{
    "title": "RedmiBook 15 e-Learning Edition Core i3 11th Gen - (8 GB/512 GB SSD/Windows 10 Home) Thin and Light Laptop  (15.6 Inch, Charcoal Gray, 1.8 kg, With MS Office)",
    "product_specification": {
        "Sales Package": "1 Laptop, 1 Power Adaptor, 1 Power cord, User Manual",
        "Model Number": "XMA2101-BV",
        "Part Number": "JYU4367IN",
        "Model Name": "RedmiBook 15 e-Learning Edition",
        "Color": "Charcoal Gray",
        "Type": "Thin and Light Laptop",
        "Suitable For": "Processing & Multitasking",
        "Battery Backup": "Up to 10 hours",
        "Power Supply": "65W Adapter",
        "MS Office Provided": "Yes",
        "Processor Brand": "Intel",
        "Processor Name": "Core i3",
        "Processor Generation": "11th Gen",
        "SSD": "Yes",
        "SSD Capacity": "512 GB",
        "RAM": "8 GB",
        "RAM Type": "DDR4",
        "Processor Variant": "1115G4",
        "Clock Speed": "3.0 GHz with Turbo Boost up to 4.1 GHz",
        "Cache": "6",
        "Graphic Processor": "Intel Integrated UHD",
        "Operating System": "Windows 10",
        "USB Port": "2 X USB 3.2 Gen1, 1 x USB 2.0",
        "Touchscreen": "No",
        "Screen Size": "39.62 cm (15.6 Inch)",
        "Screen Resolution": "1920 x 1080 Pixel",
        "Screen Type": "Full HD LED Anti-glare Display",
        "Bluetooth": "v5.0",
        "Dimensions": "363.8 x 243.5 x 19.9 mm",
        "Weight": "1.8 kg",
        "Disk Drive": "Not Available",
        "Web Camera": "720p HD Webcam",
        "Finger Print Sensor": "No",
        "Keyboard": "Chiclet keyboard with Scissor mechanism, 1.5mm key travel",
        "Backlit Keyboard": "No",
        "Included Software": "MS Office Home & Student 2019, Mi Smart Share, DTS Audio processing",
        "Warranty Summary": "1 Year Onsite Warranty",
        "Warranty Service Type": "Onsite",
        "Covered in Warranty": "Manufacturing Defects",
        "Not Covered in Warranty": "Physical Damage",
        "Domestic Warranty": "1 Year"
    },
    "product_description": {
        "Full HD 39.62 cm (15.6) Anti-glare Display": "The Full HD 39.62 cm (15.6) Anti-glare Display makes your viewing experience distraction-free. So, you can work on projects, presentations, and also watch shows without hassles.",
        "11th Gen TigerLake Intel Core i3-1115G4": "This Redmi laptop runs on the 11th Gen Tigerlake Intel Core i3-1115G4 processor. So, you can effortlessly work and do a number of tasks on it.",
        "8 GB of RAM and 512 GB SSD": "The 8 GB of RAM lets you open and work on multiple apps at the same time without lag. So, you can let multiple apps run in the background yet open and work on other apps. Also, the 512 GB SSD helps in high-speed data transfer. So, it offers fast booting and waking up time for your convenience.",
        "10 Hours of Battery Life": "The battery of this laptop runs for up to 10 hours with a single full charge.",
        "Stereo Speakers with DTS Audio Processing": "The 2 x 2 W stereo speaker setup supports the DTS Audio Processing app to let you choose any audio mode. Also, you can create a personal audio profile. As a result, you can enjoy immersive sound as per your convenience.",
        "Operating System": "This laptop comes with pre-installed Windows 10, Microsoft Office Home and Student 2019 Edition to let you accomplish a number of tasks. It also has Mi SmartShare to help you transfer files between this device and your phone.",
        "Connectivity Options": "This Redmi laptop comes with multiple connectivity options for your convenience. It has Wi-Fi 5, Bluetooth 5.0, USB 2.0, USB 3.2 Gen 1, HDMI 1.4, LAN port, 3.5 mm combo audio jack, and an SD card reader."
    },
    "reviews": {
        "ratings": [
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "4",
            "3",
            "4",
            "3",
            "1",
            "5",
            "5",
            "4",
            "2",
            "4",
            "1",
            "5",
            "1",
            "2",
            "3",
            "1",
            "2",
            "5",
            "1",
            "1",
            "4",
            "1",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "1",
            "4",
            "4",
            "4",
            "5",
            "5",
            "4",
            "3",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "3",
            "2",
            "5",
            "1",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "4",
            "4",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "3"
        ],
        "review": [
            "Satisfied with laptop. Performance is good. Problems came like Flickering screen and search options not worked when upgraded to windows 11 so I reverted back to 10. So better don't upgrade to windows 11 now wait for some more days.",
            "Thanks flipkart for the wonderful deal. Fully satisfied as of now right from timely delivery and performance.",
            "Performance: Today is first day so as per performance level no issue. I am using 10-15 tab in google chrome daily basis.\nBattery: As per company claim 10 hours. This is only for light users. If you use movie & music then may be.\nDesign: decent design.\nDisplay: As per price range best display.\nValue for money: Yes this is value for money. Today this price 39,990 but it was 37,990 while ordered this one. But i got offer in Rs. 32,490 in sale time.\nI will submit after some days with proper feedback.",
            "Everything is better than other laptops of this range of price but there is only one thing is missing which the Numericals Pad. Overall performance is good. Good for using software like AutoCAD.",
            "Awesome.",
            "I wrote this review after the use of 45 days. I never saw a lack in this laptop and the sound quality is also good. Not heating I thought this price range recommend. Thanks for reading my review.",
            "nyc laptop",
            "Good for students learning purpose.\nDo not expect to run games in this, only for study and normal office work.\nDesign is like Macbook with Windows.\n\nCons:\nBacklit keyboard could have made it to 5 stars.",
            "Overall good 👍",
            "Very good for schooling and office work",
            "REDMI is always best 👍💯\nSmooth performance\nTrue FHD display\nI can use any version of autocad,catia, heavy software\nbut other laptop 👎",
            "ok for this price",
            "Good laptop",
            "Good Battery backup, and good performance with i3 processor\nCharging time per minute 1%",
            "Bought it for Trading Purpose.\nExcept for the screen and sound quality, everything working fine, Updated to Window 11, no issues yet. Handles all the task easily. 11th gen processor 🔥",
            "I wasted my money....lap tops touch pad struck during working. I have to restart many times during working... Horrible",
            "One of best gadget which I purchased through Flipkart.\n\nValue for money and also its design is very attractive. Battery backup upto 6hrs.\nWindows 10 and Msoffice 2019 is given.\nAudio quality is amezing.\nPacking quality was too good.\nDelivery was so quick.",
            "Nice one ok",
            "Good product by REDMI at the price of 37999-/\nTotally satisfied with this..✌️",
            "The camera is in worst condition.. Camera is not good....",
            "Its really awesome..its good enough in this price.. thank you..you can go for it obviously..🥰🥰",
            "This is a good laptop but this screen was very bad so I give 1 star",
            "Overall Very Good 👍 Recommend",
            "Not good",
            "One key on keyboard is not working properly, i found out after the return period was over....will have to take it to the customer care.. it's a new laptop, such problems shouldn't be in it",
            "Average display",
            "Camera quality 😞😔",
            "Many problem in laptop",
            "Nice",
            "After using for two and half months... Its audio system is not working... Requested flipkart for warranty.. No reply yet",
            "Never buy it. Because I'm using for ten day. Then it's touchpad not working😔😔😔😔",
            "Value for money",
            "10 minutes use the laptop it was over heating\nTuch pad wanting worste and waste product\nThis flipkart is not respond in any issues",
            "Excellent and amazing built quality. Best in the price range",
            "very bad",
            "That's an awesome system whose processing time from shutdown to shutup is just within 10 seconds . You can't just think of anything else in the range",
            "Good product with this money",
            "It's just osm👌👌",
            "To be honest good product",
            "display not at all good\nbody build also average\ncamera is not good",
            "Value for money",
            "Bad product",
            "I am buy RedmiBook 15 . My own experience very good👍 laptop.",
            "Display 3/5.\nBattery 5/5.\nPerformance 4/5.\nCamera quality is 0/5.\n\nCamera quality is worst. You will need to buy external web cam if you want to go live or use for google meet etc",
            "All things are good....",
            "Very nice product at this rate 😊",
            "Good",
            "Except camera\nEverything is good",
            "Display is avarage, battery backup 4 hrs only\nDisplay brightness level isnot working",
            "Display quality is too poor",
            "Very nice laptop and performance, speed are tremendous.",
            "The performance is very good. The only thing that could have been better is the battery life.",
            "It is not true 10 hours battery hours except battery hours every thing is awesome",
            "It is awesome laptop for office users.\n\nCons:\nBut camara is not good.\ndisplay is ok ok",
            "good quality and performance",
            "Received the laptop as committed time. It looks preety and premium. Function nicely and boot time is few seconds, which is too good. After using couple of weeks, realised, its really better one.",
            "Good products",
            "Laptop is good or battery is awesome and charge very fast",
            "good super",
            "Nice performance",
            "Good one for student",
            "Good leptop",
            "Best part is design and build quality. Battery backup is superb only one problem is display is not good very bad viewing angles.",
            "Nice laptop",
            "Okay good product but battery 🔋 4 hours",
            "Often Hang while using simple apps like ms word, firefox browser. I did not expect this from redmi",
            "Battery backup is not upto 10 hours",
            "Hanging while normal use. Review under 7 days of normal use.",
            "Nice laptop with good quality and price",
            "Amazing performance 🤩😁",
            "Excellent 👌",
            "Wireless problem WIFI",
            "Awesome laptop",
            "Nice product thanks for flipkart.",
            "Reviewing it after 2 weeks of usage, initially the touchpad cursor was having some issues but then now it's working fine, performance is top notch I've also played fifa 13 with high settings and it handled that pretty smoothly. There is no heating at all and fan noise is zero. Battery backup is arround 5 hours on average and the only downside which i felt is the display, its not that great, a bit whitish. I got the 512gb nvme varient with offer and i think on this price you should go for this.",
            "Amazing laptop, Best at this price. Inloaded with all features needed.",
            "Very very good product",
            "Its amazing performance.design is very nice quality of the laptop is outstanding",
            "Excellent",
            "I can use only one day battery performance nice display good all over smooth and fast performance",
            "Product is decent , good for image editing, software development and surfing. Looking for a game then don't go for it. Screen should be little brighter.",
            "Good Product, Booting time is too fast & good for coding & the speaker is too good as compared to other laptops",
            "Very good",
            "Good\nThank you Flipkart",
            "Excellent",
            "Very geniune product. Delivery by flipkart is too fast thats why i always buy product from flipkart",
            "Overall very good",
            "Nic",
            "Good product for students 👌🏻👌🏻",
            "Thanku Redmi India & Flipkart.",
            "Ok",
            "For being a newest laptop it is slower then other i3 laptops like realme book and others...... Average for the students",
            "good",
            "Gud",
            "Best",
            "This is best Product..Best performance..Good battery backup..Best HD display...Superb Speaker Quality...Thank you flifcart..Nice product by MI.",
            "Nice product. Open only in 10sec",
            "It's good",
            "As Of Now It's Looking Awesome.",
            "Not too good but okay"
        ],
        "likes": [
            "211",
            "113",
            "34",
            "64",
            "87",
            "13",
            "44",
            "13",
            "128",
            "5",
            "27",
            "8",
            "8",
            "9",
            "16",
            "29",
            "28",
            "8",
            "7",
            "3",
            "3",
            "4",
            "4",
            "2",
            "2",
            "0",
            "2",
            "1",
            "2",
            "5",
            "3",
            "3",
            "3",
            "3",
            "2",
            "5",
            "2",
            "2",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "3",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "74",
            "36",
            "9",
            "20",
            "15",
            "0",
            "9",
            "1",
            "56",
            "0",
            "9",
            "1",
            "0",
            "2",
            "5",
            "13",
            "14",
            "1",
            "1",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "1",
            "0",
            "2",
            "1",
            "2",
            "6",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "2",
            "0",
            "1",
            "0",
            "3",
            "2",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Can it is better for programming",
            "Q:Is it best for Gaming and Daily Software uses?",
            "Q:Can I play gta5 in this laptop",
            "Q:It is suitable for animation (animating & editing)",
            "Q:Which is the best redmibook e-learning or realmebook?",
            "Q:It's have a face unlock",
            "Q:Can I upgrade the storage ? As there is no such a option of 512 gb variant only 256 gb. So poor",
            "Q:Is it contain anti virus",
            "Q:Is there num pad on keyboard",
            "Q:Is it tpm compatable?",
            "Q:It is quad core or not?",
            "Q:Additional hard drive support??",
            "Q:Gta 5 works on this device",
            "Q:Can i upgrade ram and ssd hdd",
            "Q:Bluetooth avilabule on this laptop",
            "Q:Is we can insert graphics card in this laptop?",
            "Q:Does it have balite",
            "Q:How much Internal stroage of these laptop",
            "Q:Is bagpack available",
            "Q:SIM facility ????? Ha",
            "Q:Should we attach external hard drives?",
            "Q:It good for official use?",
            "Q:Does the RedmiBook e-Learning offer fast charging?",
            "Q:Is ms office lifetime free",
            "Q:Is the memory and storage expandable?",
            "Q:Can we use this for coding?",
            "Q:Does this laptop have a fingerprint sensor and backlit keyword as some answers?",
            "Q:Can I play games on this notebook?",
            "Q:Can I connect WiFi?!!",
            "Q:Can I do editing on it...",
            "Q:How many hours of battery life can I expect?",
            "Q:Can we use design software like Auto cad on it..?",
            "Q:Do we get a charger with it?",
            "Q:Windows 11 update?",
            "Q:Can I use Photoshop in this system",
            "Q:Can I Play pubg on this Laptop ?",
            "Q:What does the RedmiBook e-Learning Edition come preloaded with?",
            "Q:Can I use it for Music studio work....?",
            "Q:Battery backup time",
            "Q:Can I use for online class",
            "Q:Body is metal built or plastic built?",
            "Q:Can we add harddisk+ssd",
            "Q:What is the clock speed of RedmiBook e-Learning?",
            "Q:Storage is upgradeable?",
            "Q:Does it comes with web camera",
            "Q:can we add internal 1tb hdd in this laptop",
            "Q:Keyboard lights ??? This laptop have backlit keyboard",
            "Q:Can we play gta5 with hight graphics in this laptop",
            "Q:Use free fire game",
            "Q:What is the warranty on the RedmiBook e-Learning Edition?",
            "Q:display is ips?",
            "Q:How much SSD in this laptop?",
            "Q:I can Upgrade the core i3 to i5 and ssd Upgrade",
            "Q:We can use programming languages or coding like c python java",
            "Q:Can I upgrade to HDD or sdd if yes which",
            "Q:Tell me brightness quality",
            "Q:Why aren't there any type c ports in this laptop?",
            "Q:Can we add internal hdd in this laptop?",
            "Q:M.2 slot available this laptop ?",
            "Q:Can I play mine craft Java edition",
            "Q:Does it come with a built in Camera."
        ],
        "answers": [
            "A:Yes it's better for programming And editing",
            "A:Good product and very useful",
            "A:u can but with low graphics",
            "A:yes",
            "A:Realme book",
            "A:No, only password to unlock.",
            "A:No",
            "A:We need to install it ..company will not provide Antivirus",
            "A:No",
            "A:Yes",
            "A:yes",
            "A:Yes",
            "A:Yes",
            "A:no",
            "A:yes",
            "A:no",
            "A:no",
            "A:256 GB",
            "A:No",
            "A:No",
            "A:Yes",
            "A:Yes",
            "A:The RedmiBook e-Learning comes with a 65W and provides upto 10 hours of battery backup and charges up to 50% in just 33 mins.",
            "A:yes. Also if u have another laptop and if you login from same Microsoft account in it then it will become free in the other laptop too(according to my experience).",
            "A:No, the RedmiBook e-Learning Edition comes with fixed storage and RAM. It offers 8 GB DDR4 3200 MHz and offers two storage options to choose from, 256 GB SATA SSD /512 GB NVMe SSD.",
            "A:Yes, our RedmiBook e-Learning Edition has a fast 11th gen processor which can be used for coding requirements of students.",
            "A:No, the fingerprint reader and backlit feature is not available on this laptop.",
            "A:The RedmiBook e-Learning comes with Integrated UHD graphics which is perfect for productivity applications but is not suited for gaming.",
            "A:Yes, you can connect to Wifi via hotspot/ Router.",
            "A:Yes.",
            "A:The RedmiBook e-Learning is equipped with approximately 10 hours of battery life on a regular usage- mix of daily productivity tasks.",
            "A:yes very smooth",
            "A:yes",
            "A:you will get it",
            "A:Yes you can use",
            "A:yes",
            "A:Every RedmiBook e-learning comes preloaded with Windows 10 Home, licensed version of MS Office Home and Student Edition 2019, Mi SmartShare and DTS Audio Processing App.",
            "A:remember its an i3 don't expect it on multitasking with heavy apps for processing.you can go for it but looks like you should opt for an i5 minimum",
            "A:6-8 hours easily..while watching videos it last about 8-9 hours.. normal browsing - 6-7 hours.",
            "A:Yes, it will serve the purpose beautifully.",
            "A:plastic",
            "A:No",
            "A:This laptop uses an 11th Gen Intel� TigerLake Core� i3-1115G4 processor, which has a base clock of 3.0 GHz and can boost upto 4.1 GHz ensuring a smooth performance at low and high work loads.",
            "A:No",
            "A:yes",
            "A:no.... absolutely hate the laptop",
            "A:No",
            "A:yes I can play so smoothly",
            "A:No",
            "A:We are offering 1 year of warranty on product and accessories.",
            "A:Yes",
            "A:SSD= 512 Gb",
            "A:yes",
            "A:Yes",
            "A:Laptop is having 256GB SSD, which is very compact in size and fast compare to HDD. Therefore, it is impossible to accomodate HDD inside laptop. however, you can connect external HDD using USB port",
            "A:Good",
            "A:tthere is no c type port....",
            "A:You can add hdd but you can't extend ram in this laptop",
            "A:No",
            "A:Yes",
            "A:yes"
        ],
        "likes": [
            "40",
            "60",
            "66",
            "4",
            "7",
            "4",
            "6",
            "2",
            "3",
            "3",
            "1",
            "2",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "82",
            "33",
            "101",
            "16",
            "65",
            "19",
            "4",
            "4",
            "11",
            "4",
            "2",
            "5",
            "3",
            "7",
            "6",
            "1",
            "1",
            "1",
            "1",
            "1",
            "6",
            "3",
            "1",
            "1",
            "2",
            "1",
            "1",
            "5",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0"
        ],
        "dislikes": [
            "9",
            "26",
            "30",
            "0",
            "2",
            "1",
            "2",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "19",
            "6",
            "39",
            "4",
            "38",
            "9",
            "0",
            "0",
            "6",
            "1",
            "0",
            "3",
            "1",
            "6",
            "8",
            "0",
            "0",
            "0",
            "1",
            "1",
            "3",
            "4",
            "1",
            "1",
            "0",
            "2",
            "3",
            "3",
            "1",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "3",
            "1",
            "0",
            "0"
        ]
    },
    "summary": {
        "pros": {
            "Design": "Attractive design and amazing build quality.",
            "Performance": "The 11th Gen Tigerlake Intel Core i3-1115G4 processor gives good performance.",
            "Price": "Good product in this price range."
        },
        "cons": {
            "Battery": "Battery backup is not 10 hours as promised. With normal usage it lasts about 4-6 hours.",
            "720 HD Web Camera": "Camera quality is really bad.",
            "39.62 cm (15.6 Inch) 1920 x 1080 Pixel Full HD LED Anti-glare Display": "Average display quality."
        },
        "verdict": "Good for study and normal office work. ",
        "Additional Information": "Fixed storage and RAM, Good for programming, No backlit and fingerprint feature."
    }
}