{
    "title": "Nokia PureBook X14 Core i5 10th Gen - (8 GB/512 GB SSD/Windows 10 Home) NKi510UL85S Thin and Light Laptop  (14 inch, Black, 1.1 kg)",
    "product_specification": {
        "Sales Package": "Laptop, Power Adaptor, User Guide with Warranty Terms and Conditions",
        "Model Number": "NKi510UL85S",
        "Part Number": "NKi510UL85S",
        "Series": "PureBook X14",
        "Color": "Black",
        "Type": "Thin and Light Laptop",
        "Suitable For": "Processing & Multitasking",
        "Battery Backup": "Upto 6Hrs",
        "Power Supply": "65 W AC Adapter",
        "Battery Cell": "3 cell",
        "MS Office Provided": "No",
        "Processor Brand": "Intel",
        "Processor Name": "Core i5",
        "Processor Generation": "10th Gen",
        "SSD": "Yes",
        "SSD Capacity": "512 GB",
        "RAM": "8 GB",
        "RAM Type": "DDR4",
        "Processor Variant": "10210U",
        "Clock Speed": "1.6 GHz with Turbo Boost Upto 4.2 GHz",
        "Memory Slots": "1 Slot",
        "Expandable Memory": "Upto 16 GB",
        "RAM Frequency": "2666 MHz",
        "Cache": "6 MB",
        "Graphic Processor": "Intel Integrated UHD",
        "Number of Cores": "4",
        "OS Architecture": "64 bit",
        "Operating System": "Windows 10 Home",
        "System Architecture": "64 bit",
        "Mic In": "Yes",
        "RJ45": "Yes",
        "USB Port": "2 x USB 3.1, 1 x USB 2.0, 1 x USB 3.1 Type C",
        "HDMI Port": "1 x HDMI Port",
        "Hardware Interface": "NVMe SSD",
        "Touchscreen": "No",
        "Screen Size": "35.56 cm (14 inch)",
        "Screen Resolution": "1920 x 1080 Pixel",
        "Screen Type": "Full HD LED Backlit IPS Display with Dolby Vision",
        "Speakers": "Built-in Dual Speakers",
        "Internal Mic": "Built-in Dual Microphone",
        "Sound Chip": "Realtek HD Audio",
        "Sound Properties": "Dolby Atmos Best Expereinced with Headphones, Dolby Access App with Multiple Pre-set Audio Modes and Settings",
        "Wireless LAN": "IEEE 802.11a/b/g/n/ac",
        "Bluetooth": "Yes",
        "Ethernet": "Integrated 10/100/1000 Gigabit Ethernet LAN",
        "Wireless WAN": "Intel Wireless-AC 9560",
        "Dimensions": "320.2 x 214.5 x 16.8 mm",
        "Weight": "1.1 kg",
        "Disk Drive": "Not Available",
        "Web Camera": "HD Webcam",
        "Face Recognition": "Yes",
        "Lock Port": "Kensington Lock Slot",
        "Keyboard": "Backlit Keyboard (with 1.4mm Key Travel)",
        "Backlit Keyboard": "Yes",
        "Pointer Device": "Precision Touchpad with Multi-gesture Support",
        "Additional Features": "46.7 WHr Battery, Magnesium Aluminium Alloy Body",
        "Warranty Summary": "1 Year Onsite Warranty Commencing from the Date of Purchase",
        "Warranty Service Type": "Repair/Component Replacement",
        "Covered in Warranty": "Warranty will Cover Only Functional Parts, Issues having Manufacturing Defects",
        "Not Covered in Warranty": "Does Not Cover Damages to the Product Resulting from Unauthorised Adaptations/ Adjustments/ Tampering/ Repair, Improper Installation or Placement, Mishandling, Improper Use, Deviation from the Instructions Set Out in the User Manual (If Applicable) Normal Wear and Tear Caused Due to Use of the Product.",
        "Domestic Warranty": "1 Year"
    },
    "product_description": {
        "Lightweight and Sleek": "With a net weight of just 1.1 kg, this laptop feels light and easy to carry around wherever you go. Featuring a premium magnesium-aluminum alloy body, the Nokia PureBook looks classy and stylish with a matte black finish.",
        "Dolby Vision and Dolby Atmos": "Get a highly engaging user experience every time with smart visuals and HD audio. The Dolby Vision technology makes every visual spring to life in rich detail and realistic clarity. Also, enjoy spatial audio with Dolby Atmos that can be best experienced with a pair of headphones.",
        "10th Gen Intel Core i5 Processor": "Experience fast processing power with the Intel Core i5 10th Gen processor that offers up to 1.6 GHz base frequency and up to 4.2 GHz turbo frequency. The quad-core processor, along with 6 MB Intel smart cache memory, offers advanced parallel processing that makes multitasking look effortless and efficient.",
        "Faster and Efficient Processing": "Enjoy the ease of faster boot-up time, quick file transfer, smooth online surfing, instantaneous app launch with the Nokia PureBook. Functioning along with the advanced 8 GB of DDR4 RAM, the inbuilt 512 GB NVMe SSD provides a super smooth performance that is three times more efficient than standard SSDs.",
        "Windows 10 Home": "Nokia PureBook comes with preinstalled Windows 10 OS. You can experience seamless accessibility with the Windows Hello face recognition feature. You can also access thousands of apps, inbuilt security features, Cortana voice assistant, and other productivity features to cater to every need. Also, you can get a 1-month free trial of MS Office 365.",
        "Immersive Viewing Experience": "Feel your eyes being captivated by the 35.56 cm (14) Full HD LED-backlit IPS display. It is also powered by Dolby Vision, with 4.8mm slim bezels, and an 86% screen to body ratio. With an expansive color palette of about 16.7 million colors, 250 nits brightness, and up to 178° viewing angle, you can experience high-on-detail visuals with accurate color reproduction regardless of the screen positioning.",
        "Smart Accessibility and Secure Login": "The Nokia PureBook is packed with smart inbuilt features that make your overall user experience easy, efficient, and secure. The HD IR webcam, featuring Windows Hello Face recognition, offers instant and secure login access. With this laptop, you can maximize your productivity with smooth transitions and efficient command input using the Precision TouchPad. Also, the backlit keyboard, with up to 1.4 mm of key travel and adjustable brightness, is designed for effortless and convenient operation.",
        "Integrated Intel Ultra HD Graphics": "This laptop comes with an Intel UHD 620 inbuilt graphics card and up to 1.1 GHz Turbo GPU to offer an immersive visual experience in every pixel. Also, you can get a highly immersive and seamless viewing experience with 4K-support-enabled Intel Quick Sync Video, Intel InTru 3D technology, and Intel Clear Video HD technology.",
        "All Round Connectivity": "You can easily connect or pair this laptop to a wide range of smart devices, thanks to the extensive range of connectivity ports, such as two USB 3.1, one USB 2.0, one USB Type-C 3.1, one HDMI, one RJ45, and one Audio Out-Mic In port.",
        "Enjoy Spotify Premium (Offer Valid Until April 2021)": "You can get a free subscription to Spotify Premium for up to 6 months on the purchase of this laptop. With this subscription, you can enjoy your favorite songs and podcasts without getting disturbed by any ads. Also, you can choose from over 4 billion playlists spanning moods and moments, and podcasts across genres. This offer is valid until April 2021. The voucher code will be shared within 30 days after product delivery."
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "4",
            "4",
            "1",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "1",
            "1",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "2",
            "1",
            "5",
            "5",
            "1",
            "1",
            "1",
            "5",
            "1",
            "2",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "1",
            "1",
            "1",
            "1",
            "5",
            "3",
            "5",
            "4",
            "1",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4"
        ],
        "review": [
            "Amazing experience from the time the package was opened till now. It's been 2 weeks. Super light weight, fantastic face recognition and sound and ui experience. Great battery backup. Camera is great. Great value, happy that I made this quality choice without spending too much !",
            "I am a stereotypical tech-nerd, so in case of using any gizmo I am biased to be critical towards a product. However this new laptop truly amazed me. It is very rare to get a market disruptor in the field of laptop(s). But in this case I have found a hidden treasure. Nokia as a brand has been in the market for quite some time and with this new entrant, it is here to stay in the laptop market.\n\nI was charmed by the built of the laptop. Sturdiness of the metal alloy body puts in a great confidence in carrying it. Small things like the quality of its hinge mechanism point out to the great engineering gone into it. In spite of all this it comes as a feathery 1.1kg machine.\nMoving on to the usability. This laptop comes with dolby vision-atmos compatibility. The industry knows that to be a mark of high end notebooks. Needless to say that media consumption is simply exceptional. The display is crisp and bright, with great colour accuracy.\nDay to day performance and utility is great as it is meant to be.\nthumbs up",
            "Over All Laptop is good but according to the price you will get much better then this . Build quality is really Good . I love the face lock it's very quick in dark also. You will enjoy this product as it's NOKIA .",
            "Loved the brand new Nokia Laptop.Its is a very very light and the speed is just wow👌High specs under 60k is worth buying.The built quality is also good .Worth buying for students.The face unlock system is most appreciated.Go for this product 100%",
            "Alright guys, I recently purchased NOKIA PUREBOOK. I am amazed with the performance of the laptop. I had few more options with the same price range but instead I tried my hands on NOKIA. Because everyone knows how NOKIA delivers. I am very much thankful for delivering this amazing product. So far I have been using laptop and I did not face even a single issue till now. Battery backup is fantastic, it will last around 7 hours, which is more than enough I believe. Then comes the performance. I have installed few moderate level games and python software and believe me guys, it's dead smooth. There is no heating issue as such. You give get an option to start/ stop internal fan as per your usage. But till now I I did face any heatings issues. Look wide it's fantastic. It's completely matt finish and you will love it. It's quite light in weight. Which is the major highlight part. And I also heard that it's lighter than macbook. So Nokia has delivered something which is unbelievable. Thnk you so much for the product.\nThe only issue which I have is, delivery options. I wanted a quicker deliver option, but unfortunately flipkart does not have that option. This is the sad part. I urge you guys to work on this. Because sometimes, people need products on urgent basis. And you guys did not respond to me at all. I was disappointed with the way you guys responded to me.",
            "Review After 10 days of usage...as this is my first laptop (earlier iPad user), i like the performance. As, I am basic user battery lasts for minimum of one day. I watched Dolby vision + Dolby Atmos videos using my apple airpods...simply marvellous... display awesome... it takes approximately 2 hours to charge from 10% to 100%... as it weighs only 1.1 kg, you may feel like nothing... speakers good and loud enough...",
            "Tie system is great and the built quality is also very good\nDesign is smooth and shiny and the best things is brand NOKIA",
            "I bought this laptop with a lot of inhibitions, but seems to be a good buy. I was looking for a laptop for personal use. I am not at all a technical guy & my criteria were as follows :\n1. 14 inch\n2. 512GB SSD\n3. Light weight\n4. Backlit keyboard\n5. Decent webcam.\n6. Good sound quality\nWould have perhaps bought the Mi but its a direct Chinese brand. Dell Latitude & HP were the next obvious choice but all the above features wasn't available at that price range, hence bought this laptop.\nIt's a lovely machine - feather light, quick & build quality is really good.\nIf you can afford to take risks & not scared of trying new brands, please go for it!",
            "Bought this product after watching a review by GeekyRanjit. Wanted a high performance laptop which was light and didn’t cost the moon. This laptop hits the right notes on all three aspects. It’s been a month since I’ve been using this and so far I am completely delighted by the experience. Great product at this price point. Good for streaming Netflix with its Dolby Vision. Great processor so super fast. And at 1.1 kg, it’s among the lightest laptops in the market. The build is pretty high quality too. This could be a game changer for Nokia.",
            "Ultra Light Laptop with good performance\n\nFast processing laptop value for money\n\n- Good display from every angle\n- boot speed is about 3,4 sec\n- battery is long Lasting about to 6,7 hours\n- keyboard is pretty good decent key travel is good\n- Trackpad is much preety good but not excellent\n\n\nThis is not a gaming laptop not recommended.\nIf you are traveler person then this is best choice.\nIt's build quality is superb it is aluminium chesis\nIt's not like other laptop\nAt the end\nRecommended for daily office work and students\nIf you are multimedia consumer then this laptop is perfect for you\n\nHaving many ports on this one as compared to other laptop.. so go for it if you have budget below 60k\n\nI bought this laptop for 49.9k which is best deal.",
            "I'm satisfied with this purchase and the laptop exceeds my expectations... The keys could have been slightly spaced better but you'll get used to it. It's ultra light and easy to carry.",
            "Thank you for a nice product like this. Booting and shutdown speed is in very few secs. The lightweight laptop is an added advantage. It's better to have MS office by default at this price. I would like to recommend this laptop since there is no glitch in programming, zoom/google calls, etc.",
            "For me it's a complete package. The laptop is so slim and sleek that it looks asthetic . It feels so premium as it has a metal chassy . And also it is sooo light weight or feels like you're holding a thin metal sheet .\n\nAnd the display quality is gorgeous.\n\nIt is worth every penny you give.\n\nThe sound is also loud and produces good sound.\n\nAnd gives around 5-6 hours of battery on moderate usage.\n\nIt doesn't have a fingerprint scanner but it has iris scanner\nWhich is so accurate and lightening fast.\nIt just takes less than 1 sec to recognise my eyes and not up the laptop .\n\nAnd as it has a ssd in it. The boot times are crazy fast like 3-4 sec to boot up and 2 sec for shutdown.\n\nI totally loved this product.\n\nThis is my honest review after 1 week of usage.\n\nGo for it. You'll not regret it.",
            "Got this laptop for 46000 rupees with bank discounts. This is the best i5 laptop in this price range.\nFirst I had a confusion with Mi Notebook 14 and Nokia purebook. After some research, I went for Nokia.\nThe only better thing in MI Notebook when compared to this is the 2GB GPU.\n\nThe best highlights of this laptop is the weight and looks. Even though the laptop is not from the Nokia (flipkart is the manufacturer), the Nokia brand name on the laptop looks classy.\n\nOverall it's a good purchase for me. Good Sound, Good picture quality.\nI tried some Dolby Atmos movies from Netflix.\nAlso I upgraded to windows 11 Dev release from this laptop and it works super smooth. Thanks for the SSD!!\nThe backlit keyboard and the integrated webcam which has the ability to recognize face is an added advantage.\n\nYou can go for it without any doubt for a price range below 50k, if you are reading this review in 2021.",
            "The laptop is ultra light weight and easy to carry. Performance is extremely good. Build quality is top notch. Display is crisp and bright. Speaker is loud and clear. Battery life is excellent. Overall, good package and value for money.",
            "Laptop is very premium... but please keep in mind, buy this laptop only if you want thin, light and compact one...this is small in size...maybe the smallest you've seen till now... size comparable to macbook air 13.3\"\nAnother thing is touchpad, I don't find touchpad very good and responsive, may have been better.\nBut seriously if you keep in mind these things you won't regret it buying..i guarantee",
            "1. Performance is as expected for an i5 with 8gb ram..no surprises there\n2. Display is surprisingly good.\n3. Keyboard feels a bit odd. But I think it's a matter of getting used to (backlight is helpful)\n4. Battery is as expected. 4-5 Hours in average performance.\n5. It feels super solid, very premium look and finish. Absolutely adore it. Gets smudged easily (which doesn't really bother)\n6. Window hello & trusted devices feature is a great addition.\n\nIt's super light and loaded with features. Excellent for anything except gaming and AV content creation.",
            "I suggest you go and grab this amazing purebook available at most trusted e-commerce company i.e Flipkart.\nBest Performance.\nGreat Display which can play videos of great quality i.e 4k.\nGreat RAM management.\nReally amazing NVMe SSD.\nDolby Atmos and Dolby Vision give you an ultimate Experience.\n\nAt last thank you Flikart and Nokia for this amazing experience.",
            "Since Nokia is not associated with laptops, I was a bit skeptical about this. But this laptop really matches up very comfortably to some of the more expensive laptops out there. The laptop body is premium and yet very light. 10th gen i5 combined with SSD and 8 GB RAM results in everything being super fast. Though my usage is mostly Word and PPT etc, and haven't played any heavy games on this. It doesn't get heated even after continuous Zoom calls, and sound quality is as promised. The sound is even more amazing over headphones, with Dolby enabled. Overall, a great deal.",
            "Super laptop very nice just book this laptop and see the performance what a laptop seriously ull fall in love it's better than all laptop like HP, LENOVO,DELL, NO other company can bet Nokia if u need compare no other company can giv this build quality excellent laptop..",
            "Good build quality,Display is just super and performance is like butteer smooth.Sound output quality is very good with Dolby vision atmos. Coolest feature is it is ultra light weight and we need to take care while typing.. This laptop is useful for frequent traveller's and and who needs light weight machine.Finally thanks to NOKIA and Flipkart for making such a beautiful Machine.😍",
            "Worth it . Fast processing laptop .\n- quick transfer of data\n- quick face recognition\n- premium outlook\n- excellent display\n- sound volume very high\nRecommended for office work , business use , college students .\nI purchased NOKIA laptop at rupees 49990 on 09 aug 2021 and delivered on 11 aug .\nI trusted to buy NOKIA laptop from Flipkart because it is from Flipkart itself . Purchase one mouse and keyboard so that inbuilt mouse would be fine for long time .",
            "I brought this laptop for 46500/- in the recent discounts available. In this range of less then 50k this is the best laptop available in i5... It is super fast.. Currently using its since last three days in daily business use. Have absolutely no issues as of now... No heating issue.. The sound of the fan is aslo negligible you won't be able to make out the noise from laptop...the sound quality even without headphones is amazing gives you feel of dolby sound..The best part about the laptop is the weight.. That gives a premium effect.. If you are looking for new laptop in i5 and if you get this again in less then 50k don't miss out on this powerful machine",
            "Nice Laptop.\nMajor advantages\n1. Purchased for 45K in flipkart BBD.\n2. Light weight 1Kg\n3. Processor & RAM in this price range is impossible All features in this price range, HP laptop would cost near 1L\n4. Classic look and metal alloys body material\n5 Best for movie watching experience Dolby vision & Dolby Atoms effects\n6. Nokia good Europian Brand\n\nDrawback\nKay pad 4 stars",
            "A topclass lightweight slim laptop with the right features for multitasking. Excellent sound and easy to handle. No issues faced till date (it's been over 2 week). Excellent display and viewing angles.\n\nHowever type C charging port should have been provided by default. A full charge does last about for 4 hrs on medium tasks. 6hrs would have been ideal. From a price perspective this should have been priced at 45 to 48k being an i5 10th Gen.",
            "So far the best.........Box looks very simple.......\n\nPositives:\nLaptop is Feather Light........Matte Black as topping is so apt and blissful...........Sound and Display look better than expected ........Yet to check the Battery and charging section.........Boots up in less than 10 seconds........Windows Hello as authentication is beast at work......Performance stands out of all ........getting all these bountiful features at this price quote is For sure an Amazing deal.........\n\nNegatives:\n1.Hinge Mechanism is on the weaker side......not that worst but could be sensitive for rough users.\n\n2. Attractive to dust, matte black is amazing and fantastic lookwise but surface of the laptop attracts dust particles.\n\n\nGo for it and Feel this Feather lighted Beast Performing in ur hands",
            "Loved the way it feels in Hand...Light like feather...Full Metal Body....\nLigthing Fast for day to day tasks...Boots up in seconds....battery is also good...around 8 - 9 hrs of normal usages with brightness @ 30%",
            "Unbelievable I never expected very great performance.\nNo doubt you can go for this laptop ,For Devops coding also very useful .\nI have seen so many laptops but I felt like this laptops is Extremely too good .\n\nI was worried before buying now I will suggest every one to go with this budget laptop I brought for 47k in offer after 1month use\nBetter is great\nDisplay is unbelievable it plays 4K video us extremely good\nPerformance is at beast\nSound - Next level\nWeight - 1.1kg it’s like carting all in one book\nFace ID - Great\nOver all - Superb superb super.\n\nActually I will not satisfy if I brought any thing that so easy but really I loved it ……!!!",
            "This is an excellent product from Nokia. A reasonably well-priced and well-built laptop.\n\nIt's very lightweight and its performance is good even though it has a one-year-old processor.\n\nAnd it comes with an awesome screen with a good level of visiblity, though audio output could have been improved.\n\nOverall a very good product and if you are thinking to buy it in 2021 then definitely go for it you will not regret it.",
            "It's a terrific product ever launched like in every angle considering the price it's the best. And what's less when you can have windows 11 also in this laptop ( I m using it's insider program and the features of 11 are fascinating )\n\nPro\nEverything in it is a pro like buying it is a pro.\n\nPrecaution\nBattery is good like it works for 5-6 hrs but if you try to download the 100gb game then it decreases to 3-4 hrs . Otherwise you can download the game in hard disk and use it , laptop's battery will not change.\n\nCon\nCortana doesn't work at my place.",
            "An amazing product by Nokia. The laptop is very light but very sturdy at the same time. Battery backup is average. I haven't used it much. It is not very good for gaming but overall a great laptop at this price range.",
            "Best purchase within this price range, light weight and beautiful design. Smooth operation and speed. Face unlock is awesome. Best 14\" laptop.",
            "A light , yet powerful laptop that breezes thru the day to day WFH home tasks. The Dolby vision and audio are just wonderfully integrated and watching movies/online classes is a treat.\nI bought it for the brand value Nokia, though it is sold by Flipkart with Nokia brand name. Coming to the weight distribution, it is so light to carry and you could just slip it into your bag on the go.\nSSD is fast and I plan to upgrade to 16 GB. Called Flipkart support to get a Service centre contact point.\nOverall fully loaded laptop with all the essential features for running moderate to powerful office tasks. I am not a gamer and think this is not a gaming laptop.\nGo for it",
            "Currently am using this laptop for my WFH it almost like 10 + hours work. Some how I will take some break. But the charge last longing more than 9+ hours. For full charging it took around 2 hours. Performance wise it is Good Awesome Worth for the Penny. Camera also Good. Am using this laptop for the last 1 week I didn't feel anything bad on this laptop.\n\nCons:\nOffice suite is not there that is the thing I wanna mention here. Otherwise it is Awesome 👍",
            "It's a good light weight laptop\n\nPros:\n1. Good performance\n2. Light weight\n3. Pro design\n4. Type C charging\n5. Backlight keyboard\n6. Better display\n7. Dolby Atmos audio and display\n\nCons:\n1. Keyboard quality is so poor\n2. Easily caught finger prints\n3. Battery is not so good\n4. Can't open with one hand",
            "This is really good product built by Nokia. The same config in other brands such as Dell & HP would cost around 60-65K. Light weight and nice mat finish, and smooth keyboard. I simply did not face any issue with this model and its working really well. If anyone planning to buy this, pls go for it.",
            "For a i5 8gb RAM 512 SSD, pretty performant and super duper light weight. Only thing I thought could be better is its trackpad smoothness but if you are going to use a mouse you won't find any difference.",
            "It's a Brand New PREMIUM PUREBOOK..😉🤩",
            "one of best laptop in this range.everthing is just perfect about this laptop.",
            "Laptop is very lightweight and good performance. Time shown for battery remaining changes drastically as per the usage.\nOverall it is good laptop.",
            "It's a very good laptop nice all things :)",
            "Nice laptop..In this price range.. 🔋 I would rate battery 5 out of 5. Display is also very good. I rate this laptop 4 out of 5. One point less bcz finger print scaner hasn't provided. Overall laptop is good. If you are student then you will gohead to buy this one. Laptop bag is not provide with it.",
            "It's really speed opens in 3seconds with face lock very good for impatient persons like me,and very light weight can put on lap and use,and feels really premium ,but price should be 50k maximum because other companies provides same specifications at 45to 50k other than that everything is good.",
            "Laptop stopped working after 5 months\nTried calling customer care several times but did not get any response from them.\nThe screen turned blank with only backlight keyboard.\nEven after 20 days no response from customer service. I called several times but no response.\nDo not buy such unbranded products.",
            "It is a good laptop",
            "If the specifications of this laptop meet your requirements, then go for it without any hesitation. It's fast( i5 10th Gen, 512 SSD, 8GB DDR4), super display quality and viewing angles, slim & light weight, killer look with backlit keyboard, looks way more better than the pictures shown by flipkart and feels very premium. Met all my expectations as well as fulfilled my requirements.Laptop boots within 7 seconds from the time power button is pressed",
            "You can watch 4k Videos as well and supporting dolby atmos vision. Very light weight.Speakers are ok ok.",
            "We are expecting Amd and 16gb ram combinations",
            "Below expectation\nUsing this laptop from 3 months\nProcessor hanged 3-4 times even in basic tasking.Screen also flickered 2-3 times\nIt is slow as compared to my previous asus ux 360 with core m3 processor\nits charger is outdated\nIts great aspect is its sound\nPlz give a case for it",
            "Review after 10 days\n1. Lite weight .\n2. Display quality is nice .\n3. Battery backup around 5-6 hrs .\n4. Design is very good .\n5. Charger quality is below the average .\n6. Sound quality is above the average .",
            "Good laptop",
            "Review after 2months of use.\nDONOT BUY THIS LAPTOP.\nThe quality of paint used is very cheap. Kindly check out images of trackpad, this is the condition only after 2months of use.\nService which is provided by Jeeves is the WORST of all. It has been 6 days I've asked for replacing the trackpad, till now no technician has visited.\nJust go for well known brands, this laptop is utter classless now I'm planning to sell out this laptop.\n50k piece of garbage Made by flipkart.",
            "The build quality is very bad. Still need more time to check the durability. better to buy some established brand.",
            "Product is value for money.",
            "Best laptop for this rate.got it for 47.8k..awsome model",
            "Very light yet quality, unmatched battery performance",
            "Laptop is good. I like small screens because of travelling.\nPros:-\nGood screen\nProcessor\nSound\nBattery backup\nBack lit\n\nCons:-\nNo Ms office\nKeys are delicate\nCharger is old model\nAvailability of care\n\nAlthough it is first model, better than mi laptops in my view. Got it at around 48k😇🙂",
            "Excellent laptop for domestic educational and entertainment purpose.",
            "Super light Weight with amazing built quality of NOKIA.\nOld nokia is back. Go for this laptop",
            "Very stylish and light\nDolby Atmos and vision\nSuper light\nWorth of every penny\nSuper fast memory\nFace unlock is also good\nNo heating problems",
            "Good purchase",
            "The laptop is excellent, but there is one blunder the company is doing, they mentioned that there are two memory slots, but in actual the term memory they used for SSD slots, not RAM slots, there is only one RAM slot available, not two. It unnecessarily creates confusion for those who want to upgrade their RAM.",
            "Build quality is best but not best for gaming\nGood for basic work and watching movies.\n6-7 hours bettery backup",
            "Best laptop Nokia",
            "Worth of money, good work from Nokia this time.",
            "The best thing about this laptop is weight, and I love the performance is excellent, but the keys are not god",
            "Really superb...value for money..",
            "Good laptop. Very light weight. Loved it",
            "Si far excellent",
            "The product is very good. Perfomance is outstanding. Just awesome.",
            "It's slim and more powerful. Dolby Atmos is very good. Display looks very perfect vision.",
            "Awesome Laptop as per design 🙂. I love it but didn't used it for comment for performance. Will update after sometime for this😀",
            "Words cant explain, just experience yourself...❤️",
            "Just awesome, weight is very less, even lesser than macbook. Just like a feather or compare it with 1 lit bottle of water.\nIt boots within just 12 sec, after even installation of all apps. Battery backup is almost of 5 hours and more.\nBacklit keyboard is superb. No heating issue.",
            "Best laptop performance in this budget...\nNokia launch first laptop i confused but after using 10 day very very excellent performance ❤️\nOld is gold 💝 @Nokia.",
            "Excellent purchase🙂",
            "The keys started creating problem after one week of use.",
            "Charging indicator is not visible when cover is closed.\nDisplay panel is not glossy.",
            "My review is after using this laptop after 2 weeks.\nUsage: Office work, few heavy software's\n\nPros:\n1) Lightweight: This product is surely for someone who carry there laptop places to places.\n1.1 KG feels super light. Overall build quality is good.\n2) Picture and sound quality: Its above average but not something which will blow your mind.\n3) Performance: SSD works as per its standard , i can open chrome, VSCode and other software within a second.\n4) Battery performance is up to 6 to 6.5 hours.\n\nCons:\n1) No office pre-installed. This is something everyone wants prebuild in the system.\n2) USB sockets when plugged in for mouse, detached and reattached frequently makes a irritating noise.\n3) No HDD support and cant update increase storage past 512 GB",
            "Good for office work",
            "It is a very weight Laptop and easy to carry.\nPerformance, Design, Display and built Quality of the product is also good.useful product for stuy.",
            "Very light, smooth and working very fast. Battery backup is gud.\nDefinitely we should go for this.",
            "After using one week\nPosting review\nI brought it for 50k\nVery good for carrying and performance also good\nBut no ms office and keyboard looks very bad camera also very bad\nApart from keyboard and games it is best at its cost",
            "Pro:\nwindows start, shutdown and restart is very quick.\nDesign is good\nVery light\nDolby Atmos vision and sound.\n\nCons:\n\nCamera quality not upto the mark.\nBattery Backup also not upto the mark.",
            "It is pricey but it's for people who are always on the go and who need lightweight alternative Processor I510210U is and efficient processor.",
            "Laptop is very light and performance is excellent.",
            "Everything in this laptop is great except it's keyboard.Keyboard is not good for typing and its backlit is very low.",
            "Best under 55000",
            "I was very skeptical to buy this product as it is something new from Nokia, but this is just excellent.\nIt's neat, sleek, fast, and totally worth the money.",
            "Nice laptop. Specially weight nd booting time is mind blowing...!!",
            "Build up quality of laptop is very impressive and ultra light .\nif you're looking for a professional laptop you're looking right to it.",
            "Thin ,sleek design.Good performance.",
            "Overall performance is satisfactory and worth of money.",
            "I am reviewing this Laptop after use of approx. a month.\nPros:\n-Lightweight\n- Boots up very fast. Within 15 secs laptop gets ready to use.\n- Display is awesome\n- Battery lasts up to 5 to 6 hrs\n-Sound is quite good\n- Have option in touchpad to disable while typing.\n- Face unlock\n\nCons\n- Its heats up while charging",
            "I am facing issue with screen brightness, All of sudden the screen become dark. I didn;t find any solution to this problem yet.\n\nThere is manufacturing defect as few pixels are always on, this can seen only when you are viewing black color.\n\nNot satisficed. As screen looks bit yellowish",
            "Just after two months of uses it's whole keyboard panel started getting heated. Now, its been 10 months it suddenly gets restarted and audio drivers also has stopped working.",
            "OMG !! Great work Flipkart and Nokia. It's a Amazing Product !! Pl. Go for Purchase... 👍👍",
            "Very very very smart laptop .",
            "Worst Quality used to manufacture.\nKey board & mouse pad hangs from the day it was purchased .\nRequested for warranty claim almost one month passed customer care just passing on service boy & service boy says responsibility of company. Still waiting for resolution.\nFlipkart is also responsible for selling such 3rd class quality products.\nNokia even don't bother its reputation as far as service & quality is concern",
            "Charger is busted within 2 days",
            "Bought this just 2 days back and charger stopped working . I have asked for a replacement . Worst experience ever",
            "One of the best laptop i have ever seen,\nsolve all the purpose, extremely light weight, and quality is outstanding.\nHighly recommended.",
            "Worst experience with this purchase.\nLaptop's charging stopped within 1 month of purchase,\nI have purchased this laptop in October 21 and it stopped working from 15th November and till now it's not repaired.\nNokia provides warranty upto 1 year through 3rd party service providers but till now problem not solved.",
            "Not worth it charging is in super draining mode😄",
            "The product so far is excellent. It's actually very lightweight compared to my previous laptop Lenovo Thinkpad. I sometimes doubt if it's still there. Though the storage is less compared to the needs. There should have been an additional 500GB / 1TB HDD hard disk.",
            "This is actually very good, I am using this laptop since 1 week, And I have faced no Issues. Charging time is bit more, Rest every thing is okay. I love the product design. Weight is very less and its very fast.",
            "Excellent product",
            "Amazing performance with beautiful design, very lightweight and battery life is very good, I'm doing mostly coding so the battery is last up to 12 hours for me.",
            "Good performance Nokia always be aspected same",
            "Great product....slim and lighter than expected.....display is very defined and live",
            "For those who are in networking field, weight, size and ethernet port matters a lot which nokia x14 fulfills.",
            "Great product with good features.",
            "really Best laptops in this price segment...",
            "After updating to windows 11,I noticed it's Dolby vision atmos doesn't work.",
            "Design is good. Display os also good. Performance is good. Rate is my opinion 4.5 out of 5",
            "Slim less weight and great performance.",
            "just love it",
            "Extremely happy with the Nokia Notebook. I was a bit hesitant of the screen size, but on use found it perfect. Light weight, smart keyboard. A good value for money.",
            "Really a nice laptops",
            "Worthless money expend this product no ms office in laptop and high price this product",
            "A good product at this price. Many people asked if Nokia had a laptop, so that is the risk of buying this, but I believe that Nokia and Flipkart (who is the manufacturer) has planned this for a long term business and hence this won't face any serious issues after or 3 years of usage. After one month of usage, I am happy.\n\nMajor USPs.\n1. Build quality\n2. Ultra lightweight.\n\nThese are the 2 reasons why I chose this product.",
            "MSO should be provided for lifetime then price of this laptop will be justified.",
            "Lightweight and amazing!",
            "Display quality is just awesome, booting time is very good, face lock is extremely good.",
            "This Laptop is Beauty.. Go for it.",
            "Superb laptop at 47k.",
            "Nice product..",
            "It is best laptop under 48000 nice performance very lite weight. Sound quality is best.",
            "Good laptop used it from 2 days. Value for money I got this beast in 49470 during big saving deal.",
            "Best price bought at 50k, best in its range",
            "Amazing experience with this laptop. Very light weight. No heat up issues. No issue with performance. Worth product..",
            "Great laptop at this price change.Thin and light weight laptop.It is very fast and having decent look",
            "Used in 7 days good performance",
            "Its excellent,",
            "Outstanding Performance\nEye View Display\nNo External Or Internal Noise\n\nIt's Really Pure performance\nIt's Really PureBook",
            "It's really gud product wid such specification",
            "Pros:\nBuilt quality\nDesign\nPerformance\n\nCon:\nNo free MS Office subscribe",
            "Amazing and the other hand I can see from your system for you guys think 3.",
            "Love it, Awesome product, value to money",
            "Good Product and light weight.",
            "The perfect sized and weighted laptop in the market right now plus with the current price, its a steal.",
            "The best thing is its lightweight but the quality of plastic specially at the back is not great. Doesnt look like a 50k product. Very fragile and weak looking laptop.\n\nBattery i dont feel is impressive. Just ok. Display is ok as well.\n\nPerformance seems ok as being a new buy there is nothing much to process.\n\nBut the product looks extremely delicate and plastic quality is cheap looking. I dont know how long it will hold.\n\nOverall and average laptop. Could have bought another one but have to live with that.",
            "I got display problem within 1 month of the purchase. I raised compliant with flipkart laptop complete protection plan. Nobody bothered to handle the issue. Flipkart protection plan is waste of money. Issue is not fixed after following up for more than a month. Don't buy this laptop.",
            "U can’t work on laptop during charging",
            "The webcam stopped working within two to three days of use. The dolby vision and dolby atmos features are just great. But the wifi connection goes off at random moments. And sometimes there is a bit lag.",
            "Dont waste your money for this , key board is such cheap that it can come out very 2nd day after buying , build quality seems too poor, performance is okay-okay,..with such costly laptop no MS office\nScreen display is just average\n\n\nNot even worth of 25k",
            "Great product from nokia 100 % satisfied with the performance... Could improve keyboard design in future models",
            "Not that much attractive.. MS office inclusion would make it a fine product.",
            "Super fine",
            "Laptop is good. But I feel company should provide activated ms office .\nLaptop heat up while charging during the use you won't feel any heat.",
            "Useless and worst product. Dont buy it....DON'T BUY...DON'T BUY AND DON'T BUY........its completely waste of money.",
            "Very small in size low quality keyboard don't buy in my opinion",
            "Simpley I loved the product",
            "Worth every penny... all latest specs with super atmos vision.\nOkay for work like VDI and running citrix\nBest for binge watching\nBest sound in this segment\nKeyboard is little mushy it requires efforts to type in initially but eventually you get habitual\nNo heating problem yet because of very good ventilation\nSmall slick and light (1.1kg)\nStylish finish..",
            "This review is after a month of usage\n\nPros:\nBuilt - Super solid, unlike other laptops in the range\n\nWeight - This is a key Differentiator.. it's so Light to fall in love with it especially if you've tired using bulky office laptops of Dell, Lenovo etc..\n\nDisplay - the Atmos display is so so good, the difference can be seen when you're watching a compatible Video on Netflix\n\nSound - Good, but not Great. But excellent when compared with peers\n\nCons:\nTrackpad: I felt the sensitivity of the track pad could have been little better for experience but i might be wrong in this as I am comparing my experience with Mac book.. again at this price it's a way better choice.",
            "Good",
            "Bought in December, working fine so far.. I wish it does not disappoint me in future as well. Thankyou Nokia and Flipkart..",
            "It’s ok laptop not great. Laptop has issue with 5Ghz WiFi. It keeps disconnecting. Over continuous use processor does not respond smoothly. External display connected via dock through USB 3 has some issue. Especially after long usage, it tend to connect and disconnect again. Look like driver has some issue.",
            "Excellent",
            "Build quality not so good",
            "Good Laptop",
            "It's very good laptop in 50k. It's very light wight for use.",
            "Good product",
            "Great service from Flipkart.\nOverall build quality and software experience great",
            "The Laptop is Very Good. But has few issues with the keys design. The Laptop is not good for anyone who use MS Excel most of the time. all the functions key have different functions. The F1 key works as Less Display Brightness and F2 works as more Display Brightness. Similarly the combination keys like Ctrl + F4 make the speaker off and does not close the app that was open. the F5 key does not refresh, instead it reduces the volume. so this laptop may not be good for someone who uses the short key very much and will find it very difficult to us. For all other usage it is pretty good to use. This Laptop did not fully fit my requirement as I do use Excel quite some time and I have to use the mouse now more to do the changes in the excel.",
            "10 days of use, Good laptop and SSD making it very quick and fast . The face lock works awesome .",
            "Excellent laptop",
            "Very good laptop at this price",
            "Most Amazing machine, Nokia has ever made!\nI'm mesmerized with this laptop. At this price, no other can beat it.\nIt's father of any laptop at this segment.",
            "Top product",
            "Powerful Chota pack",
            "Terrific purchase loved it",
            "Good",
            "Every thing is great except key pad for coding it's not suitable for me space between each key could be better. Rest all good.",
            "Awesome",
            "After 03 weeks use\nThe product is awesome.Great boot speed,light weight and elegant. Go for it if you are ahead of the popular opinions .\nYou will not regret.",
            "If with MS office pre loaded we can give 5 stars",
            "One of the best laptop, not only valued but performance is the best.",
            "Excellent product at good price. Thankyou Flipkart.",
            "Very nice product. Thin n Light like I wanted.",
            "Amazing, great perfomance, except gam8ng, no GPU bot for gaming, mind it. But otherwise, fantastic, for regular basic works and media/social media. Im satisfied and realy light and thin very convinient for carrying around.",
            "After seeing many positive reviews I purchased this laptop during BBD\nIt is unbelievably light weight and powerful\nWindows hello works in a second\nGood battery back up, back-lit keyboard,\nAnd has all ports I need\nDolby atmos and vision makes it more special while watching movies\nI was disappointed a bit by screen size of the laptop but it is same with every 14 inch laptop and I am getting used to it\nNo free upgrade to windows 11 provided",
            "loved it",
            "Laptop is superb in every segment. The only concern is after sale service. Otherwise everything great. It's really like MacBook.",
            "Best for simple tasks.... Bluestacks works like a charm.....Close your eyes and purchase the product. Unbelievable and amazing.....Just love it.",
            "Awesome laptop in this price range",
            "Very happy with the Nokia PureBook, real value for money product.\n\nVery slim, lightweight, fast and smooth operation. Love it!",
            "Performance and features wise it's best choice",
            "Awesome Laptop for daily use...",
            "Very light weight and work smoothly\nBest among all laptop I have used so far.",
            "It's good but I think more price",
            "Awesome products best to buy",
            "Performance wise it's nice, and have good specifications\n\nBut design and look is very bad, and its look like local brand. Fiber around so bad quality.. really didn't expect from nokia..\n\nNo return options..",
            "Great product from Nokia and Flipkart!",
            "Overall Its One Of the Best Laptop But Only You Have To Compromise With Its Keyboard Part Keys Are Little Bit Small And Congested.",
            "Excellent performance and nice battery. Feeling like using the MacBook.",
            "Loved it...Light weight easy to carry",
            "Nice Product 👍",
            "Excellent Laptop for Casual Users and Students. The build quality is decent, and the performance is great. The screen is great for all kind of media content and viewing angles are good too. It's very light weight and nimble, and perfect for someone who travels a lot. The keyboard is a but mushy, but that should not be problem per se, as the typing is good, and you can always use an external keyboard if needed. Touchpad is decent and the button placement of touchpad is not so great. The best part is that the laptop does not get heated up easily even with performance intensive apps running. Battery back up is great too. Been using the laptop for an hour everyday for the past 4 days and I still have a charge around 40%.",
            "Comfortable for children",
            "Using from I weak loved it till now no problem",
            "Good Laptop from Flipkart with Nokia Branding.",
            "Good",
            "Nokia has made this Laptop just as I wanted very slim and thin design. It is very light laptop on this Range. I got this laptop on just 52812/- after the No Cost EMI discount for six month.",
            "This is so lightweight and I am really surprised by the build quality. I have been using it for a month and this is so nice and smooth to use .",
            "It’s worth for money. Laptop is very slim and handy",
            "Except keyboard and backlit everything is too good…quality is great and it’s very lightweight",
            "2nd to Dell inspiron. Prefers 15 inch laptop since number keys are more frequently required.",
            "Speed of this laptop is too much fine my overall experience is very good with that",
            "Great product with a good specifications",
            "Light weight and value for money.",
            "I loved it. Wish I can get ms word free. Updation of apps took lot of space... Only 440 gb usable. And also today I received Windows 11 update too.. Good...",
            "superbbb product...",
            "Excellent. But its over heats sometimes. Still worth the price.",
            "Laptop is good from every point of view except battery backup.\nBattery backup can be improved.",
            "Good one 👍👍",
            "Very good product",
            "Good one",
            "First Impression\n--------------------------\nExcellent option for Office and Study. Definitely not for gamers and hardcore editors, it shows basic performance in these departments.\n\nOverall Rating: 4.7.\n\nCons.\nThe body easily catching imprints while handling.",
            "Very lightweight and easy to use.\nBuild quality is very good.\nBattery performance is satisfying.",
            "Good performance",
            "I liked, thanks for your recommendations!\nCongratulations Flipkart.",
            "Best deal",
            "Good product",
            "Highly compact\nGood display\nLight weight\nFast startup\nBattery usage can be minimized by customizing background applications that shall be stopped (one drive backup)\nNeed to partition and divide the disk volume to separate system files and personal files.",
            "Great features in reasonable price must buy product..👍",
            "It received as expected and product is pretty awesome, light weight\nFree to carry and suitable for business or work from home\nBattery gives 5-6 hrs",
            "Everything working well including display and performance ,battery. Only camera is OK nor so good",
            "Awesome simply Superb",
            "Simply awesome. Display admired me.",
            "i really amazed with this laptop i like it",
            "Amazing product..I like it",
            "Product is very good and surprisingly featherlight. Booting is fast and face unlock is very responsive.\nOnly con is no provision for internal HDD otherwise excellent product for the price.\nWould recommend for anyone for home use and small office"
        ],
        "likes": [
            "378",
            "35",
            "29",
            "85",
            "27",
            "88",
            "9",
            "23",
            "10",
            "11",
            "6",
            "9",
            "9",
            "15",
            "15",
            "4",
            "4",
            "14",
            "3",
            "12",
            "7",
            "8",
            "8",
            "4",
            "4",
            "5",
            "2",
            "2",
            "1",
            "2",
            "1",
            "0",
            "1",
            "2",
            "6",
            "0",
            "0",
            "30",
            "36",
            "18",
            "9",
            "144",
            "17",
            "32",
            "16",
            "64",
            "11",
            "7",
            "22",
            "5",
            "1",
            "16",
            "3",
            "4",
            "4",
            "4",
            "4",
            "3",
            "4",
            "4",
            "3",
            "12",
            "3",
            "2",
            "2",
            "3",
            "3",
            "2",
            "2",
            "3",
            "3",
            "5",
            "5",
            "5",
            "7",
            "4",
            "3",
            "4",
            "4",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "8",
            "2",
            "3",
            "3",
            "3",
            "3",
            "8",
            "3",
            "3",
            "1",
            "2",
            "1",
            "1",
            "2",
            "2",
            "2",
            "2",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "5",
            "3",
            "2",
            "6",
            "7",
            "0",
            "1",
            "1",
            "1",
            "5",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "54",
            "6",
            "2",
            "22",
            "1",
            "27",
            "0",
            "3",
            "1",
            "1",
            "0",
            "1",
            "1",
            "4",
            "5",
            "0",
            "0",
            "6",
            "0",
            "6",
            "3",
            "4",
            "4",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "17",
            "3",
            "1",
            "2",
            "3",
            "1",
            "0",
            "47",
            "2",
            "7",
            "2",
            "19",
            "1",
            "0",
            "7",
            "0",
            "1",
            "6",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "4",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "7",
            "1",
            "1",
            "1",
            "2",
            "2",
            "9",
            "2",
            "4",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "7",
            "5",
            "3",
            "16",
            "23",
            "1",
            "1",
            "1",
            "1",
            "19",
            "14",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Who is authorized to upgrade the RAM ?",
            "Q:Does this laptop has metallic body?",
            "Q:Doesthis laptop avilable with numbers keyboard?",
            "Q:How long can i charge full battery ?",
            "Q:Is this good for editing??? Because iam searching for video editing laptops",
            "Q:Is this laptop have metal body",
            "Q:Expendable Ram option",
            "Q:Can i play 4k video smoothly?",
            "Q:This laptop is for multitasking and editing",
            "Q:Can I increase the ssd to 1 tb",
            "Q:How was gaming performance chip wheter it smoothnes gaming or not",
            "Q:Keyboard light is there ???",
            "Q:Can we replace RAM with higher RAM?",
            "Q:Can i run autocad in this",
            "Q:Does this laptop has finger print security",
            "Q:Does this laptop come with MS-Word, MS- Excel, MS-PowerPoint etc?",
            "Q:Wether it is suitable for programming and stuff coding",
            "Q:Does laptop comes with micro SD card Port",
            "Q:Can we play games like pubg and gta 5",
            "Q:How to install ms office in this laptop??",
            "Q:How is the trackpad/mousepad in this laptop. Is it little closer to MAC or worst",
            "Q:Is there any heating issue ?",
            "Q:Does the webcam included with privacy shutter?",
            "Q:Autocad 3s can be used?",
            "Q:can i use for coding language because i am a IT student",
            "Q:Is this a gaming laptop Can phasmophobia be played on it?",
            "Q:Does it have a camera?",
            "Q:Can we upgrade RAM , add an extra 8GB stick ?",
            "Q:Does this able to upgrade to win 11",
            "Q:Does this laptop have Audio out jack?",
            "Q:Does it comes woth free access to Microsoft Word qnd office?",
            "Q:by mistake i have deleted 2 apps ( nokia control centre and dollby vission) and i am trying hard to find these app but i am unable to re install it. please help me out.",
            "Q:Is it suitable for students to learn coding??",
            "Q:Does this laptop has backlit keyboard and is the RAM and Storage expandable?",
            "Q:Does Nokia Pure book S14 comes with RJ45 port?",
            "Q:This laptop good for programming or not?? Like java c. C++ and python?",
            "Q:Can we buy its battery after 2-3 years ? Cause Nokia has no such laptop market ?? (Your answers will be appreciated )",
            "Q:What is the material of screen's back panel, is it Plastic or Alloy ?",
            "Q:Does its charger have the Nokia Branding ?",
            "Q:Web cam provide",
            "Q:How is Sound quality? wheather it's loud?",
            "Q:backlight in this?",
            "Q:Can we upgrade windows 10 to windows 11?",
            "Q:Does it comes with pre installed antivirus.?????",
            "Q:Is it support to python",
            "Q:Can i use/run Photoshop smoothly?",
            "Q:Is this good for students? When I need to watch hr long videos and programming?",
            "Q:What about services and spare parts if lap gets damaged where can we get the repair and spare parts",
            "Q:Does the ram and ssd can be expandable??",
            "Q:Does it has WWAN and how to use it",
            "Q:Is Microsoft free or no??",
            "Q:This laptop have ms office as inbuilt?",
            "Q:Can I add graphic card in it?",
            "Q:How long should I charge this laptop for the first time?",
            "Q:Can i charge it with my 20000mh mi power bank with typ C ?",
            "Q:If we do hydraulic press on this will it break ?",
            "Q:Is the Display of this laptop finger touch?",
            "Q:Is type-c in this is thunderbolt or not Please answer it fast",
            "Q:Does the customer have to pay for activating Windows 10?",
            "Q:Does the laptop come with an Ethernet port for LAN connectivity?",
            "Q:What software does the laptop come preloaded with?",
            "Q:Does the laptop screen support touch? Can it be flipped backwards?",
            "Q:How to Activate Windows if it is not activated?",
            "Q:Does the type-c port support charging?",
            "Q:What is the battery life?",
            "Q:What is the SSD storage type?",
            "Q:Why is there a warranty-seal sticker at the bottom case of the laptop?",
            "Q:does it have backlit...?",
            "Q:When does this model with ryzen CPU hit markets?",
            "Q:How to experience Dolby Vision and Atmos",
            "Q:Is this good for programing/coding purpose ?",
            "Q:What is the adapter type? Is it possible to use a higher capacity adapter with this laptop?",
            "Q:It has anti glare display ? This laptop is suitable for heavy coding?",
            "Q:Can I run gta 5 in this laptop?",
            "Q:What happens to the Windows License if the system crashes?",
            "Q:Can users add internal HDD in this laptop?",
            "Q:Can I run mechanical software like Catia,AutoCAD,3d max etc on this laptop",
            "Q:Does the laptop come with pre-installed Windows 10?",
            "Q:Does the laptop come with CD/DVD ROM drive?",
            "Q:Is this laptop having webcam?",
            "Q:Does the laptop come with pre-installed Microsoft Office?",
            "Q:Does the customer need an activation key to activate Windows?",
            "Q:Does c port support external display connection via VGA or HDMI? I need to connect two monitors.",
            "Q:Can the company increase to 1tb SSD before buying",
            "Q:Does this laptop heats while charging?",
            "Q:Does Nokia Purebook have microSD slot?",
            "Q:Is this laptop eligible for Windows 11 upgrade ??? Is it going to get it ???? And is the ram and Storage upgradable!",
            "Q:2gb graphics card is available for this?",
            "Q:Can we connect another monitor to this laptop? And how ?",
            "Q:Is the processor or GPU upgradeable?",
            "Q:What is the refresh rate",
            "Q:I have purchased this laptop and battery hardly last for 2 hr on normal use . Kindly let me know average battery life in one charge for normal use .",
            "Q:Can I use autocad aap well in this laptop",
            "Q:Can we connect this with nokia 1100.?",
            "Q:I can play free fire",
            "Q:Can we use \"Premiere pro\" app i.e editing app, and can we play Dota game.",
            "Q:Is this display 4k?",
            "Q:Total Battery Backup",
            "Q:Nokia purebook x14 vs Nokia purebook s14 which laptop is best",
            "Q:Does it have touch id?",
            "Q:The screen specification of Nokia PureBook X14 is not 14 \"as described. What does Nokia have to say about this?",
            "Q:Is it support to SAP Software?",
            "Q:Does the laptop supports wireless lan WIFI 6 ?",
            "Q:Can I run Google chrome in this laptop???",
            "Q:Anyone tried Linux on it? How's the performance?",
            "Q:Does it have antiglare screen or not?",
            "Q:Does it have a extra memory slot for ssd or hdd",
            "Q:Does it has 3.5 mm jack for wired earphones with mic",
            "Q:Ms office available in this laptop?",
            "Q:Will this laptop suitable for windows server 2019?",
            "Q:can i add an optical disk drive"
        ],
        "answers": [
            "A:As per the Warranty Terms & Conditions in the Instruction Manual(Page 22), upgrading RAM or Storage must be carried out through the Nokia Authorized Service Centers. Note there are charges applicable",
            "A:Yes. It is made up of metal and has a matte black finish on it.",
            "A:No. Usual numbers at the top.",
            "A:if you mean ,for a full charge how long it takes the answer is 1.5 hour . initially you need to charge for Atleast 4 hours.and Battery is lasting for at least 15 hours.",
            "A:Nope. Go for a gaming laptop if you want to edit videos.",
            "A:Ya it’s made up of MG-AL alloy metal body",
            "A:yes it is expandable but it will void the warranty I guess",
            "A:yes, you can play 4k dolby vision videos smoothly.",
            "A:Yes, you can do both. Very fast laptop.",
            "A:Yes you can increase. But you need to visit Nokia Authorized Service Centers if you don't want to void your warranty.",
            "A:continue heated while on gaming",
            "A:yes",
            "A:Yes you can",
            "A:yes",
            "A:No",
            "A:No, it doesn't come with MS Office. If they would have provided the same, it would have been PERFECT!!!",
            "A:yes",
            "A:No port",
            "A:Yes",
            "A:You have to buy any suitable MS office subscription to use. You can use other free software like WPS Office which are also quite good, though you can not use many facilities like Macro with these.",
            "A:This is obviously not Mac.. but for what it is, its pretty good and absolutely usable",
            "A:Not at all..No such issues . Usage Recommend for longer duration",
            "A:No.",
            "A:Yes, Even I'll use AutoCAD, Engineering student here..",
            "A:No",
            "A:This game can be played, under certain low Settings, But trust me! *If you are into gaming, even a bit, don't go for this laptop.",
            "A:Yes",
            "A:No, you can add a single 16GB stick, as it has only one RAM slot, not 2. In description they mentioned 2 memory slots that is 2 SSD slots not RAM slots",
            "A:Yes, I just received a notification to upgrade to Windows 11 and it is free upgrade.",
            "A:Yes, it has 3.5mm Jack",
            "A:Yes",
            "A:reset ur pc",
            "A:Yes it is...",
            "A:Yes, this laptop do have backlit keyboard",
            "A:Yes it comes with a RJ45 port and I am using it too.",
            "A:Yes",
            "A:Yes",
            "A:It is magnesium alloy.. the body feel is like metal.",
            "A:No. It does not have Nokia brand.",
            "A:Yes",
            "A:sound quality is too good",
            "A:Yes Keyboard backlight is there",
            "A:Yes it can be upgraded. I have upgraded it recently and no issues faced so far.",
            "A:no",
            "A:Yes.",
            "A:Yes the photoshop is fast enough to edit an regular Video",
            "A:best for students and 6 or 7 hr long video, average for programming",
            "A:Service Center",
            "A:yes",
            "A:No... it doesn't have sim tray to access wwan...",
            "A:Microsoft window is free, but office is not.",
            "A:No",
            "A:no",
            "A:Almost an hour.",
            "A:If it supports pd charging support you can..... But with normal powerbank you cant....",
            "A:Yes",
            "A:Do you mean touch screen : No If you mean ,\" Does it have fingerprint scanner: Still NO.\"",
            "A:No",
            "A:No, if the Windows is not activated, the customer must go to system settings and click on activate Windows and it will be activated with a lifetime license.",
            "A:Yes, the RJ45 ethernet port is available on left side.",
            "A:Microsoft Windows 10 Home Edition, Dolby Access app",
            "A:No, the laptop screen is not a touchscreen. Users can open the laptop only up to 130 degrees.",
            "A:Customers can go to Control Panel --> System and Security-->Systems click on \"Activate Windows\" on bottom right, click on troubleshoot & the Windows will be activated in 1-2 minutes.",
            "A:This laptop doesn't support Type -C charging. These is nothing like mobile charger only, all depends on Power delivery Wattage. I have OnePlus 65w typeC charger but lappy is not supporting charging.",
            "A:The battery life is up to 8 hours with mixed usage of the laptop.",
            "A:The laptop SSD type is NVMe.",
            "A:In case of warranty claims, the warranty-seal will help authorized service technician to check if the bottom case of the laptop was opened or not.",
            "A:Yes it has backlit keyboard.",
            "A:As far as I know it’s not yet announced. If you check Nokia website, only one model with intel i5 processor is currently available in India",
            "A:The best way to experience Dolby Vision & Atmos content is to stream compatible content via Windows Netflix app or Edge chromium browser . You can check Dolby access app for more options.�",
            "A:This is a very fast computer with about 6 to 8 hours of battery life having 512 GB SSD and 8 GB RAM. Core i5 10210 Processor is also fast. So, I hope you should have no problem for coding.",
            "A:The laptop comes with a 65W adapter with a pin type charging pin. It is recommended to use company provided adaptor and battery only.",
            "A:Laptop is suited for coding, but what does it mean heavy coding? It uses a lot of GUI? Then take a laptop with dedicated graphic card with Nvme ssd",
            "A:No. This laptop is for professionals. People who perform productive work and make money. Not for gamers!",
            "A:The Windows license will be linked with the registered Windows account and the it can be reactivated again in the event of a system crash.",
            "A:No, this laptop comes with SSD storage slot only.",
            "A:Yes, But you need Graphics card for the smooth experience which this laptop doesn't provide so You should buy a laptop with a Graphics card instead.",
            "A:Yes, the laptop comes with pre-installed Windows 10 Home with lifetime license. Customer needs to connect to the internet while setting up the laptop for the 1st time so that Windows gets activated.",
            "A:No, this laptop does not have CD/DVD ROM",
            "A:Yes it’s having high quality webcam",
            "A:No, the laptop does not come with Microsoft Office. Users can choose to run a 1-month trial version of Microsoft Office 365.",
            "A:No, the activation key is embedded in BIOS and the customer only needs to activate through system settings if it is not activated.",
            "A:Haven't tried connecting via type c but since it supports type c 3.1, it should support external display via type c.",
            "A:No, there is no extra SATA SSD slot in the laptop. You have to live with the 512 GB PCli M2 SSD only.",
            "A:yes, in area near the charging port, not in other places",
            "A:Yes",
            "A:It's going to be decided by Microsoft if they will allow, Windows 10 Home users for a free upgrade or not. No official announcement regarding the same so far.",
            "A:No, it has integrated UHD intel graphics card which supports 4k video playback and editing. It also supports dolby vision HDR videos.",
            "A:Yes we can connect external monitor with this laptop using HDMI cable.",
            "A:No, the processor and GPU are not upgradeable.",
            "A:120hz",
            "A:2hrs",
            "A:Yes you can use",
            "A:yeah sure",
            "A:maybe using BlueStacks or any emulator.. in low settings!",
            "A:Yes you can use both the things without any interruption.",
            "A:No.",
            "A:as per my usage, on continues Google meet it lasts for 3hours and for normal browsing upto 8 hours",
            "A:Both r good... specs are different",
            "A:it does have windows hello authentication, from which you can login via face id.",
            "A:its 14",
            "A:Yes",
            "A:Yes",
            "A:you can run anythings in this laptop.",
            "A:No.",
            "A:No",
            "A:Yes",
            "A:Yes",
            "A:yes",
            "A:yes",
            "A:no"
        ],
        "likes": [
            "77",
            "28",
            "39",
            "33",
            "9",
            "9",
            "4",
            "7",
            "6",
            "10",
            "7",
            "15",
            "0",
            "5",
            "13",
            "2",
            "2",
            "2",
            "3",
            "7",
            "3",
            "4",
            "3",
            "3",
            "0",
            "1",
            "2",
            "2",
            "2",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "177",
            "154",
            "190",
            "31",
            "19",
            "5",
            "18",
            "14",
            "20",
            "9",
            "9",
            "16",
            "10",
            "46",
            "5",
            "31",
            "16",
            "17",
            "5",
            "14",
            "30",
            "3",
            "17",
            "8",
            "3",
            "3",
            "3",
            "2",
            "0",
            "1",
            "2",
            "6",
            "2",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1"
        ],
        "dislikes": [
            "19",
            "5",
            "10",
            "11",
            "3",
            "3",
            "1",
            "1",
            "2",
            "4",
            "3",
            "8",
            "0",
            "1",
            "10",
            "1",
            "1",
            "1",
            "5",
            "4",
            "2",
            "2",
            "1",
            "1",
            "4",
            "1",
            "0",
            "2",
            "1",
            "2",
            "4",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "3",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "28",
            "34",
            "53",
            "5",
            "4",
            "0",
            "3",
            "1",
            "3",
            "0",
            "0",
            "2",
            "1",
            "19",
            "1",
            "13",
            "4",
            "4",
            "0",
            "5",
            "22",
            "0",
            "15",
            "3",
            "2",
            "3",
            "1",
            "2",
            "1",
            "1",
            "0",
            "7",
            "26",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "9",
            "0",
            "0"
        ]
    },
    "summary": {
        "pros": {
            "Build Quality": "The laptop weighs just 1.1 kg which makes it super light-weight and easier to carry around. The metal alloy body makes it sturdy.",
            "Face Recognition": "Accurate and lightning fast face recognition unlock.",
            "46.7 WHr Battery": "Battery lasts long, upto 6-7 hours on good usage.",
            "Performance": "The Intel 10th Gen core i5 processor gives amazing performance.",
            "Dolby Atmos Sound": "The Dolby Atmos sound gives the best user experience."
        },
        "cons": {
            "Backlit Keyboard (with 1.4mm Key Travel)": "Poor keyboard quality. Could have been better."
        },
        "verdict": "This laptop is a value for money with some of its amazing features such as light-weight, face recognition, dolby atmos sound and super-fast processor. Great buy for anyone.",
        "Additional Information": "Metallic body with matte black finish, No numbers keyboard, Supports 4k videos, Expandable SSD and RAM"
    }
}