{
    "title": "Lenovo Ideapad Slim3 Core i3 11th Gen - (8 GB/256 GB SSD/Windows 10 Home) 14 ITL 6 Thin and Light Laptop  (14 Inch, Arctic Grey, 1.41 KG, With MS Office)",
    "product_specification": {
        "Sales Package": "Laptop, Power Adaptor, User Guide, Warranty Documents",
        "Model Number": "14 ITL 6",
        "Part Number": "82H7016LIN||82H700J8IN",
        "Series": "Ideapad Slim3",
        "Color": "Arctic Grey",
        "Type": "Thin and Light Laptop",
        "Suitable For": "Processing & Multitasking",
        "Battery Backup": "Up to 7.5 Hours",
        "Power Supply": "65 W AC Adapter",
        "MS Office Provided": "Yes",
        "Processor Brand": "Intel",
        "Processor Name": "Core i3",
        "Processor Generation": "11th Gen",
        "SSD": "Yes",
        "SSD Capacity": "256 GB",
        "RAM": "8 GB",
        "RAM Type": "DDR4",
        "Processor Variant": "1115G4",
        "Chipset": "Intel SoC Platform",
        "Clock Speed": "3.0 GHz with Turbo Boost upto 4.1 GHz",
        "Memory Slots": "1 Slot",
        "Expandable Memory": "12",
        "RAM Frequency": "3200 MHz",
        "Cache": "6",
        "Graphic Processor": "Intel Integrated UHD",
        "Number of Cores": "2",
        "OS Architecture": "64 bit",
        "Operating System": "Windows 10 Home",
        "System Architecture": "64",
        "Mic In": "Yes",
        "RJ45": "No",
        "VGA Port": "No",
        "USB Port": "1 x USB 3.2 Gen 1, 1 x USB-C 3.2 Gen 1 (Support Data Transfer Only), 1 x USB 2.0",
        "HDMI Port": "1 x HDMI Port (v1.4b)",
        "Multi Card Slot": "4-in-1 Card Reader",
        "Hardware Interface": "PCIe NVMe M.2",
        "Touchscreen": "No",
        "Screen Size": "35.56 cm (14 Inch)",
        "Screen Resolution": "1920 x 1080 Pixel",
        "Screen Type": "Full HD LED Backlit, IPS Anti-Glare Display (300 nits Brightness, 45% NTSC Color Gamut)",
        "Speakers": "Built-In Dual Stereo Speakers",
        "Internal Mic": "Built-In Dual Array Microphone",
        "Sound Chip": "High Definition (HD) Audio, Realtek ALC3287 codec",
        "Sound Properties": "2 x 1.5W Stereo Speakers with Dolby Audio",
        "Wireless LAN": "11ac (2x2)",
        "Bluetooth": "v5.0",
        "Dimensions": "324.2 x 215.7 x 19.9",
        "Weight": "1.41 KG",
        "Disk Drive": "Not Available",
        "Web Camera": "720p HD Webcam with Privacy Shutter",
        "Finger Print Sensor": "Yes",
        "Security Chip": "Firmware TPM 2.0",
        "Antivirus": "NA",
        "Keyboard": "Standard English Backlit Keyboard",
        "Backlit Keyboard": "Yes",
        "Pointer Device": "Touchpad",
        "Included Software": "Microsoft Office Home and Student 2019",
        "Laptop Bag": "No",
        "Additional Features": "Integrated 45 Wh Battery, ErP Lot 3, RoHS Compliant",
        "Warranty Summary": "1 Year Onsite Warranty",
        "Warranty Service Type": "Onsite",
        "Covered in Warranty": "Manufacturing Defects",
        "Not Covered in Warranty": "Physical Damage",
        "Domestic Warranty": "1 Year"
    },
    "product_description": {
        "Lightweight Design": "Light in weight and built with a sleek 19.9 mm body, the 1.41 kg Lenovo IdeaPad Slim 3 Laptop lets you work or play even when you’re travelling. And, featuring a 35.56 cm (14) FHD display with four-sided sleek bezels, this laptop offers a wide view and immersive visuals.",
        "High-speed Performance": "Equipped with up to an 11th Generation Intel Core i3 processor, this laptop offers fast performance, ensuring increased productivity and efficiency. In addition, its Intel UHD Graphics can easily render heavy games, ensuring a smooth gaming experience.",
        "Efficient Battery": "Integrated with Lenovo’s Rapid Charge Technology, this laptop allows you to perform tasks or play games without having to stay connected to the charging cable. And, this technology ensures such rapid charging that the battery goes from zero to 80% within merely half an hour. Moreover, its three-cell 45 Wh battery ensures long hours of battery life on a single full charge.",
        "Your Work and Study Buddy": "Whether you want to attend virtual meetings or online classes, this laptop is a good choice. It features a 720p HD camera, privacy shutter, and Dolby Audio, ensuring high-quality visuals and sound.",
        "Easy Connectivity": "Equipped with a plethora of ports, this laptop effortlessly connects to other devices. It sports a USB-C port, a USB 3.2 Gen 1 port, an HDMI port, a USB 2 port, a Card Reader Slot, a 3.5 mm headphone/microphone jack, eliminating the need to use different types of adaptors to connect peripherals.",
        "Additional Smart Features": "Featuring AI-driven software, this laptop adds to the convenience of everyday use. Its Lenovo Aware feature sends Smart Alerts, such as Attention, Posture, and Breaks to ensure that you're paying attention, sitting in the correct position, and taking regular breaks while working or learning from home. Furthermore, with Lenovo Eye Care and Noise Cancelling functions, this laptop protects your eyes from strain and minimises ambient noise for a fun experience."
    },
    "reviews": {
        "ratings": [
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "1",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "3",
            "3",
            "3",
            "3",
            "5",
            "5",
            "3",
            "5",
            "5",
            "3",
            "4",
            "5",
            "4",
            "4",
            "4",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "1",
            "1",
            "4",
            "5",
            "2",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "3",
            "5",
            "5",
            "1",
            "4",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "4",
            "3",
            "3",
            "4",
            "1",
            "1",
            "3",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5"
        ],
        "review": [
            "I am happy with this product. Great packing order delvered in 3 days.battery life is decent .display is awesome .fast charging support.i am happy with this product. Inbuild alexa is also given. I update my review after few days",
            "Value of money product. Slim and light. Backlit keyboard, comes with 2019 ms office. Decent SSD speed and 8 gb is enough Ram.\nOnly drawback is it is made of plastic but quality is good.\nI'd recommend this any day.\nFlipkart Open delivery is great way of delivering goods.\nShare OTP only if you have received original and damaged free product.\nFingerprint is in Power button and it works fine.\nWeb cam quality is decent and comes with privacy shutter.\n\nPerformance is great. Good for web browsing, office work, meetings.",
            "Laptop has a great value for money\nFast processing and the fingerprint sensor is faster than any phone\nBoot up speed is great\nSpeakers are not Very loud\nTouchpad is very responsive\nNo high heating.\nBacklit keyboard keyboard is very awesome\nI also got windows 11 updated normaly.\nVery good laptop in my opinion\nJust go for it",
            "Must buy , fast processing , start up time max 10 s including login , shut down 4 s max , fingerprint scanner respond is good , battery life is quite good and decent.",
            "WORTH FOR MONEY.......Buttery performance in this price range .... decent battery.....is made up of plastic but still classy design....MUST GO FOR IT\n\nDeliver in good condition (BUT LATE)..... otherwise everything is perfect 💯",
            "Yes I am happy .because I have bought laptop from flipkart so no problem whatever happens then there is flipkart for help. thank you flipkart.",
            "It is good for working",
            "Great buy for 37k which I got during Big Billion sale. Fingerprint reader, display, backlit keyboards are amazing. Battery life to be tested. First day itself It got updated to Windows 11. It's light weight, is not made of metal but feel is premium not cheap plastic type.",
            "Design is spectacular. As a minimalist, I would say this is clutter free design and small like a tablet.\n\nWindows 11 update received within hours of setup completion.\n\nFinger scanner not working properly after the update. Hope it will be corrected by windows team\n\nUse it like an Android smartphone. Lenovo sends it with bloatware free software.\n\nNo standalone Sim slot. Wifi response is awesome.",
            "Nice packing with good quality display at this price range. If you are having work like editing and rendering then take this instead of HP 15s. Nice battery backup and dolby atmos is also working fine.Overall 5/5",
            "Wow Wow Wow, jut Wow. The best quality product by Lenovo, I got it in 37000 from sale , it has everything which is required for day to day usage , its super fast and reliable and compact . love it",
            "i am very happy to use this because of my budget i cant afford a very smart talented laptop like me but this company provids me a super talonted laptop i love U.will u marry me sujeet said lenovo company and i said YES to them.\nSORRY for this i am very happy now so it just said in excitement.........THANK U LENOVO AND FLIPKART",
            "It is a good laptop in this price range. It has some likable features, specially it is portable, has slim body, antiglare coating, finger print reader, backlit keyboard and camera with privacy shutter. I have bought it for my fiance as a gift. This laptop has become very useful for him in his job as a teacher. Thanks Flipkart for fast delivery.",
            "Appreciate Flipkart services, I got defective product and they replaced the product in a weeks time...\n\nPros\nAll in one package...\n\nFingerprint sensor\nSSD\n8GB ram\nPrivacy shutter in camera\nFull HD display\n\nCorns\n\nThere is no additional slot to upgrade SSD\n\nSpeaker volume is average not good as expected, after tweaking a lot you will feel fine if the room is silent",
            "This is an amazing product in the lower budget price range ... And speceally good product who uses for normal study purpase and also light weight video editing ... This is full valuable product of money ..and this not a gaming laptop .so dont buy this as gaming purpase ....",
            "Best laptop for students web surfing, online classes, making word document and powerpoint presentation can be done with ease. Gaming is not fun as it does not have dedicated GPU. Multitasking can be done smoothly.",
            "Worth of money, excellent performance with beautiful Design.Its a perfect professional laptop with ease to carry anywhere.",
            "First of all thank u flipkart for the superfast delivery just got in 2 days. Amazing laptop by lenovo with 2 yrs or warranty. Superfast fingerprint unlock and boot thanks to the SSD.\nOnly thing i did not like is the battery it drains very fast. I am a moderate user and it only lasts for about 3-4 hours that's the only flaw i noticed in this laptop, Otherwise it is a superb buy and i got it for 42k.",
            "Amazing work with lenovo, feeling good work fast",
            "Thanks filpkart nice product and very nice 🙂🙂🙂 happy for discount money 💰💰💰💰. Thanks again happy diwali god bless all.",
            "I purchased this laptop for my daughter's online school as the existing dell one got out of order.. As it's 1qth generation i3 processor, It is more than enough for daily activities like online schools and hands on with ms office and other learning software like paints and etc..\n\nDesign is superb\nPretty light weight\nFingerprint reader is awesome.\nPre-installed win 10 and ms office is good\nBattery stays for more than 5 hours for online classes (using only chrome)\nMouse track pad and keyboard is very convenient to use.\nDisplay and sound is good.. but it can be enhanced..\n\n\nI got it in 36k in big billion days... So I think it's a value for money laptop for me..",
            "First of all big thanks to flipkart and supplier who did fantastic job to deliver it before 10 days of promised delivery.!!!\n\nPlease move away from this if anybody looking a laptop with good battery backup. Apart from battery backup all features are simply awesome. At this price range i think none of the vendor can provide this much features without compromising its quality. Main attraction is its metal body,keyboard backlit and Finger print sensor. On the delivery day itself it got upgraded to Windows 11 without any confusion. Its pretty straight forward.\n\nCons:\n\nPoor Battery backup\nSSD is only 256\nCamera clarity",
            "Really great..256 ssd is ok...\nFor study purposes it great.\nbut after one day finger print sencor is not working properly.\nrest all are good",
            "Ok",
            "Fraud happened with me dont buy it I got a refurbished one and the warranty was activated 2 months earlier and now they are not providing any resolution about it and neither replacing it",
            "AL PWOLI..... NEXT LEVEL",
            "Exellent",
            "Very good 👍",
            "As of now product is good.",
            "Received my lap today\nDisplay 5/5\nBattery 4/5\nDesign 5/5\nPerformance 5/5\nJust love it safe delivery from flipkart thanks a lot",
            "I love this product",
            "I Received LAPTOP But Touchpad Not working Resolution take 15 days ago I hate it....\nmore than 20 days ago\nI have fight with Flipkar after the team is accepted replacement and i have received New LAPTOP its ok for me but Battery is quickly drain...",
            "Overall I satisfied with this product ,but I want more features with this range",
            "Excellent product\nWorth for money\nLong lasting battery\nWide display",
            "Good laptop for students 👍🏽",
            "Had some trouble with the first order, as the laptop was defective.. unfortunately flipkart couldn't replace and it had to get refunded. Finally re ordered under exchange, and got a working laptop.\nLaptop has back-lit keyboard, fast boot times, good performance on daily tasks, zero lag, superb screen to body ratio.\nFinal: Go for brands that have manufactured laptops/desktops for years, rather than investing lower amount on new entrants, as their service setup will take time..\nIf you buy this, definitely add 1 more yr of warranty by paying 1500 as it's on-site.",
            "Profile not matched with the Name given. I mean it is not that slim at all, but name is Lenovo Ideapad Slim 3i🤣",
            "Just damn good! It's been almost 2 months after purchase, if you maintain it well, you will get a good response from it, I've added stickers to it available on flipkart itself! Best laptop in such low price, looks professional.. Go for it!!",
            "Wow! Worth the price I paid. I don't need to say more i think.",
            "Good performance. Nice and sturdy design",
            "Very good product and very good flipkart and seller",
            "Battery back up is not good if we use heavily it will come 2:30h to 3h, and also heating in back side",
            "after 10 days feedback is good, except battery...",
            "best value for money product .I am typing this review on this laptop",
            "Best laptop with a makkhan speed.... Loved it but only the issue is of battery. Battery drains to fast,... And in other case it is best in this price range.",
            "Was doubtful on buying an i3 core for personal use as we use i5 core in office laptops, but seeing the reviews gave it a go and the result is delightful. All the features mentioned are truly defined, the only dissatisfaction for few could be the less audio output, though it doesn’t matter much to me. I would say nothing is better at this range.",
            "Great value for money 💰",
            "Amazing laptop(product)! Also, the delivery was good!",
            "Though battery life might be an issue but overall it's worth buying.",
            "Battery backup approx 2.5 hours",
            "🔋 backup is moderate. Don't expect more then 3hrs.",
            "good but bit expensive.\n\npros:\ngood built quality\nlight weight\nfast\nresponsive fingerprint scanner\n2 year warranty from buying date\nms office\ngood color...looks premium\nscreen is good\n\ncons:\nbattery...lasts only 3-4 hrs with wifi on\nmouse trackpad is poor esp right click.\nkeypad- nearby keys wobble\nattracts smudges easily\nmy screen has started going off randomly for a second...then turns on itself....very rarely but i hope it isnt a major defect",
            "Considering the price it’s a OKAY product!\nCould have been better!",
            "Awsm laptop first look is like so premium finish is very good. And also fast delivery thankyou flipkart ...",
            "This product This price good",
            "Everything was going fine till 2 days back when the cover of my laptop developed a hairline crack it seems the plastic material use to make the laptop is of cheap quality ,moreover lenovo company is not covering this under warranty which is very disappointing ,I have used it with at most care .now they are telling that it is chargeable",
            "I am fully satisfied with laptop performance and display",
            "best in this segment,value for money.peace.",
            "Everything is good but battery.... Its battery backup is very poor below average apart from that its ok... So u want a bigger battery life look for something else or eleae its good laptop",
            "Good product, worth buying it.",
            "Love this product.. very smooth and fast..",
            "Laptop is good but Battery is not good",
            "Lan port is missing. This should mention in portal so that user can check and buy. Otherwise it is good laptop for business work.",
            "Device is great but the only biggest Con is battery life. Battery life is extremely poor and would hardly last 2-3 hours. Expect a much poorer battery life if you're planning this device for online conferences/meetings.\nRest things like Display, Trackpad & Key travel are great.",
            "Display, size, battery and performance are all very good. But only thing that I don't like with this 14 inch laptops is the sementics of the keyboard. Keys are coupled very closely to type fluently. But one will get use to it eventually after some time. But it will not give u the feels and comfort of full size keyboard",
            "Looking very good and classic design well perfomance battery life average",
            "It is very good",
            "Nice",
            "Good",
            "Its Gud",
            "V nice",
            "Such worest laptop dont Buy it so much errors review after using 15 days",
            "It product absolutely sucks\nBattery backup max 3 hour\nLaptop lags a lot",
            "Cool. Open quickly.",
            "Best to buy under 45k\n\nwho are searching for;\n14 inch compact screen size\nbetter IPS clear display\nlight weight\nminimalist design\n4-5 hrs battery backup (Normal Usage)\nSSD , yes of course super speed (Powli)\nlightning fingerprint reader 'kidu'\nUSB C\ncharging time 0-90% takes 1.5 hrs\n2 year warranty\n\nI strongly suggest you this one.",
            "overheating, fan movement loud, touchpad vibrationg , it lags during Charing",
            "Good",
            "Best laptop smooth in working\nIt has finger print reader which works very fast in fraction of seconds\nBattery performance is good\nBut sound is little bit low\nAnd for this price if wet little more storage capacity then it will be very good",
            "A complete package for them who are in search of budget friendly and very good performing laptop. Just go for it you won't disappoint.",
            "Good laptop",
            "Worth for money fast and it's good for day to day activities.My daughter using for online classes it's good product.",
            "Preety good.",
            "Good",
            "I using this",
            "Good as I expected",
            "Could've done better with the display. It's is not slim at all. In fact it is rather bulky.",
            "Money of value in this laptop",
            "Better",
            "Some keys in the keyboard are not working after some days. The big concern is the warranty started two months before I open my laptop. I think this is refurbished one.\nBeware before you buy.",
            "Overall good",
            "Best laptop in this price range\nPros,\nAluminium finish give premium look\nLight weight compact\nBacklit\n5 sec boot time\nFingerprint reader very fast 👌\nLatest i3 11th gen is beast 🛐\nBattery backup good easily 5+ hours\nLatest wifi 6 = better connectivity and more internet speed\nCons,\nStorage is less, you get about 220gb storage for use out of 256gb ssd (buy a external hard drive , ssds are for faster boot time and overall faster performance).\nIntel integrated uhd with 4 gb shared memory, so this laptop is not for gaming still can play gta 5, cod on low graphics 👍🏼",
            "Over all a good budget laptop.\nI rated it 4 star as body doesn't seem to be very sturdy, I am not saying it is Bad but it is not very Good either. I bought this laptop for my personal use, i am also having a lenovo ThinkPad for my official work and the body of ThinkPad is really good but at the same time price is at a higher side. Lenovo after sales services are good and one can go with this laptop. It comes with 2 years base warranty.",
            "Very light weight and suitable for office use",
            "It's a amazing very NYC laptop on this price",
            "Good working..",
            "Very good product , fully satisfied",
            "Satisfied as always.. good services we are getting from flipkart and specially the delivery man he is having a good behaviour",
            "Pretty good laptop for office use .. however battery is ok not great with upto 4 hours of heavy multitasking .\nHigh end games might not be supported but although it can handle games in medium quality ..\nOverall it's a good purchase.",
            "Good Product and Good for Editing",
            "Very nice",
            "Very nice laptop light weight and more secured content specifications😊",
            "Average",
            "amazing laptop",
            "Every thing is great except battery life...best laptop in this budget.\nBattery backup is almost 3 hrs",
            "Loved it. Excellent fast delivery",
            "A very effective in performance",
            "Gud",
            "Great Laptop in this Price range.",
            "On my perspective it is best budget friendly lap comparing with other i3 laptops.\nFast booting\nGood performance\nGood camera quality for interviews\nFast charger\nBacklit keyboard\nFingerprint scanner....",
            "Worth of money",
            "Super",
            "Makin noise",
            "It is a great laptop for its price. Completely durable and you get the high quality metal feel on your hands rather than some cheap plastic in other laptops in this range. The camera is of low quality for video calls but is standard in this range. Overall, it is a good product and must buy for office work, or home use. It is not a gaming laptop.",
            "After a long search found this configuration most useful.",
            "Everything is ok 😍☺😊",
            "Good one for student. But process Speed is bit low.",
            "I Loved the Overall Performance and look.",
            "Good",
            "Perfect for every use. It's 5 months using this laptop and it's perfect for office use and personal both.",
            "This is very good product at this price i m satisfied",
            "I love it",
            "Good service from flipkart... Thank you so much",
            "Amazing product..i like it",
            "Best value for money",
            "Good",
            "This laptop is good and max 2.5hrs battery life..\nBut chack first size ,\nWhen it recived I thought it's too small but know it's good size and work better,\nAfter 30 days..",
            "Such a amazing product from lenovo, performance and the design so good, ots have HQ camera..\nBut i have concern about the battery its just average only how ever thank you flipkart for such nice product......",
            "Camera not good.\nSome technical problems with camera…2 times repair in one year usage",
            "battery timing is very low",
            "Overall good",
            "Size of screen seems a little bit smaller. I am very dissatisfied only because of screen. Rest everything is as stated.",
            "Bad product to buy",
            "Except battery all the other is excellent",
            "Lov it....",
            "Worth price",
            "Worth every penny💜\nAmazing laptop 💯",
            "Very good product",
            "Good",
            "Best product..",
            "Value for money",
            "I would suggest you to go for 512 gb varient",
            "Display is good but compared to our Dell studio laptop it is yellowish. Camera can be better but ok. Build quality not much good but keypad keys are good and also backlit. Compared to avalable options in current Indian Dell HP this is better.",
            "Amazing laptop. Runs smoothly. Very fast processed. Inbuilt office",
            "Great product with good battery life. The display could have been more lively with the audio. The audio output is the worst part of the deal, however I am happy with the overall experience. Smooth performance with with cool backlighting and Fingerprint sensor which comes very handy.",
            "Best laptop ever",
            "Product js good battery backup is ok ok and price is very good display quality is good procesor is flawless awesome I reviewed this product after using 7days",
            "It looka awsome !! Worth for money and specially it performance really very good",
            "Nice",
            "Very good you should buy it best !!!!",
            "Best product at this price point.. 😍😍\nGood customer support by flipcart.. 👍",
            "Laptop best but charge then full heating issue. Faces",
            "OSM",
            "Very nice go for it",
            "Good",
            "Nice laptop"
        ],
        "likes": [
            "198",
            "23",
            "68",
            "20",
            "61",
            "6",
            "25",
            "4",
            "13",
            "4",
            "4",
            "15",
            "18",
            "4",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "3",
            "1",
            "5",
            "1",
            "3",
            "50",
            "14",
            "7",
            "6",
            "6",
            "7",
            "15",
            "19",
            "20",
            "2",
            "3",
            "3",
            "8",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "2",
            "2",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "2",
            "0",
            "1",
            "1",
            "4",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "76",
            "7",
            "6",
            "5",
            "24",
            "0",
            "8",
            "0",
            "5",
            "0",
            "0",
            "6",
            "14",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "1",
            "4",
            "0",
            "3",
            "4",
            "0",
            "0",
            "0",
            "0",
            "1",
            "5",
            "8",
            "10",
            "0",
            "0",
            "0",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "1",
            "2",
            "31",
            "5",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Does it have c type usb?",
            "Q:Is it good for coding and programming??",
            "Q:Does it support window 11 upgradation?",
            "Q:Metallic or plastic",
            "Q:Graphic card available?",
            "Q:I brought this laptop. How to activate MS office installed inside ?",
            "Q:this laptop have fingerprint sensor",
            "Q:How to start the keyboard light?",
            "Q:We connect WiFi in this laptop",
            "Q:What color does it comes with",
            "Q:Is there charger with this",
            "Q:Having m2 slot???",
            "Q:Can we charge it using type c port and 30 watt mobile charge? If no.what us the use of that poet?",
            "Q:Does it get heated or start lagging",
            "Q:It's have Ms office",
            "Q:That the laptop support for gameing",
            "Q:Can we expand ram and rom??",
            "Q:Can windows 11 free upgrade?",
            "Q:Can I add internal hdd in it,if not then how I can increase the storage capacity of the laptop without attachment of external hdd",
            "Q:It have Bluetooth connectivity",
            "Q:What is the battery backup of this laptop",
            "Q:Does it provide windows 11 & Ms office 2021",
            "Q:Is that have keybord light?",
            "Q:Can I expand 512 GB SSD?",
            "Q:Does it suitable for video editing",
            "Q:Can i install hdd seperately?",
            "Q:Where is the fingerprint reader on the keyboard?",
            "Q:This laptop compatible with graphics Direct X12",
            "Q:Can we play gta vice city game",
            "Q:We can add 1 tb ssd in this laptop",
            "Q:Is windows 11 upgradation is free. Sincere answer",
            "Q:rj 45 cord port available",
            "Q:How many finger print can set in this",
            "Q:This laptop have backlight",
            "Q:Can I upgrade SSD after some time??",
            "Q:Which one is better realme book slim or lenovo",
            "Q:Which Is in Cd Drive",
            "Q:Plastic body or metalic body",
            "Q:Does have pre installed ms office",
            "Q:This laptop support rapid charge ??",
            "Q:Is it touch screen",
            "Q:What is the battery backup 7",
            "Q:Does laptop have backlit keyboard and fingerprint sensor",
            "Q:Is it used for office purpose?",
            "Q:Is windows lifetime or trial version?",
            "Q:Does it have windows office features such as word, powerpoint, excel for free",
            "Q:Is there Alexa in this laptop",
            "Q:HDD capacity is not mentioned. Does this laptop have a HDD? What is the capacity?",
            "Q:This laptop can play minecraft, GTA 5, Forzha horizan 5 can",
            "Q:Does it support AUTO CAD,?",
            "Q:Does it have a web cam",
            "Q:Which Wi-Fi version it has 5 Or 6"
        ],
        "answers": [
            "A:Yes",
            "A:Yes",
            "A:Yes it will support windows 11",
            "A:No it's made of plastic with metallic finish.",
            "A:No",
            "A:create Microsoft account like outlook, live. use it to activate",
            "A:Yes This comes with Fingerprint Sensor",
            "A:Press function key and space bar",
            "A:definitely",
            "A:silver",
            "A:Yes",
            "A:No",
            "A:You can't charge this laptop via type c port its only for data transfer.",
            "A:No",
            "A:Yes",
            "A:no. only light games.",
            "A:yes",
            "A:Of course! I am already using it",
            "A:No, you cannot attach internal HDD. You can increase space by replacing 256 GB ssd with ssd of higher capacity which will void warranty. Better to use external hdd.",
            "A:Yes",
            "A:2HRS . battery Not bad. But laptop not working some time",
            "A:Yeah you can update to windows 11",
            "A:Yes",
            "A:No, but you can replace with new 512gb ssd",
            "A:Yes but you can go for I5 processor",
            "A:No",
            "A:you will find the finger print reader at the bottom right of the keypad.",
            "A:n",
            "A:yes off course",
            "A:Yah we can add",
            "A:Yes",
            "A:No",
            "A:multiple",
            "A:yes",
            "A:Yes",
            "A:lenovo",
            "A:no",
            "A:Plastic but durable",
            "A:Yes, it has",
            "A:No",
            "A:noo",
            "A:2_3 hours",
            "A:Yes it has backlit keyboard and fingerprint sensor",
            "A:Yes",
            "A:life time",
            "A:Yes I am so happy and my daughter also. Meny time waiting for this sale and so I got it thanks. Amazing offers this sale. 😘😘😘😘😘🙏",
            "A:yes",
            "A:no",
            "A:Yes",
            "A:It should",
            "A:Yes 720p you can manage and worth of you're money.",
            "A:5"
        ],
        "likes": [
            "13",
            "26",
            "29",
            "2",
            "26",
            "4",
            "4",
            "3",
            "2",
            "3",
            "4",
            "14",
            "0",
            "2",
            "3",
            "2",
            "5",
            "4",
            "4",
            "4",
            "0",
            "1",
            "1",
            "1",
            "2",
            "5",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "16",
            "4",
            "30",
            "7",
            "3",
            "4",
            "6",
            "4",
            "2",
            "1",
            "1",
            "1"
        ],
        "dislikes": [
            "0",
            "3",
            "6",
            "0",
            "11",
            "0",
            "0",
            "1",
            "1",
            "0",
            "1",
            "11",
            "0",
            "1",
            "0",
            "1",
            "4",
            "0",
            "2",
            "3",
            "1",
            "0",
            "1",
            "0",
            "0",
            "8",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "4",
            "7",
            "13",
            "2",
            "0",
            "1",
            "5",
            "1",
            "1",
            "0",
            "1",
            "1"
        ]
    },
    "summary": {
        "pros": {
            "Build Quality": "The Lenovo IdeaPad Slim 3 Laptop is lightweight and has a sturdy design.",
            "Fingerprint Sensor": "The fingerprint sensor is lightning quick and works seamlessly.",
            "720p HD Webcam with Privacy Shutter": "The camera quality is decent and it comes with a privacy shutter.",
            "Performance": "The 11th Generation Intel Core i3 processor is more than enough for daily activities like online classes and meetings."
        },
        "cons": {
            "45 Wh Battery": "Battery life is extremely poor and lasts only 2-3 hours on normal usage.",
            "Storage": "Low storage as it contains only 256GB SSD."
        },
        "verdict": "Good laptop for students for normal daily usage in such a price range.",
        "Additional Information": "No graphic card, Contains C-type USB, Expandable RAM."
    }
}