{
    "title": "MSI GF63 Thin Hexa Core i5 10th Gen - (8 GB/1 TB HDD/256 GB SSD/Windows 10 Home/4 GB Graphics/NVIDIA GeForce GTX 1650 Max Q/60 Hz) GF63 Thin 10SCXR-1616IN / GF63 Thin 10SC-611IN Gaming Laptop  (15.6 inch, Black, 1.86 KG)",
    "product_specification": {
        "Sales Package": "Laptop, battery, power adapter, user guide",
        "Model Number": "GF63 Thin 10SCXR-1616IN / GF63 Thin 10SC-611IN",
        "Part Number": "9S7-16R412-1616 / 9S7-16R512-611",
        "Model Name": "GF63 Thin 10SCXR-1616IN / GF63 Thin 10SC-611IN",
        "Series": "GF63 Thin",
        "Color": "Black",
        "Type": "Gaming Laptop",
        "Suitable For": "Gaming",
        "Power Supply": "120W Adapter",
        "Battery Cell": "3",
        "MS Office Provided": "No",
        "Dedicated Graphic Memory Type": "GDDR6",
        "Dedicated Graphic Memory Capacity": "4 GB",
        "Processor Brand": "Intel",
        "Processor Name": "Hexa Core i5",
        "Processor Generation": "10th Gen",
        "SSD": "Yes",
        "SSD Capacity": "256 GB",
        "RAM": "8 GB",
        "RAM Type": "DDR4",
        "HDD Capacity": "1 TB",
        "Processor Variant": "10500H",
        "Clock Speed": "2.5 GHz with Turbo Boost upto 4.5 GHz",
        "Cache": "12",
        "Graphic Processor": "NVIDIA GeForce GTX 1650 Max Q",
        "Number of Cores": "6",
        "OS Architecture": "64 bit",
        "Operating System": "Windows 10 Home",
        "System Architecture": "64",
        "RJ45": "Yes",
        "USB Port": "1x Type-C USB3.2 (Gen1), 3x Type-A USB3.2 (Gen1)",
        "HDMI Port": "1 x HDMI Port",
        "Hardware Interface": "NVMe PCIe",
        "Touchscreen": "No",
        "Screen Size": "39.62 cm (15.6 inch)",
        "Screen Resolution": "1920 x 1080 Pixel",
        "Screen Type": "Full HD LED Backlit IPS Display (60Hz Refresh Rate, 45%NTSC Color Gamut)",
        "Speakers": "Built in Dual Speakers",
        "Internal Mic": "Built-in Microphones",
        "Sound Chip": "Realtek ALC 269",
        "Sound Properties": "2x 2W Stereo Speakers",
        "Refresh Rate": "60 Hz",
        "Wireless LAN": "Intel Wi-Fi 6 AX201(2*2 ax)",
        "Bluetooth": "v5.1",
        "Ethernet": "Yes",
        "Dimensions": "359 x 254 x 21.7",
        "Weight": "1.86 KG",
        "Disk Drive": "Not Available",
        "Web Camera": "720p HD Webcam (30fps@720p)",
        "Keyboard": "Single Backlit Keyboard (Red)",
        "Backlit Keyboard": "Yes",
        "Pointer Device": "Touchpad",
        "Included Software": "Silver-Lining Print, Cooler Boost, Audio Boost, Dragon Center, Nahimic 3",
        "Additional Features": "3-Cell, 51 Whr Battery",
        "Warranty Summary": "2 Year Warranty Term for Gaming & Content Creation (EU-WE)",
        "Warranty Service Type": "Carry-In Warranty",
        "Covered in Warranty": "Part Failure",
        "Not Covered in Warranty": "Physical Damage, Burn, Liquid Spill"
    },
    "product_description": {
        "Strong Graphics Performance": "This gaming laptop features a GeForce 1650 Max Q to ensure that you get to enjoy a strong graphics performance while using the laptop. You can run modern titles of games with the NVIDIA Turing architecture feature so that you can enjoy a thrilling gaming experience.",
        "Audio Boost": "Thanks to the Hi-resolution Audio feature, you can experience the power of music, movies, and more without any loss.",
        "SteelSeries Silver-lining Printing Keyboard": "This laptop features a keyboard that has a SteelSeries silver-lining printing keyboard that ensures aesthetic appeal and a lasting build quality.",
        "Dragon Center 2.0": "You can use the Dragon Center 2.0 feature to enhance the laptop’s gaming performance by customising and freeing up system memories. This way, you can monitor and optimise the laptop.",
        "Thin Bezel Design": "This laptop has a compact chassis that ensures that you get to enjoy immersive gameplay. Thanks to the IPS-level panel, you can get a clear and expansive view of the screen at all angles in great clarity and contrast.",
        "Quiet Performance": "This gaming laptop is designed and tuned to ensure quiet and cool performance even under load. This way, you can enjoy using the laptop without being disturbed or distracting those around you."
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "3",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "2",
            "3",
            "4",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "2",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "1",
            "4",
            "4",
            "5",
            "1",
            "5",
            "1",
            "5",
            "4",
            "2",
            "4",
            "5",
            "5",
            "1",
            "3",
            "5",
            "5",
            "3",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "2",
            "1",
            "5",
            "1",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "3",
            "4",
            "3",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "2",
            "5",
            "4",
            "1",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "4",
            "3",
            "4",
            "5",
            "4",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "4",
            "4",
            "3",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "4",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "3",
            "4",
            "3",
            "3",
            "5",
            "5",
            "5",
            "3",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "1",
            "5",
            "3",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "4"
        ],
        "review": [
            "Easily one of the most valuable & wonderful gaming laptops out there.\n\nIf you are a business user who wants more battery backup, portability & laptop for basic business requirements, then this is not for you.\n\nA few things to know if you are purchasing a gaming laptop for the first time.\n\n- Cooling system is very important for gaming laptop.\n- Battery backup is adequate. However, it can be optimised if you work more than play.\n- Fans run quiety to moderately all the time. Somewhere you can get around 45 db which is very decent and hardly noticable.\n\nThat being said, in this price range, this laptop is brilliant. I have used a macbook air and macbook pro for more than a year. I know what is offered by a premium laptop.\n\nHere is where this laptop beats the air & pro (intel edition 13\" inch both):\n\n- The bootup time is simply too good. Also the wakeup from sleep.\n- Graphics\n- Gaming\n- Cooling system.\n\nIn all fairness, apple laptops are not gaming laptops but still it makes one feel good about the decision to get this msi.\n\nRegarding gaming experience\n\nI was able to play Microsoft Flight Simulator 2020 easily on this machine. That really is something. The game was smooth and didn't lag at all. I didn't get the actual FPS. The laptop did heat up but at the same time, it cooled really well. It went up to 79°C. The cool down after gaming is really fast and efficient.\nThis flight sim experience was as good as my series X but of course nothing can beat the Series X. I am not a serious gamer. I play probably at max 2-3 titles.\n\nUsing the dragon center, you can optimise for gaming, work and other activities like graphic design and programming.\n\nI got this for 58,990 rupees which is a fantastic deal for this specs. I searched about 3 months online in many ecommerce sites.\n\nThe only drawback is the keyboard light which is bright red. It would have been better if it was white. (Red is the theme for msi.)\n\nIf you are still worried about battery, you can optimise it to suit the requirements. Don't expect too much in the battery segment. Running jupyter notebook and chrome, I got around 2-3 hours. You can probably optimise it the max to reach 4 hours. Beyond that, I am not so sure.\n\nNvidia is simply outstanding. Once you purchase this laptop, spend time updating windows, nvidia drivers and only then install anything.\n\nIt's better to get a good laptop stand for proper cooling and performance.\n\nReally happy with this purchase. Flipkart delivery was fantastic. I got it the very next day.\n\nThe display could have been better but it's more than decent and appealing for this price range.\n\nImportant Note:- there is no refund system for electronics in flipkart. Only returns and servicing. Make sure you thoroughly search before you decide on a laptop.\n\nThanks for reading this review.",
            "It's a decent laptop in this price range. I was about to finalize lenovo IdeaPad gaming 3 since I wanted ryzen 5 4600h but then this was offered with SSD and one year extra warranty. Also i510500h is almost matched the benchmark of ryzen 5 4600h, both are hexa cores.\nI was concerned about some quality issues in this laptop as reported by some of the reviewers earlier but surprisingly the quality in this one is really good. I noticed that this is manufactured in may 2021. So the stock seems t...\nREAD MORE",
            "I am writing an honest review after using this laptop for the last 20days, my experience has been great. I will explain all the intricate details of this laptop.\nPackaging: I loved the packaging of this laptop, MSI branded cardboard box looks great and the laptop was received in showroom condition with all accessories no complaints, Flipkart did a great job on the delivery as well.\nThe best part is the factory seal at the bottom of the laptop(as shown in the image) it gives me a lot of confidence that the original laptop components are intact and don't have to worry about purchasing this product through an online channel.\nLaptop Performance:\nThis laptop is a beast considering the price range and performance you can get out of it, it's top of its class laptop for any i5 gaming laptop, coupled with a 4GB graphic card, the SSD version does a great job to speed up the bootup and application startups. You can use this for any graphics work, animation, video editing, or any design software like AutoCAD, And of course gaming. everything works so well, never noticed any lag or hanging issues.\nThe laptop has got a good cooling mechanism too.\nBuilt-in Software:\nMSI Dragon Center- This is a pretty cool software to manage the performance of your laptop and optimize device performance and power consumption\nLaptop Ergonomics:\nThe best point of difference of this laptop is the lightweight compared to other gaming laptops with no compromise on build quality and performance makes it a definite buy.\nI personally like the thin bezels, build quality, and keyboard quality with the red lights on them, I like the logo on the lid (wish it had the lighting as well)\nOverall, without any second thought of comparisons buy this laptop if you are planning to buy a new one. and trust me you will never regret it.( You have read my review you don't have to search on anything else, I have purchased this after comparing and researching for the last 1 year :p)",
            "A very good gaming laptop with light weight (compared to my last 1) and a good 1080p display. It also has a very simple design not too much gamey. But it is very much fingerprint magnet and if u don't clean it everyday it will leave a print at various places",
            "I have no negatives to say about this laptop. It gives you excellent performance . Gaming is butter smooth and if you can upgrade the Ram memory then it ensures no stuttering . About the power settings if know to configure with msi dragon centre it does not exceed above 70% when gaming and at normal use it stays at 50-55% . If you don't setup the needed power settings it will produce much heat as everyone mentioning here\nGames played GTA 5 , Battlefield 1 , Red Dead Redemption 2\nEnable cooler booster while gaming and set it in turbo mode therefore less heat and better performance 👍",
            "One & Only laptop with this much specifications at optimised cost. If i suggest it is completely best for Development & Working with almost all level of Software like Machine Learning, Game Development, Augmented Reality, Virtual Reality, Block Chain Development, Graphics Development etc.\nSpecially a Smooth Coding & Programming Environment.\n\n6 Cores, 12 CPU, 12 MB Cache Memory, 1TB HDD + 256GB SSD, 8 GB RAM with upto 32 GB expandability, Backlit Keyboard, Clear Speaker, Microphone, Camera",
            "Good",
            "It was a balanced deal for the buck you pay. I5-10500h is in very less laptops right now. Performance is very fast i5-10500 matches with 4600H also gaming performance is good 75° is optimum heat it generates not too much also it cools easily .Startup is blazing fast thanks to ssd and dragon center has different mode options",
            "It's my 2nd laptop and happy to share my honest review, after 6 years I decided to move in gaming laptop bcos of heavy graphic design s/w i use like Photoshop, illustrator, after effects and corel draw .\n\nIt's very smooth for operating while using heavy file's and keyboard is very big easily can find , good GPU and processor, light in weight,\nDisplay quality is very clear,\nOverall performance is excellent at 56k price,\n\nBut battery performance is not much good and touchpad is big but after use it feel like loose and make noise when press button .",
            "Excellent performance\nintel 10500H hexa core. No other laptops below 60k range have this processor. SSD speed are also excellent. Good deal if you can buy is near 56k\n\nCONS\n\nNO fingerprint sensor\nNO number keys\nSINGLE FAN.\nEven in very light use, battery just last around 3-4 hrs.\nNOTICED SOME FAN/HDD NOICE ISSUES. I replaced the product due to black line on display. New product also have same noice issue. Don't know more on it",
            "SuperB Product. Highly Recommended. Best in the Segment. Attractive Price.\nNo heating use, no noise issue, very light weight.\nGame i tried- GTA V (super smooth), Valorant (super smooth).\n\n\nPros:-\nBuild Quality- 4.8/5\nDisplay- 5/5\nDesign- 5/5\nLooks- 5/5\nPerformance- 5/5\nCamera- 4/5\nKeyboard- 4.5/5 (looks awesome in red light)\nTouchpad- 4.6/5\n\n\nCons:-\nBattery- 3.5/5\n(Drains Faster even in normal use 1.5 hrs - 2 hours & for gaming 45 mins to 1 hour, its not a big factor for me as this is common in all gaming laptops)",
            "This is my review after a 2 weeks of usage\n1.This system works Fab\n2.The processor speed is so good that you dont fell any latency or glitch while using .\n3. I was bit worried about the fan ,but it really blowed my my mind.Even while playing battle field 5 at high graphics the fan works smoothly.\n4.Storage is dam good.\n5. Sound system is one of the best i have seen till now.\n6.battery is also good works around 4-5 hr in normal use ,while gaming around 2 hr.\noverall best lappy in the price tag!!",
            "In 50490, this beast was a steal.\nThat's why we wait for Big Billion Sale.\n\nThe best thing, 6 core processor and good graphics card, 256 ssd along with hdd.\n\nSet battery to 60% maximum charge limit, and use it on main power unless you really need to use the battery; and Tada, you get 5 to 7 years long battery life. Just discharge and charge battery once every 3 months.\n\nPeople said everything else.",
            "Overall performance wise this is a great choice. You get i5 10th gen hex core with SSD. You also get the HDD already added to it. I am using this for coding, but I ran games like NFS playback, Valorant and Resident evil Village, all games runs smoothly on 60 fps. Only issue is the battey, which can be optimised a little by changing graphic drivers and downloading it from msi support page. Worth the money, must buy.",
            "Great Laptop for the price. The best thing about this laptop is the processor, usually in this price range you get the i5 10300H which has 4 cores but this one has 6 cores and it can easily compete with an i7 10750H. The GPU works well with most games, I play CS and get about 200fps on medium settings. Hasn't really thermal throttled till now.\n\nOverall great value for money for people who want good processing power on a budget.",
            "Good product , worth buying and evrything is so flexible not runned so much but hope it will work expected",
            "Everything is amazing except for the speaker and battery. Battery backup is less than decent . Display is the best . touchpad and keypad is really nice.",
            "Used it for a day playing games such as CS Go, Dota 2 and PubG. Working fine and nice aa of now. Heats up a bit but still doesn't affect the performance. I'll share reviews after few days when I play AAA titles as well.\n\nUpdate after 1 month: USB C Type port isn't working. It has malfunctioned.",
            "Have to say .. if you are buying this model... Then get this i5 variant.. it's really gonna help.. and about everything else.. am just extremely happy.. this thing goes through games like hot knife on butter.. it's best as a first gaming laptop.\nultra fast SSD.\nBest one in this price range.\nBest among its competitors of the same configuration.\nVery light weight.\n\nPerformance at affordable cost this i5 variant is superior to all not only in performance as well as price in this range .I used only for weeks and run high performance game like \"watch dog legion\" which come along with gaming bundle. as per me there is moderate heat that not a big issue.\nONLY PROBLEM IS BATTERY🔋LIFE FOR HIGH END GAMING IT RUN FOR 1~1.5 HOURS AND FOR NORMAL USE IT RUN 3~3.5 HOURS besides this it is good choice for both student in college and for gamer when students are in home",
            "I am using this for about a month now, it can play almost any game very smoothly.\n\nit can run 5-6 hrs on power saving mode but in gaming mode battery life is reduced to an hour.\n\nIt's speed is impressive, thanks to sdd.\nIt can boot up in 5 seconds.\n\nTyping is very smooth and user friendly, i use it for coding.\n\nDisplay is very good, it can run 4k quality video very smoothly.\n\nI am pleased with my purchase.",
            "Best laptop in this price range. Usually in other laptops we get either 1tb HDD or 512gb SSD but in this laptop we get 1tb HDD and 256gb SSD both. Performance is good I use daily 8 to 10 hrs and nothing happen yet. I use Photoshop cc 2022, Premiere Pro cc 2022 and Illustrator cc 2022 daily and works smoothly.",
            "Great Performance!\n\nAwesome laptop for college students with high performance and moderate gaming.\n\nPros:\n1) Awesome performance. Tried running multiple apps with heavy usage, this laptop just handled them very fine. Switched between Linux VM and Windows with multiple apps running very smoothly.\n2) RAM management is also great.\n3) Light weight\n4) Red backlit keyboard looks really cool. Some may not like it though.\n5) USB C port and LAN port connectivity.\n\nCons:\n1) An LCD screen it is. Not good in 2021. Also the quality of LCD screen could have been better.\n2) Build quality could have been better. I felt it is little weak at the hinges.\n3) Gets heated while moderate to heavy gaming. Only 1 fan feels inadequate here. But interestingly the performance is still good and the cooling is great, it cools down very fast.",
            "It boots very fast\nLike within seconds\nI haven’t faced any problems till now\nIts a very light laptop\nThe display is good\nThe touchpad is very responsive and feels good to use",
            "This is one of the best MSI mid range product with both types of drive. Thanks flipkart for having a great packaging and dilivery on perfect timing. Love the product. And it's amazing. I was very confused before buying this online. But after this experience I m relaxed about this.",
            "Performance is awesome. Hybrid storage we can store large data. Very fast actions boot up and shut down.\nNetwork speed also good with mobile hotspot getting good speed.\nOverall review is very good.\nFlipkart delivery service worst. I never expected this kind of irresponsibility to the customer.",
            "MSI GF63 THIN 10SCXR. What to say about this beast 😍 just awesome. The red colour in almost everywhere, in the keyboard, in the logo, even my system accent colour is red. Performance is just lit, top notch performance with 6cores 12threads, 8gb ram, 256gb ssd and 1tb hdd. Oh i forgot to mention the graphics 🤓 the NVIDIA GEFORCE GTX 1650 MAX Q 4GB GRAPHICS, just performs its task smoothly. Even I'm using this laptop not for gaming but for like coding using android studio, and will use it later for some high performance applications, it's just awesome. I loved the laptop, so far so good 😁",
            "One of the best laptops I've ever used till date offering excellent performance .The laptop is easy to set up and has an amzing backlit keyboard,amzing build quality ,Overall a very good gaming laptop at a reasonable price",
            "It's a good laptop at this budget,\n\nI don't say it has a top grade built quality, it's display frame at top is not tight other than this it's fine. Performance is good.\n\nabout battery, It can run upto 5-6 hrs in a single charge, on optimal usage and it takes 3-4 hrs for charging. I think it's not bad.\n\nDon't know about battery backup for gaming.\n\nPerformance wise awesome.",
            "This laptop is awesome, small in size and productivity is far better than other laptops in this range. 8GB ram is enough and 256GB SSD makes it much faster. Love this size laptop with same 15.6 screen size. It's very handy. One who want to use it as everyday laptop will get higher battery backup. But product delivered is defective, let's see whether Flipkart replace it or not.",
            "Excellent Laptop",
            "Awesome laptop\nValue for money 😊😊just 49000",
            "This laptop was excellent in this price😍😍😍really love it",
            "Good but fingerprints are not being erased when touch this lappy... Press fn+f4 for enabling camera",
            "My msi laptop touch pad not working from first day of purchase. And there is no service provided from Flipkart side as well as not from MSI company.\nPurchase at your own risk.",
            "Good performance but very poor battery performance",
            "Just received this Laptop yesterday, at first glance this looks excellent buy at this price. Everything work fine at this point of time.\n\n1 star less, sometimes flipkart delivery is pathetic. Flipkart delayed my delivery saying unexpected delay for 2 days. I called the flipkart Customer care, I was asking for the reason for delay and they were unaware of the reason.\n\nOverall this was a good buy for me, will update more in sometime. Good days guys.",
            "Super product with affordable price 👌.\nReally satisfied. Overall rating 4/5.",
            "Awesome laptop, GO FOR IT👌👌👌",
            "Product is good, but found some heating issue due to single cooling fan, when you run this laptop on hotspot it will get got very soon, rest",
            "Nice Laptop for multiple use. Value for money.",
            "The laptop has a heat problem but games dosen't lag even after heat. Performance is too good it can give 60 fps.",
            "Nice",
            "Good product.. Value for money... Need to improve battery backup... Performance overall good...",
            "This is a excellent laptop for gaming but only battery issue if you set it's power setting on battery saver the battery life extended to 2 to 2 hours 30 minutes but if you set it's power setting on extreme performance it battery life decrease to 1 hour but if you laptop for full time at plug in it is best laptop for gaming in this budget but I think every gaming laptop has this problem but it's so excellent in performance.",
            "Using this laptop for a week performance was amazing but battery was very worst without gaming it can last upto 4.5hrs with gaming u can get maximum 1.5hrs backup....If msi provide normal 1650 gaming performance will be slightly better..... Bought this laptop for 57k Best value for money\n\nPros -\nPerformance\nDisplay (but only 60hz)\nStorage\nKeyboard\nDecent build quality\nCons -\nBattery\nOnly single fan for cooling\nHeating (use external cooling fan to reduce some heat)\nMouse trackpad",
            "Superb... Awesome...... experience and great prize for 6 core processor",
            "MSI it's specially a gaming laptop.",
            "Super",
            "Good laptop",
            "Nice lovely upgraded to windows 11 sameday",
            "Performance good.but battery 🔋 service too low approx movie 3to 4hr",
            "❤️da gallaaraa !!!bluetooth devices are not connecting properly !!!",
            "Good laptop for this range.. I bought it for 54k during big billion days and for that price it's worth. If you are concerned about battery then don't buy it. If you want performance beast then its the perfect one at that price range",
            "Valuable laptop in this price 🔥🔥🔥🔥",
            "Overall nice product\nPerformance thumbs up\nBattery is not all that great\nFilled up with features👍",
            "Loved it 😘😘\nAll rounder ( Gaming + Programming + Editing + etc )",
            "Good 👍",
            "Awesome",
            "Looks and performance of this is extraordinary",
            "Size to small.. Unexpected..",
            "Value for money",
            "Heating issues, battery backup is only 2 hours and also the battery charging time is almost took more than 3 and half hours to reach 90%",
            "One of best laptop under 60000",
            "The laptop is good, it has only two Cons l.\n\nThe laptop lid vibrates when you seet under the fan.\nIt has only single fan.\n\nApart from that the laptop is just amazing In this price range.",
            "everything thing okk with this price segment.. only one thing is ram should be 16gb.",
            "This laptop build quality is very poor and msi company not provide a good service",
            "Over all good",
            "This product is not good, while using this laptop heating too much and sound quality is also not satisfied. MSI services are worst.",
            "This laptop is exceptionally good, Recommend this to all Programmers and Gamers, android studio and other software's working very smoothly.Loved this Laptop.",
            "Everything is fine except the battery.1-2 hour charge remains on doing basic works.Camera quality is medium.Rest everything is fine.",
            "product not meet expectation.\nnot good battery life.\nproduct quality is not mcuh good\nexpected price = 45000\nmy suggestion dont buy .",
            "Go for it 🤩😃",
            "Battery draining too fast...\nBut performance is great and excellent 👍🏻👍🏻",
            "Good",
            "batterey back up is verey low compared to other laptops",
            "Ok",
            "It's going to be a month and it's the best except speakers.Best for gaming and students.I got it for 54k.",
            "Wonderful experience buying a MSI product for the first time 🙌",
            "Overall good\n\nBattery backup:---👎\nPerformance :--- Sometimes hanging while performing coding",
            "Nice purchase\nsmooth going",
            "Wonderfull laptop",
            "Mind blowing performance on this price.. 🥰🥰🥰\nOnly battery issue I think msi think to improve this problem.\nDon't forget this is a gaming laptop battery issues comes only on gaming laptop",
            "Osm",
            "Value for money",
            "Great performance 🔥🔥🔥\nThere was no laptop bag 👜",
            "Good good",
            "Great laptop at this price range... Light weight as compared to other gaming laptops",
            "One of the best, it is very lightweight and thin , it is sufficient for gaming , coding editing, smooth browsing..Good service from flipkart.",
            "Very nice 👍\nIm satisfied in this price segment\nIm buyed this laptop 54,990\nIn big billion day",
            "Very good laptop for gaming and study purpose . Wonderful performance looking so beautiful",
            "This laptop is just amazing with so many specifications at this budget price segment for a gaming laptop. I highly recommend to go for this.👍",
            "Awesome product.",
            "Excellent product in affordable price",
            "Great laptop under 55000 it has only one problem of battery its battery drain fast and its gaming laptop so this is common in all gaming laptop and it last upto 4 to 4.5 hr in very normal use",
            "awesome product in this range..",
            "some heating issues and less battery backup otherwise for general purpose this laptop is the best!!!",
            "Best products",
            "Worth buy",
            "I love it ❤",
            "Awesome one. I am satisfied in this product. I recommend it to you",
            "Nice laptop",
            "mouse pad is making sounds",
            "It's a nice laptop, but the fans sound a bit weird. What's scary, is that it makes a high-pitched scratching sound randomly sometimes and it isn't even under stress. It might be that they gave me a hard disk that may be breaking down. :(",
            "Not support windows 11 don't purchase Flipkart also worsted service",
            "Super 👌",
            "It's been a month using laptop the battery is draining easily within an hour from 100 to zero",
            "Nice product 👌",
            "Very good laptop - no bag along this laptop",
            "my laptop camera not working",
            "At this price range best gaming laptop\nAnd battery backup is 4 -5 hr normal usage",
            "A perfect laptop for this price... Go for it!!!",
            "The best product ❤\nTo good laptop for students in budget.\nPros : speed boot up\nDislpay is good in price category\nSpeakers are good\nHigh accuracy while activate the apps\nKeyboard is good\nCooling system is fantastic with one fan\nWifi connectivity is excellent .\n\nCons : battery backup is don't except what msi is mentioned in details, it's average backup\nBluetooth connectivity taking more time to connect\nIt's easily mark fingerprints on laptop, better suggestions don't remove transparent cover.",
            "Battery fast drain only 1hours",
            "Good",
            "Good one",
            "Nice",
            "Nice product",
            "Performance is nice\nDesign is wonderful\nQuite value for money\n\nOne thing it missing out that HDD is 5400rpm which should 7200rpm",
            "Value for money 👌",
            "Good product",
            "Value for money **good configuration in price range and effective cooling - overall performance is 👍",
            "Product price is too high..\nLaptop performance is 🔥🔥🔥.\nBut the battery life is too poor, when i connect to the internet less than an hour the battery get drained but without using the internet it will be take 2:30hrs to get drained even if i am watching movies.\nCamera quality is too good.\nTill now i didn't face any heating issue.\nTotally worth buying laptop...",
            "Display quality is bad as well battery performance worse from day one",
            "Well build and works good. I m satisfied with it. You can buy it for sure..",
            "Osm product...",
            "I agree with most of the previous positive reviews here. It a very good laptop. No doubt about it. However, one thing at I noticed is that the battery backup is the concern.\nTo improve the battery backup in normal use (My Experience)\n1. First thing to do is conduct battery calibration in Dragon Center\na. Update the Dragon Center (if any latest update is available)\nb. Plugin the charger\nc. Open the Dragon Center\nd. Click on tools\ne. Click on Battery Calibration\nf. Battery calibration will start now, it will charge the battery to 100% (Don’t remove the charger), post that it will discharge to around 5%, post that it will charge again to\n100%, after this the calibration is completed (Please don’t use the laptop till the calibration is completed and it will take some time to complete, so I would suggest\ndoing it when you go for sleep)\n2. Change the user scenario to “super battery”\na. Open the Dragon Center\nb. Click on home button\nc. Click on user scenario\nd. Select super battery\n3. Update it to Windows 11\n4. Change the power mode to “Best power efficiency” (Windows 11)\na. Open windows settings app\nb. Select “Power & battery”\nc. Select “Best power efficiency” under power mode",
            "gud",
            "Excellet product",
            "Good laptop for all but battery issue only 3 hrs battery is there",
            "Terrific purchase",
            "Highly recommend, because it's a beast Laptop in this price segment. Just go for it .you won't regret it\nThe only problem I feel battery backup is low while gaming I play GTA 5.for better performance play while charging but for normal use battery can last up to 2 to 3 hours\nIf you are looking for a laptop for student and casual gaming this is for you it's very thin. You can take it outside. Normally all gaming laptops have weight over 2.5kg but this is only 1.8kg and also very thin. Laptop is so silent\nIt has only 1 fan and two vends but there is no heating problem while gaming. But always be aware of that the Temperature must not go above 80°C it will affect your performance after all. I prefer to buy a cooling pad with it if you are a gamer. Also it has a high quality plastic body also it is sticky so our print of hand will be there but not in mouse pad",
            "Not good",
            "Great laptop",
            "Things to look out for :-\n\nBattery - 3 hours max, Don't expect anything above this even after undervolting\n\nDisplay : Looks Good but Screen Tearing is insane so you'll always be using Vsync\n\nKeyboard : Very Good Feel, sadly no numpad\n\nPorts : All of em work fine , HDMI is connected to iGPU\n\nPerformance : Top Notch 10/10\n\nCharging : Pretty Slow for some reason\n\nHeating : tries to stay stable at 75-80°C but occasionally spikes upto 90°+\n\nCooling : Cools very fast, make sure to change modes in Dragon Center accordingly. Fan Noise is alright;\n\nSpeakers and Drivers : Speakers are amazing and driver support is also great\n\nNote : For Undervolting , you'll have to enable Overclocking in advanced BIOS Settings\nAlso Hi-Res support is wired only.\n\nConclusion : If you want to have a very powerful all round machine and don't mind the battery life then go for it",
            "Display showing lines within 3 months",
            "Good Product Value for money",
            "Overall product is good but disappointed by battery performance",
            "Awesome machine, just remember it to plug in while playing heavy game else the framerate will drop . The hinge can be opened with one hand which shows the built quality.",
            "Best performance",
            "Battery and display is very poor. Performance is great.",
            "Very good",
            "Good. Value for money",
            "Awesome Laptop\nSystem working easy and fast",
            "Value for money best laptop in game",
            "Best performance, impressed by the boot time, really wonderful laptop, loved it, battery is the only factor to consider it drains fast and display could have improved a bit.",
            "please buy it it is the only best option",
            "Nic",
            "Just loved it!🔥❤️",
            "Superb performance gaming laptop under 60k.",
            "This is an amazing laptop I bought and performance and display is so good this is value for money",
            "A true gamer",
            "It's nice 👌 budget gaming laptop ...\nBattery backup bit low\nLoved it 😊",
            "A nice laptop for all age groups. 👌 value for money.",
            "overall good performance but battery backup is too low. I know it is a gaming laptop but still, it should be around 3 hours at least.",
            "It's been 3 months and already got major issue , if the battery is less than 30% it doesn't power up it goes to the recovery mode and again on the same loop",
            "Wanderful .....",
            "At this budget it's ok and it's performance is too good better than other products in this cost.Fully satisfied with this",
            "Im really dissatisfied with this product. It have immense heating issues, automatically switching off after 30-60 minutes of usage. I replaced the Product once and the new product also have the similar issues.",
            "Very good",
            "Good",
            "Nice product",
            "Never to buy this product from this site\nHard-disk is faulty\nReplace not available\nService is very very bad",
            "nice laptop",
            "Best Laptop for beginners with a lot of features. In my research These The Beast laptops having in only MSI.\nThe main thing is \"THE DRAGON\" it goosebumps when I told to my friends.\nThey were shocked because never heard about these laptop. When they look the design It was awesome they said.\nCooler Boost 5, Nahmic 3, Sound, build, rocking performance.\nThanks: MSI, flipkart, MSI India.",
            "i am happy that i went for this laptop inplace of getting the hp one. Really happy that it suits all my needs and that also its display which i am in love with is just one of its kind.\none small downside you can say the battery does not last so long but yes it does the job i am happy with the purchase",
            "Good",
            "Good must buy in this budget",
            "Highly recommended!",
            "It is ok",
            "Absolutely amazing love the speed very nice processor n best at its price.",
            "Great product",
            "After use 3months no worries in case this is in u r cart go n blind to pick it's a really multitasking lapi 👏",
            "Excellent quality",
            "it's awesome product....just bought for gaming and personal use.its very smooth too operate!!",
            "sound was great using nahamic software and as for the display colors are little bit faded.\nbattery life was average with 4-5 hours for normal usage and 1-1.5 for extensive usage\ngo with it if your budget is under 60k ,keyboard was nice",
            "I liked the product. Everything is great except the battery drainage",
            "I got this laptop under 53Kand I love this laptop.Attractive look and good performance but should be do improve build quality and battery backup but there is no Major issue if you want gaming laptop with reasonable price so this is the best machine.",
            "The laptop is very light weight good design and beat for work and play.",
            "Simply good",
            "Best for gaming and performance is also best\nCooling pad is a must here. Laptop heats a lot when high performance task is done like gaming or editing at other time it is better\nOther than this there is no issue.\nIt has 4 hours batterylife only which was enough for me.",
            "All are good but speaker's are little bit noises",
            "Perfect",
            "Performance is good. Boot speed good. Display is ok. Sound quality fantastic. Battery is average. keyboard is not good, ctrl key stuck inside. Lasts 2 hrs for heavy usage.",
            "Nice laptop in this range 😀😀",
            "Allover nice products",
            "This laptop is best in it's segment, it provides best in class processor and I really like the display quality, it is vibrant and provides a really punchy picture quality. And even with a single fan the temperature stay between 60~70 C° which is nice.",
            "Good laptop under budget anyday , the design is perfect and not too sassy but it's classy. 10500h i5 processor is a beast compared to any other 11th gen without a doubt , go for it",
            "The only bad thing about this laptop is that it needs some well ventilated environment. Because it has single fan for cooling. Otherwise the performance is superb, though it's heating up pretty good.",
            "The laptop is good.\nthe battery is below average but as compared to gaming laptops it is adjustable.",
            "product is good for this price range",
            "Good laptop value for money 100% ok.",
            "The only thing lacking is a card reader and would have preferred two usb type C ports",
            "Its really good laptop. Its more than expectation.",
            "It is better than other laptop , very good laptop",
            "A 'worth it' laptop for this price, performance in gaming is extraordinary,Keys are so smooth..bet you can't take your hands off,has multiple ports..has secured web cam options and mouse pad options... totally weight balanced,great design,a smooth experience in operating this machine,not gonna lie..a fully packed system andTHE BEST laptop you can get for this price!",
            "Most increase battery capacity and include different colour lights in keyboard .",
            "Battery backup is low compared to other laptops and if you are looking for a business/ study laptop go for msi modern series even though you cant compare it with gf 63, they provide better Battery backup and if you are looking for pure performance gf63 is the one.",
            "Performance is above average, battery is average and display is crisp.",
            "Every word is less for this laptop .UNBELIEVEABLE, AWESOME . This laptop is so good .Battery , sound , design graphics ,light weight, colour, awesome.I like everything of this prodiuct.",
            "Performance is excellent but battery capacity is very less",
            "It's pretty awesome 🤩🤩🤩",
            "I have ordered this laptop, budget frndly, and it is worthy to buy. I like the laptop.,, but there is no laptop bag",
            "Everything is good but performance of laptop is not good",
            "Highly recommended!!\nThis laptop is a beast",
            "Excellent product.",
            "Good product",
            "Awesome quality",
            "Best in this segment.... bactery back is avg...but its ok in this segment... not bad... perfomace is unbeatable.. go for it...",
            "Nice",
            "Good",
            "Great gaming experience, but weak battery performance, battery drains soo fast if u play high spec games. I suggest always keep the laptop plugged in to power. Otherwise great laptop. Cooler is must",
            "Good build for gaming. Good enough for some graphics heavy gaming and video and image editing. The pre-installed dragon center has settings for high performance, battery saver and silent running and a customisable mode to control fan speed or cpu and GPU clock speeds. Overall good laptop build. This one also has a 256gb SSD apart from the 1 tb hdd.",
            "Great product ❤️",
            "Beast and brisk",
            "Best laptop at this price.",
            "Packaging is very bad for this costly product it is very loose in packaging.but thank god product is good condition....",
            "looks Great",
            "Amazing",
            "I have no words …. awesome yr... trust me guys ….top speed and fabulous laptop I have seen.... thanks flipkart for this amazing deal",
            "Worst battery backup.",
            "Good quality",
            "While playing getting heating issue 😞",
            "The beast that I received recently was nevertheless below what I excepted. Be it the style, the performance, and the ease of access, all of them were at par with the standards. The Nvidia card on the top at such a price range is beyond its competition. Overall optimization of the CPU with inbuilt support of MSI Dragon Center boosts up the performance to top-notch. Was playing asphalt 9 on high settings and had no issues playing the game. Fans were performing as required keeping fairly low CPU and GPU temperature. Overall a great pick for price and specifications.",
            "Just Buy it and thanks me later",
            "Battery life is poor, 3-4 hr max on charging.",
            "It is an amazing laptop for the money paid. It fulfilled my expectations. But battery performance is average, on working battery saver and switching off some performance and feature only It gives upto 5hr battery working time.\n\nStill It is amazing laptop, but battery performance can increased... and it takes nearly 2.30 to 3 hours to get full charge. Charger adapter also gets hot quiker.",
            "I bought this laptop in July and I used it almost 2 month so I write this review now. Positive side of this:- Laptop is best value for money\nBest performance for every heavy software like solidworks, AutoCAD, Ansys.....Etc\nBest graphics for video editing, image editing......\nBest graphics for gaming like GTA V, Hitman 3.....\nBest Design and built quality (Metallic body)\nNice Screen display\nWifi speed is also excellent\n\nNegative side:-\nVery less battery backup\nSome fan noise when work on heavy software and games\n\nI think everything have their pros and cons but Overall my experience regarding this laptop is excellent.",
            "MSI products are awesome and known for high performance even price looks quite expensive",
            "Nice product",
            "The first impression is fantastic.\nIt's body is a finger magnet, so you may need to add a sticker to avoid a greasy appearance.\nFor a gaming laptop, the battery life is adequate. You'll get up to 2.5 to 3 hours of normal use (if you've set battery saver mode in MSI Dragon centre) and 45 to 60 minutes of gaming (I've only tried with GTA V).\nBecause this is a single-fan laptop, it can get a little bit hot while playing AAA games, but it cools off quickly and has no effect on performance.",
            "Everything is good but battery drains too quick",
            "Nice",
            "Amazing laptop....no one even comes close to it at this price range... perfect value for money... just the battery doesn't last too long but it's good...since u r getting a good performance",
            "This is such an awesome machine with loads of perfomance on offer and at a very great price. On seeing the graphic card with max q design what I thought was that the performance will go up compared to the gtx 1650 but the performance is a bit low. The thermal efficiency it has was just impeccable with adjustable fan speed in the dragon center. Comparatively speaking, I used asus tuf laptop with GTX 1650 which used to heat all the upto 80°C but this manages every single hard load under 70°C. Overall this is a beast of a machine.",
            "It will be good and value for money",
            "Product was fab Delievery was very good by Flipkart they never disappoints me when it comes to Delievery or product satisfaction great work Flipkart 😘❤️",
            "It was really worth buying online",
            "Just one thing beast in budget.",
            "Believe it. It's the best in this segment",
            "Very stylish looks but battery drains faster as compared other ..Other wise it's performing awesome ...Just loved it!!!!",
            "Battery backup is not good......but the performance is very high level and sound is also not good enough.heating issue is also very big point......however the product is good at this prize.",
            "This laptop is Beast!!! Display, Performance, Audio, everything is top notch!! I just loved the keyboard woth it's gaming ambience red light and the steel series quality is Just an amazing experience altogether.!",
            "I suggest you all to buy is laptop only because in avg price range this laptop is excellent.",
            "Battery backup was not good",
            "Good performer in Budget gaming laptops",
            "Overall the product is good. I have considered many other options before purchasing this but the value for money MSI offers is too good.\nOnly issue is battery backup but it's normal for a gaming laptop.",
            "Excellent laptop in budget",
            "This is the laptop am looking for I love this laptop and the gaming experience is totally high and the 4gb graphics card shows a high quality picture finally I love this one",
            "Its a great laptop to buy. The only issue I faced is the battery gets discharged too soon. Need to keep the laptop on charging all the time. Apart from that no other issues.",
            "Battery is very low",
            "Good",
            "A laptop with all necessary features",
            "I loved it",
            "The performance of the product was fine as are the display but the battery capacity is poor."
        ],
        "likes": [
            "302",
            "321",
            "42",
            "21",
            "51",
            "6",
            "22",
            "3",
            "15",
            "13",
            "12",
            "15",
            "13",
            "13",
            "4",
            "5",
            "9",
            "11",
            "4",
            "2",
            "3",
            "3",
            "4",
            "3",
            "2",
            "1",
            "1",
            "0",
            "0",
            "1",
            "1",
            "59",
            "9",
            "8",
            "33",
            "31",
            "12",
            "12",
            "8",
            "4",
            "8",
            "13",
            "3",
            "3",
            "12",
            "5",
            "2",
            "2",
            "4",
            "9",
            "3",
            "2",
            "2",
            "2",
            "1",
            "2",
            "1",
            "1",
            "2",
            "2",
            "2",
            "11",
            "3",
            "3",
            "6",
            "2",
            "1",
            "2",
            "2",
            "2",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "1",
            "0",
            "2",
            "7",
            "4",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "37",
            "48",
            "7",
            "9",
            "9",
            "0",
            "9",
            "0",
            "1",
            "3",
            "3",
            "6",
            "5",
            "6",
            "1",
            "2",
            "5",
            "7",
            "1",
            "0",
            "1",
            "1",
            "2",
            "2",
            "1",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "8",
            "0",
            "0",
            "8",
            "9",
            "2",
            "2",
            "1",
            "0",
            "1",
            "5",
            "0",
            "0",
            "5",
            "1",
            "0",
            "0",
            "1",
            "5",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "11",
            "1",
            "3",
            "9",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "23",
            "11",
            "1",
            "1",
            "0",
            "1",
            "4",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Can I play GTA v smoothly ??",
            "Q:We get ssd+hdd both Or any one from them..i.e either ssd or hdd~??",
            "Q:How many core and threads are there in this laptop",
            "Q:Is single fan enough for gaming, how long the battery lasts",
            "Q:Can I upgrade to win 11???",
            "Q:Is the hdd 5400 rpm or 7200 rpm ?",
            "Q:Can we replace Hdd with ssd ?",
            "Q:What is its internal storage",
            "Q:Can I use all mechanical software like Autocad Catia solidworks and anays",
            "Q:Is it contains msi bag",
            "Q:Please specify if we can extend Ram as wells as Ssd?? And one more thing, will it be Ok to do ML and DL code??",
            "Q:Does it run fortnite game smoothly?",
            "Q:Windows is installed in Ssd or Hdd",
            "Q:Does this laptop comes with life time validity of ms office?",
            "Q:Camera is available",
            "Q:Does it comes with msi app player?",
            "Q:Can I play pubg pc",
            "Q:Does it contains only one fan?",
            "Q:Maximum SSD capacity?",
            "Q:What us the launch date of this laptop?",
            "Q:Can we play free fire in hardcore??",
            "Q:Is this better than acer aspire7 i5 10th generation laptop",
            "Q:Does it have a fingerprint sansar?",
            "Q:Can I play any game like gta6",
            "Q:Can we upgrade ram if yes then by how gb we can extend ram on this laptop",
            "Q:Can I connect with printer?",
            "Q:Is there 1 tb hdd available?",
            "Q:is it useful for multitasking ?",
            "Q:At which condition does it lag??",
            "Q:What is better 512 GB SSD or 1TB HDD and 256 SSD",
            "Q:Does it have windows 1",
            "Q:What ssd will I get In it ,is it sata or m.2",
            "Q:i5 10500hvs5500u 1650vs1650 maxq Obvi easy right now Msi gf63 have i5 10500h gtx 1650 max q Vs Acer aspire 7 5500u gtx 1650 Now were to go One with power efficient processor or with efficient graphics",
            "Q:Can iplay fifa 22 without any lags in full graphics",
            "Q:Does this have a fingerprint scencer",
            "Q:How many ram slots are there. And upto how much we can upgrade ram",
            "Q:how long the battery last if i don't play any game on it?",
            "Q:Is it compatible for office use??",
            "Q:Microsoft Office Available?",
            "Q:which brand 256 gb ssd have in it? please tell me",
            "Q:Can i play juraasic world evolution in it",
            "Q:Can i use a normal earphone for both audio and mic in a single jack?",
            "Q:How much battery capacity",
            "Q:What is the WiFi version",
            "Q:can it run warzone smoothly",
            "Q:Which one better 10300H or 10500H",
            "Q:Can I use latest version of lumion and 3ds max it runs smoothly?",
            "Q:Can we play the witcher game smooth",
            "Q:Can i use for 4k video editing with no issues? Can i use for YouTube live streaming?",
            "Q:Does this have keyboard backlit for this laptop",
            "Q:Can I use this for 4 years?",
            "Q:Ssd is available with this laptop or not ?",
            "Q:Can I use this laptop for live streaming",
            "Q:Ram can be extended ?land SSD is available",
            "Q:how much ram can we upgrade and ssd is nvme or not",
            "Q:If screen of this laptop is antiglare",
            "Q:Please provide details of in-box items .",
            "Q:Which graphic card is better 5500m or 1650 max q",
            "Q:2 earphones can be attach for listening song Or movie",
            "Q:How is the display brightness and contrast?",
            "Q:Does this laptop has speakers on sides' or edges or back of laptop",
            "Q:Is there rgb??",
            "Q:What is the screen size of this laptop?",
            "Q:Is this have dedicated graphic card?",
            "Q:Is Power button within the Keyboard or not?",
            "Q:Can I play BGMI or PUBG",
            "Q:Can I Play Valorant This laptop How much Fps?",
            "Q:Is that the logo is available with backlight like an apple logo",
            "Q:We can upgrade ram and ssd upto how much gb",
            "Q:Can it be used for coding learning",
            "Q:Can I play gta 5 on ultra graphic. And on what graphic settings can I play fifa 21",
            "Q:Are there provided extra slots for RAM and SSD/HDD? Please specify.",
            "Q:Does it come with MS Odfice suite pre installed?",
            "Q:Can i use it for 1080p heavy Video Editing like VFX etc. And also GTA 5 Ultra setting with 60+ fps?",
            "Q:Can I upgrade SSD 256 to 1TB?",
            "Q:Screen refresh rate?",
            "Q:This loptop can support AutoCAD software?",
            "Q:Cd drive available?",
            "Q:Msi bravo or this plz give ans.",
            "Q:Can I use graphic designing, like a photoshop, Editing purpose...?",
            "Q:Can i play god of war 4 ?",
            "Q:Can I play cricket 19 in this ??????",
            "Q:Hi guys, how is the typing experience on this laptop? I will use it for coding and gaming both. Sure anyone have coding experience on this laptop? . I hope keyboard don't have any shake while typing.",
            "Q:Can I use this for programming",
            "Q:what is the complete name of i5 5th gen processor?",
            "Q:Plastic or metal body...??",
            "Q:What is the material of top lead of laptop and keyboard face???",
            "Q:Can this laptop run red dead redemption 2 ?",
            "Q:Any Over heat issue faced??",
            "Q:I want to know one thing please tell me how long time battery backup",
            "Q:Can we upgrade that 256gb ssd to 512",
            "Q:can we play games continuously 8 hours",
            "Q:How many n.o of extra slots for ssd..?",
            "Q:What is srgb no of this laptop",
            "Q:Does it have audio jack?And is it Windows 10?",
            "Q:For office work - battery backup how much time with stand ?",
            "Q:Can we use this laptop for college purpose as for presentation assignment etc...",
            "Q:Can it be upgraded from 8GB ram in the future?",
            "Q:Benifit of the laptop",
            "Q:What is the tgp for this model 1650 max q????",
            "Q:Can We Play Gta 5 And Minecraft With High Graphics",
            "Q:Is this laptop have Intel Processor or AMD?",
            "Q:Does the laptop support fingerprint security?",
            "Q:Is hdr support",
            "Q:How much is the Cpu speed",
            "Q:Will it support kali linux",
            "Q:Does the screen goes 180??",
            "Q:Can I do heavy editing in Photoshop, Illustrator, Animate CC?",
            "Q:Is this refurbished laptop ?",
            "Q:Does it have Bluetooth ... ?",
            "Q:Can it be used for making 3d animation and gaming?",
            "Q:Can we play valorant smoothly?",
            "Q:Tell me about battery life when I play gta v",
            "Q:Can this laptop screen flex 90 angel",
            "Q:If I lost my laptop charger Can I charge my laptop with mobile charger",
            "Q:Can I upgrade screen refresh rate?",
            "Q:Web cam is available in this laptop?",
            "Q:Which GPU is better GTX 1650 or GTX 1650ti or 1650 max q",
            "Q:Can I use it for rendering and 3d softwares",
            "Q:HDMI port is available or not",
            "Q:Can we Change the Colour effect of the Backlight from Red to any other Colours?",
            "Q:How to change keyboard colours",
            "Q:Will I get pre-installed antivirus",
            "Q:Is it have fingerprint",
            "Q:Microsoft 365 pack is available with this laptop?",
            "Q:It has two jacks for audio n mic I guess plzz explain me. Can I use normal earphones",
            "Q:Can we play Minecraft",
            "Q:Is it the right choice for work",
            "Q:Do this laptop supports WOL (wake up on LAN)",
            "Q:What is the generation?",
            "Q:Does it useful for Auto CAD"
        ],
        "answers": [
            "A:yes you can Play any games",
            "A:you get 1TB HDD and 256 SSD combined",
            "A:6 cores 12 threads",
            "A:Battery backup is very low .. battery backup only 1:30 hours .. Charing time to long ..",
            "A:Yes, You will gt option to upgrade to win 11 or continuing with win 11, if u want select option at this level only, coz it is quite difficult to upgrade win11, after win 10 setup.",
            "A:hdd is 5400 rpm which is bit disappointing but the ssd speed is superb.",
            "A:yes you can",
            "A:256 gb ssd + 1 tb hdd",
            "A:yes",
            "A:Nope",
            "A:Yes you can extend and remember one thing they have shown that 256 gb ssd will come but it is not available in laptop so make sure that",
            "A:very smoothly",
            "A:Off course on sdd",
            "A:no",
            "A:yes",
            "A:Yes, it comes with a msi app player.",
            "A:Yes. i got upto 70 fps",
            "A:yes but cooling system is quite good even though having single fan",
            "A:256 gb available, but initially 16% of the SSD consists of windows 10 and the rest of the SSD is free",
            "A:2021",
            "A:Yes😂",
            "A:Obviously, acer aspire 7 has only 512 GB SSD but MSI has 1TB hdd & 256 GB SSD and also red back light looks pretty good..",
            "A:no",
            "A:yepp but how could one play as battery will drain out in minutes",
            "A:8gb",
            "A:no",
            "A:yes it is available along with 256gb ssd",
            "A:Yes",
            "A:No Lag",
            "A:SSD is best because processing fast and performance best.",
            "A:you mean Windows 11 ,if yes then it supports 11",
            "A:m. 2",
            "A:if u want more of performance, choose ryzen over intel, as it has more threads, parellel processing is more strong, also gpu is more or less similar only I both, so wont affect u that much..",
            "A:yes u can",
            "A:Nope",
            "A:1",
            "A:2.5 hours very easily if we dont play game.. Only normal use.",
            "A:yes dear",
            "A:yes bro",
            "A:hynix",
            "A:yes",
            "A:No.",
            "A:Maximum 3-4 hrs",
            "A:It supports both 2.5 and 5Ghz",
            "A:No not smoothly it lags sometimes",
            "A:10500H",
            "A:yes",
            "A:yes bro very smoothly just go for it you want get this specification like this in this segment",
            "A:yes you can.",
            "A:Yes, but only Red. No RGB",
            "A:sure",
            "A:Yes",
            "A:yes you can",
            "A:Yes",
            "A:ran upto 64 gb max(SoDimm ram)and the SSD is nvme",
            "A:Yes it is antiglare.",
            "A:charger (filter not available) and laptop",
            "A:absolutely 1650 max q 😊",
            "A:One is for mic(input signal) and another one is for earphone(output signal)",
            "A:Good. But Speed is very less. very difficult to run two software simultaneously. should try with 16 GB RAM. Battery Back up is less.",
            "A:yes",
            "A:no rgb",
            "A:15.6 inch",
            "A:Yes it has.",
            "A:yes",
            "A:You can play PUBG pc. But I’m not sure if BGMI mobile game for PC is out yet. So check online first. But as for PUBG PC, yes!",
            "A:yes you can play at 60 fps",
            "A:nope",
            "A:one more slot is available for ram, so it can be double.",
            "A:yaa sure",
            "A:Yes I am Using a premium edition Of GTA 5 ( 111 gb) it don't have option to set the graphic it's running in high graphics so u can change the resolution",
            "A:yes",
            "A:Though it comes with MS Office pre-installed, it's not with license. We have to buy a license",
            "A:Surely you can , i also play gta5 in 1950 graphics settings",
            "A:yes",
            "A:60hz",
            "A:yes it can run Autocad",
            "A:No, CD drive is thing of the past.",
            "A:both are good but battery backup is really bad msi need to work about battery backup",
            "A:Yes, it can be used for Photoshop and other editing purposes upto an above average level.",
            "A:Yes...we can play any games...No 1 for Gaming",
            "A:Yeah",
            "A:it was good experience with coding and gaming without second thought u can buy",
            "A:yes, but has a battry life of 3-4 hr only",
            "A:not 5th gen thats 10th generation processor 10500H 6 cores",
            "A:Plastic",
            "A:Metal",
            "A:yes",
            "A:Since it has only one exhaust fan it heats pretty fast. If you are a gamer i would suggest using cooling pad. For normal use it doesn't heat.",
            "A:3.5 hrs to 4.5 hours. To be honest, its a gaming laptop & all other gaming laptops have such battery backup. You should not expect it to be as much as normal laptops and make decisions on that basis.",
            "A:yes you can upgrade ram ssd hdd also",
            "A:nope... I think this much battery backup you won't get in any gaming laptop, but the battery backup is decent .. performance is flawless.",
            "A:1 only",
            "A:battery backup is very bad, full charge laptop but running only 1 hour to 1:30 hour only",
            "A:yes",
            "A:2.5 hrs",
            "A:Yes,",
            "A:yes u can",
            "A:working very smoothly , handy , smart processing",
            "A:35 w",
            "A:yes",
            "A:intel i5",
            "A:no",
            "A:yes",
            "A:It's good, games run quiet smooth on it",
            "A:Obviously, why not. If you can install it properly, you can use it too.",
            "A:no",
            "A:yes! but it lag little bit.",
            "A:nope",
            "A:yes it has",
            "A:Yes",
            "A:Yes",
            "A:1hour",
            "A:no",
            "A:No.",
            "A:no",
            "A:Yes. Inbuilt camera is there.",
            "A:GTX 1650",
            "A:Yes You can it's gaming laptop",
            "A:Yes hdmi port is available of a back side",
            "A:no bro only red you can adjust the brightness",
            "A:there is no colours option, all though you can increase and decrease the light levels of keyboard.",
            "A:for 60days only and Nortons security",
            "A:No",
            "A:no",
            "A:first one for mic and second one for earphone",
            "A:you can it's a performance laptop so, you can go for it.",
            "A:Yes all the Hardware matches upto the level of programming work. Also all kind of business related can be managed easily. But they don't provide licensed version of MS office.",
            "A:Yes, supports WOL.",
            "A:10th",
            "A:yes"
        ],
        "likes": [
            "90",
            "80",
            "63",
            "42",
            "5",
            "7",
            "4",
            "4",
            "8",
            "3",
            "10",
            "4",
            "5",
            "2",
            "2",
            "2",
            "4",
            "5",
            "2",
            "2",
            "3",
            "2",
            "3",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "1",
            "115",
            "54",
            "19",
            "8",
            "1",
            "3",
            "4",
            "3",
            "5",
            "3",
            "2",
            "2",
            "0",
            "1",
            "1",
            "4",
            "1",
            "4",
            "2",
            "3",
            "2",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "15",
            "14",
            "14",
            "17",
            "2",
            "1",
            "1",
            "1",
            "2",
            "1",
            "5",
            "1",
            "3",
            "1",
            "1",
            "1",
            "2",
            "3",
            "2",
            "3",
            "3",
            "1",
            "11",
            "2",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "3",
            "18",
            "12",
            "4",
            "1",
            "1",
            "1",
            "1",
            "2",
            "2",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "3",
            "1",
            "5",
            "3",
            "2",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "4",
            "1",
            "1",
            "4",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1"
        ]
    },
    "summary": {
        "pros": {
            "Performance": "The Intel hexa core i5 10th gen processor is the highlight of this laptop. It is fast and gives super smooth performance.",
            "Storage": "The combination of 1TB HDD and 256GB SSD is excellent. SSD makes the booting quick and gives a smoother experience.",
            "39.62 cm (15.6 inch) 1920 x 1080 Full HD LED Backlit IPS Display ": "Awesome display. Supports 4k videos as well.",
            "Cooling": "Faster cooling with just one fan which is something exceptional."
        },
        "cons": {
            "3-Cell 51 Whr Battery": "Battery backup is just decent enough for a gaming laptop. Gives 4-5 hours for normal use whereas around 2 hours for gaming."
        },
        "verdict": "The MSI GF63 Thin Hexa Core i5 10th Gen is one of the best budget laptops for gamers, designers and programmers.",
        "Additional Information": "Expandable RAM, Can be used for coding."
    }
}