{
    "title": "acer Predator Helios 300 Core i7 8th Gen - (16 GB/1 TB HDD/128 GB SSD/Windows 10 Home/6 GB Graphics/NVIDIA GeForce GTX 1060) PH315-51-73BH Gaming Laptop  (15.6 inch, Shale Black, 2.7 kg)",
    "product_specification": {
        "Sales Package": "Laptop, Battery, Power Adaptor, User Guide, Warranty Documents",
        "Model Number": "PH315-51-73BH",
        "Part Number": "NH.Q3FSI.005 / NH.Q3FSI.008",
        "Series": "Predator Helios 300",
        "Color": "Shale Black",
        "Type": "Gaming Laptop",
        "Suitable For": "Gaming, Processing & Multitasking",
        "Battery Backup": "Upto 5 hours",
        "Power Supply": "180 W AC Adapter",
        "Battery Cell": "4 cell",
        "MS Office Provided": "No",
        "Dedicated Graphic Memory Type": "GDDR5",
        "Dedicated Graphic Memory Capacity": "6 GB",
        "Processor Brand": "Intel",
        "Processor Name": "Core i7",
        "Processor Generation": "8th Gen",
        "SSD": "Yes",
        "SSD Capacity": "128 GB",
        "RAM": "16 GB",
        "RAM Type": "DDR4",
        "HDD Capacity": "1 TB",
        "Processor Variant": "8750H",
        "Chipset": "Intel HM370 Mobile",
        "Clock Speed": "2.2 GHz with Turbo Boost Upto 4.1 GHz",
        "Memory Slots": "2 Slots",
        "Expandable Memory": "Upto 32 GB",
        "Cache": "9 MB",
        "Graphic Processor": "NVIDIA GeForce GTX 1060",
        "OS Architecture": "64 bit",
        "Operating System": "Windows 10 Home",
        "System Architecture": "64 bit",
        "Mic In": "Yes",
        "RJ45": "Yes",
        "USB Port": "2 x USB 2.0, 1 x USB 3.0, 1 x USB 3.1 Type C (1st Gen)",
        "HDMI Port": "1 x HDMI Port (v2.0)",
        "Multi Card Slot": "2-in-1 Card Reader (SD, SDXC)",
        "Hardware Interface": "SATA",
        "Touchscreen": "No",
        "Screen Size": "39.62 cm (15.6 inch)",
        "Screen Resolution": "1920 x 1080 Pixel",
        "Screen Type": "Full HD LED Backlit Wideview IPS Display",
        "Speakers": "Built-in Dual Speakers",
        "Internal Mic": "Built-in Dual Digital Microphone",
        "Sound Properties": "Stereo Speakers, Acer TrueHarmony Plus Technology, Optimized Dolby Audio Premium Sound Enhancement",
        "Wireless LAN": "IEEE 802.11a/b/g/n/ac",
        "Bluetooth": "v5.0",
        "Ethernet": "Gigabit Ethernet, Wake-on-LAN Ready",
        "Dimensions": "390 x 266 x 26.75 mm",
        "Weight": "2.7 kg",
        "Disk Drive": "Not Available",
        "Web Camera": "HD Webcam",
        "Lock Port": "Kensington Lock Slot",
        "Keyboard": "FineTip Backlit Keyboard with Independent Standard Numeric Keypad (International Language Support)",
        "Backlit Keyboard": "Yes",
        "Pointer Device": "Multi Gesture Touchpad",
        "Included Software": "Acer Care Center, Acer Configuration Manager, Acer Collection, Acer Quick Access, Acer Product Registration, PredatorSense",
        "Additional Features": "Metal Designed Form Factor, Dual Fan Cooling with Metal AeroBlade 3D, 3220 mAh Li-ion Battery",
        "Warranty Summary": "1 Year International Travelers Warranty (ITW)",
        "Warranty Service Type": "Onsite",
        "Covered in Warranty": "Manufacturing Defects",
        "Not Covered in Warranty": "Physical Damage",
        "Domestic Warranty": "1 Year",
        "International Warranty": "1 Year"
    },
    "product_description": {
        "Aggressive Gaming Design": "Take complete control with the help of the futuristic Acer Predator Helios 300. The laptop has an iron red backlit keyboard which is a boon for gamers as it helps them play with skill while giving the laptop a hardcore look. It also makes it easy to play in low-light conditions.",
        "High-powered Processing": "The cutting-edge processors in this Predator Helios 300, provide you with everything you need to fulfil your gaming needs. You can be assured of top-notch performance, thanks to the powerful and innovative hardware in the laptop.",
        "Overclock Your Graphics": "You can access 3 different modes by overclocking the graphics card with the help of the PredatorSense control centre.",
        "AeroBlade 3D Fan": "These fans with 0.1 mm blades keep this laptop at the optimal temperature, even when you are playing high-end games which require a lot of processing power.",
        "802.11ac 160MHz Gigabit Wi-Fi": "Enjoy the next-generation Gigabit Ethernet connection with the Intel Wireless-AC 2x2 160 MHz (1,733 Mbps) and raise the standards of your wireless experience.",
        "PredatorSense": "You can control your whole gaming experience from one convenient place with the PredatorSense software."
    },
    "reviews": {
        "ratings": [
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "4",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "2",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "1",
            "3",
            "1",
            "4",
            "4",
            "5",
            "1",
            "4",
            "1",
            "3",
            "4",
            "5",
            "5",
            "5",
            "3",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "1",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "1",
            "4",
            "3",
            "2",
            "5",
            "2",
            "5",
            "1",
            "5",
            "5",
            "4"
        ],
        "review": [
            "bought it a month ago for a good deal, so consider this a review after one month. im a engineering student who does casual gaming, video editing along with other study related tasks like doing autocad, solidworks, matlab and stuff. im sure most of you can relate with this. so talking about the laptop, it is a monster. great laptop for the price point ( got a GTX 1060 for around the same rate as GTX 1050ti laptops with the sane specs). so getting into the good stuff\nPROS:\n# The processor and graphics combo: man! this is just too good, any demanding tasks could be easily done without breaking a sweat. For gaming, any newer AAA titles you throw at it run like butter on medium-high settings ( For the older ones like CS-GO, battlefield 1, ultra settings are also playable) >60fps.\n#The looks: Be sure to raise some eyebrows wherever you carry this badboy! The top lid shines bright due to the brushed aluminum panel and the red air vents behind the laptop make it look even cooler!\n#3)PredatorSense: The gamer friendly app! Control fan speed, monitor CPU,GPU temperatures, overclock graphics, this app can do it all.\n#4)Screen: Honestly, i was expecting a mediocre screen, but this one turned up to be surprisingly good! I could easily work outdoors on 75 percent brightness, and the color quality was awesome for a 60Hz screen!\n#5) 16 gigs of RAM, baby!: i mean! what more can you expect, 16 gigs SODIMM 2666 MHZ RAM.. more than enough, even if you are a heavy gamer!\n#6)The speakers and keyboard: The speakers are not the best at producing bass but they are well beyond average for a laptop, the volume was enough to fill a small room (or a car) and there doesn't seem to be any distortion at max volume. The keyboard is great, i could type on hours together without being fatigued! The red backlighting is a cherry on top of the cake..\n\nso the dark side? yes, did find a few flaws\n#1) The thermals (obviously): The cooling is not as good as advertised. It is fine if you are, you know going through documents, reading books, listening to music, watching a movie (it barely crosses 50°C). but if you are going to consider gaming for long hours non stop, this one is going to blow steam at your face ( not literally..), after playing far cry 5 for 3 hours, the max temperature reading was 98° C and it started throttling hard, woah! i mean, what is that! even under max fans, the max temperature was 92°C after 4 hours but the great news is that it doesn't throttle under max fan speed! ( average stays around 85°), i understand that FC5 is a demanding game but these temperatures are too high.. But, the laptop was fine for gaming like a stretch of an hour or a half, the temperatures were around 82°.(yet to try undervolting the CPU and GPU)\nP.S:If the temperatures cross 90°, turn the game off and max the fans and leave it be for 5 minutes. Go get a coffee if you will.The temperatures drop to 55/60 and then resume gaming.. this helps a lot!\n#2) Screen: ( not a big issue) as i said, its bright! it gets hard to read word documents in the dark even at minimum brightness.( This is if you're a nocturnal)\n#3)Fingerprint magnet: not a huge problem tho.\n\nBenchmarks:Haven't played much games yet but the ones i did, ( used MSI afterburner for benchmarking)\nFar cry 5, 1080p ultra settings: 63 fps avg\nMordern warfare, 1080p, highest settings: 260 fps avg ( holy smokes!)\nCS-GO, 1080p,highest settings: 200fps average\nRainbow 6: siege, ultra settings, 1080p: 140 fps average\n\nOverall, excellent laptop. Definitely would recommend. .",
            "cant believe i got a GTX 1060 6gb edition plus an i7 8750h and 16gb ram config. for 96,990 rs. (mrp is 1lakh 40 thousand), loving flipkart for this. This got the best cooling n ips screen right now for this price range. can run literally any game @60fps 1080p ,ultra- high mix of settings, got delivered in 2 days -excellent product",
            "Performance:\nAll the high end games work on highest settings on 60 fps, I think it can even run faster if the fps capping was more than 60. You can play fortnite, pubg, gta5 any game at ultra settings with zero lag. So performance wise it's a beast.\nBattery:\nThe rating of battery is given according to gaming laptops, normally these heavy end gaming laptops give 2-3 hrs of battery but this one is giving easily 4-5 hrs.\nDesign:\nThe design is super cool and the fans are located in such a way that it doesn't target your lap, so that's a good thing.\nThe body is finger print attractor but you can always clean it. After heavy end gaming for very long, as the bosy is metallic, body near keyboard gets little hot but that's not an issue.\nDisplay:\nThe display quality is really great and things run very smooth.",
            "The laptop is amazing but my screen hinges were lose it makes sound whenever I touch the side of the screen",
            "I've heard many people complaining about battery but trust me it is worth for a gaming laptop. It's not a book obviously. For general web browsing it goes upto 4.5 to 5 hours. For gaming it goes to 1.5 to 2 hours but gaming is always preferred while charger plugged in. Also the predator sense helps me drop the temperature really fast from 85℃ to 45℃ within 5 mins so overall it is a beast.",
            "got this beast in bbd and this is a gaming beast only battery issue rest excellent",
            "This right here is a monster. If you're looking for an amazing gaming laptop within 1 lakh budget, blindly go for this. There are lot of reviews on the pros and cons so I'm not going to say the same again. However please note that this is only a 60Hz screen refresh rate. I had used the chat option within the product page to check with the representative on if it's a 144Hz Screen refresh rate or 60Hz since it wasn't part of the description. The representative assured that it is 144Hz refresh rate. When I got the laptop, it's only 60Hz instead. I'm still happy with the purchase since it is still a monster at this price range, but reducing one star because the rep should be more educated before giving a response.",
            "I was little scared reading some flipkart review that it sometimes deliver refurbised product , but delivery was nice it was sealed properly and Serial NO. was matching with the bill. laptop is little under performing while gaming I am getting around 45 fps at ultra setting in gta 5, but I saw people are playing it at 80 fps on youtube at ultra settings, I am using Predator sence to boost gpu. people were complaining that it crosses 92 degree c but my lappy never crosses 80.",
            "one of the best one in the world...worth every penny!!!! thank you flipkart....",
            "heating issue bro it bevomes a frying pan during games",
            "I bought it in a big billion days sale and it is a beast.\nU won't get such a gaming laptop under 1 lakh.\n\npros :\n\n1) good design and performance.\n2) gtx 1060 allows u to play 97% games with high settings.\n3) display is amazing.\n4) ips display is good at both editing and gaming.I am sure that u won't disappoint with screen.Screen and its quality is amazing.\n5) good cooling system.\n6) keyboard is good for typing and playing.\n7) dolby atmos.\n8) multi gesture touchpad makes easy to control.\n\ncons...\nREAD MORE",
            "Best Laptop under 1 lakh , but I bought on discount for 95k the package has 2 brand seal on the laptop box ,the laptop they send to me is a refurbished one but works fine. But I didn't return it because it works fine and I am in urgent required for such laptop . Flipkart should check for such activities made by sellers",
            "I'm impressed . Good for architecture rendering for students . battery gets drained fast . Good display and sound is awesome. overall it's really good . got it in the sale",
            "Thanks to flipkart . This laptop is a Beast in performance and is at good prices, I got it for 94990Rs. I am Fully satisfied with its performance.\n\n*Well Packed from seller.\n* Fast delivery just in 24 hours considering my place is a town.\n\n\n*The Best in performance you won't face any problem in dealing with any high graphics games and softwares.\n*Heating is not much in normal use but if you game hard then it will heat but it can be cooled by adjusting it's modes. The user should manage the laptop according to the Task.\n*Comparing to other similar specifications laptop I think choosing Acer Predictor is best option because of good discount which makes it 25000- 45000Rs less compare to other laptops.\n\nFor me buying this laptop from Flipkart is amazing.\nSince I am a student and I used to create 3D designs of Mechanical parts and electronic circuits using AutoDesk softwares as Maya, Inventor ext all this softwares runs smoothly without any issues.\n\nExcellent Experience.",
            "Good Awesome Laptop, Being an IT Network Engineer i suggest this laptop. Good for high end applications, Gaming, for running Cisco Networking application, GNS3, VMware, HyperV(with Win-10 Pro) For CCIE routing and switching lab learning, this laptop is best with 32GB RAM. Go for it if u r a gamer and high end software/application user.\nThanks",
            "This is a awesome product by Acer. I love this product very much not only because of its design, because of its performance. Its very fast and powerfull. Build for heavy gaming. it's really a predator, no other laptop in this price range can tackle its performance. predator helios 300 have i7 8750H processor its one of the higher end processor having good benchmark. The booting time and predator sense app, these things make this laptop go beyond and always ahead of any other laptop in this range. we can do over clocking with the help of inbuilt predator sense app. The real predator power is its 6 GB 1060 GPU. You don't have a second option to think for this price.",
            "Thank you Flipkart for lightning fast delivery within 2 days of ordering. I got it on sale with no cost EMI. The laptop was packed properly. Amazing gaming laptop at this price range.\nThis is what I feel after 12 days of usage.\n\nFor this price this laptop delivers big time. I bought it for photo processing using Lightroom and Photoshop and equally to game too. With 16gb ram and i7-8th gen the laptop can literally handle any application.\nComing to games, GTX 1060 6GB is doing pretty great work. Games like MK X and Dishonored 2 gives 60fps at ultra settings. Any AAA title game should be handleable with this monster. Especially I was surprised with how it can handle METRO EXODUS smoothly.\nOther than that, the speakers are pretty good for the price and the display has really good viewing angles and is lit enough for movies and gaming. The track pad is smooth and does the job well.\n\nSo far I've given a good picture. Let's see the cons now. The cons here are the battery life and the thermal issue. Lemme tell you how I handle it.\n\nWhen I tried running Prey on ultra settings, the laptop did deliver good performance but for the first time I saw the CPU n GPU temps rise to 87°C. Then I maxed out the fans in predator sense and it came down to 65°in two mins. After reading about it a lot, the best thing to do to avoid over heating or even thermal throttling is to keep the laptop on an elevated surface as the air vents for intake are on the bottom. I use an old non-functioning fan as the base while gaming so the airflow is good. This definitely helps reduce 5-8°C. I've not tried undervolting yet, so can't comment on that.\n\nThe battery.... Wish Acer gave a bigger battery. Two things to note while gaming on battery. 1. FPS DROPS significantly. Needs settings adjustment in Nvidia panel and windows power management settings. 2. Abnormal rate of battery drain. Drops to 20 from 100% within 40 mins.\nWith light work and downloading in the background, I got around 3.5-4hrs of battery runtime.\n\nIn a nutshell, though battery life and cooling systems could've been way better, this laptop is still a steal at this price. Go for it. The performance is unparalleled.",
            "Got it for 90k after all the offers Includee, I was skeptical about the processor because it's not the high end i7 8th gen , not clocked to 4.1 but medium clocked...\n\nthis wont effect gaming or any other multimedia software you use but can show difference in 4k output and multitasking or running VMware etc.\n\ncooling is good, gets hot but cools down very fast.\n\nnot so impressed about display,sound and mousepad. can be okay.\n\nbest thing about laptop is price at which u are getting the whole thing for.. it works are as expected.",
            "Review after a week.\n\n1.But Runs hot when playing aaa titles at max settings for 30 mins if you let the predator sense in auto mode, thermal throttling is there. It is recommended that you put it in boost mode to avoid such throttling.\n\n2.acer has sacrificed battery life while making this product cost effective. Could have given a bigger battery.\n\nBut it's what you get with the price. Go for it.",
            "super beast",
            "The screen refresh rate is 60hz unlike the PH315-51 available outside India whose refresh rate is 144hz. Keep this in mind before buying.",
            "It is a beast, the specs is powerful enough for each and every games till date.\nIt gets heated pretty quickly but gets cool quickly too. It doesn't have separate buttons to control the fans through keyboard,you have yo do it through predator sense. Neither any buttons to control keyboard light. The body is strong and has a premium feel to it.\nIt sucks air from the bottom so if possible .. keep the laptop lifted up a little to ease the flow of air\nI undervolted thorough XTU, but got constant BSOD when in -155 voltage\nso i am keeping it in -140 and is stable right now .. the temperature of CPU gets around 88 degrees maximum while GPU gets around 75 degrees after undervolt",
            "Awesome laptop. Thank you flipkart for this amazing deal. I got it only 91,400. Just go for it. Everything is perfect.",
            "Amazing quality and got it delivered within 48 hrs. Feels amazing and soft and works like flash.",
            "This is a great device at a great price. The overall build is great, solid with no flex. The keyboard is good, and the backlight is fine. GTX 1060 needs no review, with 6GB it's a beast for 1080p gaming. The core i7 gets a bit toasty, thermals could have been better but having said that, a 6 core 12 thread processor will heat up anyways. The processor and graphics card perfectly compliment each other and the 128GB SSD is really fast. It's at par with Samsung 850 Evo interns of speed, I used it earlier. Overall, it's a great but especially if it's running on a deal.",
            "performance truly reflects the specs this beast comes with! Nice and sturdy body which looks premium. Played FIFA 19 and PES 19 with no lags.. although I thought the screen might have been better with at least 120 Hz display.\noverall, worth every penny you invest for gaming and entertainment!!!\nI strongly recommend this beast to game lovers!",
            "This laptop is a beast. It's been three days and I am in love with it.\n- The display is amazing, great color accuracy.\n- You don't even need headphones for gaming, the sound quality is really good.\n- Have tested Assassin's creed : Odyssey, getting 45-60 fps in ultra settings | GTA V : Around 80-100 fps in max settings | COD WW2 : 60+ FPS in Max Settings\n- The front camera is really poor :( I have used cheaper laptops( under 25K), even those laptops have a better camera quality.\n- Of course - The Issue of overheating (which isn't really an issue) Initially The temperature was reaching 90 degrees, but then I undervolted the cpu by -0.150 V and the average temperature even after a couple of hours of gaming doesn't go above 80 degree, so if you face the same problem under-volt your core - It's safe and effective.",
            "Great Laptop with blazing fast boot times thanks to the 128 Gi SSD. Games run super smooth too.",
            "Got This Laptop At 92 K During the big billion day sale, Just gonna say one thing, there aren't any better gaming laptop than this, It can literally run any game at its maximum graphic settings.",
            "Best for the price offered. Can handle any tasks thrown at it. Gaming on this beauty is a bliss. Only issue can be heating, but that can also be fixed by the PredatorSense s/w that comes in-built. Go for this product without any second thoughts. Try to get it under 1lakh :)",
            "For the price I got it (95k) the laptop is very good.",
            "Amazing laptop and amazing service on the flipkart part.The only thing I wanna mention is the battery life is poor if u are someone who has to work on the go I would suggest looking for some other option otherwise the laptop performance and design is perfect and the thermals are also good",
            "Great specification, enough to be abreast with tech for at least next 5 years gaming's. Form factor is too good. Speakers not very great. Heats up fast but predator sense cools it down. 1 star for seller, box seal was already compromised. Why you guys selling stuff worth lakh with seal open. How to trust you guys.",
            "so im using this laptop from couple of months and its been a good experience till now. the only issue im getting now is the heating problem while playing games like cs go and pubg even while turning the coolboost and increasing fan speed other than this the laptop is best for gaming and giving a good fps too and if you are confused msi and acer go for acer cause it has good battery back up. JUST FEEL TO ASK ANY QUESTION REGARDING THIS LAPTOP :)",
            "Performance wise one of the best in this price range, but the main thumbs down is the cooling system. One just can't play any high graphics game in indian summer (at around 40 degree centigrade) . Even the processor shows power throttling for high demanding games with the provided charger, which is approx 200 watt. Most of the power gets diverted to the cooling fans. The display is also not as vibrant as others in this segment. Battery life is not bad when the gpu is turned off.",
            "under budget gaming beast\nwith the use of predator sense boost while charger is plugged in u can play any game at ultra settings\nscreen is ok(as per price range) but not excellent\nbattery drainage is so fast so keep it plugged in if you want to use it for a long time\nbuild quality is excellent\njust 1 problem is there .... the body gets too much heated after use(gaming) for a while\nrather than these small issues this laptop is beast ..\nif u wanna buy this then just do that dont think twice about it.",
            "Awesome Laptop by Acer. Predator was premium Gaming Laptop brand. Bought it for Republic Day Sale @94k. Performance is like a beast.\n\nHigh performance Nvidia GTX1060 for this price is a notable feature. Other brands like MSI, Asus ROG and Dell GTX1060 will was priced 1.3 to 1.6 lacks.\n\n16GB RAM is a good bundle for this Nvidia. Multi tasking is awesome.\n\nAverage Battery Backup for a Gaming Laptop. 3 to 4 hours for normal usage and 1 to 1.5 hours for gaming.\n\nNo freebies are available with this laptop. Also we cannot extend the warranty from Acer India site. Acer Indian site doesn't have store.\n\nVR Features are awesome. Need to purchase VR goggles box for another 32k.\n\nI purchased this laptop for gaming and software simulations.\n\nI've tried GTA5, Batman Arkham Knight, Assassin's Creed Syndicate, Battlefield V and Far Cry 5. The laptop was heating upto 98 degree Celsius.\n\nOnly Windows 10 is coming with this laptop. That too was Home Edition. MS Office was not free.\n\nAlso you should give backpack for this laptop because we are spending this much amount.",
            "I got it for 94900, it has single solt of 16 gb ram which is good.\nanother slot is empty. Display is amazing. comparison to other gaming laptop battery backup is good. on normal browsing it gives about 5 hrs of backup.\nover all, best laptop in this range",
            "The main package was tightly sealed and without any damages to the inner product or box I was 100% satisfied with the product thank you.",
            "Overall a very sturdyly build lappy.some cons r lyk Battery lyf s dissapointing. Drains really fast even when not gaming. When on charging mode u feel a bit shock near the USB ports and metal parts. Performance is nyc. Can handle any AAA title games with ease. HV played shadow of tomb raider and fifa19. When playing shadow of tomb raider which is a gpu demanding game it heats up lyk anything. Thermals should hv been good. Just would advice u guys to extend the warranty from official acer site rather dan buying flipkart extended warranty coz in acer site u get 1st Yr ADP warranty +2nd and 3rd Yr normal warranty along with 1yr free anti-virus and data recovery software.. U also get a predator mouse which costs around 3k for free.. All des for a mere cost of Rs 2359. The specs provided in dis lappy can easily fit for coming 4-5 yrs. Overall satisfied with this purchase. ❤️❤️❤️",
            "Laptop is amazing but delivery guy was very bad",
            "This a gaming lap so dont expect battery life. Overall performance is very good. Laptop will get hot but running fans in max and if the room is cool there will be no probs. I will suggest this lap if u want to buy the best gaming lap at 1 lakh(priced at 1 lakh when i bought)",
            "Without charging adapter the game lags but when charged games work smooth but after half hour of gaming it gets a lot hot.\nThe main issue the heating of this laptop because this laptop is built for gaming and it doesnt handle the thermal throttling very well when gaming",
            "Performance of the laptop is top notch. There is not much of a heating issue. But the screen left me a little disappointed.",
            "awesome product..as expected",
            "Great as of now",
            "Works perfectly fine. The battery is on the lower side, but that's expected.",
            "awesome laptop..",
            "Good Performance at reasonable price but with poor batteries.",
            "right now working pretty good.",
            "the display is 4/5 as it I's 60 hz display but decent for average plus gaming. The battery is on a bit downside .The build quality is far better than msi . Heat issues are a bit there . rest is awesome . I got it at 93k . At that price with 6 GB 1060 graphics is awesome. flipkart delivery was bad and the seal was torn",
            "Very good product. I bought it in 94990/ in BBD. In market it was priced more than 100k for 8GB RAM",
            "PERFORMANCE AND DISPLAY IS AWESOME 👌",
            "Its a nice laptop at this price. I wanted to go for MSI but acer have better after sales support. Gaming for long duration can make it heat up a little but setting fans to max makes it better. Fan noise isn't a issue even at full speed.",
            "awesome product .",
            "Best budget gaming laptop.",
            "good",
            "I love this gaming beast, although I bought it for design and rendering purposes. it's still an awesome laptop",
            "This laptop is a Beast!!!",
            "Really very good performance.....",
            "Best buy...",
            "Awesome laptop at this price.",
            "beast has arrived",
            "Good laptop but the new one has heat issues where we need to call acer customer service and need to add some paste to solve the issue.",
            "simply a beast..... superb laptop as per expectations.....saved my almost 40k ...",
            "MS office there is no life time validation",
            "The packing or package need to be improved as it might or can get damaged.\nThe seal was broken of the laptop box.\nThe laptop is the same and has the same configuration as said.\nAwesome laptop super fast.",
            "Got the laptop in 3 days.... very good and safe delivery..... the laptop is blazing fast and all high end graphics games work like a charm.... got this for 94990 it was a steal deal....",
            "nice product, I bought it for 93k one of the best for architects",
            "The laptop is very good for the PRICE but it's having its own issues...\n\nThermal throttle can be avoided by decreasing the core voltage by -155 MV it will boost the performance by 30 %\n\nAlso after first turn on try to install the updated bios it will increase the stability by 40%\n\nPros\n\nGood Screen\nNvidia 1060\ni7 8750h\nWeight is a bit... manageable for gaming laptop.\nFan Boost.\nKeyboard is great\n\nCons\n\nThermal Throttle after 20 min of heavy usage\nbuild quality is lacking..\nFan Noise is huge on full boost.\nTrack pad is Not up to the mark\n\n\nSteps to overcome throttle\n\nDownload Intel XTU\nSET decrease the voltage to -155mv.\nafter that it will not throttle.",
            "Value for money. Good performance in the price range. But worst cooling system/design.",
            "Simple... go for it... it's a beast for least rs...\npros:\neverything...\ncon:\nexcept camera,battery life,design...\n\nNote:\nDon't consider heating issues because it is common in all laptop...",
            "the laptop is amazing..... played games like\nASSASSIN CREED ORIGINS\nGTA V\nJUST CAUSE 3\nPREY\nNEED FOR SPEED PAYBACK\nBATMAN ARKHAM ORIGINS\nPROTOTYPE 2\nAnd all the games ran very well....\n100% SATISFIED...\nHEATING is a bit issue but its OK with AERO 3D COOLING FANS.\nBUILD QUALITY is also good.\nOVERALL.. PERFECT FOR GAMING.",
            "i bought it on sale..just can't believe what i got for this price..definately worth iy",
            "Acer predator helios 300\ni7 (8th Gen) , Nvidia geforce GTX 1060\n\nFor 95k rupees! Are you serious Flipkart....\n\nSeriously this is the best deal...I've seen till now....\n\n\nAnd the laptop's package was not that good....\n\nBut the performance....oh My god..... It was suuperp",
            "thank you flipkart..this laptop is best for gaming run smoothly..thank you",
            "Excellent product.",
            "Ghost look but packing was too worst they didn't know how to pack a laptop they packed like a weast....",
            "good laptop but price is varying day by day wait for it and buy cheapest is 85k till now but I bought for 96k",
            "nice laptop with amazing features only issue is heating & warranty was already there before registering",
            "only one problem😭 overheating",
            "The best laptop under 1lakh",
            "The laptop is so awesome , it can run every game possible without any lag or framedrop !!\nMany people complain that it heats but my experience is not so bad with it\nIts aeroblade fans can reduce temp from 80° to 40° in couple of seconds !!\nOverall best value for money.",
            "Everything is up to the mark but has some heating issues.",
            "perfection at budget of gaming laptops.\ncompletely recommended if you want gaming laptop with the available specs\n\nonly con I felt is battery...not much back-up, but plugin when needed.",
            "Flawless",
            "Awesome product ❤️❤️❤️",
            "Pure BEAST. No words to say♥️",
            "laptop is ok..\nbut I got this laptop with broken seal\nand as expected the carger is changed\nit is not of acer coy\nand laptop case is sealed, so that's why I took it..\n(mazboori)",
            "best laptop at an affordable price!!!!",
            "Super performance n nice laptop",
            "If you are buying it for gaming please don't think about it because it heats alot my cpu temp goes to 91°C to 97°C while gaming(pubg,AC odessy.etc..)which is not got for your hardware same with gpu almost 89°C to 91°C although its specification is good but what you will do of it if you can not play the games.I bought this laptop 2 months ago and now I want to throw it in the garbage please If you love gaming or buying it for the purpose of gaming don't think to buy it.It is nothing more than crap.",
            "The design and build quality is really good, even though its mostly made of plastic. Still feels premium. The battery life sucks. It lasts only 2 hrs for normal usage. And I dont know why but it keeps hanging while installing any software or opening any folder. Probably just my unit. Will mostly get a replacement.",
            "the products sucks horrible product after period of time gpu and processor got damaged even if try to claim warrenty they offended it",
            "Whenever you are playing any AAA title, the laptop exceeds 90°C which can be issue when playing for long hours and always stays connected to the adapter because the battery life is short. Overall performance is great and reaches 60+ FPS on any* game when set on high settings",
            "Great Laptop loved it.",
            "best laptop at the sale price",
            "Battery is extremely bad! 2hrs on full charge (refer photo)",
            "Nice one.. Fast performance..",
            "Camera is not working........",
            "Except Battery Life, rest are ok. Purchase the 2019 November Model. Ignore this Model.",
            "Good product. Working satisfactorily.",
            "Worth the money. At first I thought that it is too costly. But realised that it js worth the buck. Runs smooth on even demanding games. Great experience. Highly recommend it.",
            "fantastic gaming laptop under 100000 RS range\n\nperformace of laptop is good\n\nsupport almost all the games",
            "Awesome performance",
            "mic port was not working",
            "pros: desktop gtx 1060.\ni7 8750 6 core 12 threads CPU\nsturdy and durable body\ngamer design\ngood price to performance ratio\ncons: thermal performance for hot Indian climate is not great\nkeyboard is not great for typing\nbattery life is very poor even for lowkey usage\ntouchpad clicks are not precise. use mouse.",
            "awesome product but battery drains too fast",
            "Competitive price but costly for students category, good machine but weight is high.",
            "Super",
            "Very good product with awesome features. It runs all my games in decent fps. The charger they provide is not from ACER but it's ok as it is ok.\n\nBattery life is less, but that's is negligible compared to performance. 1060GTX is beast. It gets hot at time, but with predator sense and overclocking, it works quite decently.\n\nOverall a good deal.",
            "awesome.. don't think get it",
            "Amazing gaming experience...overall cracked a good deal.",
            "Great performance so far, even good battery backup if you are not playing, i being doing software development and designing on battery and it is giving good backup. Heat issues strikes when you play game but auto thermal sense handles it. If you are hard core gamer buy a cooling pad.",
            "Keys get removed on the second day of use...... Keypad doesn't work and sound doesn't work at times",
            "I am not a big gamer, bought this laptop for productivity. Especially for graphically intensive programs. Apart from a slight hiccup in After Effects never encountered any lags or errors. this laptop is a beast for productivity. The body is clunky and the looks are over the top but I compromised for power and screen. This is not a long term review so would still advise more research.",
            "i have received the laptop with the seal open then i asked them for the replacement then also the same problem occurred and when i transferred my data into tbe laptop it automatically deleted the data. So after investing a 1 lakh rupees it is not good.",
            "No other gaming laptop (high end configuration) at this price point. Not only for gaming, for every purpose even video editing it is best. Some people talking about heating issues. But, if you have the knowledge to adjust some settings , then no problem at all.",
            "Amazing laptop",
            "very good",
            "Battery could have been a lot better. Just using internet and youtube and the battery drains in4 hours maximum. The charger is not very fast as well.",
            "I bought it for 84-85thousand delivery was before the time they gave.\nmust say worth the value and the packing was very good.\n*laptop design definitely will give u a gamer experience.\n*sound is little less as speakers are below the keypad.\nthe built quality is though (mean good).\n*the keypad lighting has a feature of sleep mode light as in if u were using the keypad you don't use the keyboard for a while the light goes on sleep until use the board again soo batter saving mode that is I must say.\n*touch pad is little hard to use so would recommend use mouse for better work.",
            "I love this Laptop",
            "I was expecting something better....",
            "It's a excellent gaming beast",
            "Speaker problem.",
            "Never opt for this i bought it and now i regret it so much now i think i shouldve gone for macbook pro",
            "Value for money!",
            "when i carry this laptop , speaker are slightly damaged.\nheating issue is the major problem. even keyboard buttons heatup too much.\nmy old laptop has i3 processor and 8 gb ram play pubg( 24gb game size) without lag and heating issue. but this preaditor heat too much.\nits goes 110 degree Celsius when play pubg pc.\ndisplay quality is also bad.\nif you really want to play games buy other laptop like lenovo hp etc",
            "just buy",
            "Simply awesome.... Just go for ths",
            "Simply great",
            "Design is childish (in my personal opinion, because I use it for professional work), would have loved to see minimal design like Lenovo's Legion or HP Omen.\nBuild Quality is very Good.\nThermal throttling is problem but can be solved by replacing the cooling paste.",
            "battery is not up to the mark.screen is good but only 60 hz.due to gtx 1060 this machine is beast.key is fantastic.i loved its keyboard.tourchpad is also good."
        ],
        "likes": [
            "80",
            "84",
            "6",
            "34",
            "8",
            "14",
            "4",
            "6",
            "3",
            "5",
            "5",
            "18",
            "11",
            "11",
            "7",
            "3",
            "3",
            "3",
            "4",
            "4",
            "4",
            "2",
            "7",
            "2",
            "2",
            "1",
            "1",
            "1",
            "2",
            "2",
            "2",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "5",
            "3",
            "3",
            "3",
            "2",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "17",
            "88",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "27",
            "3",
            "5",
            "2",
            "2",
            "5",
            "2",
            "2",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "28",
            "62",
            "0",
            "12",
            "1",
            "4",
            "0",
            "1",
            "0",
            "1",
            "1",
            "5",
            "2",
            "3",
            "2",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "3",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "7",
            "2",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "11",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "13",
            "0",
            "2",
            "0",
            "0",
            "4",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "16",
            "3",
            "1",
            "1",
            "1",
            "1",
            "20",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "11",
            "0",
            "0",
            "1",
            "3",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Where and How to download drivers for your laptop?",
            "Q:Is it better than MSI GV series GTX 1060 ,i78th gen laptop?",
            "Q:When will this come?",
            "Q:Is it 1x16gb or 2x8GB RAM sticks installed ?? Please check and reply those who has upgraded to 32 gb recently",
            "Q:Today is 19Dec 2018 and this product is out of date . So when it will be buyable? Any upcoming date?",
            "Q:what is the main use of this lap...only for game?",
            "Q:why does it come with the seal broken?",
            "Q:Is it possible to turn off the GPU while not using it and have a better battery life?",
            "Q:does it have anti dust technology ??",
            "Q:I have heard that most of the Outer Boxes of this Laptop delivers with Broken seal is it true ? If Yes Then Why ?",
            "Q:I'm planning to buy this laptop but there are two options available, 1. i5 144hz display and 2. i7 60hz display, which are confusing me.. can anyone help to choose the right option? Thanks in advance",
            "Q:Does it contain gtx 1060 max q version or 1060 desktop one ?",
            "Q:i have pre installed 128gb ssd and 1 tb hard disk drive..can i add another hdd in this ?",
            "Q:Does it have SATA or NVMe ssd type?",
            "Q:does it has single 16 GB ram in one slot and another is empty or 8GB + 8GB RAM in both slot?",
            "Q:Will this laptop support 144hz monitor so that I can enjoy game at 144hz?",
            "Q:whether the laptop contain wifi & Bluetooth?",
            "Q:Can we make presentations of office work on acer predator helios 300",
            "Q:which type of ssd it have 1)m.2sata or 2)sata 2.5\"",
            "Q:can i upgrade the hdd and sdd at the same time ??",
            "Q:I have two questions 1) Can i play METRO EXODUS in ultra graphics with it? 2) what accessories will be packed with it?",
            "Q:Does it have metal fans",
            "Q:Does it have the new 3D Aero Blades ?",
            "Q:What is its model year ?",
            "Q:Can we watch 3d movies in this?",
            "Q:how many colours does the keyboard have??",
            "Q:can we play PS4 games",
            "Q:Can we run autodesk maya on this?",
            "Q:i read answerrs (of questions saying the memory is 1x16 and some saying 2x8.Which is it? also, can yo upgrade the SSD & HDD? if so, by how much and how many slots are there?",
            "Q:can we extend the graphic card upto 8gb",
            "Q:For programming it's good or bad?",
            "Q:Is this 1050ti or 1060 ?? In the video is seen as 1050ti....please confirm. And is it 60hz or 144hz?",
            "Q:does it come with the bill?",
            "Q:how many heat reducing fans it have??",
            "Q:what iw the weigth of laptop?",
            "Q:Does it have any heating issues?..i heard a lot about this.",
            "Q:what is the rpm of 1 tb hdd",
            "Q:Is it Hexacore or Quadcore ?",
            "Q:does it originally have gtx 1060 ?",
            "Q:does it have gtx 1060 ??",
            "Q:how many ram",
            "Q:We need to install graphics drives and others drives???",
            "Q:Is the CPU i7-7700HQ or i7-8750H ?",
            "Q:can you please tell how much fps you are getting at AAA games at high or ultra settings. Tell fps correspondimg to game's title.",
            "Q:i heard about heating issues & game will choppy for heating . any suggestions about this ?",
            "Q:Does this laptop have thunderbolt port??",
            "Q:what is the battery life of this laptop",
            "Q:is this laptop helpful for video editing?",
            "Q:does it has 2x8gb ram or single slot 16gb ram",
            "Q:60HZ uhd or fhd",
            "Q:in the m.2 slot can i put a pcie nvme drive.",
            "Q:Can I upgrade my GPU later?",
            "Q:How is the RAM allotment??? Is it 1 slot x 16GB=16GB or 2 slot x 8GB = 16GB????",
            "Q:Is it truly is or \"ips level\" TN display?",
            "Q:will i will get a bag ?",
            "Q:Is the SSD drive expandable?",
            "Q:How is the heat management under heavy gpu and cpu load ? Is there any thermal throttling for cpu ?",
            "Q:Can It Run AAA Games At Highest Settings Or Would I Need To Overclock Or Undervolt?",
            "Q:Is the screen 144hz??",
            "Q:This display has 144Hz refresh rate??",
            "Q:is the display 120 hz or higher?",
            "Q:Are you serious it has 8 gen i7 processor at this price???",
            "Q:what is the refresh rate of the screen?",
            "Q:There Is No Optical Disc Drive So How can I intstalled New game With disc...please Give me A suggestion.",
            "Q:is it 144 hz refresh rate monitor",
            "Q:does it have a 144hz panel?",
            "Q:how to make parttitions of hdd? and how to install second os?",
            "Q:i hope there is predator sense...?cuz my friend ordered from flipkart and the predator sense was unavailable !",
            "Q:Which laptop is better msi gv (16gb ram/128gb ssd/i7 8 gen ) or acer predator hellios 300 (16gb ram/128 gb ssd/i7 8gen) ?",
            "Q:Does it face thermal throttling? if yes then is there any drop in performance",
            "Q:can i update display 60 to 144 hz ?",
            "Q:Is it the 2018 model???if yes then should it have 144hz refresh rate???",
            "Q:Can i install linux for dual boot support? or do i need to change BIOS?",
            "Q:What kind of performance does it give in productivity tasks like 3D modelling, moderate to heavy VFX editing, etc?",
            "Q:is it good for edtiting in big softers",
            "Q:Play pubg on this laptop",
            "Q:Is this laptop VR ready ?",
            "Q:what are the package contents ?",
            "Q:what its camera quality",
            "Q:windows installed on SSD????",
            "Q:what if there is no.predator sense?",
            "Q:can we install another ram stick on our own or should have to visit service center?",
            "Q:how to solve gta5 error- this computer does not meet the minimum recommended cpu frequency",
            "Q:what to do if laptops seal is broken ?",
            "Q:Is it a good option for engineering students? How heavy is this beast? As in, is it portable?",
            "Q:ram details in this laptop",
            "Q:How many cores does it have?",
            "Q:does this laptop come with 1tb+256gb or only256gb",
            "Q:Sir is it have 1TB HDD or only 128gb ssd ???? am confused clear me????",
            "Q:can i livestream on YouTube while playing pubg? and how much frame rate will i get ?",
            "Q:msi gl63 8sd or this?",
            "Q:does this laptop is best for programming,web developing and photo shop",
            "Q:does this laptop has DVD driver or not??",
            "Q:does it support pcie X4 bandwidth ?",
            "Q:Can i Play high end games on this laptop? like metro exodus,battlefield 5 or assasins creed?",
            "Q:Do we get Backpack for free?",
            "Q:Does this laptop have a m.2 port?And if yes, the is it occupied by the ssd?",
            "Q:will it be safe to just put the laptop on charging and not playing any games while fans are switched to max and overclocking switched to turbo simultaneously",
            "Q:display hz and response time?",
            "Q:What is the refresh rate of the display???",
            "Q:how much long we can play while charging and long time playing on charging can cause of battery damage",
            "Q:performance is best for 3d cad software like catia and creo?? or any other suggested laptops?",
            "Q:Does the Predator logo lit up?",
            "Q:highest temperature in Gaming?",
            "Q:what is the RGB confrigation of this laptop",
            "Q:Does this model has a Vram??",
            "Q:can i pay with net banking account?",
            "Q:Is It Having DDR5 Ram Slot?",
            "Q:Does it has NVIDIA 1050TI or else?",
            "Q:Which version of NVIDIA it has? 1050ti or else?",
            "Q:how much fps on GTA max setting and medium setting is it above 60 fps on this 60hz display or only 60fps",
            "Q:What is frequency of RAM and HDD?",
            "Q:can i play gta5 on it",
            "Q:is the hdd a firecuda one(sshd) ?",
            "Q:does 1060 bottleneck with this cpu or should i buy i5 1060 model",
            "Q:how to use predator sense",
            "Q:does anyone found touch pad noisy",
            "Q:Will it work with Oculus Rift or HTC vibe VR headsets? Does it have enough ports for these equipment?",
            "Q:The HDMI port of this laptop is routed through Nvidia graphic card or it's Intel processor???",
            "Q:does it have free sync?",
            "Q:can we play pubg in ultra hdr mode?",
            "Q:what is the RAM frequency?",
            "Q:Does it have MS office 2016 H & S edition?",
            "Q:why this contains 60hz display the latest i7 8th gen model comes with 144hz display??",
            "Q:how come this has reviews when it has not been released yet?",
            "Q:Is it 2666mhz DDR4 RAM ?",
            "Q:how is temperature ? is there throttling ?",
            "Q:Is this model 2018 Version with brightness 300nts and 72% NTSC",
            "Q:can you confirm the display is of 144hz ?",
            "Q:is it 120 hz or 60 ?"
        ],
        "answers": [
            "A:Visit Acer India Official Website->Click on Support Tab->Select Drivers&Manuals->Option1:Enter Model No eg: Aspire 315-21->Option2:Select �Category�,�Series�,�Model� from drop down->Download drivers",
            "A:yes",
            "A:they have revised prices, probably soon",
            "A:It’s 1x16GB. For 32GB additional slot available to upgrade for another 16GB RAM",
            "A:I have this @92,990 and the predator is doing great. Don't know when it will be available again. If there is so do go for it....",
            "A:3D model render, Heavy Video Editing, Gaming and other heavy content creation",
            "A:No, it comes as a brand new product. No scratches, no seal tampering. You should also go to Acer India website & register your product for 1K for 3 year warranty.",
            "A:It switches the gpu off automatically if no tasks require gpu",
            "A:no, it doesn't have any anti dust technology and also slots gonna have some serious dirt if u don't keep it clean regularly",
            "A:I found completely sealed packing",
            "A:if you are looking for speed, performance, multitasking and play game while streaming then i7 is the best ,it has one of the best processor in it 8750H ......6 cores and 12 threads....",
            "A:1060 desktop one",
            "A:Good laptop, device speed well n good. But screen cover not strong enough. I have not added xtra HDD, nor i have opened the cover to check. As per acer webste HDD can be added, RAM xtended upto 32GB.",
            "A:SATA",
            "A:Single 16 GB ram in one slot. It can be expanded upto 32 GB by putting another 16 GB in the empty slot.",
            "A:Yes. You can even go to an expert to change the monitor to a 144hz one.",
            "A:Yes of course it is having WiFi and Bluetooth",
            "A:yes, but charge as per your duration of presentation",
            "A:2",
            "A:yes you can.",
            "A:1) well you can play with max graphics but you will get 30-40fps. 2) only charger.",
            "A:yes",
            "A:If you check under features it is clearly mentioned that is has 3D Aero Bladed.",
            "A:2018",
            "A:yes you can, provided you have the 3D glasses and the required software to play 3D films!",
            "A:1",
            "A:If PS4 game titles are available for PC then you can play them.",
            "A:easily",
            "A:Ram is 1*16 and yes you can upgrade the drive.",
            "A:you can't extend the graphics card because it doesn't have a thunderbolt port,but you can overclock it. predator sense app(pre installed app) will help you.",
            "A:its over featured if u r looking for only programing....",
            "A:it is 1060 of 6gb variant and 60hz display.",
            "A:Obviously.",
            "A:two",
            "A:More then 3kg.adaptor is also much heavy.",
            "A:running smoothly like hell. just go for it it's a masterpiece",
            "A:7200 RPM",
            "A:Hexacore",
            "A:Yes",
            "A:Yes it has nvidea gtx 1060",
            "A:Single 16gb",
            "A:All of them are pre installed",
            "A:8750H",
            "A:Yes.. i will get 60fps for every games... and 40 fps for cinematic games like witcher 3..... the fps will not drop or increase if that is with (whisper mode ON)",
            "A:no have been using this laptop for a month now.. yes it does get quite hot but there are no performance issues.. performance issues occur when you unplug the charger in game..",
            "A:no",
            "A:3 hours in normal use. 5hours stand by,gaming only on charging.u can't game more then 45 min. without charging.",
            "A:Yes....but keep in mind it might get thermally throttled if you use it for long time say for 2 hours.my suggestion you undervolt it for best results",
            "A:2x8gb used not a single 16",
            "A:fhd",
            "A:Yes we can put both a slot",
            "A:No you can't, you can only upgrade RAM and SSD",
            "A:songle 16gb ram stick",
            "A:it's ips panel",
            "A:No.",
            "A:Yes.",
            "A:Heat management is pretty good you can also customize your fan speed . i recommend to use it at cool room temperature. As in summers it would heat easily",
            "A:yes it can run AAA games",
            "A:no",
            "A:No it is 60 Hz",
            "A:60hz IPS display",
            "A:Yes.",
            "A:60hzs for this model",
            "A:buy an USB powered optical drive from flipkart",
            "A:that model seems unavailable in India but this 60hz ips is excellent in colors and viewing angles, they have also corrected the yellowish tinge issue seen in the 1050ti models",
            "A:No.There is another model with same config. which has 144hz display in amazon.",
            "A:you can use any bootable usb drive having windows on it and make partitions on HDD. you can use the same even to install a second os. more info you can get from YouTube.",
            "A:There is predator sense in my laptop and there will be for every laptop for sure bcuz to control fans and overclocking.If not there contact acer.U might get the answer from them.",
            "A:Predator",
            "A:Yes it does, but you can check tutorials on YouTube as to how to undervolt the cpu by around - 155v and its performance will improve",
            "A:well you can upgrade the display to 120hz based on linustechtips video (Gaming Laptop Screen Upgrade!) but you do lose the ability to use brightness control.Try PH315-51-78NP 's screen as replacement",
            "A:I'd doesn't, only 60hz but display is OK.. It serves the purpose. But you have to adjust the color though, it feels too much reddish at the start",
            "A:You can have dual boot. keep windows intact in the nvme and install Linux on other drive. But I would recommend to go through VMware rather than having dual boot.",
            "A:smooth won't have anytriuble but will heat alot you can even add a secondary graphics card as it has type cable was well",
            "A:It's very good for editing....and gaming..I use Photoshop and after effects...its very good.It has IPS screen which is also good for editing.Don't worry about heating..It won't get heated for editing.",
            "A:yes ,at HDR extreme mode.",
            "A:Yes. This is VR ready laptop. Geforce GTX 1060",
            "A:laptop and charger...",
            "A:its pretty good",
            "A:yes it is installed on ssd",
            "A:It was pre-installed for me.",
            "A:you can , but you will already have two 8 gig sticks inside so you have to take both off if you are going for higher frequency and number.",
            "A:Damn....GTA-5 is too ezz for this laptop.Size may be more...but u can have atleast i5 processor and 2GB graphic card to play it.Just buy the game or install the files needed properly.",
            "A:You can check the product inside and if it is working properly and everything is fine then there should not be any problem.",
            "A:u can use for taking clg.. but it has little bit weight compared with other laptop.",
            "A:16gb",
            "A:It comes with an 8th gen Core i7. So it's 6 cores and 12 threads",
            "A:hi. this laptop have 1tb + 128gb ssd.",
            "A:It has both, 1 tb hdd as well as an 128GB SSD.",
            "A:yea you can, this laptop is capable of running 2 pubg at the same time so what is streaming !! you qi1ll get max fps possible.",
            "A:this model best",
            "A:it is more than best for these works",
            "A:No, it doesn't.",
            "A:no",
            "A:Yup, U can play all games",
            "A:No, only laptop and adapter is in box.",
            "A:yes ssd is present",
            "A:no",
            "A:60 Hz",
            "A:60Hz",
            "A:While charging it provides a turbo mode which enables better gameplay.you can play as much as you can while charging.Ofcourse not everything is permament ,the day you buy this,it will start to get old",
            "A:it's good one.becoz it has 6gb of nvidia 1060 gtx graphics card.and 16gb ddr4 ram ,128 gb ssd along with 1tb hdd. but 128 gb is not enough to use many software. u should change installation disk.",
            "A:No, it doesn't.",
            "A:70°-75° for high end games",
            "A:it has only single red color no rgb",
            "A:yes 6 gb vram of gtx 1060",
            "A:Not sure as I availed the zero cost emi option...",
            "A:nope DDR4",
            "A:it has NVIDIA 1060",
            "A:It has Nvidia 1060.",
            "A:60fps",
            "A:RAM-2666 MHz and HDD-5600 Mhz",
            "A:Yes you can",
            "A:no",
            "A:1060 bottleneck",
            "A:Open predator sense app , which u get it pre installed. You can control speed of fans and overclock.",
            "A:naah ..works fine for me !",
            "A:Yes",
            "A:Yes",
            "A:no it's not haveing",
            "A:yes we can play abd and i get 45-55fps also.",
            "A:2667 Mhz",
            "A:No! It only has get office software.",
            "A:This also has 144hz model, but you can find it in amazon.",
            "A:It has been released long ago",
            "A:yes",
            "A:if the room temperature is higher it gets heated easily",
            "A:yes but not sure",
            "A:Display is of 60hz.",
            "A:60hz"
        ],
        "likes": [
            "32",
            "1",
            "8",
            "4",
            "9",
            "2",
            "12",
            "3",
            "2",
            "0",
            "2",
            "0",
            "5",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "4",
            "6",
            "17",
            "18",
            "3",
            "4",
            "4",
            "7",
            "4",
            "2",
            "2",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "7",
            "3",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "7",
            "0",
            "3",
            "1",
            "5",
            "0",
            "16",
            "2",
            "1",
            "0",
            "1",
            "0",
            "11",
            "1",
            "2",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "2",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "1",
            "9",
            "11",
            "1",
            "2",
            "3",
            "9",
            "4",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "12",
            "3",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "3",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0"
        ]
    },
    "summary": {
        "pros": {
            "Performance": "With 16GB RAM and Intel core i7 8th gen processor this laptop can handle any application with absoulte ease. An assured top-notch performance, thanks to the powerful hardware.",
            "128 GB SSD": "Faster boot ups due to SSD. Takes less than 5 seconds to boot up.",
            "39.62 cm (15.6 inch) 1920 x 1080 Pixel Full HD LED Backlit Wideview IPS Display": "It is a full HD IPS display with good colours and decent brightness. Has great viewing angles.",
            "Build Quality": "Premium build quality and awesome looks.",
            "6GB NVIDIA GeForce GTX 1060": "This is a beast of a combo and gives the ultimate gaming experience."
        },
        "cons": {
            "4 cell 3220 mAh Li-ion Battery": "Considering it is a gaming laptop, the battery is just decent. Gives 4-5 hours backup on normal use. Recommended to plug in for the best gaming experience.",
            "Fingerprint smudges": "The laptop is prone to fingerprint marks even on the smallest touch.",
            "Heating Issue": "Suffers from heating issues but is manageable with the Predator Sense."
        },
        "verdict": "The Acer Predator Helios 300 Core i7 8th Gen is one of the best gaming laptops out in the market. An absolute monster when it comes to performance.",
        "Additional Information": "60hz display, Comes with Predator Sense."
    }
}