{
    "title": "Vaio E Series Ryzen 5 Quad Core 3500U - (8 GB/512 GB SSD/Windows 10 Home) NE15V2IN007P Thin and Light Laptop  (15.6 inch, Silver, 1.77 kg, With MS Office)",
    "product_specification": {
        "Sales Package": "Laptop, Power Adaptor, Laptop Bag, User Guide, Warranty Documents",
        "Model Number": "NE15V2IN007P",
        "Part Number": "NE15V2IN007P",
        "Model Name": "E15 AMD",
        "Series": "E Series",
        "Color": "Silver",
        "Type": "Thin and Light Laptop",
        "Suitable For": "Processing & Multitasking",
        "Battery Backup": "Upto 8 hours",
        "MS Office Provided": "Yes",
        "Processor Brand": "AMD",
        "Processor Name": "Ryzen 5 Quad Core",
        "SSD": "Yes",
        "SSD Capacity": "512 GB",
        "RAM": "8 GB",
        "RAM Type": "DDR4",
        "Processor Variant": "3500U",
        "Clock Speed": "2.1 GHz with Turbo Boost Upto 3.7 GHz",
        "Cache": "6 MB",
        "Graphic Processor": "AMD Radeon Vega 8",
        "Number of Cores": "4",
        "OS Architecture": "64 bit",
        "Operating System": "Windows 10 Home",
        "System Architecture": "64 bit",
        "Mic In": "Yes",
        "USB Port": "2 x USB 3.0, 1 x USB 3.1 Type C (PD 3.0 Charging, Display Out)",
        "HDMI Port": "1 x Micro HDMI Port",
        "Multi Card Slot": "Micro SD Card Reader",
        "Touchscreen": "No",
        "Screen Size": "39.62 cm (15.6 inch)",
        "Screen Resolution": "1920 x 1080 Pixel",
        "Screen Type": "Full HD LED Backlit IPS Display",
        "Speakers": "Built-in Dual Speakers",
        "Internal Mic": "Built-in Microphones",
        "Sound Properties": "2 x 1 W Stereo Speakers",
        "Wireless LAN": "IEEE 802.11 ac/b/g/n",
        "Bluetooth": "v4.2",
        "Dimensions": "358.7 x 239.2 x 19.9 mm",
        "Weight": "1.77 kg",
        "Disk Drive": "Not Available",
        "Web Camera": "1 MP Webcam",
        "Finger Print Sensor": "No",
        "Keyboard": "Standard English Backlit Keyboard",
        "Backlit Keyboard": "Yes",
        "Pointer Device": "Touchpad",
        "Included Software": "Microsoft Office 365",
        "Laptop Bag": "Yes",
        "Additional Features": "Li-ion Battery",
        "Warranty Summary": "2 Years Onsite Warranty",
        "Warranty Service Type": "Onsite",
        "Covered in Warranty": "Manufacturing Defects",
        "Not Covered in Warranty": "Physical Damage",
        "Domestic Warranty": "2 Year"
    },
    "product_description": {
        "Stylish and Elegant Design": "Featuring a stylish and stunning design, this laptop from Vaio is a must-buy device that perfectly complements a modern corporate leader’s lifestyle.",
        "Lightweight": "Thanks to its lightweight build, this laptop makes it easy to lift, hold, and open. You can even take it along with you wherever you go, making it your ideal travel companion.",
        "Easy Connectivity": "This laptop comes with a wide range of I/O ports that let you connect various compatible devices to it. Moreover, the ports are placed on either side of the laptop, making it easy for you to connect your compatible mobile/tablet, storage drives, external displays, and more.",
        "Stunning Audio-visual Experience": "Get ready to enjoy an immersive and cinematic audio-visual experience as this laptop comes with a 39.62 cm (15.6) Full HD IPS screen and dual speakers. This laptop’s screen offers clear and vivid visuals which makes every bit of content come alive. Moreover, its slim bezel offers a larger viewing area, making it a delight to binge-watch your favorite TV shows. The dual speakers deliver rich and high-fidelity audio, taking your movie-watching experience to another level.",
        "Long-lasting Battery": "This laptop’s battery can offer a runtime of up to 8 hours when fully charged, helping you finish your tasks on time. Along with giving final touches to your presentation, you can even watch one or more episodes of your favorite TV show before the device needs to be plugged in to be charged.",
        "Ergonomic Keyboard and Hinge": "Thanks to the ergonomically designed hinge, this laptop's screen tilts down at a slanting angle, enabling you to open it with ease. The keyboard offers a comfortable typing experience, thereby minimizing the load on your hands while working.",
        "SSD": "Store your files, photos, videos, and more in a single place as this Vaio E15 laptop comes with a large-capacity SSD. This SSD also helps in enhancing the performance of this laptop, making it a delight to play games or work on it."
    },
    "reviews": {
        "ratings": [
            "5",
            "4",
            "4",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "4",
            "2",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "3",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "4",
            "1",
            "5",
            "5",
            "1",
            "4",
            "5",
            "4",
            "5",
            "2",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "1",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "2",
            "4",
            "1",
            "5",
            "1",
            "1",
            "1",
            "3",
            "1",
            "1",
            "5",
            "1",
            "4",
            "5",
            "5",
            "1",
            "5",
            "2",
            "4",
            "1",
            "1",
            "1",
            "1",
            "2",
            "2",
            "4",
            "1",
            "4",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "1",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "3",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "3"
        ],
        "review": [
            "Fabulous design, premium matte finish, looks awesome\nBuild quality is good, plastic but solid built\nFast processor and ssd makes operating smooth\nDisplay is good ..\nSupports all gestures\nBattery 6-7 hrs\nNormal heating ...\nJustifies the price overall good for medium user\n\nCONS\ncamera not that good",
            "The laptop looks good overall - Thin bezel, ag ips display and the slightly slanted keyboard, got a very good laptop bag.\nFound some issues with the laptop -\nFan noise is too loud when the speed goes high, and heat is getting blown on to the bottom side of the screen. Dont know if this is a good idea in the long run.\nOffice subscription is only for 1 year ** its office personal not h and s, but you get extra apps like onedrive, onenote etc.\nThe laptop speaker sound quality isnt that great. Its having decent loudness though.\nscreen brightness is not that great.\nOnly 2 usb ports provided.",
            "Laptop has Matt Looks and design is very decent\nOverall a good deal. This is only the first day review, everything found excellent except some heat at the battery side. Will try to elaborate more after using it for a week.\n\nIt has been now more than a week and now I am decreasing one star as it really heats at the back and yes there is a little sound of Fan's noise as well.\nRest the laptop is really fast and happening.\nOverall it's ok till now.\n\nLet's see further.",
            "Thin and light, the overall form factor of the laptop describe being 15.6 size is a bit smaller. The display is quite enough with good viewing angles and better than most HP/DELL Laptops is this range. The body is made of plastic but trust me it's amazing. I use this laptop for meetings/office work/surfing/movies. Ryzen 3500u is good enough to handle this kind of usage and in this form factor makes it a good deal. Right side numeric keypad is an added benefit for users!",
            "First look is impressive, very thin and lightweight, Dispaly is bright and good, superfast performance with windows 10 and SSD with 8 gb of ram, Reason of 4 star is I found some heating on the back, It is quite acceptable for me as I'm normal user, but not sure it is temporary or permanent, One more thing is it has inbuilt battery so you can't remove it, Overall good performance and worthy product.",
            "Great laptop.... Black variant is looking like a cheaper one.. but great performance. Average camera..",
            "Yeah I've used 3days . I felt little bit heat under the laptop. But it's ok when we use on table it won't heat if we place it on bed it will get heat. Charging by closing the laptop it will take 1.20 min to charge 0 to 85\nPros:\n*Price..I think won't get better deal than this.\n*8GB ram , 512 ssd ,40 wt fast charging, ryzen 5 quad core\n*Disply ok for me.\n*Sound good\n*Windows 10\n*Discharging time 5hours for me\n*Looks premium but it's semi plastic\nCons:\n*Getting little bit heat . But its common in amd ryzen processor.\n*Camera only 1mp\n[Ryzen 5 quad core is better than i5 and less than i7]\nOverall (7.5/10)\nGo for this.",
            "Excellent Laptop by Vaio\nDisplay is very good with thin bezzels.\nProcessor is very fast, it takes just 5-6 seconds to start the pc\nLaptop bag given with laptop is of nice fabric quality\nOverall highly satified with the product",
            "Super laptop with great performance, look supub and premium. as a IT guy I must recommend to all this lappy.",
            "This is my detail review of my laptop\n1) performance is excellent as expected than other laptop very smooth very handy and super duper fast.\n2) ips display is simply amazing no doubt\n3) It's okay battery lacks in between and yes their is a slightly noise of fan and heating is also fine.o Otherwise its very ease to guys I would strongly recommend go for this product.\nOnly for office or personal use not at al gaming.\nThanks you flipkart for delivering the product very properly .\nThank you flipkart team and management for taking the responsibility In such a sistematic way.",
            "Excellent product in the range of 45-50k. Looks are premium, display was decent and good enough as compared to other laptops in this budget range. It was mentioned that it contains office but the truth is it gives an office 365 subscription for one year after which we need to renew (drawback). Sound quality was not up to the expectations, it is not that loud enough which we can get from the competitors. It delivers an exceptional performance with fast booting time and can run all the applications smoothly.\n\nI would recommend this product for students/ working professional as it is good for running applications like MATALAB, CAD Softwares and other office applications including gaming",
            "I have been searching for a laptop from few days and I finally decided to go for VAIO e15 . First thanks to flipkart for fast delivery.It has a great display, booting was very fast because of the AMD ryzen 5, decent battery back up 4 to 5 hours depending on our usage , body made up of plastic but looks premium and backlit keyboard was good. Speakers volume could have been better.\nAfter 5 months I've observed no major issues so far but it's heating while browsing and some light editing.",
            "Good Performance. Booting time less than 30 seconds. very fast. In built MS Office 365. In first boot don't connect to internet, other wise the system will automatically download latst Win 10 update, whch will take more than 90 minutes.",
            "A fantastic laptop bought it for my daughter and she has very much inspired to this beautiful kid. Thank you Flipkart and thanks to SONY VAIO!",
            "Good in speed very nice to handle but battery performance little bit low compare to which i expected more over everything is good like a premium laptop display is awesome in vaio..",
            "Very good and smooth functioning laptop. Even my friends and relatives are impressed very much and some of them are planning to buy it. Battery backup is upto four hours while online usage and the same works more than five hours offline. Thanks alot Vaio team and Flipkart.",
            "I'm writing this review after 5 months of usage.\n\nVaio is a well known brand. I usually check all the specifications before I buy any gadget. It works amazingly fast and smooth.. No doubt about that. These are my classifications based on my usage.\n\nFor students : It's the best in the range. It has all the specifications we need to do daily tasks by the students.\nFor Coders : Yes, It is good. As a SE, I'm using this laptop for the past 6 months and It did a great job for me.\nFor Creators : It is not much recommended as it has comparatively does low in RAM and Graphics card.\n\n8gb RAM and 512 SSD is far more enough for students and coders for sure\n\nComing to processor, It has very good processor names AMD Ryzen 5 3500u which is good in handling multiple cores.\nPS: It has some heating issue while charging.(But improper earthing could be the reason for it (In my case it is not heating once I resolved earthing issue)\nNote : It is Polycarbonate body. Do not expect to be tough and rigid. In fact, it feels delicate on the first touch.\n\nThis laptop is not recommended for rough users.\nThank you.... :)",
            "After one week laptop display issue 2 line coming from display and report to customer service and good support to change display after one week but repair agency roughly use laptop and lots of scratches in front area so laptop look like 2nd hand laptop so I recommend to don't waste buy this laptop because my laptop after repair look like second hand laptop ,so I think why I am buy this viao laptop ..",
            "After one week my experience says...\nLooks and display- 5star\nBattery drains too fast however gives around 4 hr backup\nWorking on Microsoft office is a big challenge. It's not activating on laptop even after many tries and login through paid membership as well though it was. Microsoft product key doesn't comes automatically as suggested by Vaio.\nSound ia too low , have to use portable Bluetooth speaker for online classes.\nOverall a 3 star as I am still using it for browsing and mail purpose only.",
            "It's a good laptop. But the keyboard keys are very light & loose. It can break easily. Also, there are no enough ports in this laptop. The charger provided is also missing Vaio branding, which means it's a local Chinese charger.\n\nElse, the performance is decent for day to day activities. Boot is fast due to SSD.",
            "Super laptop value for money laptop bag also super",
            "Beautiful looking. Backlit keyboard. Built solid. Also got a beautiful laptop cloth bag. worth it.",
            "It's really a good product",
            "Premium quality",
            "Aswame product\nPicture quality is very very awesome\nDisplay quality beetter tan all\nPremium looking",
            "Nice",
            "Excellent for daily use\nIt's fast, efficient and good looking.\nDisplay is brilliant\nBattery lasts about 4+ hours if ms office or chrome browsing is done.\nThe only problem is heating, it's slightly high when compared to other laptops.",
            "Everything is fine, except some issues with Wifi hardware. Still facing issue with the wifi. Initially system was not detecting the hardware for wifi. Now It got disconnected very frequently even with a good network strength. Also troubles when we try to connect with a new network.",
            "Compact design, soothing keypad and mouse board. Fast response as per cost and expectation. Microsoft office 365 valid for 1 year. Unfortunately the fan speed to too high to tolerate!",
            "Today i received this laptop. Packing is so good and flipkart take care of safety during packing.",
            "First of all This laptop is value for money and its good to use for office purpose and if you are game addict try some other laptop",
            "The laptop is great I'm happy to use this.\nIt's really awesome to see the logo design and over all performance is awesome. Go for it you won't regret it after buying 🙂",
            "I am reviewing this laptop after using around 5 months (light use only). This laptop has stunning design and display. Boot time is very less, the moment you switch on the laptop you will be in your login screen, thanks to AMD for that. Good clarity while watching movies and all. Green color light in power on/off button light is a bit annoying when use in dark esp., watching movies. Battery backup is a bit poor and also heating issue is there (can't use by lap for long time).",
            "Excellent design and light weight, booting also good. Overall nice ... Thanks to VAIO",
            "Was excited to see the product while unboxing. During initial setup, laptop was not connecting to wifi and I had to set it up via without internet option where you don't get most of the apps installed. However next day the laptop was receiving wifi signal and I had to do windows reset to begin the setup process afresh.\n\nI noticed heating issue which I also read in reviews by others. Thus I assume its a common issue in Vaio.\n\nDesign is elegant and I liked the slanting position of keypads when it is placed on the desk. However when it is placed on lap, it bothers you due to that extra projection at the bottom of the laptop which is intended to give a slanting position for keypads. Display is awesome.\n\nI haven't used the laptop for long hours, hence I am not sure about the battery performance. I have Lenovo laptop with same configuration and I was curious to perform speed test for comparison. I noticed the speed is almost same in both the laptops.",
            "Nice 👍👍",
            "Never buy,I am facing lot of problems with this laptop within 1 months",
            "Best Laptop within Range with 8GB Ram and 512GB SSD.",
            "Very good product, Value for money,Go for it\nExcellent build quality.",
            "WORST! Don't buy or regret sooner\n\nLaptop body is catching finger oil very easily from sweaty fingers and after that it is very difficult to remove it.\n\nWhen I am lifting the laptop with one hand, it looks like its gonna break. A little bit bending.\n\nKeys from Keyboard are making creepy noise while typing.\n\nWhen switching on the laptop, screen is bright from sides, and after everything loads up, it goes fine.\n\nKeys setup is somewhat different from default keyboards. You have to get used to it.\n\nType C Charger should have been provided.\n\nAfter using 5 months:\n\nThis is the worst product and worst service I have seen.\nCa\n\nmera stopped working. My request is pending since last 35 days and camera still not dispatched.\n\nWhen I call customer care every time they say we are escalating to hire management. It happened 4 times.\n\nNow, it stopped working abruptly. Not even charging.\n\nI feel moron to trust vaio. Please do not buy this brand.\n\nWorst Product in the History of mankind and the worst company without any plan for service...\n\nEdit1 : after 2 months, I got the replacement for the laptop, they gave me silver color instead of black which is 6k less. But it is ok for me. But the product quality is sooo bad that I will not even buy it for 20k.\n\nPlease avoid this laptop, there are very good laptops in the market in this price range.\n\nDo not choose Vaio.",
            "I am using this laptop for 4 month and it's good",
            "Best display quality, upto 7 hrs of battery , stylish look , lightweight,easy to carry, overall it's good product",
            "Thanks to Flipkart, i purchased this product on a massive discount! Definitely worth the buy, but giving only 4 stars as the camera and speaker quality/output is very poor. Those who are looking to buy this laptop for online classes, you need to spend few more bucks on bluetooth or external speakers.",
            "Superb display with ultimate speed..only I found one problem volume is little low and bettery draining very fast , rest is awesome..light weight",
            "Truly value for money performance laptop. Has all the features for a business use. Not for gaming though. The only feature missing is a fingerprint reader. Editing review after one month of use. Camera stopped working within 2 weeks. Lodged complaint with helpline. Technician asked me to send images of the issue!! Even after two days, he's yet to turn up. Pathetic service. Don't buy Vaio or Avita brands.",
            "Best laptop\nSlight heating issues\nOverall superb",
            "Performance and design in one device",
            "Nice laptop working very fast and speed and gaming also smooth",
            "Issue with its battery backup ,it was mentioned 8hrs+,but it dosent last for more than 4hrs without charging (in just simple browsing)",
            "Sexy",
            "Beautiful device. Met the expectations. Battery drains faster which is an issue. Overall better deal.",
            "Battery is only upto two hours , even I am using c++ software for practice .",
            "Good one and value for money 💰",
            "Best Laptop at this price segment...Go for it👍",
            "The worst laptop ever. I purchased this in Jan 2021 under the impression that this is the Vaio under Sony, which was a great laptop. This Vaio is owned by Nextgo & service by Avita. Except, for the looks, there is nothing good about this laptop. In less than a year, I have faced keyboard, display, webcam, sound and heating issues. The keyboard even got replaced but every day there is a new problem and the worst part of this laptop is terrible after sales service. Also there is no option to sell this laptop in exchange, I am stuck with this horrible product. Please do not buy this Vaio laptop, especially the amd ryzen one, you will only regret like me.",
            "Superb laptop, really osm and its value for money",
            "Nice Product",
            "Best product at reasonable price. Value of money 💸 full paisa vasul.",
            "It is superb",
            "Awesom",
            "Best at this range",
            "Nice laptop. I loved it.",
            "Very good product",
            "Design is good performance is also good but some screen bleeding problem",
            "Premium product in best price feels nice in hand. Nicely built",
            "Very good laptop in this price\nVery good looking nd stylish\nIt gives 7 hrs battery backup\nLove this laptop😍",
            "1 star cut because of delivery , they don't had card swipe machine , overall it's a good product",
            "Awesome laptop love it",
            "Camera is too poor. You can always buy another one.\nSound could have been a bit louder.\nVery satisfied with the performance.\nThe display is amazing.",
            "Thanks flipkart for timely delivery with good packaging. Overall nice laptop in 45k price range, only one can not expand the ram.",
            "#rank1 laptop in this price range ,,, go for it",
            "Smart sleek efficient\nOnly draw backs\nSpeakers volume very low\nHeating issue",
            "Premium product",
            "U won't regret..best of the lot",
            "Awesome laptop looks wise\nPerformance good too\nCamera glitched and not working after 6 months\nheating issues\nNot for heavy usage",
            "With normal work battery serves upto 4 to 4: 30 hrs..\nRest are as they said ...to me I am satisfied.",
            "display battery is best,\nslightly back side heating issu time to time.\nvery doubtfull about service.......",
            "Very very worst speakers\nVery low sound quality\nHeats up to the extreme\nVery worst battery Only upto 2hrs\nHeating issues are there in this laptop",
            "It's one of d best laptop in this range . Heating issue and speaker is poor quality . Rest all seems very good .Atleast you should provide a good speaker. Laptop bag was missing , and when I filed complain I got only 600 rupees coupon which isn't worth it. Atleast it should be 1000 INR.",
            "It's not even been 6 months, three laptop has started malfunctioning. Some keys and ports are not working. Heating a lot. Very low speaker sound. The plastic body seems very fragile.\n\nTotal waste of money. Go for any other laptop but not this one.",
            "Awesome,fully satisfied product.",
            "Quality and experience at this price is not as expected. No fingerprint reader so no windows hello feature. battery hardly 4 hours in normal use. Very low sound quality. Dont buy this laptop",
            "Review after 1 month , very bad don't go for it\nScreen bleeding , HEATS up like hell even for normal browsing.It will heat up even while watching online videos for very short time.vaio has destroyed my trust.I feel completely cheated.they couldn't use such a good processor as ryzen 5 properly.fooling people on name of onsite warranty",
            "Writing this review after using the VAIO laptop for 6 months, Didn't expect such a worst quality product from VAIO, keyboard button came out on the first week itself even it was of minimal use. Web cam is not working now. Requested for replace of laptop itself because I cannot tolerate the replacement of spare parts of a brand new product one by one. But the VAIO is offering the replacement of spare part. I wont recommend this laptop for the users who are planning to buy.",
            "It is very delicate. Not roboust to application.Not have the good primary experiences.",
            "After 5 months used battery backup very poor. Never expect from Vaio.",
            "After one week it's not working hanging issue and t letter typing automatically continuously without touching keyboard keys",
            "very very good product",
            "Not working good ,\nover heat\nshutting down automatically\nDisplay shutting down",
            "Value for my money.. Good. Thank u",
            "Very good laptop with good performance",
            "If you're facing heating issues, just go to power settings and reduce maximum processor state to 90%, the heating will be completely solved",
            "Within 15-20 days of the purchase, I started facing a heating issue which results in an automatic switch off the laptop. Also since the very first week of purchasing this laptop, I started facing laptop freeze issue while running two browsers at same time. The CPU Usage goes to 100% without using any other application except two browsers. So overall this laptop is stylish but comes with the major issue i.e. heating, freeze and slow speed. Also, the battery remains for 2 hours only after the full charge.",
            "Nice products",
            "Within 2 months of the purchase, I started facing a heating issue which results in an automatic switch off the laptop. Also since the very first month of purchasing this laptop, I started facing the issue while booting i.e. it says \" Automatic repair \". So overall my review is that this is a good laptop stylish but comes with the major issue i.e. heating. Also, the battery remains for 2 hours only after the full charge. So it depends on you what you want a stylish-looking laptop with a heating issue.",
            "It works great and specs meet its criteria , just makes a bit noise from the cooling fan .",
            "Don't buy. Has wifi connectivity issue. Only 2 hr battery backup. Display is orangish... heatting issue, just ran chrom for few min and laptop heats up. U need to be very close to wifi router to get connected. If ur r lil far like in another room, it will not connect.\n\nDesign is good but only for table. U will have difficulty placing it on ur lap.",
            "Don't buy cause my lap keyboard failed and send for service unfortunately still not serviced , company said parts not available in india and it will come from Hong kong!!!!!!!!! pathetic situation one month is over now .",
            "Don't buy it's a waste.\nIt's been 3 months since I've purchased my laptop, and every 2nd day i need to call the customer care center and nearly 5 times technician had visited me , 2 times my laptop has been picked by the technician in just 3 months .\nIn 3 months my battery is washed out.\nEvery 2nd laptop can't find it's own camera and microphone and numerous other issues.",
            "Very poor battery. Doesn't even last for 3hrs. But description promises to stay for 8hrs. No answer in VAIO customer support. Not worth money",
            "Very Bad, not worth buying this product. Getting a Support from Viao is so difficult.",
            "Sound and web cam quality is extremely poor. Some heating issues too. Rest all is good.",
            "The laptop on this budget with superb feature is just wow deal .....I liked the performance, design, that premium look it was smooth with the performance but the cooling function makes bit quite noise and even it easily caught heat at the back when u prefer bed for doing ur work for table it doesn't get heat and the microphone also as some weird voice of something the storage we get is 476gb .at last the packaging was wonderfull..i love it u must go for it without thinking so much abt it",
            "After 3month it's waste your money, automatically shutdown. Over heating within sec, frog crying sounds come from cooling fan",
            "So far the performance is good.\nLaptop should have had biometric, better body . Body feels cheap plastic.\nBattery doesn't last longer as mentioned in the sales package.",
            "Good laptop",
            "Awesome product but body build quality is so bad poor plastic",
            "If you don't mind heating and plastic body...just go for this product...\n( I don't think it will break...but you shouldn't be rough)\n( You cannot keep laptop on your lap for long... because of heating issue)",
            "Worth every penny spent. Great performance ànd design without having to spend a bomb!",
            "Noice\nFinger print magnet",
            "Frankly telling I really appreciate the design of vaio\nPerformance-4/5\nDesign-5/5\nBattery-4/5 ( Battery life is good but it gets heated up while using)\nKeyboard- 5/5\nDisplay-5/5\nOverall it is a fantastic product , looks very cool\nIt has very slim body and is very light in weight , no issues for carrying out while journey\nI suggest you to go on it without thinking anymore .\nLiked the product\nThank you Flipkart\nAlso I would like to thank e-kark for fastest delivery ( With 2 days)",
            "Nice product",
            "I'm fully satisfied 😁 owao it's amazing 😊",
            "It's battery dead in 20 days",
            "Good",
            "Worthy pick\nCamera is ok\nBut otherwise is a budget beast.\nIt's not a Sony sub brand, no worry it contains 2 yrs of warranty.\nBooting tym is too low.\nDisplay 😍😍\nKeyboard 😍😍 very soft keys\nOver all must buy😍😍😍😍❤️❤️❤️❤️",
            "may be the best office device\n* boots quickly\n* display quality is superb",
            "Best leptop\nGood leptop",
            "Nice one!!",
            "Awesome product",
            "Overall laptop is best but if we talk about the quality of the laptop is not up to the mark.\nI got this laptop in 41000",
            "battery drains little bit quickly",
            "Having issues with Bluetooth headphone connection, it says connected but doesn't work",
            "Nice laptop. Happy with product.",
            "Currently, i am using it for 3 months and here is my opinion about this laptop:-\n1. It looks and fell very primium, everyone ask u about it❤️\n2. It is very light wieght and easy to carry and Handel.\n3.battery backup is quite nice\nCons\n1. Some times u will feel like cheap build quality\n2. It will heat up quickly and have an overheating issue u can feel it easily\n3. Very low sound",
            "I love the design and build ❤️❤️ superb finish and excellent performance just go for it 💪",
            "Best performance\nBest screen (amazing )\nBattery was also good\nCamera was good\nMust buy ....\nFull value for money",
            "Very nice laptop",
            "Good value for the cost. Though it is slightly higher in price, but it is worth the investment.",
            "My most liked purchase item this awsome",
            "Good laptop with powerful mid range processor, it is has good as i7 8th gen\nSsd is fast enough and 8 gb ram is more than enough for most tasks\nGood laptop to buy for students and coders.\nCons: Fans are a bit too loud, but that is expected in amd processors\nBattery life is below average as it is a powerful laptop\nKeyboard is average for typing\nWebcam is average to below average at this price.\n\n\nPros: Great display 1080p\nGood speakers\nPowerful performance( do not play games)\nEveryday tasks and stuff runs well, can run multiple programs and switch between them without much delay\nBuild quality is good, slim laptop and also looks very premium.\nYou get a carrying bag with the laptop.",
            "Product is good\nBut heating issues",
            "After using for 1 week I would say its fast. Battery consumption didn't check yet. What I like most is ease of exchange.",
            "Amazing product by Sony..customer care support is also available ..prompt service by them",
            "The laptop performance and screen clarity is amazing but the laptop battery is not at all upto the mark. It drains out in 2 hrs .",
            "Very good",
            "For this price range its a nice choice , display and design could have been better, but overall performance is good.\nNo heating issues or battery draining issues observed. Can go for it , if you are a student or techie.",
            "Best in class. Name VAIO is enough, nice sleek design, except for battery (works 5 hrs once charged) rest all is exceptional. Better than it’s rivals in this price band.",
            "1st thing it become much heater\nYou get only 365 day home package of MSoffice\nPerformance is good but you cant expect more than 4-5 hrs battery life",
            "Very good laptop performance is very high looking so stylish with MS office 365 for 1 years.😎",
            "Got a damaged product.",
            "Good but after 6 months of use its battery life is only 1 hour maximum and if you work with charger plugin then fan will make noise and will not stop till you shutdown"
        ],
        "likes": [
            "30",
            "25",
            "20",
            "361",
            "125",
            "14",
            "3",
            "7",
            "3",
            "8",
            "14",
            "19",
            "3",
            "0",
            "1",
            "1",
            "2",
            "1",
            "0",
            "8",
            "1",
            "90",
            "45",
            "23",
            "8",
            "7",
            "19",
            "15",
            "4",
            "5",
            "2",
            "2",
            "2",
            "3",
            "3",
            "3",
            "22",
            "4",
            "4",
            "14",
            "1",
            "2",
            "1",
            "2",
            "2",
            "2",
            "2",
            "1",
            "2",
            "2",
            "3",
            "6",
            "2",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "7",
            "3",
            "2",
            "2",
            "3",
            "2",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "8",
            "9",
            "6",
            "161",
            "53",
            "4",
            "0",
            "2",
            "0",
            "4",
            "9",
            "20",
            "2",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "7",
            "0",
            "7",
            "4",
            "3",
            "0",
            "0",
            "5",
            "6",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "15",
            "1",
            "1",
            "11",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "8",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "11",
            "2",
            "2",
            "2",
            "6",
            "3",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "3",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Can I expand the Ram of this laptop to 16 gb ?",
            "Q:Is there any heating issue which is not so normal??",
            "Q:Keyboard has backlight.",
            "Q:is Backlit keyboard available??",
            "Q:It is a touch screen laptop ?",
            "Q:Can we connect wifi ???",
            "Q:Does it hv SIM card slot?",
            "Q:Is it have fingerprint sensor unlock system,,",
            "Q:Dolby audio is available?",
            "Q:Is it good for compitative coding",
            "Q:Does it comes with amoled display?",
            "Q:Can i install external graphics card?",
            "Q:How much watt is the charger?",
            "Q:Does it have RJ45 LAN PORT..?",
            "Q:Is there any issue in display with color shifting? And is the body metallic.",
            "Q:What is its generation??",
            "Q:I need the product key for activation of Microsoft Office",
            "Q:Is the ms Office is valided or has input code to do it?",
            "Q:Can it charge with type-c port",
            "Q:Can we run the html,java,python and adobe photoshop without any lag?",
            "Q:How much time taken by full charge",
            "Q:Is Fan sound will be there while using the laptop?",
            "Q:How to change the battery?",
            "Q:Can we install HDD along with SSD?",
            "Q:Is the storage expandable/upgradeable? Does it have a LAN port (RJ45)?",
            "Q:Whether keyboard is soft or hard?",
            "Q:What about graphic card?",
            "Q:Is it ok for light gaming",
            "Q:Does it have face unlock ??",
            "Q:Is it sony laptop",
            "Q:It is useful for coding or not",
            "Q:Can i do the CAD software in this laptop",
            "Q:Can I play GTA 5 and call of duty morden warzone",
            "Q:What is the average battery life ?",
            "Q:Does it contain graphics card",
            "Q:There is MS office available one year or lifetime ..?",
            "Q:DOES IT HAVE BLUETOOTH OPTIONS",
            "Q:Is it has inbuilt high quality air cooling system",
            "Q:What is the validity of Office 365?",
            "Q:Is the RAM expandable?. Does it have a finger print sensor?. Does it have a backlit keyboard?. What is the power supply rating?",
            "Q:Window 11 upgrade will be available and free ?",
            "Q:Can I use this laptop for DevOps operational work like running virtual machine, KVM, docker, kubernetes, ansible etc... ???",
            "Q:It has camera",
            "Q:How to solve heating issue",
            "Q:Is it a renewed product ?",
            "Q:Does it have led backlit keyboard",
            "Q:Is it metal body?",
            "Q:Does it contain fingerprint sensor like vivobook?",
            "Q:I have purchase the laptop and it is asking for activation code for MS Office.....It is not activated. How to activate..?",
            "Q:is m2 slot available for ram and SSD",
            "Q:Does it have anti glare?",
            "Q:1. Is the webcam 720p? 2. How much will the battery charge lasts?",
            "Q:is bag available with laptop.....???",
            "Q:Can I do video editing???",
            "Q:How is the sound quality via headphone does it support high resolution audio?",
            "Q:How many hour does laptop's charge stand ???????",
            "Q:Internal Hard disk can be added later?",
            "Q:Can I play only GTA 5 without lag",
            "Q:Is this laptop manufactured by Vaio or Nexstgo?",
            "Q:Shall we expand the storage for ssd",
            "Q:Does it have regular HDMI or mini HDMI port?",
            "Q:What is the type of SSD - NVME or SATA?",
            "Q:Hard disk capacity?",
            "Q:Can I play free fire in this laptop",
            "Q:Has it speakers",
            "Q:Does it Good For Gaming (Not Proper) & Editing (After Effects)??",
            "Q:What generation is it ?",
            "Q:Is this have removable battery??",
            "Q:What is the manufacturing date of this laptop",
            "Q:Is GST invoicing of this product available?",
            "Q:Can we expanding RAM ?"
        ],
        "answers": [
            "A:No.",
            "A:Always. you cannot use this product because of the heating",
            "A:Yes",
            "A:yes",
            "A:No",
            "A:yes",
            "A:No.., please read the specifications carefully and after that now a days there is a option for watching unboxing or detailed review of any products.",
            "A:No",
            "A:No. Heating issue is on high mark",
            "A:Yes I am doing",
            "A:No , it isn't an Amoled display",
            "A:No",
            "A:It's only 40 watts",
            "A:yes",
            "A:If daily use After 2 month the metallic colour gone. And black plastic body show up",
            "A:10th gen",
            "A:No, it’s activated as you login with a MS Account. However it’s lifetime version of Office, rather a 1 year subscription of Office 365, just to clarify! You’ll need to pay after a year.",
            "A:Valid for 1year",
            "A:no",
            "A:yes",
            "A:2 hours",
            "A:yes. lot of sound",
            "A:Not possible as battey is internally attached.",
            "A:no",
            "A:Not sure about the expansion. I won't suggest you to do it either. Else, do it at your own risk. It doesn't have LAN port.",
            "A:Keyboard is soft.",
            "A:radeon vega 8",
            "A:yes.. perfectly okay",
            "A:no",
            "A:nope....vaio is an independent company now",
            "A:yes yes pretty useful... Fast and efficient . I am using for engineering course as well",
            "A:Offcourse Yes. Ryzen 5 is meant to be a super fast processor which can handle big graphics. I myself a CISCO engineer has to extensively do networking & other security stuffs, which is buttery smooth",
            "A:Yes, you can play but radon on this range graphic of the game will be some lagging, so you can't play in high settings.",
            "A:3-4 hrs max after full charging",
            "A:no it does not ..comes with vegaa 8 integrated graphic card",
            "A:MS office is only for one year",
            "A:Yes, it has Bluetooth option and works very fast and also range is very good 😊",
            "A:Yes, but it still heats",
            "A:one year",
            "A:Yes,no,yes",
            "A:Yes, it's free",
            "A:Yes, I bought it for same. I’m practising on it now. The this is you can do this on any good laptop with GIT and Mobaxterm installed in it.",
            "A:Yes",
            "A:Use a cooling pad, perhaps? That won't really solve the issue but definitely help in dissipation. This laptop does have heating issues even if used scarcely but that is the case with majority AMD LTs",
            "A:No, it isn't a renewed product.",
            "A:Yes it does. I use it.",
            "A:no full plastic body",
            "A:No it does not",
            "A:there is no ms office package with this laptop. and you have to buy the activation code.",
            "A:Yes",
            "A:Yes",
            "A:battery is hardly 2 hours 30 minutes , web cam quality is very low , not satisfied with it.",
            "A:Yes! They are offering an amazing handy bag with this model. Looks stylish and comfortable to carry!",
            "A:You can but it heats alot. Which is the biggest flaw. If you don’t wanna waste your time and money then I suggest you to go for dell inspiron 3505.",
            "A:Sound quality is average not much effective.",
            "A:5",
            "A:No, only single SSD, I believe it can be replaced by higher capacity SSD",
            "A:no",
            "A:Naxstgo. It provides to Vaio & Avita.",
            "A:No, you have to use external hard drives",
            "A:A regular one",
            "A:NVME",
            "A:512GB SSD, Read the description",
            "A:NO",
            "A:average speakers, display is good, heating is there and overall good for its price",
            "A:Moderate for Gaming and good for editing",
            "A:10th",
            "A:nope. it is not removable.",
            "A:NOV2020",
            "A:Yes",
            "A:As the design is compact..I think It is difficult but not impossible..Try on your risk"
        ],
        "likes": [
            "24",
            "2",
            "10",
            "11",
            "6",
            "5",
            "3",
            "2",
            "4",
            "1",
            "1",
            "2",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "61",
            "25",
            "16",
            "16",
            "14",
            "4",
            "6",
            "3",
            "3",
            "6",
            "6",
            "2",
            "2",
            "0",
            "1",
            "1",
            "2",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1"
        ],
        "dislikes": [
            "5",
            "2",
            "4",
            "4",
            "2",
            "3",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "4",
            "0",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "10",
            "4",
            "2",
            "7",
            "6",
            "2",
            "2",
            "0",
            "0",
            "3",
            "7",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "4",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "3",
            "1",
            "0",
            "2",
            "0",
            "0",
            "1",
            "0"
        ]
    },
    "summary": {
        "pros": {
            "Design": "Features a stylish and stunning design and is super light making it easy to carry anywhere.",
            "Performance": "The AMD Ryzen 5 Quad core processor gives a super-fast and seamless performance.",
            "512 GB SSD": "The booting time is very less due to the presence of 512GB SSD.",
            "39.62 cm (15.6 inch) 1920 x 1080 Pixel Full HD LED Backlit IPS Display": "The display offers clear and vivid visuals and are simply amazing."
        },
        "cons": {
            "Heating Issue": "Suffers from some heating problems.",
            "1 MP Webcam": "Camera quality is very poor.",
            "Sound": "Sound quality is average. Speakers could have been better.",
            "Li-ion Battery": "Battery backup could have been better. It is decent enough but not good at this price range."
        },
        "verdict": "The Vaio E Series Ryzen 5 Quad Core 3500U laptop is a good pick especially for students and programmers.",
        "Additional Information": "RAM non-expandable, Heating issues, Backlight Keyboard."
    }
}