{
    "title": "Avita PURA APU Dual Core A6 9220e - (8 GB/256 GB SSD/Windows 10 Home) NS14A6ING541-IBB Thin and Light Laptop  (14 inches, Ink Black, 1.34 kg)",
    "product_specification": {
        "Sales Package": "Laptop, Power Adaptor, User Guide, Warranty Documents",
        "Model Number": "NS14A6ING541-IBB",
        "Part Number": "NS14A6ING541-IBB",
        "Series": "PURA",
        "Color": "Ink Black",
        "Type": "Thin and Light Laptop",
        "Suitable For": "Processing & Multitasking",
        "Battery Backup": "Upto 6 hours",
        "MS Office Provided": "No",
        "Processor Brand": "AMD",
        "Processor Name": "APU Dual Core A6",
        "SSD": "Yes",
        "SSD Capacity": "256 GB",
        "RAM": "8 GB",
        "RAM Type": "DDR4",
        "Processor Variant": "9220e",
        "Clock Speed": "2.4 GHz with Max Turbo Frequency",
        "Graphic Processor": "AMD Radeon R4",
        "Number of Cores": "2",
        "OS Architecture": "64 bit",
        "Operating System": "Windows 10 Home",
        "System Architecture": "64",
        "USB Port": "USB 3.0 Type C x 1",
        "HDMI Port": "1 x Mini HDMI Port",
        "Multi Card Slot": "NA",
        "Touchscreen": "No",
        "Screen Size": "35.56 cm (14 inches)",
        "Screen Resolution": "1366 x 768 Pixels",
        "Screen Type": "HD TFT IPS Display",
        "Speakers": "0.8W x 2 Speakers",
        "Wireless LAN": "802.11a/b/g/n",
        "Bluetooth": "v4.2",
        "Dimensions": "332 x 221 x 19",
        "Weight": "1.34 kg",
        "Disk Drive": "Not Available",
        "Web Camera": "VGA Webcam",
        "Finger Print Sensor": "No",
        "Warranty Summary": "18+6 Months Warranty",
        "Warranty Service Type": "On-Site",
        "Covered in Warranty": "Manufacturing Defects",
        "Not Covered in Warranty": "Physical Damage",
        "Domestic Warranty": "2 Year"
    },
    "product_description": {
        "Minimalistic Design": "Boasting a sleek, minimalistic design, the Avita Pura APU Laptop will enhance the overall aesthetics of your desk. And, its simple design requires little to no maintenance.",
        "Compact Design": "Weighing just about 1.344 kg, this laptop is slim and compact enough to carry with you even when you're on the move.",
        "High-quality Visuals": "Designed with an anti-glare display, this laptop ensures that your eyes are safeguarded against harsh light, thereby minimising eye strain. And, with intensified pixels in each frame, this laptop offers stellar picture quality.",
        "Effortless Connectivity": "Thanks to its multiple ports, this laptop can be connected to other devices for enhanced convenience."
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "3",
            "1",
            "4",
            "3",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "2",
            "1",
            "3",
            "5",
            "1",
            "3",
            "1",
            "1",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "3",
            "1",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "1",
            "4",
            "5",
            "5",
            "1",
            "3",
            "5",
            "1",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "1",
            "5",
            "1",
            "1",
            "1",
            "5",
            "1",
            "5",
            "4",
            "4",
            "3",
            "5",
            "5",
            "3",
            "4",
            "3",
            "4",
            "4",
            "4",
            "4",
            "4",
            "5",
            "5",
            "1",
            "2",
            "2",
            "3",
            "1",
            "3",
            "5",
            "3",
            "5",
            "5",
            "4",
            "1",
            "5",
            "4",
            "5",
            "1",
            "5",
            "4",
            "1"
        ],
        "review": [
            "This is very good laptop for beginner and this is the best laptop under this price, its battery backup around 2.30 hours, I can easily run python. ,anaconda .vs code for data science, its fast connectivity ,internet suffering is very fast and laptop run smoothly",
            "Perfect configuration as price, it would be better to use it properly, it is not suitable for business, if used personally, good, model is great. personal and office use is better.",
            "Nice laptop in this pric range no other brand gives these features in this price range good for normal uses very good for student study propose over all good laptop",
            "Nice laptop for the price, due to current market situation this laptop is good priced that's all. Specs is good only if the processor was atleast new gen athelon then it would have been great. Nevertheless this is a backup product for those who can't get any other good laptop in around 25k.",
            "Laptop is very good in looking as well as performence but battary backup is very poor.. I can not start my laptop without connecting it to charger .. If i remove charger battary will discharge within 30 minut. If they will improve thier battary quality then this laptop is worth .",
            "This product is very very very basic, only useful for internet browsing . This laptop doesn't supports dual band wifi so no hi speed internet works.\nIf you are looking for online video streaming or online classes for kids , never buy it. The video and voice is not stable at all. Overall a waste of money.\nNow i don't know what to do with this.",
            "Its a good one at this affordable price, very beautifully designed. And one more thing its a comparatively lighter in weight...",
            "its good , battery backup is not good ,general heating problem but display nice value for money and good working .so this is good not nice not best😐",
            "Best product at this price... Heating issue on load but every thing is best and product is best at this price range.. Delivery boy was great",
            "It's just okay 😀",
            "Laptop good but working bad",
            "Beautiful.",
            "Good one, battery backup is weak, but worth to money. Overall good laptop for common use.",
            "Nice product best choice for students and office work\nValue for money",
            "Ossam performance",
            "Satisfied by it's price .... And its price. Okay for student amd bussing work.",
            "Overall Laptop is Good . For entry leval laptop.\nIts build quality is weak. And it needs extra care.",
            "Good performance 👏 and budget price super deal",
            "Disappointed, Avita has cunningly toned down the specs. I had purchased Avita Pura last year with same 8GB Ram and 256 GB SSD storage and went for it again. But this laptop Amd A6 processor is way slower than the previous Ryzen 3, processor, also wifi 802.11 ac is missing, update message says system does not meet minimum requirements for win 11 and boot time is over a minute too, which was not the case with the predessor.",
            "very bad",
            "Good",
            "I bought RAM:8GB && ROM:256SSD Variant.\nColor: Gary\nCost: 24,999(without offer)\n\nPros:\nCompact design and light weight.\nExcellent build quality.\nPerformance awesome.\nKeyboard flexibility excellent.\nDisplay full HD.\nSuitable to exam preparation students && software cource students and college project works. Etc....\n\n\nCons:\nCharging max 4 to 5 hrs.based on brightness.\nNot suitable to Gaming, Photoshop editing",
            "Good looking but very bad battery not a 8 gb ram I prefer it could be better very lagging",
            "Charging problem in this laptop",
            "Overheating and slow ssd performance below the expectations",
            "The build quality is bad...... Processor is very slow battery is bad only 2 hours backup.. But overall it's good",
            "Good but screen is small",
            "At this Price range this laptop is best. After uninstalling one drive this laptop run very fast. I very happy with this products. This is a best laptop under 22k.",
            "fromLaptop at this price we can't expect much . This is good laptop but compromise in build quality and battery backup . Charging adapter is very worse",
            "After using 10days\nEverything is good in this laptop but battery backup is very bad.",
            "Suprb product",
            "Nice product in low budget 😊",
            "Super laptop for personal and office use daily.",
            "Good for students.Good specs, 256 SSD,",
            "Well i must say that in this price of 22000 the laptop is fantastic. My reason of giving 4 star is that the camera picture quality is pathetic. Rest everything is superb",
            "Get heating very soon",
            "Not much good",
            "Very good laptop 😊😊😊",
            "Good",
            "The equivalent of money",
            "Very nice",
            "Fine laptop at this price",
            "Value for money",
            "very good product",
            "Worst brand..",
            "Nice one",
            "Very nice 👍🏻",
            "Super product and value for money",
            "Good laptop for kid's online classes. Laptop has some issue found after one month of using it. Not happy with Avita. Earlier also I had Avita which was 4GB RAM and responding slow and now also it's not working with wifi.\nThe service engineer came two times. Last time he changed the motherboard also but still has the same problem. Avita is not interested to replace the laptop. Now it's useless. Not recommended at all.",
            "I ordered this laptop in flipkart and taken 6 days to deliver it after Very long waiting time.\nMoreover in this laptop battery back up is very bad. After full charging only 2 hours was running and second thing is When internet connection is going on in laptop a lot of Heat is produced in the backside of the laptop. Please check it for bring this laptop more suitable uses. But overall software performance, browsing and video suffering is very good.\nIn a brief This laptop is suitable for studen...\nREAD MORE",
            "Worth buying it !loved it 😍",
            "Everything is ok but only backup is less",
            "Good Laptop At Price",
            "Good product with the price range",
            "Ok",
            "Nice product at this price range 😊",
            "It's really worth",
            "Ok",
            "Very nice laptop ...\nBattery backup 4 hours\nDisplay good\nPerformance super ....\nNot bad budget laptop",
            "Nice product",
            "Wow",
            "Really nice,. lite wait. Lookin smart ....",
            "Ok for 25k",
            "Good",
            "Battery is good but performance is low",
            "Worst to buy",
            "1. Good Product working smoothly\n2. Worth for money",
            "Value for money super product",
            "Not up to the mark\nPerformance is different from the given specifications\nVery slow even with SSD",
            "Value for money bettry is 4 hrs continue and display quality hd means clear not visual in side .",
            "Very bad",
            "Performance is worse so many framdrops while working it was the worst thing that I ever had\nAdvise: take anything but boycott it\nIf you are very fast working man then never by it I bet you , you will destroy it with in second",
            "Not satisfied with Flipkart",
            "Hello, here I am sharing my personal experience, how i first time felt when Avita pura was in my hands.\n\nFirst and foremost, This laptop is great for student use, but only for beginners, and it's very easy to use. Nobody will face any difficulties in basic usage. Click the power button and it takes just 10 to 15 seconds to start.\nIt's not for hard gaming or programming, because the processor is of entry level.\nTo sum up all, this is made for office documentation work, online classes for students, to do homework etc.",
            "Battery backup only 2.5 hour",
            "Nice product",
            "Nice good product use office work and ki D's online classes",
            "This product is very good",
            "Good",
            "Good and it's really value for money",
            "Best in class product. The features and everything else is exceptionally good.\nQuite portable. Something you must owe. 👍",
            "Average",
            "It's good for the starters and it's in low budget. Overall the performance is okay but the battery is draining fast the backup come's around 2.5 hrs instead of 6hrs as per the specifications",
            "Battery backup need improvement",
            "It is budget tablet and one cannot aspects more.",
            "Good laptop",
            "It's ok for students.",
            "Not recommended for heavy users, but will handle day to day task. Browsing , excel , PowerPoint presentation, trading, video calls , with Microsoft edge u can easily open 3 to 4 tabs and use it.",
            "Good product",
            "Beautiful design and value for money",
            "Goi",
            "Waste product",
            "Laptop was good but performance was very poor\nI suggest don't buy this laptop for high level work like, android studio, video editing ,gaming.",
            "Only for normal use but they said 8 gbram , and also ssd, i expected more but not reached.",
            "Good",
            "Failure product",
            "value for money, its a entry level process.",
            "Very nice",
            "This laptop is avarage not gd not bd.\nBut. Bettary beckup is so weak",
            "Very good product good paraformans",
            "Best product at this price... Heating issue on load but every thing is best and product is best at this price range.. Delivery boy was great",
            "Not recommended for heavy users, but will handle day to day task. Browsing , excel , PowerPoint presentation, trading, video calls , with Microsoft edge u can easily open 3 to 4 tabs and use it.",
            "Heating problem and very slow",
            "Best deal to buy",
            "Performance is slow... Good for entertainment purpose... Overall nice notebook",
            "Super quality in this price segment",
            "Display got damaged after one month of purchase. Lot of hanging problem.",
            "Awesome product, quickest delivery i have ever seen, keep up the good work please.",
            "Adopter will b like ur phn charger.\nWith 20k u can buy.",
            "Waste product"
        ],
        "likes": [
            "182",
            "144",
            "46",
            "8",
            "3",
            "4",
            "1",
            "0",
            "1",
            "2",
            "1",
            "16",
            "75",
            "45",
            "19",
            "7",
            "7",
            "12",
            "13",
            "13",
            "8",
            "8",
            "8",
            "4",
            "11",
            "19",
            "3",
            "14",
            "6",
            "4",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "3",
            "3",
            "2",
            "3",
            "3",
            "4",
            "1",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "5",
            "3",
            "2",
            "1",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "34",
            "31",
            "8",
            "0",
            "1",
            "3",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "16",
            "9",
            "2",
            "0",
            "0",
            "2",
            "3",
            "3",
            "1",
            "2",
            "2",
            "0",
            "4",
            "11",
            "0",
            "8",
            "3",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "2",
            "2",
            "4",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "8",
            "3",
            "2",
            "0",
            "1",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Can I do programming in this?!!",
            "Q:Can we connet laptop with wifi",
            "Q:Does it has keyboard back light?",
            "Q:this laptop is applicable for Engineering student ?",
            "Q:Can I use trading platform with this laptop",
            "Q:Can l play minecraft in laptop",
            "Q:Is this fine for ms office and tally work ???",
            "Q:Can I upgrade ram up to 6gb or 8gb",
            "Q:Can I do php and javascript programming in this laptop? Also can I upgrade it windows 11?",
            "Q:How much does the battery backup give?",
            "Q:Can I play pubg and gta 5",
            "Q:Does it support Autocad 2016?",
            "Q:Can I use hard disk",
            "Q:Can I play free fier",
            "Q:Can I use this software programming",
            "Q:Can I use this laptop for video calling interviews with quality and Clarity?",
            "Q:Can I run photoshop and Corel draw?",
            "Q:Is this suitable for programming course?",
            "Q:Can I use mobile software this laptop",
            "Q:How many port are there",
            "Q:Can I use notepad in this laptop",
            "Q:HDD sport this leptop",
            "Q:Is there ms access installed?",
            "Q:Can I use emulator in it",
            "Q:Does it has notepad",
            "Q:Does it has 256 gb storage",
            "Q:Does it has 8 gb ram",
            "Q:Could I use it to learn ethical hacking",
            "Q:Can't use rahino software",
            "Q:Can I use this for data entry jobs",
            "Q:How much time it takes to restarting after update",
            "Q:Does it have fingerprint sensor ?",
            "Q:Is HDD possible to add in this laptop? And how many hours can this laptop last by just watching movies.",
            "Q:This laptop is of plastic or metallic body? Please answer this question. (On backside)",
            "Q:It has anti glare technology for eye protection?",
            "Q:Bag included...? Laptop will deliver along with bag...?",
            "Q:Can we put our CD drive in tihs",
            "Q:Can I do C++ in this lptp",
            "Q:It is having Microsoft",
            "Q:can we play roblox",
            "Q:Can we use telly erp9",
            "Q:Can I use Adobe Photoshop CC 2021 on it?",
            "Q:Can we use sim card on this",
            "Q:Have a Bluetooth connection",
            "Q:Can I run revit architecture like software in this laptop",
            "Q:Can we use photoshop 7.0 in this laptop",
            "Q:Does it provide beg with this laptop??",
            "Q:Can I work of Excel sheet in this product",
            "Q:Is it pre installed windows",
            "Q:Can we use it for tally , busy and excel?",
            "Q:DVD in this laptop",
            "Q:Does it work on internet?",
            "Q:Does it support wire less mouse and keyboard",
            "Q:Can I us online classes",
            "Q:Can i play games , games like trader life ,gas station?",
            "Q:In this laptop avita... Are we able toblur the background",
            "Q:Can i play pubg mobile game",
            "Q:Adapter ablable or not",
            "Q:Can I play PlayStation games in this laptop?",
            "Q:Is this work on mobile hotspot",
            "Q:Can I do coding in this laptop ? Does it suport Visual studio code ?",
            "Q:Is there available wifi system in laptop",
            "Q:Can i run ms office and tally smoothly in this laptop..? Pls reply me...",
            "Q:can we do java program in this laptop",
            "Q:I we use power point",
            "Q:Does it ssd expandable",
            "Q:Can I write to blog post in this laptop",
            "Q:Can I install linux operating system in it??",
            "Q:Can we insert perdrive in this laptop?",
            "Q:Can we app install this laptop",
            "Q:Can I play gta 5 game",
            "Q:Ms office was avilable in this laptop",
            "Q:Can I play roblox on this laptop",
            "Q:Can I use programing software?",
            "Q:Is there back lite keyboard?",
            "Q:Does it support edius video editting software",
            "Q:Can we play 1 gb game",
            "Q:What is the processer?",
            "Q:Can I run games smoothly in it",
            "Q:Is there a pre installed ms office ?",
            "Q:Can we play spider man miles morals",
            "Q:Can we Install Windows 11 in this laptop ?",
            "Q:Is it touchscreen?",
            "Q:Can I play fall guys",
            "Q:Does it has camera",
            "Q:How is video quality can I run 4k easily on it?",
            "Q:Can I use it for solidworks?",
            "Q:Can i use this for product a music?",
            "Q:Do we get pre-installed windows 10?",
            "Q:Can I use any accounting software.",
            "Q:Is it have a backlight keyboard?",
            "Q:Is it suitable for web development",
            "Q:Q:Can I edit? A:?",
            "Q:Can I use this laptop for basic video editing",
            "Q:Is it good for research",
            "Q:Can I used ms word in this pc ????",
            "Q:Will autoCAD work in this"
        ],
        "answers": [
            "A:no",
            "A:Yes.",
            "A:No",
            "A:This is a basic model for school students & for personal use. For engineering student choose minimum i3/ryzen3 processor, 8GB RAM & SSD model",
            "A:yes",
            "A:Yes",
            "A:not fine but gud",
            "A:It has already built-in 8GB and cannot be upgraded to any more",
            "A:no",
            "A:3 hour",
            "A:no",
            "A:ya It can support but don't use it for heavy tasks on autocad",
            "A:It has SSD Hard drive, where software is loaded and can save data too. You can also use external hard drive via usb.",
            "A:No",
            "A:yes you can use but I would to suggest go for other laptop this is not a good choice.",
            "A:No. Very poor webcam.",
            "A:yes u can run it",
            "A:Yes",
            "A:i didn't understand ur question",
            "A:2 only",
            "A:no",
            "A:Yes, but you'll get already installed ssd",
            "A:Not",
            "A:Yes, you can, without any doubt",
            "A:Yes,it's very thin laptop with light weight",
            "A:yes it has 256gb storage",
            "A:Yes",
            "A:Not",
            "A:Not",
            "A:Yes",
            "A:30 minutes",
            "A:No",
            "A:2 hours",
            "A:This laptop is of plastic body,web camera very poor.but over all performance is good at this price.",
            "A:yes",
            "A:No",
            "A:no",
            "A:ya we can code in any language just install vs code and start coding",
            "A:yes but it is not activated, tried to activate it but not working",
            "A:it's basic laptop for students.",
            "A:Yes.",
            "A:No I don't recommend this laptop for heavy work especially for video or photo editing, its meant for normal and basic use if that's ur requirement go for it,but heavy task please don't consider this.",
            "A:no",
            "A:no",
            "A:Yes",
            "A:Yes",
            "A:No",
            "A:Yes",
            "A:yes. good lapatap",
            "A:u can use tally",
            "A:no",
            "A:yes",
            "A:Yes",
            "A:Yes",
            "A:No, you couldn't, even you install it it won't give you pleasure, Go for another laptop if you want to play games. it is lightweight for study purpose notebook.",
            "A:No",
            "A:No, it's ment for the basic work only.",
            "A:adapter and mouse give me ....",
            "A:yes",
            "A:yes, it works smoothly,,",
            "A:yes. it can be used for professional work",
            "A:yes",
            "A:when I use first time it was so much lag but after update it runs well ms office run well and I didn't try tally.",
            "A:yes",
            "A:yes",
            "A:yes ,",
            "A:yes absolutely",
            "A:yes, I'm using Ubuntu 20.04 and works fine, You can install any distribution if you have bit of skills otherwise go for Ubuntu it provides user friendly Installer.",
            "A:yes ofcourse why not.",
            "A:Yes, all windows application install",
            "A:No",
            "A:yes",
            "A:no this laptop is only meant for basic use,any heavy task will lag and cause heating issues",
            "A:no",
            "A:no",
            "A:Yes, it does",
            "A:Not",
            "A:AMD",
            "A:Not",
            "A:yes but trial version",
            "A:No",
            "A:No the processor is not supported for windows 11",
            "A:No.",
            "A:yes but highly lagging",
            "A:best camera",
            "A:1020 is also not possible",
            "A:no",
            "A:Yes",
            "A:yess",
            "A:no",
            "A:no",
            "A:yes, It is suitable for it. even you could do backend development as well.",
            "A:If you are talking about video editing, You should not buy it as some extent it's fine",
            "A:Yes",
            "A:yes",
            "A:yes, you can...",
            "A:no"
        ],
        "likes": [
            "26",
            "37",
            "42",
            "4",
            "4",
            "8",
            "8",
            "5",
            "3",
            "1",
            "1",
            "4",
            "5",
            "5",
            "1",
            "1",
            "2",
            "2",
            "2",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "38",
            "21",
            "44",
            "4",
            "9",
            "33",
            "3",
            "3",
            "2",
            "3",
            "6",
            "3",
            "4",
            "3",
            "3",
            "1",
            "2",
            "1",
            "4",
            "4",
            "1",
            "2",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "1",
            "0",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1"
        ],
        "dislikes": [
            "63",
            "9",
            "12",
            "1",
            "0",
            "2",
            "2",
            "2",
            "0",
            "1",
            "1",
            "1",
            "2",
            "4",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "5",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "7",
            "3",
            "13",
            "0",
            "3",
            "25",
            "0",
            "0",
            "0",
            "0",
            "3",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "1",
            "3",
            "4",
            "2",
            "1",
            "5",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "2",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "5"
        ]
    },
    "summary": {
        "pros": {
            "Price": "Good laptop at such low price.",
            "Performance": "The AMD APU Dual Core A6 processor is very slow and the performance is just average."
        },
        "cons": {
            "Battery": "Battery backup is average. Gives 4-5 hours max time."
        },
        "verdict": "The Avita PURA APU Dual Core A6 9220e laptop is suited only for basic use.",
        "Additional Information": "No keyboard backlit, Wifi connectivity."
    }
}