{
    "title": "ASUS Celeron Dual Core - (4 GB/1 TB HDD/Windows 10 Home) X543MA-GQ1015T Laptop  (15.6 inch, Transparent Silver, 1.9 kg)",
    "product_specification": {
        "Sales Package": "Laptop, Power Adaptor, User Guide, Warranty Documents",
        "Model Number": "X543MA-GQ1015T",
        "Part Number": "90NB0IR6-M19120",
        "Color": "Transparent Silver",
        "Type": "Laptop",
        "Suitable For": "Processing & Multitasking",
        "Power Supply": "33 W AC Adapter",
        "Battery Cell": "3 cell",
        "MS Office Provided": "No",
        "Processor Brand": "Intel",
        "Processor Name": "Celeron Dual Core",
        "SSD": "No",
        "RAM": "4 GB",
        "RAM Type": "DDR4",
        "HDD Capacity": "1 TB",
        "Processor Variant": "N4020",
        "Clock Speed": "1.1 GHz with Turbo Boost Upto 2.8 GHz",
        "Cache": "4 MB",
        "RPM": "5400",
        "Graphic Processor": "Intel Integrated UHD 600",
        "Number of Cores": "2",
        "OS Architecture": "64 bit",
        "Operating System": "Windows 10 Home",
        "System Architecture": "64 bit",
        "Mic In": "Yes",
        "USB Port": "1 x USB 3.2 (1st Gen) Type A, 2 x USB 2.0 Type A",
        "HDMI Port": "1 x HDMI Port (v1.4)",
        "Multi Card Slot": "Micro SD Card Reader",
        "Hardware Interface": "SATA",
        "Touchscreen": "No",
        "Screen Size": "39.62 cm (15.6 inch)",
        "Screen Resolution": "1366 x 768 Pixel",
        "Screen Type": "HD LED Backlit Anti-glare Display (200 nits Brightness, 45% NTSC, 75% Screen-to-body Ratio)",
        "Speakers": "Built-in Speaker",
        "Internal Mic": "Built-in Microphone",
        "Sound Properties": "Audio by ICEpower, Sonic Master",
        "Wireless LAN": "IEEE 802.11ac (Wi-Fi 5)",
        "Bluetooth": "v4.1",
        "Dimensions": "381 x 251 x 27.2 mm",
        "Weight": "1.9 kg",
        "Disk Drive": "Not Available",
        "Web Camera": "VGA Webcam (without Privacy Shutter)",
        "Security Chip": "TPM",
        "Keyboard": "Chiclet Keyboard",
        "Pointer Device": "Touchpad",
        "Included Software": "Splendid",
        "Additional Features": "33 WHr Li-ion Battery, BIOS Booting User Password Protection",
        "Warranty Summary": "1 Year Onsite Warranty",
        "Warranty Service Type": "Onsite",
        "Covered in Warranty": "Manufacturing Defects",
        "Not Covered in Warranty": "Physical Damage",
        "Domestic Warranty": "1 Year"
    },
    "product_description": {
        "Aesthetic Design": "This ASUS laptop features a sturdy design and weighs just 1.9 kg, making it perfect to take it along with you when you’re going to the office or on a vacation. The stylish design of this laptop is sure to grab the attention of onlookers.",
        "Powerful Processor": "Powered by an Intel Celeron Dual Core N4020 processor and 4GB of LPDDR4 RAM, this laptop can seamlessly handle your daily computing tasks.",
        "Large Storage Space": "Equipped with a 1 TB HDD, this laptop from ASUS lets you store all your important documents, pictures, videos, movies, music albums, video games, and more in a single place.",
        "Easy Connectivity": "This ASUS laptop comes with a USB 3.2 Type-A (Gen 1) port so that you can connect compatible devices to it and experience fast data transfer speeds. The two standard USB 2.0 Type-A ports are compatible with all USB devices, such as hard drives, pen drives, and more. To top it off, this laptop also has an HDMI output port and a microSD card reader.",
        "ASUS SonicMaster and ASUS Audio Wizard": "The ASUS SonicMaster and ASUS Audio Wizard offer an amazing combination of hardware, software, and audio tuning so that you can experience rich and high-fidelity audio at all times, irrespective of whether you’re playing games or watching movies. The ASUS SonicMaster uses a professional-grade codec which encodes and decodes audio while also making use of large speakers, amplifiers, and resonance chambers to deliver rich and clear audio. The ASUS Audio Wizard software suite helps achieve the perfect audio balance for any type of sonic content. You can adjust the audio according to your preference, thanks to the manual settings options.",
        "High-fidelity Audio": "The speakers of this laptop utilize the available chassis space so that they can deliver enhanced low-frequency audio performance with reduced noise. The extra-large 19.4cc chamber delivers a clear and powerful audio output with rich and deep bass, taking your audio experience to the next level.",
        "Rich and Clear Visuals": "With the ASUS Splendid technology, every content that you watch on this laptop’s screen will be rich and immersive. This technology has four display modes, namely Normal mode, Vivid mode, Eye Care mode, and Manual mode. The Normal mode is perfect for everyday computing tasks. The Vivid mode helps optimize the contrast so that your photos and videos will appear stunning. The Eye Care mode helps reduce blue-light levels, thereby minimizing eye strain. The Manual mode helps you adjust the color according to your preference. You can enjoy enhanced image quality as the ASUS Tru2Life Video technology helps in intelligently optimizing each pixel in the video frame.",
        "Ergonomic Keyboard": "If you have to type multiple pages for your report or send out a huge email, you don’t have to worry about finger fatigue as the full-size one-piece chiclet keyboard of this laptop makes typing a breeze. It offers a 1.8 mm of key travel and minimal key float for a tactile typing experience.",
        "Stays Cool for Long": "Whether you’re playing games for long hours or binge-watching your favorite TV series, the ASUS IceCool technology tackles the heating issue by preventing the build-up of heat under the palm rest. This technology helps maintain the temperature of the palm rest surface in the range of 28°C to 35°C. The internal layout is designed in such a way that the heat-producing components are situated away from you. Moreover, the cooling from the heat pipes and vents also help keep this laptop cool."
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "4",
            "5",
            "4",
            "3",
            "4",
            "5",
            "1",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "3",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "1",
            "5",
            "4",
            "1",
            "5",
            "5",
            "1",
            "4",
            "1",
            "4",
            "1",
            "5",
            "3",
            "4",
            "3",
            "5",
            "1",
            "1",
            "2",
            "1",
            "5",
            "1",
            "5",
            "4",
            "4",
            "3",
            "1",
            "1",
            "1",
            "1",
            "5",
            "5",
            "1",
            "5",
            "4",
            "1",
            "1",
            "4",
            "1",
            "5",
            "1",
            "3",
            "4",
            "1",
            "1",
            "2",
            "1",
            "1",
            "2",
            "1",
            "4",
            "1",
            "5",
            "3",
            "3",
            "5",
            "5",
            "1",
            "4",
            "1",
            "2",
            "1",
            "4",
            "4",
            "5",
            "5",
            "1",
            "2",
            "1",
            "1",
            "1",
            "3",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "3",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "3",
            "5",
            "5",
            "1",
            "4",
            "3",
            "4",
            "1",
            "1",
            "3",
            "5",
            "5",
            "3",
            "1",
            "1",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "3",
            "1",
            "4",
            "5",
            "4",
            "1",
            "2",
            "5",
            "1",
            "1",
            "4",
            "5",
            "5",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "3",
            "2",
            "5",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "5",
            "1",
            "5",
            "1",
            "3",
            "1",
            "1",
            "1",
            "3",
            "5",
            "4",
            "1",
            "5",
            "5",
            "4",
            "5",
            "2",
            "1",
            "1",
            "1",
            "5",
            "1",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "1",
            "4",
            "1",
            "1",
            "1",
            "1",
            "1",
            "5",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "5",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "4",
            "1",
            "1",
            "1",
            "1",
            "1",
            "5",
            "1",
            "1",
            "5",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "5",
            "1",
            "1",
            "5",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "3",
            "4",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "4",
            "1",
            "1",
            "4",
            "4",
            "3",
            "3",
            "1",
            "5",
            "5",
            "4",
            "4",
            "5",
            "1",
            "1",
            "1",
            "3",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "1",
            "4",
            "1",
            "1",
            "1",
            "5",
            "4",
            "1",
            "1",
            "5",
            "3",
            "4",
            "5",
            "5",
            "4",
            "4",
            "4",
            "1",
            "5",
            "5",
            "4",
            "4",
            "4",
            "4",
            "1",
            "5",
            "1",
            "5",
            "4",
            "3",
            "5",
            "3",
            "5",
            "4",
            "1",
            "5",
            "5",
            "1",
            "3",
            "1",
            "5",
            "4",
            "5",
            "2",
            "1",
            "1",
            "5",
            "5",
            "1",
            "1",
            "5",
            "1",
            "1",
            "5",
            "1",
            "1",
            "1",
            "1",
            "5",
            "1",
            "5",
            "1",
            "3",
            "4",
            "1",
            "5",
            "5",
            "2",
            "5",
            "5",
            "3",
            "4",
            "1",
            "1",
            "1",
            "3",
            "1",
            "4",
            "1",
            "2",
            "4",
            "5",
            "2",
            "1",
            "4",
            "1",
            "1",
            "1",
            "5",
            "4",
            "1",
            "5",
            "3",
            "5",
            "1",
            "1",
            "3",
            "4",
            "4",
            "4",
            "4",
            "5",
            "3",
            "1",
            "5",
            "2",
            "5",
            "2",
            "1",
            "5",
            "1",
            "1",
            "5",
            "3",
            "3",
            "4",
            "3",
            "5",
            "5",
            "4",
            "2",
            "3",
            "5",
            "5",
            "5",
            "1",
            "5",
            "2",
            "3",
            "3",
            "1",
            "3",
            "5",
            "1",
            "1",
            "5",
            "3",
            "5",
            "1",
            "1",
            "3",
            "1",
            "5",
            "3",
            "2",
            "1",
            "4",
            "1",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "2",
            "1",
            "1",
            "3",
            "1",
            "2",
            "1",
            "3",
            "1",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "2",
            "5",
            "3",
            "5",
            "1",
            "1",
            "5",
            "3",
            "3"
        ],
        "review": [
            "It's very good to this price.....I really thankful to flipkart 😊😘.... it's very good experience with flipkart.... thank you...💙",
            "Seriously awwsm .. pls go for it without any hesitation.. the performance look wise so good budget friendly... Can be used for online class, online xms, browsing,and also for mid range games, basic level programming tally and all.. preferable to clg students",
            "Performance are too good and friendly budget and also I love to buy this product very happy to this thanks Flipkart for the lovely product ❤️☺️.\nI'll give 5 🌟🌟🌟🌟🌟💯",
            "I am happy with this laptop. Good for basic use at home. Good for kid's use also. Battery is good - runs more than 4-5 hours. Not happy with Display and no caps lock and number log indicator light.",
            "I have just received the laptop today and am very excited to use it.Must say that at this price range it's one of the best laptops to buy without thinking once.Must buy if you want a decent work laptop with good specifications at this price range.",
            "Its my review after used after 5 months.\nIts not a valuable laptop for study or any smooth working purposes.\nIssues:\n1. Connectivity issues I m facing now. Specially usb port.\n2. Battary performance was well for first 3 months. After it drains quickly without any playing video or audio. Only pdf reading it running hardly 2 hrs.\n3. web camera is very bad performing like 0.3mp.\n4. The processor also very slow and sometimes its hanging that one can't move for other work.\n5. In sunlight one can't see the display correctly.\nConclusion: I don't recommend to purchase asus laptop. Go to any other companies.\n\nIf the person who wants for storage and only for audio or first learner then he or she can go for purchase it. It will be good.",
            "it's quite good ,and one important thing to do while updating win 10 or download win 10 don't turn up your laptop it's quite risky when you download your update quickly install and restart it\nand we are thinking about display quality it's good you can also play video upto 4K on youtube but first of all I think display quality is very poor cause of TFT panel but wrong TFT panel is also good but not like that IPS .\n\nWhen you use it for office work then download WPS office it's good and features like World office",
            "a god product for students, i'm writing this review after use of 1 month, if you use it only for online class and watching you tube then it's best for you & also its consumes less data if you setting in metered connection. so don't worry about data consumption.\n\npros- good battery back up & charging very fast, clear resolution screen and it's comes with a classy look\n\ncons- a little bit slower, * It's takes 30-40 sec to open and after open it takes 3-5 sec to being ready to use and the refresh process.\n\n# you can't run smoothly video/photo editing software on this.",
            "It is worth laptop who like to prefer to attending online classes, watching movies, simple ms office works. It built quality was good and key board was average it is 180 degree screen rotation.when to talk about performance we can tell average and we unable to run multi apps at a time and it takes long time to restart when laptop is updated and it has average camera quality and when compare to other laptops it not have LAN support and main drawback was we don’t know if caps lock is on or off (no light indication). Over all at this price it is worth to buy it has 1 year warranty but after few days we get notification of extension of warranty for another 1 year it is good to have total 2 years warranty for this laptop.",
            "Writing this review after full 24 hours of putting this machine to grind. I bought this with a certain kind of apprehension, wondering the budget I had, the choice made after thorough research and the product chosen would cater to my needs or not? However, this piece of beauty is well equipped to go smoothly with my expectations of a big clear display, clear voice and word/pdf typing/reading works. A word of caution to the gamers though.. Don't go for this if you are into high end games. Othe...\nREAD MORE",
            "Product was good while delivering...\nThe laptop works slow for first two days now it is ok...\nI like it...\nIn below 30,000 range laptop,this was worth with windows 10...",
            "Its very beautiful looking so good and stylishly leptop run is",
            "The webcam quality for video calls is very bad\nAnd it takes aloot of time to open each file or folder\nAnd the display quality is not good.\nFor basic kids use only .\nonly look wise its good\nDon't buy better add little more money and buy i3/i5",
            "Overall below average laptop not worth buyin nothing noteworthy pretty much not worth the money\nPs: not recommended to buy only if u can custom install and remove the stock parts",
            "Laptop is good for kids ..school or secondary laptop for movies and also for older folks who just need connectivity.. like skype and social.\nFor 17k this is a good deal. 1TB for storage and 4GB ram does the light lifting.\nDont expect this to do any fancy gaming or programs..what you pay and the purpose is key before selecting this laptop",
            "Very Good in Display Quality.\nkeyboard /Mouse Good.\nProcessing is something , just something slow....but its good..\nOver All I found this A Great Office work Laptop , so that i want.\n5 mein se phir bi 4.5 dunga..",
            "Best laptop in given prize range..battery was gud but processor running slow..overall laptop was good for simple works",
            "Nice product for normal & jenuine home use only , and value for money. Proud on me for good choice",
            "It's a decent product at a price of 20000. Does the job at the price point. Dont expect it to behave like i5 or i3.\nBut overall good product",
            "1. Delivery was sooo fast.... Thanks a lot for that. Seller and Ekart.\n\n2. Design- Good and weight also perfect for carrying.\n\nKeypad color is not adjusted as per the product color. It is very problematic to use. No capslock indicator as well as numlock indicator. All USB ports are in one side.\n\n3. Screen - Very good. It's carefully for eye. Very soft looking. Display quality is very good.\n\n5. Performance- Good. Little bit slow to open excel those are greater than 1mb.\n\n6. Battery - Not good but no heating issue. Maximum 2 hr for continuous usage.\n\nOverall- Good. Value for money. ( After 2 week of using )",
            "overall good... value for the price ...but not for heavy works .. it's ok for basic works like web browsing, emails, office works - excell, word etc.",
            "Amazing product under this price range. It's stylish design, powerful processor and budget friendly is perfect for basic use. Really thankful to flipkart for delivering this amazing product on time.",
            "Good quality",
            "Nice product should buy this if you have low budget",
            "Best products but processor shlow..,",
            "Nice laptop",
            "Very Nice feature in low cost",
            "Product is good but battery not strong....",
            "Nice",
            "More than expected",
            "This is the best budget laptop..\nI bought it for 18990 on a sale.\nGood laptop\nBut performance is not as expected.",
            "very nice product in this price range, no hanging issue i recommend you to install asus optimizer for a incredible performance",
            "Very good for normal work",
            "Nice product 😂",
            "Design best but no light numeric and caps lock On off.\nPerformance is lower.\nBetry backup Average 3-4 hour.\nDisplay Good.",
            "Very nice 👌 product net speed 👌 osm prosesing normal looking *****",
            "Its best for general use like online study.Best at this price.Thanks Flipkart",
            "This laptop in so good and look is very wonderful.\nThanks flipkart",
            "Full laptop is very good but slow 🙂",
            "Very nice laptop for study and design is very good with osm performance thank u flip kart",
            "Nice but for light use only",
            "The laptop wont start when received. Flipkart has some misleading claims as now they say that replacement will be done only after Asus technician visits and checks the laptop. So one will end up wasting time and will have to deal with unnecessary haggling for no fault except buying a lemon product from Flipkart. Pathetic fine prints policy.",
            "Dilevery was two days delay but awesome product",
            "Good Laptop for Beginners...",
            "Laptop stopped responding from today (purchase date 29 Dec 2019)",
            "Good laptop",
            "Best laptop.overall performance is awesome..myst buy",
            "Absolutely waste of money. Do not buy this laptop. It's so slow that you can literally miss whole class by the time it boots and connects. It cannot perform basic documentation even with minimal needs, you can finish 2 cups of tea by the time it is loading applications. Restarting this is absolutely headache and just keep seeing the circle in front. Sometimes it appears that there is no processor inside. Bought it for kids online class with basic functionality but my 'chintoo' threw on day one and I find it a shot product.",
            "Quality and Design is Super good,\nBut the only drawback I found after using it for 2 hours is its battery performance..\nProcessing is some what lagging when I have started it for first time for setting up and installing some programs.\nFinally it is enough for that price range..",
            "Don't ever buy this product trust me you will suffer later...don't buy this product",
            "Ok",
            "Dont buy this laptop.. it stopped working within 15 days.. completely switched off.. not getting turned on..",
            "very best product",
            "Best at this price",
            "Good",
            "The laptop is best in very cheap price",
            "Light weight, much better than expected.\nThank you so much dear flipkart😊🙏\n1st day service awsm 👍",
            "One of the worst laptop ever .Review after 25 days of use. Happens daily . Very slow at performance and requires 20 mins just to start up . On start up it nearly takes 15 mins for any application to open . Hangs continuously . Asus customer service support is also bad , they keep us on hold and never returns the call . Made the worst decision ever purchasing this laptop . Have to spend more to add accessories like RAM etc .",
            "Waste product, always hanging while starting the windows it's keep on hanging, packing also very worst.. Please don't buy the product by seeing the photos and features, going to return the product",
            "slow",
            "7 days work okay but post returned policy laptop got hang, stopped working getting load what..kind of product are selling on your portal??worst product don't waste your money .",
            "Its so nice",
            "Waste of money",
            "Chief &best",
            "Nice laptop for students. Not for heavy user.Very lite weight laptop and good in performance. Asus give a nice product.",
            "Cooling system is very good. As per price range it laptop is Good. Not for heavy task but Good laptop.",
            "Performance not good.... display, battery are good and sound awesome 🔥I expect little more performance..offenly it not switch on, lately on...",
            "Totally disappointed with the product. It was slow right from the first time use. It has started making some noice just after the end of return policy. But the design is really nice and the delivery was made on time.",
            "PRODUCT IS NOT UP TO THE MARK AS SHOWN ON THE WEBSITE , FLIPKART SAY REPLACEMENT POLICY BEWARE THEY EVEN DONT PROVIDE THE PRODUCT UPGRADATION POLICY.\nVERY SLOW,\nSLOW WIFI CONNECTIVITY,\nHANGINNG IN SEARCHING FROM THE TASK BAR.\nMAKE SURE DONT FALL FOR THE TRAP LAID BY ASUS.",
            "Very very bad products don't buy this product guy's",
            "After 15 days not working this product",
            "It was nice product in lower cost",
            "Nice laptop . I am writing this after 15 day use. Best at this price",
            "Slow ....keebord not work\n6math",
            "Nice laptop Im happy",
            "Nyc laptop in this price design is awsm❤️\nThere is a small lag when we browse..",
            "Very slow, not up to the mark....",
            "Don't waste money on this product.\nIts very slow.\nStop inbetween your work.\nTakes long time to open file folders everything.\nEven you can't take online classes properly in one go from this device its takes large time for every action.",
            "😍😘😘😘😍Thanks flipkart &asus",
            "Please don't waste your money on this. It is the worst laptop I have ever used. It takes 5 to 6 min to open simple app like microsoft edge, ms word. Etc. It is too slow can't even rely it for typing",
            "Tooo good 🤟❤",
            "Booting problem add 2 3 more thousand on your budget and get good config laptop.",
            "Average km",
            "Good laptop for daily use\nbut not for gamer\nScreen is good also speaker",
            "Don't buy it. It taking longer time to switch on. And processing speed is very slow.",
            "Don't even consider this laptop just for cheaper rate. This laptop is a trap in this rate. Just after 3 day use . The laptop now don't even turns on. If by chance it turns on by mistake u can't see anything all blank .",
            "This is not good product it's prosesser is verey slow image not clear it is very bed laptop",
            "This is most worst laptop i ever purchased it cost me 24000 and then too battery and charging problem starts as soon as u start using it .bilieveme never bythis product",
            "Late delivery of a crucial product !\nCaps lock key doesn't even have a light to indicate if it's on unless we type and find it out!\nNeither invoice nor guarantee card provided.\nSlow performance and average battery life.",
            "Very slow processing speed.",
            "Not at all happy with the product as the keyboard is uplifted as in the keys are coming out, it hangs and works very slow while using Excel and inspite of being a brand new laptop it restarts very slowly. Have no option other than getting it as replacement as per the sellers policy. So waiting for replacement to come and see what happens with it.",
            "Osam product",
            "Very Bad product and services",
            "Best",
            "Good for beginners , online classes etc.",
            "Its really slow machine and took minutes to boot. I have updated window as well but speed is really slow. Actually dualcore works only with xp not for window 10. Better if you can few more thousands and buy I3 or i5",
            "Good",
            "Fantastic look... Thank u flipkart",
            "Full hanged laptop",
            "It is great product in small budget 😊",
            "Who the hell used this laptop, it is very worst, how you gave 3.9 star.... It is worst product... Without opening any Task the disk size is crossing 100% and CPU as well... Dont buy this product...",
            "I brought this laptop for my kids online classes, Look and fill is fine, but speed is very slow, my recommendation is don't buy this product.",
            "Never trap on this product too slow, build quality also worst",
            "overall good with this price range",
            "In this range it's very effective for those who are only want to normal use like online classes,browsing etc. We can say it's only for beginner 😊",
            "Thankyou flipcart",
            "Damn good 😍 lovable 😍❤️😘",
            "Laptop is not turned on after 20 usage and waste of money. ASUS support team is too lazy and no response from them",
            "Not upto that i want and i think so much slow processor don't buy please if you have budget then only purchase another lap top don't purchase this one with low budget",
            "Very bed laptop",
            "Waste of money",
            "This is not compartable to online classes it's very poor quality",
            "Performance is not good. When you click on some file or folder or running program it takes 20sec of time to open so it's very disappointing",
            "Very bad product\nDisplay problem",
            "Very poor",
            "this product is very cheap.",
            "Don't waste money...",
            "This laptop works really slow. Don't buy it, otherwise, you will regret your decision.",
            "This is just a box with screen nothing else\nPlease save your hard earn money, don't waste upon this",
            "Very bad",
            "Number keys are not working 🤯🤯🤯🤯🤯🤯😡",
            "Slowly performing",
            "Third class product",
            "Very bad product do not buy it.. don't waste money over it...slow processing....taking 5 minute to open",
            "Waste of money.. it's not working after one week",
            "Laptop is more slow",
            "It's design and memory are very attractive but processor and function are very bad. Very slow functioning, even for start the computer there have taking more than 15 minutes. I am very disappointed by this product",
            "Slow network.problem ....... very bad experience",
            "Don't buy this laptop. It is very very slow to start and also load anything. And paint will go off in case if you sanitize it. After a month the charging is not working.",
            "Lagging problem",
            "This product design is good 👍 but processor is very slow, battery backup is better ( 4-5 hours) so i will suggest you don't buy add some extra money and buy SSD involved laptop",
            "Damaged product and windows takes time to startup",
            "Very worst product. Don't try to go with this product.",
            "Very worst laptop really don't buy this very slow and stroke",
            "Waste of money\nVery slow system",
            "I want to replace my laptop but not respond from asus team and Flipkart team",
            "Nice Laptop in this Price good Deal",
            "Verry poor laptop",
            "extremely slow...worthless",
            "Laptop is very good",
            "Performance is pathetic",
            "Very slow,do not buy",
            "Very slow processer and get hanged even while we operate excel sheets",
            "Body break & nutt lose",
            "Bought just three days ago. Looks okay. Light weight, good display, bigger keyboard buttons. 1TB hard disk in this price. overall great. However, If Asus can reduce the size which will look attractive, whole plastics is been used instead if they could have used metal, that would be essential. In India we all need low cost laptops for school or small business purpose. And a one more feature essential can make this laptop popular is the backlights in the keyboard.\n\nNo company pays attention to this",
            "awesome in this PRICE...\nlooks good..\nprocessor work good..\nram is 4GB & 1TB hard disk at that price is very awesome..\nBest for first time buyers.. and college students",
            "The laptop is good and perfect for freelancing and doing some college works and only thing which I find a little bit of a problem is sometimes it work slow and take a bit much time to open any app or settings etc.\n\nBeside that everything is good!",
            "Warmest laptop",
            "Nice product for children studying upto 12. Overall performance is good including battery backup.",
            "Average....good for beginners",
            "It is amazing product in this budget\nBut not useful for any multitasking works but for students ✌",
            "not good ... very bad product.",
            "Very bad laptop",
            "Good laptop but battery back up very low",
            "Nice",
            "Awesome laptop",
            "Very Use ful laptop I Am Very Happy",
            "It revealed later that I have been fooled",
            "MS office not supported. Other window also have not supported",
            "It's so good in this price",
            "Good product",
            "Better for student's",
            "Please Don't buy it..WASTE OF MONEY!!\ni am very sad now after buying it😞",
            "Nice product and fast delivery from Flipkart",
            "it is a good laptop for students but not for gaming It was best expirans for me",
            "Overall I would grade it 3/5.\nDisplay colours are very dim may be because of anti glaze screen.\nStorage is pitiable.... even my 7 years old Lenovo has got better storage than it.\nAnd the worst thing is that I received the product with two minor dead pixels' line at the bottom, these pixels are visible in the pic just above the logo ......\ngoing to opt for the replacement.......",
            "Awsm product means that's too good nd it's processor is also not too slow ..... I m very happy for this I love it 🥰🥰🥰🥰",
            "Superr",
            "I purchased this laptop good but very slow .\nBattery backup 4 hours .",
            "Very slow don't buy",
            "Yerry good",
            "Good",
            "Love it",
            "As per price it's Good product",
            "Bad laptops and bad services bad performance i need my money dont trust and dont buy this laptops",
            "Not so good,, too much hang,\nDon't waste your money..",
            "I think it's value for money product",
            "DO NOT BUY\nAfter one month I also write don't buy this product. The speed is too slow to meet the demand. The performance is too bad and it is not worth giving it a review of one star .",
            "Worst product till date.\nHangs a lot.\nI loved Asus laptops but now I'll prefer Hp.\nAfter updating it's just hanged as I've shown in picture.",
            "Nice",
            "Excellent item at this price",
            "Excellent look,performance, display,sound and battery backup everything is perfect guys go for it",
            "One of the worst laptop I have ever used. It takes around 15 mins to jus start. For opening chrome it will take another 15 mins. If at all chime is open it will hang. Waste of money and waste of time",
            "Please dnt buy this laptop, boot time takes 20-30 mins hanging problem too much.\nAnd there is no replacement from Asus, totally waste of money product. Go for i3 processor and SSD's laptop.",
            "It is vary worrest product and worrest flipkart",
            "Laptop running dead slow",
            "laptop is very very slow",
            "NEW laptop lags. Can't even open a browser soon. Once you click something you have to wait for sometime to see whether you can proceed further or not. Not even stored anything on system and yet facing these problems. Don't buy this just because of low price. Don't feel like open the system:( don't know what to do with this now ;(",
            "very slow processing",
            "Please don't buy this lap. Take 2-5 mint to start",
            "Awesome product..Worth buying.",
            "Slow",
            "Slow laptop",
            "NOT FOR Gaming and small amount of editing bad for gamers please not buy (gamers)",
            "Worse laptop ever",
            "Very poor performance. Very slow processor",
            "Never buy this laptop , taking too much time for start.\nWasting a lot of time while open",
            "Very bad product",
            "Never buy Asus laptop .....very slow laptop....No return policy from Flipkart if you receive defected laptop and in case your laptop working very slow.....After purchasing new laptop it is not working like Lenovo laptop who I had purchased in 2009.",
            "no use",
            "Supper",
            "Laptop is very slow you cannot even type single letter it is very very very slow and bad performance and now seller is not replacing the item",
            "Superb working",
            "This is review after using 3 months. It is very very slow, even it is not worth for simple tasks like online classes, MS office use. Not recommended.",
            "Performance is very poor",
            "Worst Product... Very very very slow... Also the screen pasting is not proper...",
            "The worst thing I ever purchased in my whole life...1. YouTube videos are lagging, 2. The screen clarity is not upto the mark, it is as worse as a 5k rupees tablet, 3. Supremely disappointed.",
            "laptop hangs always......",
            "After 5 months update:\nWorking Fine.\nAfter purchasing windows need to be updated to get smoother experience.\nWorth for the price.\nDon't expect too much. Basic use only.",
            "Very nice laptop. You can buy",
            "At this Price product is awesome",
            "The laptop hangs now and then ! I bought it 5months back and now it’s gone ! I am searching for how to get it repaired all data lost ! I would suggest to buy higher configuration refurbished laptops instead , if budget is low !",
            "Delivery wonderful..",
            "Pls add an update to improve display color, it's yellow now",
            "Value for money",
            "Nyc",
            "Too slow, not of any use. The price was less but the quality was too poor. Did not expect such slow performance.\nYou need to wait for a long time after you opened any application.\n\nNot returning because I don't want to go through all the returning procedures during this pandemic.",
            "Only students",
            "It is too slowly, sometimes it stacked and went off while using it....Don't buy it just a waste of money",
            "Laptop is good but very slow at normal use",
            "good product",
            "You will feel that you are using weak laptop",
            "Awesome product in low budget",
            "Best",
            "With in this range of price fabulous",
            "Let's see it\nJust purchased",
            "Good laptop at this price",
            "Budget laptop",
            "Don't buy",
            "Quality is good but battery and keypad low",
            "Worst performance, don't buy anyone please",
            "Please don't buy....very slow",
            "Don't buy",
            "Very bad laptop",
            "Not warking",
            "Excellent",
            "Very very very slow laptop, totally waste of money. I am very disappointed that my money ruined on this bogus laptop. This laptop is not recommended to anyone.",
            "Not starting after 3hour charge as per mentioned on manuals kindly help",
            "Ery bed product and very slow system and software .",
            "porr product don't buy\nonly 3days use and verry to much problems",
            "Bad bad bad ... don't buy. Waste of money",
            "It stopped working after 3 days worst product...",
            "As per the given instructions it is very slow hence I have returned the product",
            "very bad qulity",
            "Problematic after a month. I bought this for my father who uses it only for browsing. Even then, it has a disastrous performance. Boots horribly slow, sometimes it just gets stuck and nothing works. This is not at all a worthy laptop, how much ever low the price may be.",
            "Nice prodect osm Paisa vsul 😅😅😅",
            "No one help me, windows not started",
            "Perfomance is very poor. Booting time goes anywhere between 3-7 mins. Pathetic perfomance. Never buy",
            "Really bad quality",
            "its very worst product. very slow asus employee come and check he said it is the cepacity for this product. they did not replace. money weast.",
            "Please don't buy for office purpose.",
            "very slow, not at all usable",
            "Worth for money...enough for students online classes",
            "Dont buy this laptop. Hanging problem and very slow processor.",
            "Very poor performance overall. Extremely slow for basic operations also.",
            "poor performance display not visible very low brightness.\n1. slow\n2. brightness\n3. keyboard light's not available\n4. poor performance\n5. weste of money.",
            "Very slow start and hang out or wifi connection is bad . battery power is very chip quality",
            "Too bad, Infact it has gpu but it is not also for light work if there is minus rating,l would give it.",
            "Battery was not good performance but all other performance are good",
            "Its very very slow performer laptop.from the first day it is being hanged.it take lots of time to boot up",
            "Charger is missing from this laptop",
            "very nice product",
            "This is the worst purchase of my life. The day I recieved it charger stopped working. The laptop is slow like snail. It takes 15-20mins to boot up. They have installed windows10 to this inferior configuration which makes it more worst. Moreover, when I contacted Flipkart to take it back they said it can only be replaced for which they want me to wait 16 days. Please avoid purchasing electronics from flipkart if you love your hard earned money.",
            "Charger 🔋🔌dosent work after 10 days. No help from anyone",
            "Poor quality",
            "Display is worst and it’s going inside when u press the display and the system is too slow",
            "Verry bed",
            "Very bad product, I bought 15 days before 2 time my product not working, I can’t believe flipcart plateform any more, if seller not ressolve your problem flipcart also not support.. very bad experience this product",
            "Very very slow the processing for new page have to wait20mins... better my 5yrs old phone... waste my money on this laptop.. much much disappointing wit this laptop....",
            "Old processor dont buy it.. It's waste of our valuable money",
            "Prosser is slow",
            "Not at all good laptop. Really worst laptop ever seen.. Very slow, because of this laptop I lost my job..",
            "Office not pre-insttal , and very slow",
            "When I got this product. After 10 days its not doing. It's not charging its not switching on. What I do???",
            "Best for Students. Buy a wireless keyboard & mouse and you will be satisfied with built quality issue . Best for use at home . This is my 2 months review. I am satisfied.",
            "Not good enough",
            "It is very sholw and very bed parformanc",
            "Nice laptop.",
            "Bad product",
            "Bad",
            "Not using Microsoft word",
            "Hanging problem and performance is very slow 😔😌",
            "Very very slow laptop.don't purchase it.very very very slow.",
            "Low range model\nPlease don't buy waste of money",
            "Third class and worst product",
            "Battery not charge more than 60 percentage",
            "sys. working very very very slow\nbuild quality of laptop very poor just like baby toys\nreturn policy in not available\nvery disappointing with this produch\nwaste of money",
            "Not worth buying this if investing 20 k kindly refer to a second had insted of this one",
            "Very slow processing",
            "Dont buy laptop doesn't seem to start",
            "No start the device",
            "Good product with an affordable price",
            "Satisfied",
            "Totally wastage of money..",
            "When we got product its performance is worst after few day software window 10 also corrupted now not getting on,,",
            "Very slow processor",
            "Failure WiFi card , don't buy this model.",
            "it’s very horrible.I never expected this type of waste product from a reputable tech company.I was really disappointed",
            "The laptop hangs most of the time and shuts down automatically for hours and days.",
            "Ms office licance problem",
            "Hello Seller Sir,\nI wanna tell you that I turned on my laptop today but it's showing black screen 😑 🤨 😵\n\nLet me know fast ✓",
            "Very slow",
            "Nice lap top value for money",
            "Not working well and after few time it was hanging . To much slow laptop and respons by any of them",
            "Verry slow oprateing",
            "Nice laptop in a low budget. If you are not a gamer or need a laptop for your personal use you must go for it. Worth the money....",
            "Good laptop at this price\nDesign is super\nUsed for browsing, watching movies etc\nCamera is not good",
            "Slow function, battery is best sleem design",
            "Average",
            "My laptop 3 days to problem Windows not open 😭",
            "Very low",
            "For less price the product is really good. Performance is also good.",
            "Giving my review after 2 days of use. It is good for normal use. Battery is around 4 hours of constant use I.e. video and net surfing. Those who want quick processor performance, should not buy this. Processor is bit slow. Moreover one should not expect great performance in 18k. Otherwise it's good.",
            "Iam 7 days used this product . Maybe a good product in this price . But some times gallary is not opened I dont know what is the problam . Keyped not good Camara avg Battary avg , processor is slow best for study purpose and small internet browsing",
            "Performance was good For price",
            "It is slow working disply is bad qulity battry is not proper work\nAnd slow broging working it is bad qulity west of money😞😡😡👎👎👎",
            "Not worth the money",
            "Plz don't buy this... waste of money..it will take soo much time to open any app....pls don't buy this..now it's not working and opening..worst",
            "Fantastic products",
            "Performance is terrible very slow....",
            "Best laptop",
            "Performance wise it's little slow...but after few days of regular use its value for money\nBattery lasts for 6-7 hrs with continue work...otherwise can last for 2-3 days",
            "Worst laptop ever... it takes atleast 20 minutes to turn on... n once its turned to start any process another 20 minutes... literally nothing works... very disappointed",
            "Nice working",
            "Value for money so nice buy it complisery so nice must must must buy it complesery",
            "Very nice performance and also good price",
            "Do not buy this..you will feel it is value for money but you do not get anything. The speed and performance is horrible. You cannot even open 2 tabs at a time. I tried to increase RAM but cannot do it as it has 4 GB inbuilt RAM and you can only add SSD which is costly. They lied that you can increase the RAM by 16 GB but you cannot",
            "Good product, value of money satisfaction",
            "Nice laptop",
            "Very satisfied laptop run 4 hour when fully charged reàlly help me a lot for my work. Performance is also good when operated softly",
            "Disgusting laptop",
            "Very nice and best product.",
            "Very bad don't buy this product and very bad delivery of buy flipkart bad product don't buy it please did not Product very slow waste of money",
            "Very Slow Machine! You can't even browse smoothly.",
            "Response is very slow.\nNot as good as my expectations.",
            "Nice laptop💻",
            "Affordable",
            "Hanging problem ,.. I had brought for my college use but I can do anything because of the hanging problem",
            "Very bad laptop don't even think to buy it it's having celeron process which is too slow & very old processor and the main thing is that flipkart has not provided any such information.. can't even return it .. Asus is fooling their consumer in which flipkart is supporting them.. The screen freezes each time i start the laptop it runs too slow it responds 4-5 seconds later after clicking..\nAn honest review don't buy it💔",
            "Love it..",
            "Keyboard was not good. Overall ok",
            "Good laptop in this price range.",
            "Nice for increasing watch time",
            "Very good product",
            "Nice but processor is slow",
            "Bought king...",
            "Is always good in this price is awesome",
            "Light use",
            "Nice product thank you flipkart",
            "Super best quality",
            "Good product",
            "Battery Avery time low .",
            "Good one with the budget",
            "Using this device since 1 month, so far good, worth for money, however camera quality is very poor...",
            "Keyboard mistake\nVery slow processor",
            "So far so good 🤩",
            "Very bad products. I request to you all don't buy it",
            "Nice 👍 product tq flipkart",
            "It's a good product for low budget. Battery performance need to be work",
            "Avaarage product",
            "In the budget laptop",
            "Very slow",
            "Good product",
            "Buy it only if you have patience while working. It lags most of the time. Don't know weather it's a RAM issue or processor issue.",
            "Display not open",
            "NICE..",
            "Nice",
            "Awful system. If you are planning to buy for basic work the system is dead slow not even worth to work comfortably on MS Office with normal internet browsing. It hangs guys. You will cry and repent after buying like me.\nJust wasted my time and money\n\n🤦🤦‍♀️",
            "It is a very good laptop in budget",
            "Don't buy ,it's a waste of money!",
            "Awesome laptop charger best bettary awesome Warranty not this laptop my laptop Abhi to achha h",
            "To slow working\nOverall good",
            "Best Laptop",
            "Not good",
            "Worst laptop when I tried to join on Google meet or Ms teams it is totally struck and I couldn't login on to that...don't but these laptop, I suggested whoever people planned to buy these..",
            "Very slow. Unable to use it. Keeps hanging. This is the worst laptop I have ever used",
            "Goid",
            "Good",
            "Waste of money",
            "Very slow",
            "Good",
            "Slow and dull machine",
            "Very slow",
            "Useful and best product MONEY SAFE",
            "Not Good\nNot proper warranty service",
            "Very Bad company ..please don't buy the Asus Laptop ...\nYou will get fake things..\n\nPlease don't wast your money",
            "Very slow..",
            "Very bad and cheap quality of product",
            "Best For Students",
            "Worst product and poor response from flipcart",
            "Good Laptop @ This Price. Very Compactable and Light weight",
            "System is very very slow",
            "Bild quality is not happy but over all good",
            "Good",
            "Very very bad laptops for asus",
            "Good like it",
            "Nice one.. Go ahead to buy this",
            "Not working properly. Display stuck. Hang .",
            "It's good .",
            "Very Nice",
            "I have expected in this product very high but disappointed in very slow process not battery backup and some time hanging , but this price and normal usages better this laptop please improve quality and speed thanks 🙏👍",
            "Good👍 m happy",
            "Very slow",
            "Getting too much time to open... unable to do any work ..",
            "very bad",
            "Too slow working as an old generation computer 😭",
            "Very bad processor",
            "Good laptop",
            "Very Wrost product. very Bad service by flipkart",
            "The laptop is very slow..",
            "Ok",
            "Best quality for student use",
            "I have wasted the money on this.",
            "Performance is very bad .... Net open time laptop is hang and slow work ..😣😣",
            "Good for average user",
            "Very very very very very SLOW. Wastage of money .",
            "Processer is vry slow its not work.",
            "Waste one dont purchase.",
            "Nice laptop keep buy",
            "It's look and battery performance is very good. But in this range I expect this product will be more good for working and more reliable. It has taking 2-3 minutes to open/close.. Laptop is very slow for heavy work.\n\n\nBut for online video lecture it is very fantastic in this price range.",
            "Vrisht very bad",
            "Good",
            "Basic usage",
            "Value of money 💰",
            "Waist of money .don't buy this product .",
            "Hang problem",
            "Worst laptop I have never seen..\nPlease don't buy go for i3 on this price..",
            "I AM SO HAPPY TO BUT THIS PRODUCT AND THAT'S THE BETTER PRICE",
            "Nice but performace is slow",
            "Nice 1 in this price seg",
            "nice product",
            "Thank you Flipkart.",
            "Product is worth for this cost.I feel battery will down fastly ,that was I am facing major problem on this laptop. Othereise performance always good .",
            "Performance is too bad",
            "Amazing quality of product",
            "This laptop is very slow",
            "Good",
            "Not that good",
            "Laptop is not working properly",
            "Awesome Product and Battery Bachup",
            "Very bad product don't buy",
            "First Asus products have BIOS window problem and it came with a defective SSD wire. Also the return policy is very bad for laptops. Never buy laptops.",
            "Not bad",
            "Asus laptop designing is very best in this price but performance is slow in 2 months If anyone buy this I suggest you laptop is for normal use only",
            "Ok ok starting process is slow",
            "System is slow. But very handy, soft buttons and TouchPad.",
            "Slow processing",
            "Super",
            "Really awesome product.",
            "Good",
            "So nice laptop...\nHaving latest updates and features\nVisibility of display so good\nProcecer speed is fine...\nEdge Browser so fast...\nEdges of laptop some what looking large...\nKeyboard very nice n smooth\nSounds sytems very well...\nMira cast working super\nSpeed connectivity of bluetooth\n\n\nAfter some days its performance is too slow",
            "Okay not bad",
            "Superb\nFast Delivery",
            "Good Product",
            "Excellent service By Flipkart 👍👍",
            "Dont buy ...Waste of money",
            "Thanks asus",
            "Performance very poor",
            "Product is good and affordable for low budget, But the Celeron processor is slow. Otherwise good experience with the product till now.",
            "Ok ok",
            "I purchased this product from Flipkart only a month ago. The laptop hangs frequently even with only 1 or 2 apps in use. It stopped to boot after a month. My honest recommendation and suggestion is please do not waste your money on this product",
            "It is only use of mailed works",
            "Amazing 🤩",
            "Very bad experience\nUnable to open.\nIT works so slow",
            "Worst product ever recieved",
            "Very nice",
            "Software very slow",
            "Nice",
            "My advice to you all who is going to buy this laptop I have used it for last 6 month regular and its fully waste product I will suggest you to buy to better laptop this is one of worst product ....",
            "Product is good!! But Flipkart is one of the worst company in terms of service!! Employees are not customer centric, greedy asking for bribe.\nI never recommend to buy anything from Flipkart!!!\nWorst!!!\nWorst!!!!\nWorst!!!!!\nWorst!!!!!!\n\nAmazon is best in this segment.!!!",
            "The system lacks speed..even the local disk takes about 10 seconds to open..very much lag experiencing..",
            "System Systum has to slow",
            "This product is very good",
            "Very slow",
            "Very slow performance when I use Microsoft Office and everytime i open some file then it will not responding and take more time to respond...👎👎👎",
            "Worst laptop",
            "Good product",
            "Worst laptop don't buy",
            "Worth for money",
            "Very good product battery backup good",
            "Good",
            "good",
            "This is a budget laptop. Good for student, but very slow loading.it is not working properly.",
            "Best",
            "Good",
            "Bad",
            "Very poor quality",
            "Very poor asus laptop",
            "Osm product I am happy",
            "Please dont buy this product",
            "Not up to the mark and expectations logs a lot when contacted customer care said to change to disk to ssd so not glad as it logs a lot when nothing is yet loaded in 1 TB hard disk",
            "Laptop hangs often, Opening apps and files taken long time, Installing apps take long time overall you will get irritated everyday, don't even think to buy this, Total waste of money.",
            "Best product in this renge",
            "Laptop does not boot at all. Once in a blue moon only it opens up. Absolutely dead slow",
            "Very slow prosser not play any vedio and work hang on little work",
            "It,s a nice product in this amount thanks to Flipkart",
            "Just like a marvel Avenger⚙️\nGood performance\nAnd Good Battery backup\nGood Display quality",
            "Awesome as the need of the student",
            "All good",
            "Been using the laptop for more than 9 months now it's good at this price range and value for money",
            "Very nice 🙂🙂",
            "Very slow for working",
            "Nice product",
            "Very slow... Ok for beginners n student upto class XII",
            "Gud & worthy product",
            "Very hanging this product",
            "Completely waste product",
            "It's Good",
            "Budget friendly laptop....\nOverlall best for home uses and e learning. But it cant perform photoshop and video editing softweres.\nSo dont buy if you need a laptop for heavy uses....\nAnyway its good and worth the price",
            "Good"
        ],
        "likes": [
            "1541",
            "800",
            "585",
            "1551",
            "200",
            "117",
            "182",
            "61",
            "53",
            "80",
            "20",
            "5",
            "16",
            "10",
            "11",
            "13",
            "5",
            "5",
            "3",
            "4",
            "3",
            "2",
            "139",
            "136",
            "87",
            "61",
            "49",
            "45",
            "19",
            "110",
            "61",
            "38",
            "20",
            "40",
            "40",
            "42",
            "44",
            "8",
            "21",
            "12",
            "23",
            "19",
            "24",
            "30",
            "15",
            "11",
            "10",
            "7",
            "10",
            "24",
            "6",
            "5",
            "6",
            "23",
            "16",
            "16",
            "9",
            "5",
            "5",
            "5",
            "4",
            "9",
            "9",
            "11",
            "7",
            "9",
            "15",
            "40",
            "3",
            "3",
            "3",
            "4",
            "4",
            "3",
            "3",
            "3",
            "54",
            "12",
            "7",
            "8",
            "5",
            "5",
            "9",
            "9",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "4",
            "4",
            "6",
            "6",
            "6",
            "2",
            "2",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "2",
            "1",
            "2",
            "1",
            "1",
            "1",
            "2",
            "2",
            "2",
            "9",
            "5",
            "3",
            "3",
            "3",
            "2",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "4",
            "4",
            "3",
            "4",
            "4",
            "5",
            "5",
            "4",
            "2",
            "2",
            "2",
            "2",
            "1",
            "2",
            "2",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "3",
            "3",
            "3",
            "3",
            "2",
            "2",
            "3",
            "2",
            "2",
            "2",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "1",
            "0",
            "1",
            "1",
            "0",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "305",
            "202",
            "155",
            "451",
            "50",
            "34",
            "57",
            "60",
            "18",
            "41",
            "5",
            "1",
            "3",
            "2",
            "1",
            "3",
            "0",
            "1",
            "0",
            "1",
            "1",
            "1",
            "11",
            "14",
            "10",
            "6",
            "5",
            "5",
            "1",
            "21",
            "10",
            "6",
            "2",
            "7",
            "7",
            "9",
            "9",
            "0",
            "3",
            "1",
            "4",
            "3",
            "5",
            "7",
            "2",
            "1",
            "1",
            "0",
            "1",
            "7",
            "0",
            "0",
            "0",
            "7",
            "4",
            "4",
            "1",
            "0",
            "0",
            "0",
            "0",
            "2",
            "2",
            "3",
            "1",
            "2",
            "6",
            "23",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "37",
            "5",
            "2",
            "2",
            "1",
            "1",
            "3",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "2",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "7",
            "2",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "2",
            "2",
            "1",
            "3",
            "3",
            "3",
            "2",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "5",
            "2",
            "2",
            "3",
            "2",
            "1",
            "2",
            "4",
            "3",
            "3",
            "2",
            "0",
            "1",
            "1",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "2",
            "2",
            "1",
            "2",
            "2",
            "2",
            "1",
            "1",
            "2",
            "1",
            "1",
            "3",
            "2",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Is ram and storage is expandable",
            "Q:Does it support online classes",
            "Q:Can we play small games",
            "Q:This leptop Can I play free fire game",
            "Q:This laptop have Wifi and Bluetooth connection",
            "Q:It is good for trading",
            "Q:Can i increase ram 4gb to 6/8 gb",
            "Q:Can it support pycharm ide ???? This is good for software developer 18-20 hrs work??",
            "Q:Does it support java, Python and other programming language????????",
            "Q:Can I use internet connection with wi-fi",
            "Q:Ms Office available?",
            "Q:In which type this leptop gaming , entertainment or study",
            "Q:We can download games in this laptop",
            "Q:Can we use it for music production?",
            "Q:I can edit video on this laptop",
            "Q:Can we use this laptop for online classes and video call?",
            "Q:Can i play pubg mobile lite in this laptop.",
            "Q:Is the laptop good in processing. Is it good for basic learning for students???",
            "Q:Is this laptop is best for editing in premiere pro software",
            "Q:Working of ZOOM APP ON THIS",
            "Q:Delcam software supported",
            "Q:We can use this for mobile shopes use",
            "Q:Asus support pubg game??",
            "Q:Can we use whatsApp? Plz answer me",
            "Q:Does it can be connected with a mouse?",
            "Q:Can I play watch dogs 2",
            "Q:Is it good for coding?",
            "Q:Can I eable to use FL studio",
            "Q:Can we use ms office, and how to instaled",
            "Q:Can i do data entry jobs",
            "Q:Can the screen be rotated to 360 degree",
            "Q:Does it contains a camera",
            "Q:Can we use it for daily office use?",
            "Q:Is charger is provided?",
            "Q:Keybord backlight available inside ?",
            "Q:Can I edit youtub video by this laptop?",
            "Q:Can I Edit my video to upload in YouTube ... On this laptop",
            "Q:Is this laptop good for class 6",
            "Q:Mobile hot-spot can be used",
            "Q:Cooling system is inside yes or no",
            "Q:Updated to ssd",
            "Q:Does it have pre installed offline ms office?",
            "Q:Play free fire this laptop ans",
            "Q:Does it support sim card",
            "Q:Can i watch movies(online) through subscriptions?",
            "Q:Can i use for bloging....?",
            "Q:This laptop have wifi connection?",
            "Q:Up to which version of ms office does it support",
            "Q:Is this suitable for CATIA",
            "Q:Can we add extra 4gb ram in it or 6 gb ram",
            "Q:Can I use YouTube in this laptop",
            "Q:What is it's bits??",
            "Q:What is the maximum ram capacity?",
            "Q:What is the battery life after full charge once.?",
            "Q:Can i play battle ground mobile india",
            "Q:It's ram was upgradeable?",
            "Q:Can I change celeron processor?",
            "Q:Can we play hitman 2 in this laptop",
            "Q:Can I do data entry work?",
            "Q:In one of answer it says ram could not be upgraded and in one answer it says yes it can. My question is that can ram and processer be upgraded in this laptop.",
            "Q:cap lock is available or not ??",
            "Q:We can use free fire game",
            "Q:Touch screen available or not",
            "Q:I want to ask that picture quality in this laptop is 720p or 1080p",
            "Q:Can i stream at 720p on YouTube",
            "Q:Can I play minecraft and GTA v5",
            "Q:Can I play Free fire or Pubg in this laptop",
            "Q:Can i upgrade my storage from HDD to SSD",
            "Q:Is this laptop support for fifa game?",
            "Q:Is this laptop support for free fire game?",
            "Q:Is it good for coding and programming",
            "Q:I can play free fire with outlag",
            "Q:Can I will use internet in this laptop?",
            "Q:how its body strong or not",
            "Q:Can I use playstore apps?",
            "Q:How about online business",
            "Q:can kyu play candy crush",
            "Q:Can we play GTA 5 in it and can we do editing",
            "Q:Can i change it's processor to apple one?",
            "Q:Can we use ms office ? Ms office is available ? Working or not ?",
            "Q:Is ms office pre installed n work on and offline both",
            "Q:Ms office 7 is right for this laptop",
            "Q:which generation plz tell me",
            "Q:Can I use DVD player in this laptop",
            "Q:Can I use Jan Seva Kendra this laptop",
            "Q:Can we use e Mitra",
            "Q:Voice recording abavibie",
            "Q:If mouse is free with it",
            "Q:This laptop has built in alaxa",
            "Q:Can I use mt4/ mt5 software in this laptop",
            "Q:It can use more then 5 to 6 hrs daily for office use...? And its support billing software..? Kindly answer both questions.",
            "Q:How can use it fixed lan connection?",
            "Q:can I used Ms Office Unlimited Usefully",
            "Q:Play Store is available in this laptop",
            "Q:Can i use solidwork?",
            "Q:How much ram is expandable in this laptop?",
            "Q:Does we have to pay for activation of MS office?",
            "Q:Does it have ips screen ?",
            "Q:Can use unacademy learning app?????",
            "Q:Can we play tlauncher in this without any lag",
            "Q:Can we get windows 10 life time licence ?",
            "Q:Can i use vb r any other programming language in this n use project work??",
            "Q:Can I download physics walla app for study",
            "Q:Can I play free fier",
            "Q:Can I run solidworks in this laptop?",
            "Q:Is this a chromebook?",
            "Q:Ms word is already there in this laptop?",
            "Q:Can I do online classes ? And one more Can I play mid range games on this laptop ?",
            "Q:Can I download gta V in this laptop",
            "Q:Can I play GTA 5 In the device through DISK",
            "Q:It's have c.d player",
            "Q:Is it good for multitasking like browsing and youtube stuff? And can we play low end games in it?",
            "Q:I can use typing mastr app?",
            "Q:Can i connect wifi mouse",
            "Q:This is equal to i3 processor",
            "Q:Can use whatapp and photo edition",
            "Q:can it work with chrome os or can we install chrome os.",
            "Q:Camera has clearity",
            "Q:Speaker are available or not?",
            "Q:Ram cam extend",
            "Q:CAN I 8NCREASE THE RAM OF THIS LAPTOP",
            "Q:1can we play gta 5 inthis lapatop 2can i play minecraft and free fire 3how to download a app",
            "Q:Can i use this laptop for coding and programming?",
            "Q:Can ye run GTA 5 game",
            "Q:Does this laptop is best for college students to store more documents?",
            "Q:Can we download whatsapp",
            "Q:Does it contain scratch program and notepad",
            "Q:I can play a Minecraft game in this laptop",
            "Q:Can i book train ticket",
            "Q:Can I use medical coding job",
            "Q:Can I use Q-GIS or arc gis Software in this",
            "Q:We can hear online classes in this laptop",
            "Q:Can I attend Interview in this laptop",
            "Q:Can I download microsoft teams in it",
            "Q:Can it support basic coding like html and css",
            "Q:Camera is clear or bluur and It has latest featurels or not",
            "Q:Can I use the laptop for engineering",
            "Q:Can I play ranked game",
            "Q:Can i download hello neighbor 2 and other games in this laptop",
            "Q:Can we fill online form, office work etc From this",
            "Q:Can i play ps4 games on it",
            "Q:Ms office provided this leptop..?",
            "Q:Does it have a HDMI input",
            "Q:It have internet connection solt",
            "Q:Does it gets heated after using few hours?",
            "Q:Can we benf",
            "Q:Android app can support for this window",
            "Q:Can used watsapp",
            "Q:Isn't used For coding and learning Purpose",
            "Q:In this rio player 2.0 is working",
            "Q:Can we join jio Wi-Fi to do zoom metting it not problem in laptop",
            "Q:Can i use it on charging mode ? Any heating problem or something else",
            "Q:Can we play Lara croft",
            "Q:Can I install power BI?",
            "Q:In this tally works fastly",
            "Q:Can I use type-c charger ?",
            "Q:Windows 10 install or not",
            "Q:Does it have a wifi button",
            "Q:Ms office 2007 do we get that pre installed.",
            "Q:Play a granny game in laptop",
            "Q:Can we use it for java programing",
            "Q:Can we use it for phyton programing",
            "Q:Is Microsoft office software are available for free lifetime",
            "Q:Is this laptop suitable for editing?",
            "Q:In this laptop i3 processor?",
            "Q:Can I use external keyboard",
            "Q:GTA 5 onThis laptop",
            "Q:Can we play ppsspp games on this laptop??",
            "Q:Can i play vice City in this laptop",
            "Q:Does it support video call",
            "Q:Does it runs smoothly with wifi connection?",
            "Q:Can we play movies in offline mode",
            "Q:Can i use maya software? And is this processor weak than i5?",
            "Q:This is i5",
            "Q:Free fire play minecraft ets2 play",
            "Q:Can we attach pendrive with laptop",
            "Q:Can we use BlueStacks for playing pubg????",
            "Q:It is support for focus",
            "Q:Does accesories came with it",
            "Q:Can I use this laptop for online data entry work ?"
        ],
        "answers": [
            "A:yes",
            "A:yes absolutely",
            "A:gta 5",
            "A:No it is not possible",
            "A:yes",
            "A:Yes.",
            "A:Yes . The ram can increase 4 gb total 8 gb ram supported in this laptop",
            "A:no",
            "A:No",
            "A:Yes",
            "A:Not available license version of windows 10",
            "A:study",
            "A:yes",
            "A:yes ofcourse",
            "A:yes",
            "A:yes",
            "A:yes u can bt this is not a mobile to install pubg mobile lite",
            "A:yes, for students it's a good choice as they don't require much processing power. for normal internet browsing and documentation work and for entertainment purpose as well.",
            "A:No. Its a basic laptop only. Mainly for office, data entry works.",
            "A:Yes",
            "A:Yes",
            "A:No we are using for home only",
            "A:yes support pubg game this laptop",
            "A:yea",
            "A:yes",
            "A:yes",
            "A:Not at all . This Laptop is not suitable for coding , you should have budget around <40000 for coding laptops.",
            "A:Yes",
            "A:Yes you can use, Ms office is already there.",
            "A:Yes, This laptop is capable of this.",
            "A:No",
            "A:Yes it contains a normal VGA camera",
            "A:It work fine for light working but you can go with it as per your use . I'll suggest you to looking other Laptop if you have daily office work for smooth uses.",
            "A:Yes",
            "A:no",
            "A:Yes",
            "A:yes. But is slow due to Ram space.",
            "A:Yes. It is good for study",
            "A:Yes",
            "A:There is a fan inside the laptop near the processor",
            "A:no",
            "A:No,it doesn't have pre install ms office.",
            "A:no u will face to much problem to play free fire on this laptop",
            "A:Yes",
            "A:Yes, you can watch movies through subscription 👍👍",
            "A:Nope. only basic",
            "A:Yes, this laptop has WiFi connection.",
            "A:Windows 10",
            "A:its very slow laptop dont buy broo its truth..trust me",
            "A:Yes",
            "A:Yes",
            "A:64",
            "A:16gb",
            "A:maximum 4 hours non stop",
            "A:yes",
            "A:yess",
            "A:No",
            "A:Graphic Issue. Don't have Graphic card . This laptop 💻 only use for educational purpose. Eg: Online Classes, Exams much more.",
            "A:Yes. But ms office is not inbuilt with this laptop. Depends on what data entry you do",
            "A:no",
            "A:available",
            "A:No",
            "A:Performance is not good",
            "A:720",
            "A:No, processor is too slow",
            "A:no",
            "A:No",
            "A:no",
            "A:no.",
            "A:no",
            "A:No",
            "A:its not possible",
            "A:yes it comes with wifi .",
            "A:yes laptop body is strong",
            "A:no you can't use play store ,laptop is waste of money",
            "A:Good to work with it",
            "A:no",
            "A:no",
            "A:no",
            "A:Yes you can use ms office... But you need to buy pack",
            "A:yes it is",
            "A:Yes",
            "A:it is Intel(R) Celeron(R) N4020 cpu @1.10GHz . To add the laptop is very slow...",
            "A:No",
            "A:yes",
            "A:yes",
            "A:no",
            "A:No,but u can use touch pad",
            "A:No, it hasn't.",
            "A:Yes",
            "A:yeah it's working atleast 4hrs nd depend ur software requirement.....",
            "A:there is no lan connection port",
            "A:No, this laptop is not recommended for office use. Its just a basic specific lap.",
            "A:yes",
            "A:Avoid, this is for basic use. And even slow good basic users",
            "A:4GB",
            "A:no",
            "A:no",
            "A:No",
            "A:No",
            "A:also get windows 11 update from Microsoft",
            "A:Yes, you can. It comes with genuine Windows 10 and 1 TB hard disk.",
            "A:Yes",
            "A:yes",
            "A:No bro not at all , its not working in small works very very slow don’t expect solid work. Go for another one",
            "A:No. It runs on Windows 10.",
            "A:No. & This Laptop is Very Very Slow. Think B4 Buy",
            "A:YES👍",
            "A:No it’s will become too slow",
            "A:no we can't able to browse Google as well",
            "A:no",
            "A:performance is good you can do multitasking . But I don't play games in it. for my official work it is good",
            "A:no",
            "A:Yes you can connect easily",
            "A:slightly lower than that",
            "A:yes",
            "A:Yes, you can.",
            "A:yes.",
            "A:In built speaker is there. No extra additional speakers.",
            "A:Not Sure, most probably no.Pls confirm from Asus website.",
            "A:No. there is no option in Motherboard like they not given cabin for installation of ram I personally checked by laptop technician.",
            "A:No",
            "A:no, go for laptop with better processor",
            "A:No",
            "A:yes, space is available.",
            "A:Yes",
            "A:Yes",
            "A:Yes, absolutely",
            "A:Yess",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:yes",
            "A:Yes",
            "A:its just 0.3mp cam ,its ok for zoom and google meets ,in low light it struggles a lot so its an average cam .it has all latest feature but you can't use the features to the fullest",
            "A:i think its not advisable coz this laptop doesn't give microsoft office for which u need to buy a separate license else u can absolutely use fir engineering",
            "A:No, this is mainly for kids… home online class. Also home office Works only. Using high end games or software makes laptop slow.",
            "A:no it is only for normal work. and it also many lag in normal work",
            "A:office work is too general, still good enough configuration for most clerical and managerial tasks.",
            "A:No, you can't. it is good for light work only.",
            "A:No",
            "A:ok but slow laptop",
            "A:yes",
            "A:Yes",
            "A:No",
            "A:no",
            "A:Yes, (Whatsapp web) you can connect to your whatsapp.",
            "A:yes but hanging issue",
            "A:yes",
            "A:you can do browse internet, do word precession, internet speed is good. Not for gaming and heavy performance.",
            "A:No",
            "A:no",
            "A:yes you can install low specs application and if you want for heavy usage then go for i3 with 8gb ram for avoiding lagging issues",
            "A:No",
            "A:no",
            "A:yes installed",
            "A:No",
            "A:No, office 365 is installed, without key, it comes with only monthly rental schemes, and works only online",
            "A:yes your choice",
            "A:no",
            "A:You can do anything on this, what a normal Windows laptop does, all you need to take care about speed and RAM. You can do but you'll face so much issues, its very slow with low configuration.",
            "A:No, For a month only",
            "A:yes. it can do average. not good for high end use.",
            "A:No",
            "A:no",
            "A:NO",
            "A:No games only for use study and work",
            "A:yes ofcourse",
            "A:yes",
            "A:yes no issues",
            "A:noo",
            "A:As per my suggestion it's not compatible for Maya & i5 is more powerful then celeron dual core processor.",
            "A:nope this basic intel celeron dual core",
            "A:no you cant play it cannot run gta san smoothly",
            "A:yes",
            "A:U CAN USE BLUESTACK IN THIS SYSTEM BUT IF U WANT TO PLAY PUBG IN THIS SYSTEM SO PLEASE PURCHASE ANY MOBILE NOT THIS LAPTOP UR GAME WILL BE LAG TO MUCH U WILL BE FRUSTRATED",
            "A:Yes",
            "A:Only charger",
            "A:slow running laptop"
        ],
        "likes": [
            "378",
            "132",
            "333",
            "0",
            "377",
            "29",
            "0",
            "298",
            "5",
            "10",
            "200",
            "41",
            "6",
            "17",
            "29",
            "24",
            "26",
            "15",
            "18",
            "9",
            "5",
            "4",
            "22",
            "8",
            "7",
            "24",
            "19",
            "4",
            "4",
            "4",
            "13",
            "9",
            "9",
            "9",
            "9",
            "5",
            "6",
            "0",
            "2",
            "0",
            "10",
            "9",
            "20",
            "13",
            "4",
            "3",
            "4",
            "7",
            "9",
            "4",
            "4",
            "4",
            "7",
            "5",
            "3",
            "3",
            "3",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "5",
            "6",
            "5",
            "5",
            "1",
            "5",
            "7",
            "3",
            "2",
            "3",
            "2",
            "1",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0"
        ],
        "dislikes": [
            "84",
            "27",
            "92",
            "0",
            "108",
            "4",
            "0",
            "96",
            "0",
            "0",
            "68",
            "10",
            "0",
            "4",
            "9",
            "7",
            "7",
            "3",
            "5",
            "1",
            "0",
            "0",
            "10",
            "2",
            "1",
            "13",
            "10",
            "0",
            "0",
            "0",
            "6",
            "3",
            "5",
            "5",
            "6",
            "1",
            "2",
            "0",
            "0",
            "0",
            "9",
            "6",
            "24",
            "14",
            "1",
            "1",
            "1",
            "8",
            "10",
            "1",
            "2",
            "2",
            "8",
            "6",
            "1",
            "1",
            "0",
            "1",
            "0",
            "1",
            "1",
            "2",
            "1",
            "5",
            "11",
            "9",
            "9",
            "3",
            "8",
            "22",
            "7",
            "5",
            "4",
            "1",
            "1",
            "3",
            "4",
            "9",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "2",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "4",
            "0",
            "0",
            "2",
            "0",
            "1",
            "0",
            "0",
            "0"
        ]
    },
    "summary": {
        "pros": {
            "Aesthetic Design": "The laptop features a sturdy design and is perfect to carry along. It is lightweight and weighs only 1.9 kg.",
            "Price": "Good laptop at such low price."
        },
        "cons": {
            "33 WHr Li-ion Battery": "Battery backup is below par. Could have better.",
            "Performance": "The Intel Celeron Dual Core N4020 processor is slow and performs below average."
        },
        "verdict": "The ASUS Celeron Dual Core is a budget laptop good for only normal use.",
        "Additional Information": "Takes one hour to get fully charged, i3 processor."
    }
}