{
    "title": "OPPO Reno7 Pro 5G (Startrails Blue, 256 GB)  (12 GB RAM)",
    "product_specification": {
        "In The Box": "Handset, USB Cable, Charger, Sim Ejector Tool, Protective Case, Quick Start Guide, Warranty Card",
        "Model Number": "CPH2293",
        "Model Name": "Reno7 Pro 5G",
        "Color": "Startrails Blue",
        "Browse Type": "Smartphones",
        "SIM Type": "Dual Sim",
        "Hybrid Sim Slot": "Yes",
        "Touchscreen": "Yes",
        "OTG Compatible": "Yes",
        "Quick Charging": "Yes",
        "Sound Enhancements": "Dirac Effect (Supported by Both the Speaker and Earphones)",
        "SAR Value": "Head: 1.03 W/Kg, Body: 0.78 W/Kg",
        "Display Size": "16.51 cm (6.5 inch)",
        "Resolution": "2400 x 1080 Pixels",
        "Resolution Type": "Full HD+ AMOLED Display",
        "GPU": "ARM G77 MC9",
        "Display Type": "Full HD+ AMOLED Display",
        "Display Colors": "16.7 Million",
        "Other Display Features": "90 Hz Refresh Rate, Screen-to-Body Ratio: 92.80%, Color Saturation: 97%, Aspect Ratio: 20:9, Color Gamut: Vivid Mode: 97.60% NTSC/99.94% DCI-P3, Gentle Mode: 72% NTSC/100% sRGB, Contrast Ratio: Static Maximum: 1,000,000:1, Dynamic Maximum: 1,000,000:1, Brightness: 500 nits with a Maximum of 800 nits in Sunlight and a Maximum of 920 nits when Displaying HDR or HDR10+ Contents",
        "Operating System": "Android 11",
        "Processor Type": "MediaTek Dimensity 1200-Max",
        "Processor Core": "Octa Core",
        "Primary Clock Speed": "3 GHz",
        "Operating Frequency": "Sim 1 (2G GSM: 850/900/1800/1900 MHz, 3G WCDMA: B1/B2/B4/B5/B6/B8/B19, 4G TD-LTE: B38/B39/B40/B41, 4G LTE FDD: B1/B2/B3/B4/B5/B7/B8/B12/B17/B18/B19/B20/B26/B28A/B28B, 5G: n1/n3/n5/n7/n8/n28A/n28B/n38/n41/n77/n78), Sim 2 (2G GSM: 850/900/1800/1900 MHz, 3G WCDMA: B1/B2/B4/B5/B6/B8/B19, 4G TD-LTE: B38/B39/B40/B41)",
        "Internal Storage": "256 GB",
        "RAM": "12 GB",
        "Expandable Storage": "7 GB",
        "Memory Card Slot Type": "Hybrid Slot",
        "Call Log Memory": "Yes",
        "SMS Memory": "200",
        "Primary Camera Available": "Yes",
        "Primary Camera": "50MP + 8MP + 2MP",
        "Primary Camera Features": "Triple Camera Setup: 50MP Main Camera (Sony IMX766, 1/1.56 inch, 1.0um, 4:3, All Pixel Omni-Directional PDAF, f/1.8 Aperture, FOV: 86 Degree, 7P Lens, Closed-loop Focus Motor, 5.42 mm Effective Focal Length, 23 mm Equivalent Focal Length, Contrast Detection Autofocus + Phase Detection Autofocus) + 8MP Ultra-Wide Angle Camera (Sony IMX355, 1/4 inch, 1.12um, 4:3, f/2.2 Aperture, FOV: 118.9 Degree, 5P Lens, Fixed Focus, 1.64 mm Effective Focal Length, 15 mm Equivalent Focal Length) + 2MP Macro Camera (OV02B10, 1/5 inch, 1.75um, 4:3, f/2.4 Aperture, FOV: 88.8 Degree, 3P Lens, Fixed Focus, 1.77 mm Effective Focal Length, 22 mm Equivalent Focal Length), Camera Feature: Photo, Video, Night, Expert, Panorama, Portrait, Time-lapse, Dual-View Video, Slow Motion, Text Scanner, Extra HD, Macro, Movie, Sticker, and Google Lens (Supported Only for Regions Outside the Chinese Mainland), Soloop Templates (Not supported for EU regions), EIS, CMOS (4 in 1 Pixel Binning Technology), 20 Burst Photo",
        "Secondary Camera Available": "Yes",
        "Secondary Camera": "32MP Front Camera",
        "Secondary Camera Features": "32MP Camera Setup: f/2.4 Aperture, FOV: 90 Degree, 5P Lens, Sony IMX709, 4:3, 1/2.74 inch, 0.8um, Fixed Focus, Camera Feature: Photo, Video, Panoramic, Portrait, Night, Time-lapse, Dual-view Video, and Sticker, 3 Axis EIS, CMOS (4 in 1 Pixel Binning Technology), Image Format - JPG, Shooting method - Touch the Screen, Press the Volume Button, Use Gestures, or Tap the Virtual Button to Take Photos",
        "Flash": "Rear: One Single Color Temperature Light",
        "HD Recording": "Yes",
        "Full HD Recording": "Yes",
        "Video Recording Resolution": "Rear camera: 4K (at 30 fps), 1080p (at 60 fps/30 fps), 720p (at 60 fps/30 fps) | Front camera: 1080p/720p (at 30 fps), 1080p (at 120 fps), 720p (at 240 fps), 1080p (at 60 fps), 4K (at 30 fps), 1080p (at 60 fps/30 fps), 720p (at 60 fps/30 fps)",
        "Digital Zoom": "20x",
        "Frame Rate": "240 fps, 120 fps, 60 fps, 30 fps",
        "Image Editor": "Yes",
        "Dual Camera Lens": "Primary Camera",
        "Speaker Phone": "Yes",
        "Call Records": "Yes",
        "Logs": "Yes",
        "Network Type": "5G, 4G VOLTE, 4G, 3G, 2G",
        "Supported Networks": "5G, 4G VoLTE, 4G LTE, WCDMA, GSM",
        "Internet Connectivity": "5G, 4G, 3G, Wi-Fi, GPRS, EDGE",
        "GPRS": "Yes",
        "Bluetooth Support": "Yes",
        "Bluetooth Version": "v5.2",
        "Wi-Fi": "Yes",
        "Wi-Fi Version": "802.11a/b/g/n/ac/ax (2.4 GHz | 5.1 GHz | 5.8 GHz)",
        "Wi-Fi Hotspot": "Yes",
        "NFC": "Yes",
        "USB Connectivity": "Yes",
        "Audio Jack": "Type C",
        "Map Support": "Google Maps",
        "GPS Support": "Yes",
        "Smartphone": "Yes",
        "Touchscreen Type": "Capacitive",
        "SIM Size": "Nano-USIM Card",
        "User Interface": "ColorOS 12 (Based on Android 11)",
        "MMS": "Yes",
        "SMS": "Yes",
        "Graphics PPI": "402 PPI",
        "Sensors": "Geomagnetic Sensor, Color Temperature Sensor, Proximity Sensor, Optical Sensor, Accelerometer, Gravity Sensor, Gyroscope, Pedometer, Digital Compass, Face Recognition, Fingerprint",
        "Ringtones Format": "MP3, AMR, APE, OGG, FLAC, WAV, MIDI, WMA",
        "Other Features": "Corning Gorilla Glass 5, 10 Touch Points, Touch Sampling Rate: Maximum: 1000 Hz, Default: 180 Hz, Screen Protector Type: SRF 2D High Definition Film, OTG Storage Format: FAT32, NTFS, EXTAT, Maximum OTG Storage Supported: 2 TB, Widevine Key: L1 Supported, Bluetooth Audio Specifications: SBC, AAC, aptX, aptX HD, LDAC, 2 x 2 MIMO Wi-Fi Antenna, SuperVOOC 2.0, SuperVOOC, VOOC 3.0, PD (9V/2A), QC (9V/2A), Material of Top Mainboard Case (Material of Middle Frame) - Aluminum Alloy 6A09H, Material of Bottom Mainboard Case - Plastics (PA + 50% GF) + SUS304 Stainless Steel Sheet, Material of Rear Cover - Panda Reinforced Material, Oleophobic Coating on Rear Cover, Oleophobic Coating on Screen, Dark Mode, Eye Comfort, HDR Display, SMS character limit - 1530 English Characters (Chinese, for Encoding Reasons, Will be Less Than 1530); SMS Exceeding the Limit Will be Automatically Converted to MMS), Capacity for One MMS Message - 300 KB, File Compression and Extraction, Private Safe (File Lock), World Clock, Clock Widget, Third-Party App Widget, Flashlight, 5G Uplink/Downlink Rate - Uplink: 700 Mbps, Downlink: 5100 Mbps, 4G Uplink/Downlink Rate - Uplink: 90 Mbps, Downlink: 900 Mbps, Maximum Audio Playback Time (Through Earphones) - 66 hrs, Maximum Call Time - 29 hrs, Maximum Video Playback Time - 21 hrs, Maximum Standby Time (4G) - 372 hrs, VOOC Charge Support, Vibration Motor - X-axis Linear Motor, IPX4 Waterproof IP Rating, Two-Mic Noise Cancellation",
        "GPS Type": "GPS, AGPS, GLONASS, GALILEO, QZSS, BEIDOU, NaVIC",
        "FM Radio": "No",
        "Audio Formats": "MP3, AAC, APE, AMR, WAV, MID, OGG, FLAC, WMA",
        "Video Formats": "AVI, 3GP, MP4, WMV, MKV, MOV, ASF, FLV",
        "Battery Capacity": "4500 mAh",
        "Width": "73.2 mm",
        "Height": "158.2 mm",
        "Depth": "7.45 mm",
        "Weight": "180 g",
        "Warranty Summary": "1 Year Warranty for Phone and 6 Months Warranty for In-Box Accessories",
        "Domestic Warranty": "1 Year"
    },
    "product_description": {
        "Intelligent Frame Sense": "With two Sony camera sensors, one for the front and one for the back cameras, you'll be able to take unrivalled photographs regardless of the illumination. You can flamboyantly record memorable recollections of your life.",
        "Scenic Beauty": "The front camera image sensor, which is powered by Sony electronics, offers improved light-capturing abilities and photographic capacity. Be it a sunset shot or a full moon shot, every selfie comes alive with great image resolution.",
        "Dapper Sensor": "The front camera, which is powered by Quadra Binning Algorithm features an RGBW sensor that is sensitive to huge volumes of light and reduces noise significantly, enabling you to take stunning photos even in low-light situations.",
        "Expressive Photography": "DOL-HDR technology helps minimise overexposure in well-lit regions while preserving details in dimly lit surroundings, allowing you to record the warmest moments of your life with amazing HDR effects.",
        "Smart Selfie": "When it's just you and the phone, the front camera employs a conventional wide-angle to ensure you're the focus of attention in the selfie. When you're in a group, the phone's front camera detects the number of people in the frame and automatically shifts to a wider angle, ensuring that everyone is in focus and no one is left out.",
        "Vibrant Imagery": "Thanks to a large photochromic area of 2.54/3.96 cm (1/1.56) that allows large amounts of light to pass through, the videos you record are vibrant and colourful, with life-like clarity.",
        "Power of Bokeh": "With around 25 levels of ergonomic blurring, bokeh, and light spot size, Portrait Mode places your favourite person in focus with flawlessly blurred backgrounds and keeps their cherished smiles in an unending DSLR-style portrait image.",
        "Detailed Visuals": "This phone's advanced algorithm defocuses your background finely, giving you the flawless bokeh and flare you need to create your aesthetic masterwork. This way, you'll never be out of the spotlight.",
        "Eloquent Portrait Camera": "Owing to the Portrait Camera System powered by AI, this camera detects your surroundings and instantly switches on Ultra Night Video or Live HDR, so you can shoot vibrant movies that are clear and bright.",
        "Quirky Design": "This phone uses LDI (Laser Direct Imaging) processing, which is often used in the semiconductor sector to provide precise touch. Additionally, the design of this phone is inspired by auroras, and features over 1.2 million micro-lines.",
        "Novel Build": "This phone, which is powered by LDI technology, is meant to be appealing, making the beholder the focus of attention while providing an opulently delightful feel.",
        "Brilliance Illuminated": "This phone uses hot-bent optical fibre technology, and in the form of a 3D Orbit Breathing Light, you can see indistinct starlight hushing around the camera piece. This alerts you of incoming calls, recent messages, and other important information.",
        "Sturdy Camera": "To highlight and protect the cameras, this phone uses a wear-resistant ceramic coating and a metal layer. This way, you can carry your phone to secluded spots for tranquil photography without worrying about the camera breaking. This unique mix lends a sophisticated touch to the already appealing smartphone.",
        "Slim and Effective": "With a sleek 7.45 mm thin 2.5 D body, weighing around 180 g, this phone is meant to offer you a featherlight experience, making it pleasant to handle this phone for a long period when capturing video or viewing your favourite movie.",
        "Sharp Visuals": "With a 16.5 cm (6.4) display and a refresh rate of 90 Hz, this phone has a unique design that will catch people's attention wherever you go, as well as a dynamic video playback that will give you a stutter-free visual experience.",
        "Influential Processor": "With a comprehensive 6 nm processor, 1+3+4 architecture, and an integrated 5G MediaTek SoC, this phone’s processor delivers lightning-fast performance. Furthermore, this phone has design modifications such as AI Deblur, which reduces blurriness while capturing images, providing an ideal atmosphere for capturing great photos.",
        "Juggle with Ease": "This phone, with its high-speed design and a substantial RAM capacity, can be the pinnacle of multitasking, allowing you to work on your tasks, play games to your heart's content, and watch your favourite movies.",
        "Blazing-fast Charging": "This phone comes with a 65 W SUPER VOOC charger that can charge the 4500 mAh battery to 100% in around 31 minutes.",
        "Engaging Gameplay": "This phone's X-Axis Liner Motor generates varied amounts of vibration feedback, allowing you to indulge in a flawless and immersive gaming experience. This allows you to play games while also enjoying the sensation of each movement on the screen.",
        "Remarkable User Interface": "ColorOS 12 comes with unique 3D icon graphics that are visually tactile and frangible, as well as an inclusive design that can work with multiple languages.",
        "Reflect the Inner You": "You can make your own live Omoji and throwback to the real you using innovative face-capture technology that detects dynamic facial emotions.",
        "Flawless Connection": "With this phone, you can easily connect your phone to your PC and share the necessary files between them. You can also cast your phone's screen to your monitor for a seamless connection.",
        "Privacy Protected": "When someone else looks at your phone screen, this phone automatically detects other faces and hides notifications. You may just relax and enjoy your solitude without worrying about where you are.Enhanced Data Security",
        "Enhanced Data Security": "This phone encrypts your personal information and comes with international privacy and security safeguards to keep your data secure from potential threats."
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "2",
            "4",
            "5",
            "3",
            "3",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "1",
            "4",
            "1",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "1",
            "5",
            "4",
            "4",
            "4",
            "3",
            "3",
            "5",
            "5",
            "1",
            "2",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "1",
            "2",
            "5",
            "1",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "3",
            "5",
            "3",
            "3",
            "1",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "1",
            "4",
            "5",
            "1",
            "1",
            "5",
            "5",
            "5",
            "5",
            "1",
            "1",
            "5",
            "4",
            "2",
            "4",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "2",
            "1",
            "4",
            "5",
            "3",
            "1",
            "2",
            "3",
            "1",
            "5",
            "5",
            "3",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "3",
            "3",
            "4",
            "5",
            "2",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "3",
            "1",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "3",
            "3",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "2",
            "1",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "2",
            "5",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "1",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "1",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "4",
            "1",
            "4",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "2",
            "5",
            "1",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "1",
            "5",
            "2",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "1",
            "1",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "3",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5"
        ],
        "review": [
            "Excellent Phone.. great camera quality, good battery backup, good performance really worthy",
            "Good\nIt's Good in Camera Front and Back\nBattery is Good 4500 mah\nDesign excellent\nBack orbit light is excellent\nOS is good\nDisplay I find slightly contrast is less compare to oppo Reno 3 pro which is two years old.it may be new technology 90 hz refresh rate.\nRam and storage is good",
            "After using one full week satisfied with the phone. As per specification mentioned, the phone is a good one to look for. Price wise it is on a higher side. There is no lag in performance at all. Battery is good, touch feel is awesome, looks premium. Full charge in 32 minutes(approx). Camera is good, may be better after software update. Low light performance is average. Selfie looks good and crisp. Colour is little bit enhanced than actual. Pectures are softer if taken with zoom. Overall it is not a flagship one.",
            "Really amazing features in the camera .. potrait mode is the best .65 watts fast charging full charged in 31mins ..really amazing product from oppo and it's another sucess in the Reno series still so many features is hidden and verifying each. Overall worth for the price ..",
            "Best phone in this range...best camera and best battery backup and charging Speed also fast (30min only) Vivo V 23 pro is also better than this but it cost high. I won't suggest to go for Vivo. Its just a camera phone.\nOne last thing built-up quality is great and solid...\nNever go for curvy border phones like Vivo, curvy phone are not easy to handle. This reno 7 pro is boxy design...i love it and it's really easy to handle..and best for rough use.",
            "Updated review after around 2 months : Its no-doubt a beast in every aspect; packed with sooo many features and so much optimisation options. I upgraded from Reno 5 pro to Reno 7 pro.. and I feel its worth upgrading. Though I am missing curved edges but its fine; its sleek design impresses me too! Air gesture feature is missing as told in Launch event, I hope to see that in this may be by an OTA Update soon!! Battery backup is average to good. I miss Dolby sound while using buds and its so called Dirac sound provided is not that good! Camera is the biggest plus in this device {very well optimised} and selfie is awesome with lovely flare portrait mode. BGMI runs smoothly. I really loved the back light and star trail design and and and Stereo speakers are just woww! To sum up all; I would say:- Display, Design; Camera; Gameplay & usage interface are its biggest Pros! Battery, 3.5mm jack missing (neither any converter); Dolby not provided and Air gesture feature missing would be its minor Cons!! Well on a wider aspect... Its the perfect Flagship available right now....and I guess I will continue to be a Reno Superfan 🥰",
            "After 1 day use\nBattery good no heating issue\nCamera good\nNo pubg testing but sure to he performe excellent\nDisplay nice\nLook great worthy\nBoya Mike working properly and excellent capture clear voice to making videos\nBreathing light awesome",
            "Other than the back design and SuperVOOC 65W Charge, nothing seems good about the phone.\nThe display of Reno 6 Pro with curved glass was far more superior than this phone which has an outdated flat screen design.\nThe phone is having brick-like design similar to Apple phones. It doesnt feel comfortable to hold in the hands. Doesn't seem slim at all.\nThe highlight of the phone, the Sony IMX camera sensor is not upto my satisfaction. Portraits have blurry edges and not much customisations by Oppo.\n1st update is already received and yet did not get satisfied with the camera photos. Selfies are a dampner. Even photos of low end phones from Vivo are far superior.\nSuch a phone with high specs doesn't support Live Screen.\nDoesn't have OIS or EIS,\nComes with old Android 11 out of the box instead of Android 12, and only 90Hz refresh rate at such a high price point.\nI would be happy to exchange this phone with something better.\nOverall, the price doesn't justify the specs and quality. I am disappointed. Oppo Reno 7 Pro is a loser.",
            "Excellent Product, broken my Keyone so wanted replacement for it sale started 14:00 pm ordered 14:05 min ; now using it with iPhone 12 mini ; both have the exact same interface its like using iPhone only ; UI developed by OPPO is very smooth and customizable ; product is sturdy , baterry bacup heavy usage last fr whole day ;; over all 10 out of 10 STAR to such a grand product at affordable price.",
            "1. Very good battery life\n2. Solid industrial design\n3. Bright and vivid display\n4. Snappy overall performance\n5. Decent cameras\n\nand yeah breathing light is just fantastic\n💯🔥🔥",
            "Excellent Phone.. great camera quality, good battery backup, good performance really worthy",
            "Good\nIt's Good in Camera Front and Back\nBattery is Good 4500 mah\nDesign excellent\nBack orbit light is excellent\nOS is good\nDisplay I find slightly contrast is less compare to oppo Reno 3 pro which is two years old.it may be new technology 90 hz refresh rate.\nRam and storage is good",
            "After using one full week satisfied with the phone. As per specification mentioned, the phone is a good one to look for. Price wise it is on a higher side. There is no lag in performance at all. Battery is good, touch feel is awesome, looks premium. Full charge in 32 minutes(approx). Camera is good, may be better after software update. Low light performance is average. Selfie looks good and crisp. Colour is little bit enhanced than actual. Pectures are softer if taken with zoom. Overall it is not a flagship one.",
            "Really amazing features in the camera .. potrait mode is the best .65 watts fast charging full charged in 31mins ..really amazing product from oppo and it's another sucess in the Reno series still so many features is hidden and verifying each. Overall worth for the price ..",
            "Best phone in this range...best camera and best battery backup and charging Speed also fast (30min only) Vivo V 23 pro is also better than this but it cost high. I won't suggest to go for Vivo. Its just a camera phone.\nOne last thing built-up quality is great and solid...\nNever go for curvy border phones like Vivo, curvy phone are not easy to handle. This reno 7 pro is boxy design...i love it and it's really easy to handle..and best for rough use.",
            "Updated review after around 2 months : Its no-doubt a beast in every aspect; packed with sooo many features and so much optimisation options. I upgraded from Reno 5 pro to Reno 7 pro.. and I feel its worth upgrading. Though I am missing curved edges but its fine; its sleek design impresses me too! Air gesture feature is missing as told in Launch event, I hope to see that in this may be by an OTA Update soon!! Battery backup is average to good. I miss Dolby sound while using buds and its so called Dirac sound provided is not that good! Camera is the biggest plus in this device {very well optimised} and selfie is awesome with lovely flare portrait mode. BGMI runs smoothly. I really loved the back light and star trail design and and and Stereo speakers are just woww! To sum up all; I would say:- Display, Design; Camera; Gameplay & usage interface are its biggest Pros! Battery, 3.5mm jack missing (neither any converter); Dolby not provided and Air gesture feature missing would be its minor Cons!! Well on a wider aspect... Its the perfect Flagship available right now....and I guess I will continue to be a Reno Superfan 🥰",
            "After 1 day use\nBattery good no heating issue\nCamera good\nNo pubg testing but sure to he performe excellent\nDisplay nice\nLook great worthy\nBoya Mike working properly and excellent capture clear voice to making videos\nBreathing light awesome",
            "Other than the back design and SuperVOOC 65W Charge, nothing seems good about the phone.\nThe display of Reno 6 Pro with curved glass was far more superior than this phone which has an outdated flat screen design.\nThe phone is having brick-like design similar to Apple phones. It doesnt feel comfortable to hold in the hands. Doesn't seem slim at all.\nThe highlight of the phone, the Sony IMX camera sensor is not upto my satisfaction. Portraits have blurry edges and not much customisations by Oppo.\n1st update is already received and yet did not get satisfied with the camera photos. Selfies are a dampner. Even photos of low end phones from Vivo are far superior.\nSuch a phone with high specs doesn't support Live Screen.\nDoesn't have OIS or EIS,\nComes with old Android 11 out of the box instead of Android 12, and only 90Hz refresh rate at such a high price point.\nI would be happy to exchange this phone with something better.\nOverall, the price doesn't justify the specs and quality. I am disappointed. Oppo Reno 7 Pro is a loser.",
            "Excellent Product, broken my Keyone so wanted replacement for it sale started 14:00 pm ordered 14:05 min ; now using it with iPhone 12 mini ; both have the exact same interface its like using iPhone only ; UI developed by OPPO is very smooth and customizable ; product is sturdy , baterry bacup heavy usage last fr whole day ;; over all 10 out of 10 STAR to such a grand product at affordable price.",
            "1. Very good battery life\n2. Solid industrial design\n3. Bright and vivid display\n4. Snappy overall performance\n5. Decent cameras\n\nand yeah breathing light is just fantastic\n💯🔥🔥",
            "Good Mobile Feel Like premium body, premium in performance. Camera Night Mode not working properly in full darkness. Audio quality & Screen very good. Battery drainage is the weakness point of this Mobile. Fast charging support the battery full charged in 35 to 40 mnt from 0 to 100 percent.",
            "1.Super awesome fast work ....\n2.like a butter...\n3.camera quality so good....\n4.Super performance .....\n5. Video quality so good\n6.value for money...\n7. I like it Ram extend function ...",
            "Overall it is better than other at this price....\nLook is so awesome.....\nCamera as expected very nice...\nBlack colour mobile much more good looking as compared to blue.....\nWhile in advertisement and pictures blue colour is looking good but in reality black colour is nice..",
            "Awesome camera phone.if u have a budget n dont want to go for i phone but love taking photos,this is simply awsome",
            "A must buy for portrait pic lovers. Build quality is great and phone is very lite weight.\nPerformance is very good for normal usage, did not try playing games n other heavy stuff.\n65 watt charger does it's job pretty well and phone gets charged within half an hour from 20 to 100%.\nCamera quality is really stunning. I own OP 9R, but camera quality of this Oppo Reno 7 Pro is altogether different experience, just wow.",
            "Good camera, good battery life with one and half day, but sound is not the best and a little over priced.",
            "Pretty neat phone. Delete all the unnecessary pre loaded apps. Phone works super smooth no worries at all. I used it normally for some social media, calling and chatting so serves the purpose well. Much better than my previous phone moto g5g so really happy with this purchase. Camera quality is good although photos at times do tend to look a little artificial. Operating performance along with the fast charge makes it a good deal. Guys, do consider this one.",
            "Its a Beast..\nSuperfast performance..\nNo doubt it's the best phone in this range. U can't get more.. I was lucky to get this phone at a crackling deal.\nI m writing this review after using it for more than 10days. I was skepticle to go for OPPO.. i already have One Plus 8 Pro, & this phone is no less in any aspect to One Plus 8 Pro.\nGuys, go for it without any single thought. You will love it..",
            "Very good product. I was using pixel 4 a. I shifter to oppo 2 days back. Initial impression is good. charges real quick. OS is good and stable. Have a lot of unwanted apps. but just delete them all. Coming from a stock android experience, I felt there are a lot of customizations available.\nI liked oxygen OS, but now it is being slowly masked into color OS completely, using color OS itself makes more sense.\nThis phone has solid build quality.\nThe best part is it weighs exactly like my pixel 4a. Bigger. but lighter.\nAmazing display.\nVery good cameras. But cannot compare it with pixels camera. Pixel camera is another league.\nBut the sony sensors are good. Front camera is doing a lot of skin smoothening unnecessarily. Girls will like it, as it will make them more artificial.\nPixels camera was raw. But oppos camera also does justice. It exceeded my expectations.\nOverrall reno 7 pro is a nice phone.",
            "Camera is just ok if we compared it with the price range in which it comes.\nDisplay is good but not best. Sound is good and yes handset is light weight and good to hold in hand.",
            "Good look but price is very high. Could have go with Reno7 5G instead of Pro. Backlight feature is really impressive.still I feel not worthy of 40k bucks.\n\nReview updated... Today this mobile got hanged bcs I just use basic feature of switching data from one sim to another. After that phone started blinking continuosly and heated too much.. feeling like just got cheated..\nUpdated...\nYesterday received update from oppo.. the above issue has been fixed",
            "Simply Superb 👍👌👌 Amazing build quality with gorgeous looks.. Rear look's are so eye catching for other's.. Most impressed with Charging Speed 0-100% within 40 min's.. 50 to 100% i just checked completed in just 20 min's. Camera is Simply Superb.👍\nI can rate 4.5 overall for 5.\nOppo brand can be trusted for durability as per my knowledge.🤷",
            "The best phone oppo Reno 7 pro . I also bought this . This mobile fully charged in 22 minutes . Battery backup is good . Screen and look is very good. I liked very much . 🥰🥰🥰",
            "battery getting down quickly, mobile has some has heating issue. camera quality is good but not as good as advertised. overall good phone but for value for money price should be near 33-35k.",
            "Firstly mobile is not good has one plus\nBattery back up is less compare to reno 6 pro\nCamera is ok ok not that much good due to no OIS\nScreen quality is good.\nPerformance wise ok ok\nBetter to go with OnePlus 9 series",
            "Good one sleek slim design comfortable to use\nCamera is good\nPerformance is good\nOverall nice package",
            "Beautiful selfie click by this phone runs smoothly\nBattery is too good\nCharging of this is too much\nOver all my experience this is the best phone on this prise segment....\nOppo Reno 7 pro & reno 7 both are the good 👍\nAnd light weight phones .. Design of both phones are amazing 😍..",
            "It's been 2 weeks I'm using it and satisfied and happy with the overall performance of the mobile.\n1. Beautiful design\n2. Butter smooth touch feel\n3. Awesome viewing experience with display\n4. Front and back cameras are too good except macro lens. Front camera is awesome, may or may not be the best in the segment, can't comment on it as I'm not that expert, but according to me, it's awesome.\n5. Battery back up is as expected from a 4500 mah battery, it's lasting for 24 hours for normal usage., but definitely not justified for the price. Must not be sufficient for Gamers, Could be some more better for 40K.\n6. Excellent build quality\n7. Charging speed is completely as the company claims. It's getting charged in 25 mins from 20 to 100% which is really helpful in the morning if we are in hurry to go somewhere and the battery is low by the time we wake up.\n8. Refresh rate is just 90hz where it should be 120hz for the price range., Truly, I never noticed big difference and I never felt any problem with it, but heavy Gamers must feel it as a big Con.\n9. Signal reception is excellent. No call drops, no problem in hearing both the sides.\n10. RAM and storage capacity is very good which is completely worth.\n11. First time I'm using Color OS and I liked it as much as I liked the Samsung UI, surely better experience over MIUI.\n12. Android 12 is not given out of the box and no update till now which is not expected from a 40K phone.\n13. No water resistance - I'm not sure whether it's expected for the price range or not, but could definitely became killer phone if the feature is given.\n14. Not a flagship phone. But still Processor is very good and RAM is high, also there is an option to increase RAM, so no problem with RAM management.\n\nOverall, one will be very happy to hold it and a highly recommend phone but only if we get it below 35K with any offers like bank offers or Flipkart sales etc. I feel, it's definitely not worth for 40K. I got 9K discount including bank offer and exchange bonus and 3K for old phone, so after exchanging my old phone and bought by using HDFC CC, I got the mobile for 28K and 30watt fast charging power bank for 1/- as an offer. All together, it's more than 100% worth in my case.",
            "I am previously using Oppo Reno 10x Zoom and my rating are based on Oppo Reno 10x Zoom\nOppo Reno 7 Pro Has Awesome in Design\nHas Fast charging\nGood battery life but\nCamera not upto the mark\nPerformance not upto the mark\nDisplay not as bright as my previous Reno 10x Zoom\n\nOverall look & feel of Oppo Reno 7 Pro is classy but i think if it has at least Snapdragon 870 processor thn it's a worthy deal",
            "I was happy when I get this product and this is band product packed in oppo packet with verify QR code I am happy because no default piece I get.\nBut after 1 hour of used mobile was heated and till night it was heating this is - point of this smartphone.\nBattery is big issue for this smartphone because battery ends too soon and I didn't like it this one is also - point of this smartphone.\nThis is too much futuristic smartphone because is has a lot feature that I never imagined. I am happy because I got this type of feature that I want in my smartphone this + point of this smartphone.\nThis case quality of this phonee is average.\nOne more thing is that... When I saw this smartphone in Flipkart I think that it's display is too big but when I see it in my hand I shocked because in picture and real there is too plenty of different between image and real but the smartphone is very light weight .\nIt looks very professional in my hand I loved it but some - point make me unhappy\nOne more thing is that there is hybrid sim card in this mobile I was also confused which type sim card in it . We have to insert two sim card in this mobile from front and back\n1 sim Card we have instead from upper side and 2nd from back side there is no slot for memory card in this smartphone.\nAnything else I loved this smartphone because it is too much futuristic......but oppo have to work on battery my device is set up with in 15 min from old device\nCamera is very good both front and back",
            "Very very good product 😃😃😃😃",
            "Value for money. Awesome phone.",
            "Awesome\nCamera quality good",
            "What a device look like..\nexcellent camera quality",
            "Oppo Reno 7pro phone is awesome",
            "Camera is really good like DSLR.🤩🤩🤩",
            "Nice Mobile",
            "Looking wise killer flagship product",
            "Good And Feel Premium",
            "Super",
            "Lovely phone in all areas. Flipkart offer and buy back scheem made so many people purchase this amaging phone.",
            "Nice phone with Awsm quality love it",
            "Nice excellent phone\nCamera good",
            "Camera 📷 quality best 👍",
            "2much camera quality I just loved it",
            "It's Good..",
            "Premium look and feel, so many extra features, fully customised. I loved it.",
            "Superb phone... awesome camera",
            "One of the best phone in this price range..",
            "Display quality out of 10/10\nBattery charging. 10/10\nDesign excellent 10/10\nOrbit light excellent",
            "I'M SO HAPPY VERY FAST DELIVERY 🥰🥰🥰 THANKS Flipkart",
            "I am impress Good 👍 product",
            "Best mobile so far..",
            "Awesome phone ♥️🥰♥️",
            "Excellent performance",
            "Camera is good. But at 40000 wanted a bit more features and quality..but overall good phone. You will never feel guilt.",
            "Camera quality too good",
            "Nice phone ☺️📱",
            "Super",
            "Camera is awesome..\nFront camera is lit..\nBattery is a annoying part.. lasts for 7 hours..\nCharging is quick in 35 minutes...0 to 100\nVideo quality is super as I m using oppo Reno series from start...\nBack is so slippery as I use it without any protection ..\nI m using black colour, looks sublime.",
            "Excellence",
            "Excellent phone in this price.overall nice experience.",
            "Flagship level camera....!!🥰🥰\nAlso a good looking mobile phone....",
            "Good 👍",
            "One of the best phone in this price segment Camera ⭐⭐⭐⭐⭐\nDisplay ⭐⭐⭐⭐⭐\nPerformance ⭐⭐⭐⭐⭐\nCharging ⭐⭐⭐⭐⭐\nBattery ⭐⭐⭐⭐",
            "Good gadget value for money",
            "This phone is very good and camera is perfect",
            "Fabulous Camera 🤳 phone",
            "Very good",
            "Phone is really good camera & Battery is excellent",
            "NICE & ELEGANT OPPO 7 PRO 5G HANDSET...",
            "Oppo Reno 7pro best mobile 👍👌",
            "Overall very much satisfied with the product.",
            "Nice Phone and reasonable price",
            "Over all Awesome but camera dslr effect love it.",
            "Front camera looks completely artificial but main camera is good",
            "Super mobile super\ncamera 5/5\nBodybuilding. 5/5\nDisplay 5/5\nPerfume 5/5\nBattery 5/5",
            "Overheating problem, not advisable to buy.",
            "Super",
            "Very comfortable and nice design value for money...lot of new features added...sure after use for a week I will write again",
            "Just an ordinary phone no special as flagship model overpriced",
            "Phone soooper, camera good, but night selfy bad, nigth rear camera sooper, display good, performance 10 out of 8.5...lightly heating ..... 40 k not value for money... 35 k value for money... My opinion oppo reno 7 pro good phone....",
            "This phone performance very bad and filpcart service also very bad",
            "After one week of use\nRear camera is excellent\nSelfie camera is not upto the mark not maches with the discription. Pictures are not sharp with the front camera.\nBattery is quite good and can last 7-9 hours if used continuesly.\nPermance is excellent.",
            "Camera Quality Very Nice.",
            "Value for money\n\nExcellent device\n\nBack orbit light is amazing\n\nOs is smooth\n\nOverally it is better than other competitors at this price",
            "Nice picture",
            "Very nice product 👍",
            "Superb design and Sony camera..worth it..first time oppo user...case could have been better for camera protection",
            "Display is very Good. Flagship camera missing OIS... :(",
            "Best mobile in this price range camera quality is so good and mobile display is very good",
            "Very nice looking\nnice camera quality",
            "Selfy cam not uptomark we spend lots of money and oppo company can't give headphone",
            "Guy this phone is awesome. You can find everything what u desire. Specially camera, battery and performance is mind blowing.. Go for it.. Flipkart gives you awesome offers.. love 💕 it..",
            "very poor battery life and heating isuee also",
            "Awesome phone",
            "Nice product",
            "NYC",
            "Build quality nice,\nDisplay is just awesome\nFront camera not so good.\nPerformance is also good\nBack camera overall decent.\nBut Price is little bit high according to me",
            "I like this oppo phone but one problem i noticed its support Google security so not get auto call recording. Another then all is well",
            "Not satisfied with camera quality. Not very impressive",
            "Best dim light cam .",
            "Performance is reasonably good considering the price of the product with exchange...",
            "Camera quality bad",
            "Not good as described by Oppo. Camera quality in not good. Heating issue.",
            "NYC product\nValue for money\nDisplay very nice\nCamera quality very nice 👍🙂",
            "I should say that the back is just awesome, the low light camera performance will just blow your mind. It's not a gaming phone but you can, without any problem. Quite impressive UI, alot of customisation and is should say that the breathing light would just make you love the device more and more...",
            "Liked the phone, very fast, premium look, 30 minutes full charge, superb screen....overall nice purchase",
            "What an amazing device!!!",
            "Overall good.\nCamera makes the pic extra white.\nPerformance is ok.\nCall recording announcement is a headache, which u can't stop.\n90hz refresh rate.\nMobile is over priced.",
            "Best Camera Phone",
            "Quite handy, selfie camera requires an update",
            "Phone feels very premium in hand, the display and the camera quilty is superb, not happy with battery backup even though it is 4500, elese performance screen touch gaming experience awesome no lag so far after 6 days use..",
            "EXCELLENT",
            "Night mood perfect",
            "Good phone at this price",
            "Nyc product",
            "After using 2 days\nAwesome mobile. You can extend RAM max 19 gb wow.\nMind-blowing performance.\nCamera great picture quality. HDR works great.\nFlawless multi tasking.\nGood looking design.\nFlicker light is awesome.\nLoud and clear sound.\nJust go for it.",
            "V good",
            "Overall phone is excellent with great features.. except slightly heating issues...",
            "Superb mobile",
            "Camera Superb\nBreathing Light effect superb first time ever\nCharging superb within 15mins full charge\n\nThanks to Flipkart @ fast delivery.",
            "Worst mobile don't take ... Battery back up is worst .. with in 2ds in kept replacement for mobile they rejected for replacement ... After using one month I'm writing review on this mobile. Friends don't take this mobile . Full over heat ... And worst battery backup and software is worst ..Over all this supplier also is worst ...",
            "Bad. Don't purchase anything from Flipkart.",
            "Camera :- Just ok. Can be better at such a price.\nThe worst part is OPPO is running very bad and late at technology. Android 12 is still a dream for this phone.\nCharging :- Not 100% in 32 mins. But still good at charging.\nLooks :- Great\n\nStill I am unhappy about Android update. Android 12 should be given or as a part of updates.",
            "I love Reno 7pro jiten",
            "Bad display and interface. Fast charging and equally fast draining, Heating problem and Camera is not good too. Overall very disappointed. If you buy you will regret for sure, mark my words.",
            "Mobile calls hunging same time hitting problem",
            "Really Fabulous 😍🤩",
            "Camera is too good, performance as better,90htz refresh good but not too good,I think 120hz should have given.and everything else is fine oppo Reno 7 pro👍",
            "Camera quality excellent\nBattery charging excellent\nLooks excellent\nUser friendly -moderate\nSpeed - excellent",
            "Mind blowing camera, awesome display, good sound, build quality and look was superb, performance realy good and battery much better\nValue for money.",
            "I am using the the mobile from one month, it is fine in oppo brand, camera is excellent, battery backup is very fine. I satisfied with the mobile",
            "Phone is okay except the camera department. Not as expected, i think i made a mistake instead of buying this i could have vivo x70 pro. ☹️",
            "Not worthy at 40k",
            "Superb quality phone camera is awesome.",
            "Not like a 40k mobile...",
            "Looks good. Performance is alright. Camera is average for this price point. Screen is quite bad. I'll recommend this phone only to those people who keep the design and look of the phone above all else.",
            "Heating problem with in 15 mins of using net based application",
            "Ok",
            "Good product great camera\nAnd featured",
            "All looks good but front camera is not up to the mark. Over phone charging very quickly and light and handy.",
            "Such a handy mobile with classy premium look and quality. Satisfied with the performance as well.\nJus go for it❤️",
            "Really this phon is value for money, battery backup so good. I am very happy to Flipkart for provide exchange offer for all customer .",
            "Battery capacity is low 5000 capacity is good for this phone",
            "Super",
            "Simply awesome ❤️",
            "Ultimate one and a must buy with closed eyes",
            "Flagship product with good discount. Camera is key point. Display resolution good. Refresh rate ok. Processor is good. In display fingerprint good. Colour and blinking light look awesome. Should provide 3.5mm jack converter.\n\nOverall OWESOME.",
            "Overheating issues cpu performance not too good",
            "Really good phone",
            "It's a okay mobile. The network antenna are not powerfull. Performance is also okay. The cameras are good.",
            "Very impressive mobile for this year...",
            "Good",
            "Amazing pic....👌",
            "Love Reno Series, Flagship smartphone...",
            "Good",
            "Nyc one.",
            "Good",
            "Wow just amazing",
            "Best Reno ever 😎😎",
            "Classy Design.",
            "Great camera 📷🎥 optimization it at its peak love the master class from oppo. Gaming is also very good.",
            "I love so much this phone",
            "Best perfomance, super fast operating systeam.",
            "Awesome",
            "Excellent",
            "Camera clarity super",
            "AWSOME PHONE I JUST LOVED IT...",
            "Camera Quality Is Very Very Good\nBattery Very Very Good\nLooking Fantastic\nPerformance Very Very Good",
            "Money wasted.... unnecessarily hype created. Potential buyers....pls not that it doesn't have headphone port in phone....you can't use headset with lead..",
            "Good product under 30K",
            "Nice camera and no hitting problem must go to buy",
            "Battery backup is low",
            "Third class phone dont buy",
            "Ok",
            "Very good & great phone 🦁",
            "This Camera Bokeh Portrait Mode Just Awesome",
            "Good product 👍👍",
            "Front camera performance very poor please don't buy phone total waste of money",
            "Very poor battery 👎\nHandse very heating",
            "Good pik",
            "Fast pick",
            "Freezes on the second day of purchase. 12 GB ram seems to be give 2 or 4 GB performance.",
            "Super mobile",
            "camera very bad\nmobile worth Rs15000",
            "Nice",
            "Over all great",
            "great phone",
            "Very good mobile worth for money🤩",
            "Very good purchase",
            "Not worth money",
            "Worst software and display, heating problem normal use also heat , charging slow battery drain fast, worst camera ,game players don't buy this mobile",
            "Display was poor quality please don't buy this",
            "Okay",
            "Good",
            "Good",
            "Facin battery issue",
            "Camera flash at night is very worst,Pic with full brightness, no clarity. My friend uses\nOppo reno 6 pro which camera quality is Excell in night flash\nThis phone has very low quality flash",
            "Had a bug in it can be rectified",
            "Very bad performance",
            "It's amazing phone go for it ..❤️",
            "Good camera quality.",
            "I'm not satisfied with this phone.social media platforms are properly not working.lagging, some time phone auto restart",
            "Nice one 👍",
            "Nice phone",
            "Worst phone ever purchased this review is after using this mobile phone for one month waste of money",
            "Video quality 4k",
            "Good phone",
            "Mobile is almost good",
            "Bad",
            "Costly but good",
            "Good phone",
            "Fabulous phone",
            "Worst camera processing phone.. it couldn't take a proper pic even in daylight. Colours are over saturated,lots of noise in the images and post processing of images are least natural.. even a budget 10k phones can take better pictures than this.",
            "A balanced phone with right hardware and software combination. Built quality is also superb.",
            "It's a great phone, I would say that you should also buy it.",
            "Excellent must buy, Thanks Flipkart.",
            "This phone is not justifing it's price.i got surprised when it gon hang.it is slow than my vivo z1 x.i can't recommend this phone",
            "Very nice phone\nExcellent camera",
            "Hi I had not buyed a good phone this time I saw this it's amazing features performance and battery is good need to do some features for better of any of the phone good phone",
            "Not working properly\nWithin month hanging and now switched off permanently\ndon't Buy fake company oppo\ncheating genuine Flipkart customer",
            "bad experience",
            "Fantastic phon",
            "Superb purchase. Display, camera , Sound and looks are Top class.",
            "The charging of the phone and the long lasting battery stands out",
            "Itz a good phone",
            "Good",
            "Superb",
            "Good",
            "Nice product",
            "When I opened camera phone is over heating.. what is solution??",
            "Superb",
            "Super",
            "Very nice phone",
            "Just Loved the phone",
            "Very nice",
            "A good quality products",
            "Awesome purchase",
            "Good phone 🤩😍",
            "Ok good product.but more price",
            "Very nice producta",
            "Perfect Mobile\nThat mobile is all in one",
            "nice nd good profuct",
            "Camera performance very nice.",
            "Mobile hanging problem\nBattery backup only 3-4hrs..",
            "Camera image is good as expected",
            "Awesome",
            "Zoom in is not up to the mark\nBattery backup is good enough\nCharging time is 30 mins from 0 to 100%\nEdge lighting and breathing light is an added feature.",
            "Avarage battery backup",
            "Hangs",
            "Phone is good but prize is very high",
            "Excellent finish nice mobile camera quality is good\nWorthy in 40k range",
            "Nice mobile....",
            "Awesome phone camera is good but macro function is not good not even clear image it takes. Design and display is worth it audio 🔉 sound is good.",
            "Not worth the price",
            "Nice",
            "Best mobile",
            "Amazing Experience Nice Camera And Audio",
            "My personal suggestion. Do not buy.",
            "except the camera everything else justifies the price range. Camera pictures are over exposed and gives soft tone.",
            "Nice",
            "Good",
            "Very bigg issue with battery drained very past . And heavy heating issue thiss mobile",
            "Not good product",
            "Bad battery,low quality product",
            "Nice",
            "Nice phone.",
            "Outstanding",
            "Classy, Stylish, Presentable.. It is a pure class.",
            "Good",
            "Best mobile for photos, gaming, n media viewing...",
            "Awesome mobile no words",
            "Camera performance is very good and battery 🔋 is perfomance is very waist",
            "VERY GOOD EXPERIENCE BUT 120HZ COULD BE MORE BEETER OPTION AT THIS PRICE RANGE.",
            "Great phone... Worth the price in this segment... If ur priority is for camera means surely go for this one",
            "Battery backup very low.. and some network issue is there. Sometimes Opposite person unable to hear my voice .",
            "Fair looking",
            "Overall good 👍👍👍 just batery issue ..but it's k...best is camera...light waight n screen ..",
            "Awesome phone👍",
            "Good Looking",
            "Good",
            "Third class phone , total waste of money, worst display and battery backup. Don't buy this phone.\n\nPros are only slim and good looking structure of phone. That's it.",
            "Nice phone, was confused while buying it due to other phones like Vivo, redmi and iPhone. Within this price range best I can say. iPhone is overpriced and find less quality camera than Oppo. Such a beast",
            "Good one.",
            "Super",
            "Excellent",
            "Good phone......\nCamera quality excellent",
            "Osm",
            "Excellent mobile.\nExpectaionts Fulfilled",
            "Excellent 👌👌👌",
            "Don't buy this phone very heet and not charge ING properly this horrible vest my money",
            "Good buy",
            "Not worth for 39K!!! I was using Reno 4Pro and bought this phone recently! I regret my decision!! Major issues are as follows: Heating heavily, battery backup is less, and discharge quickly! No 3.5mm port for headphones, and if would like to use headphones, spend another K for a Bluetooth headset! The camera is average, not up to the mark what the advertisements tell you!",
            "Overall Good phone",
            "Display Quality is not Good 😉😉😉",
            "No best phone",
            "Very good",
            "Nice phone",
            "Nice look perfect selfie and pics",
            "So far fulfilled my requirements.lets see when real time will come and phone has to perform upto level.",
            "Awesome 👍",
            "Amazing 🤩 Phone. Have been using it from past on month. Already had Oppo Reno 2 z. Now this. Not disappointed at all.",
            "Nice phone with Very Good Display Quality, Cameras and build quality is awesome\nThanks to Oppo making quality phones!!",
            "Nice phon",
            "Nice phone",
            "Super performance",
            "Nice Phone.. getting I Phone feelings",
            "Good",
            "Overall a good phone",
            "Nice product worth full of your money",
            "It's ok",
            "Best wishes",
            "Perfect phone",
            "Fantastic",
            "Super h lelo boss",
            "Good",
            "Battery issue and heating issue 😔",
            "Camera and Performace are good, but one thing I don't liked about this mobile is slightly warm when using more than 30 minutes of normal usage",
            "Design & looks are very good , Camera are really good ..",
            "Superb",
            "Everything is good...except battery backup",
            "Awesome phone",
            "Good product",
            "Best phone",
            "Night video and photo too much noise\nWell lit light decent snaps taken\nNo head phone jack\nSoftware issues noted ( get stuck on dialer while on call , fingerprint display delay )\nFast charging definitely helping\nRefresh at 90hz could have been 12ohz\n\nBuilt quality good\nNo cooling mechanism , gets heated while using maps",
            "Fantastic mobile but price wise little high . Camera features are awesome , design and built quality is good . Some of the features are not avail like IR blaster , Headphone connection through blue tooth only .OPPO has to renovate the above features.",
            "After use of 15days my phone got discolored",
            "Best phone in this price range of 12gb ram and 256 gb storage. Really Fast charging is something surprised...30 to 100% in less than 30 min.",
            "I LIKE THIS AND MIND BLOWING PERFORMANCE 5 STAR TO OPPP RENO 7 PRO",
            "In Gaming too much heating issues",
            "Very good camera",
            "Great phone as per camera and charging is considered. Refresh rate is really impressive as avoids hang. Overall a decent package all total for gamers and camera lovers.",
            "Worth Mobile For Camera Must learn the settings of camera to take Perfect Photos so 5 star Rating for Camera.",
            "Praise the lord thank u lord for this mobile",
            "Very good",
            "Good",
            "nice phone",
            "Very good and look as I phone working as very good options",
            "Good product",
            "Phone is very good excellent performance and camera. But disappointed two things autocall recording announcement, and not adual payment apps that's it. Other than mobile is very good",
            "Only issue of curved display otherwise the phone is great",
            "Supper",
            "Nice",
            "I really loved this phone it's beautiful device camera awesome",
            "Really it's superb....worth for money",
            "Best 👍",
            "Nice project",
            "Nice",
            "Excellent product. Full charging in less than 30 minutes. Camera is awesom. Photos are dslr like quality. Look wise excellent. Overall worth for money.",
            "Front camera in night time very worst\nAnd the mobile having heating issue and don't buy this product I hated",
            "Awesome Phone..",
            "Don't buy this cheap oppo product go for Xiaomi or OnePlus",
            "•Good detailed finish. Awesome remarks on that.\n•No complain on the Chipset, but i don't know if the MAX part is contributing much to it.\n•Rear main camera's performance is satisfactory, low light photography is decent.\n•Front Camera is great, but skin gets quite soft at times (although some may like this very much)\n•4500mah battery will not last you a full day but the 65watt charger will charge your phone in about less than 30 minutes, no worries.\n•The downside is No OIS and 2mp macro camera.\nAt this price point and a camera centric phone, one would expect OIS and at least 5mp macro camera or even better on this phone.",
            "Very good mobile",
            "Very nice to use .",
            "Good But Camara Is Not Upto Mark As Of Vivo X70 Series",
            "Good phone.",
            "Nice phone",
            "100% value for money..",
            "Perfect phone",
            "Good Phone but little over priced.",
            "Camera clarity found good and Battery capacity to be improve.\nVery nice to use but Sometimes mobile getting hang.",
            "Good",
            "Beast in hand, ultimate looks totally satisfied...",
            "one and only camera quality is very very low like 2MP 🥱",
            "Nice product",
            "Good phone",
            "Good",
            "Awesome Product",
            "Camera Quality is very good. And battery performance is good and charging quality is also very good.\nI like the product and I'm impressed.",
            "Good Mobile phone. I Tell everyone Are Need Need Best New Phone Plz. Buy Oppo Reno 7 PRO.",
            "very nice mobile and supp batry beckup",
            "Over heating issue, OMG, it is burning, too heat. Dont buy it, heats like boiled water.\nSeller big cheater, given good Exchange rate while buying mobile, but he sent heating issue mobile, if you talk 5 min in video call mobile will become heater. And while making video camera also facing over heating issue.",
            "Slim cute phone with great performance but heating makes me disappointed.",
            "Good",
            "Oppo Reno 7 pro is such a awesome design and construction.performance ultra.",
            "Best Phone",
            "What a performance, recommended",
            "Good phone",
            "Nice",
            "Everything is Good. Best camera quality. 31mins charge working great.",
            "Very nice phone",
            "Very good",
            "Product was good but Flipkart service is very bad",
            "First impressions are very good. Excellent phone.\nDetail review will be after few months of usage.",
            "Overall good Android phone",
            "Worst phone west of money",
            "Good",
            "Good",
            "It's good product...",
            "Poor battery backup camera low quality",
            "Perfect deal from oppo and Flipkart.",
            "Good....",
            "Good",
            "Nice 🙂🙂🙂🙂 Phone 📱",
            "Good",
            "Very good product",
            "Beautiful phone with very good camera",
            "Battery backup very bad",
            "Nice Phone Battery charging backup display all camera awesome",
            "Light weight, good display, good camera,",
            "Superb",
            "Battery capacity is low but everything is good",
            "Just ok",
            "Great mobile",
            "Very good mobile very smooth display",
            "Nice Phone 📱",
            "I like it oppo rano brand\nLove you oppo rano 7 pro\nBack camera 📸 is super quality",
            "Ultimate Phone.\n100% Value for Money",
            "Nice product. Very light weight and in-hand feeling is awesome.Heating issue after playing game more than 2 hr.Low battery 🔋 performance. Bt it is very high price according to specifications gadget. It is not value for money.",
            "Good",
            "Bad phone",
            "So far so good. Speaker could have been better. Battery life is awesome.",
            "In hand feeling awesome",
            "Good",
            "Its very good pone...Everything fine",
            "Great product",
            "The newest Oppo has a lighter weight, clearer resolution and enhanced selfie capabilities. The inbuilt 12 +3 (virtual) GBs of (RAM) make it a performance powerhouse.",
            "Better then vivo and mi",
            "I am giving this rating after using the phone for 2weeks. The Phone is worthy. The look is great and feeling nice in hand.",
            "Nice",
            "Good",
            "nice product.",
            "Good",
            "Superb phone",
            "Best camera best charging 15 minutes full charge love Reno 7 pro 😍",
            "Superb mobile finishing it love in blue clolo",
            "Super good spec & performance, natural camera pics no over makeup effects, intake natural colours through both rear & selfie camera",
            "Perfect phone",
            "Best phone in the market in this price range",
            "Selfie camera is very good",
            "Perfect Mobile In This Range 👍👍👍",
            "Excellent",
            "All in one premium quality mobile",
            "I am disappointed because mobile hiting issue",
            "Have been using this device for 10 days. Camera and display is awesome. Charges very fast and processor is beast. Loved it.",
            "Sony cam is very good. Look wise superb",
            "Good 👍👍",
            "Nice peace",
            "Camera quality is superb.. most important is its 65 W charger . Apart from these front camera shows some extra brightness some time.. overall its good looks premium performance is extraordinary.. in hand feel is awesome.. go for it",
            "No 1 stylist phone\nProfomance super\nBattery, display, front camera average\nBack camera super",
            "Oppo Reno7 pro 5g best phone is ever",
            "Battery backup is poor 😞",
            "Nice performance",
            "Nice mobile",
            "Good product",
            "Heating issue battery drain fast",
            "Bestest ❤️.",
            "Really feel regreted after purchase of this phone, should have waited for iqoo9 series, this was my first oppo brand phone,\nPoor call connectivity, has lots of video lags, os is very bad, only con was it's camera, battery, face unlock and fingerprint sensors",
            "Good",
            "Superb mobile phone with best camera result n smart looking",
            "Two Weeks Review..\nThe phone has been performing really well. Camera is the top notch. 65 watt fast charging is amazing. Display is pretty well. Look is classy.\n\nOverall a very good mobile at the given price range..",
            "Not worthy of this price, poor battery backup, ordinary display, average canera",
            "grt phone",
            "Nyc",
            "Best performance",
            "This realy good phone but one problem if you play and see the notification centre that may go ones right left but good\n\nBye this phone Now\nThanks Flipkart 🙏",
            "Best product",
            "Camera features awesome.handy look.\n1.camera clarity.\n2.video recording from back & front camera work at a same time.\n3.ultra wide angle is awesome.\n4.Battery drained fast.\n5.heat issue found",
            "An elegant and classy phone with a premium finish. Camera quality is excellent, speed n performance solid, powerful battery performance. Amazingly beautiful design, ultra smooth display., sleek body is making it most loved in my family. Also the it's orbit breathing light is awesome. I am very happy and satisfied with the model. No doubt about it ☺️. Thank you Flipkart for super fast delivery.",
            "Nice phone.",
            "Amazing phone go for it.",
            "Good product",
            "At pickest level",
            "Reno 7 pro... Is superb... Camera wise... N everything... But it should have speed dial n call recording.... While on call.... Else everything is superb.... Superb battery backup.... If u r not a gaming person.... Full day battery for normal use.... No need to charge....",
            "Mobile is very good",
            "Good overall performance in the segment of 40K... Only issue is the phone doesnt have sterio speakers... 😔",
            "Main highlight is the design. it gives super handling experience. Selfi Camera is perfect. rear camera is not upto the expectation.",
            "Worst no battery",
            "Bad product compare to vivo v23\n\nAnd price too high",
            "The product when I received I felt good.The ambience light when a notification comes and the breathing light which glows during a call or notification arrives is really good.The selfie camera is good at night Also.The Rear camera is also good.And the best feature in this phone is I gets fully charged in 30 minutes with a super Vocc Charger but the drawback of a mediated processor is that battery also drains very very fast.Overall a good buy but not at all a value for money.",
            "Wonderful mobile and it's features",
            "Might feel a little overpriced.\nPeople who prefer looks over specs can go for it\nHowever this phone is a beast for the pay\n\nBattery life is impressive\nCharging is very fast\nCamera performs very well in low light\nSmooth UI . Display is awesome\n90Hz is well and good and should keep your battery for all day.\nFaster in all aspects ..\nFeatures are innovative . Over years this premium level phones can be at a good resale values ...people\nPreferring square edges can go for this blindly.\nLesser weight\n\nMoreover you have so many offline markets and service centers for oppo .\nSo yes this is something you can get at this price after discount of 4k around 35",
            "Super mobile",
            "Good phont",
            "Good product 👌 👍",
            "Personally I liked the box type design with thin bezel. Rest are fine which is more or less competing with latest spec.",
            "Nice phone.",
            "Nice",
            "Awesome phone value of money",
            "Excellent",
            "Good product",
            "I am using Pro 5G for the past two weeks. Smooth... No overheat issue, Great processor, camera👍👍, excellent design, great speakers. It is up to the expectation. So far no issues. SATISFIED.",
            "Just ok",
            "Love at first sight",
            "Very very nice 👌🥰🥰",
            "Excellent product",
            "Good",
            "Awesome product, best for camera performance, gaming experience is good but can be improved at this price range.. also some themes are paid but don't know what they need after purchasing for 40k..\n\n\nBut over all best one , suggested to buy",
            "Love it",
            "Superb. Only dissatisfied by 90hz refresh rate.",
            "Camera picture quality is awesome\nLook is good.\nSpeaker sound is good.\nOverall nice phone in this price segment.",
            "Superb awesome phone this price.",
            "I was using iphone for more than 15 years. But thought of a change.Excellent phone. Battery life ia outstanding, loved it.",
            "Nice ph for exchange",
            "Ok",
            "It is two weeks of review camera is top no comments on that.Battery tho one day aayega charging is awesome . Performance ka tho sometimes it kags i noticed",
            "Good product",
            "Best",
            "Phone over all looks good. The price would have been kept slightly lesser. Sometime I see screen delays and battery performance is not that great. Phone often hangs. It generates more heat in long calls.",
            "Very nice phone",
            "Loved this phone ..looks very premium 👍",
            "Thanks good product",
            "Sleek design",
            "Not upto the value of money... expect More at same price as Vivo is giving same features as low price ..",
            "It's awesome",
            "Nice pic",
            "nice product and value for money",
            "Its better in camera",
            "Nice looking and good performance mobile except audio quality in the head phone. Pls do the update from oppo, other wise super",
            "Nice",
            "Nice Phone",
            "Phone performance is excellent. Battery backup should have been better.",
            "Nice mobile",
            "Nice n handy...easy to use.. totally satisfied with my new handset",
            "Very nice 👍👍👍👍",
            "Awesome",
            "Nothing is like flagship phone as claimed by oppo....Just ok",
            "Superb ..... Elite class smartphone",
            "I didn't excepted this function of handset.",
            "Very nice",
            "Good 👍",
            "Nice phone with good memory.",
            "Very Good Phone. Great camera and speed.",
            "Good",
            "Only issue is basic Google phone dialer and contact app, on this price, we should get advance dialer and contact app.\nRest all good but phone dialer is very basic thing and expected to have advance version of phone dialer.",
            "Camera performance is very poor worst moblie and waste of money\nPhone is heating issue",
            "Marvellous looks & build quality.",
            "Looking good. Sometimes it seems much heating on screen and back while using continuesly much time and while taking data data back up to cloud or restore from cloud. It should be rectified in rolling updates",
            "Excellent",
            "Fantastic",
            "Best phone 📱 till then ☺️ I used in my life",
            "Ok",
            "Superb photography",
            "Good k",
            "So amazing phone\n10 mint 💯%charge\nLove it",
            "Lovely 💐🌹",
            "Awesome product,,camera 🤳 display, performance, superb",
            "Amazing product by Oppo... Just loved it by all sides 😉",
            "Wastage of Money... Scratch issue on back camera",
            "Excellent device, My Mom is happy with the phone, Camera and Performance both are amazing, Seeing my Mom's happy smiling face made my day :)"
        ],
        "likes": [
            "1341",
            "171",
            "177",
            "785",
            "254",
            "32",
            "64",
            "29",
            "85",
            "24",
            "1341",
            "171",
            "177",
            "785",
            "254",
            "32",
            "64",
            "29",
            "85",
            "24",
            "38",
            "51",
            "30",
            "29",
            "6",
            "19",
            "8",
            "11",
            "6",
            "3",
            "19",
            "6",
            "18",
            "3",
            "3",
            "2",
            "1",
            "1",
            "0",
            "0",
            "530",
            "439",
            "68",
            "145",
            "56",
            "22",
            "60",
            "47",
            "137",
            "128",
            "23",
            "14",
            "33",
            "201",
            "37",
            "45",
            "109",
            "100",
            "74",
            "12",
            "144",
            "56",
            "17",
            "10",
            "13",
            "9",
            "27",
            "12",
            "64",
            "27",
            "27",
            "7",
            "23",
            "17",
            "6",
            "9",
            "9",
            "16",
            "5",
            "5",
            "5",
            "9",
            "9",
            "9",
            "8",
            "3",
            "23",
            "8",
            "7",
            "6",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "2",
            "3",
            "2",
            "2",
            "5",
            "4",
            "12",
            "5",
            "1",
            "2",
            "2",
            "2",
            "2",
            "0",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "2",
            "1",
            "1",
            "6",
            "3",
            "4",
            "0",
            "2",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "4",
            "1",
            "2",
            "7",
            "3",
            "2",
            "0",
            "0",
            "0",
            "4",
            "1",
            "0",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "68",
            "33",
            "43",
            "331",
            "224",
            "5",
            "17",
            "11",
            "50",
            "2",
            "68",
            "33",
            "43",
            "331",
            "224",
            "5",
            "17",
            "11",
            "50",
            "2",
            "32",
            "16",
            "19",
            "6",
            "0",
            "6",
            "1",
            "3",
            "1",
            "0",
            "22",
            "4",
            "22",
            "1",
            "0",
            "1",
            "0",
            "0",
            "1",
            "1",
            "30",
            "41",
            "3",
            "12",
            "3",
            "0",
            "4",
            "3",
            "18",
            "18",
            "1",
            "0",
            "3",
            "42",
            "4",
            "6",
            "21",
            "19",
            "13",
            "0",
            "33",
            "10",
            "1",
            "0",
            "1",
            "0",
            "5",
            "1",
            "20",
            "6",
            "6",
            "0",
            "4",
            "3",
            "0",
            "1",
            "1",
            "4",
            "0",
            "0",
            "0",
            "2",
            "2",
            "2",
            "2",
            "0",
            "11",
            "2",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "9",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "2",
            "3",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "4",
            "2",
            "1",
            "21",
            "6",
            "4",
            "1",
            "1",
            "1",
            "16",
            "1",
            "1",
            "2",
            "9",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "3",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "7",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Oppo renu 7 pro have dual speaker?",
            "Q:Notifications light is abilable in this phone",
            "Q:Curve or flat screen it has?",
            "Q:Automatic call recording available in Reno 7pro",
            "Q:Does both sim works with 5g network",
            "Q:Is Macro mood available in oppo Reno 7 series ?",
            "Q:Is orbit-breathing light will produce heat around back camera area?",
            "Q:OPPO Reno 7 camera sensor is Sony sensor or not",
            "Q:Will the phone support e sim card in future",
            "Q:How can we use headphone without jack or adapter?",
            "Q:Is this phone RAM expendeble storage",
            "Q:Can I play bubble game on this phone I mean big game like snake leelne wala like bubble shoot like ludo game",
            "Q:Wireless charging available for Oppo reno 7 pro..",
            "Q:Oppo reno 7 pro or realme gt Master edition is good",
            "Q:Can i play free fire Max",
            "Q:Is Display finger print this phone",
            "Q:Is Dolby Atmos is supported for this mobile",
            "Q:Is this phone water resistant? Wireless charging",
            "Q:How many 5 g bands",
            "Q:Can it record calls without knowing the caller?",
            "Q:smart dual sim option available ?",
            "Q:Oppo reno7 or Vivo v23 better phone",
            "Q:Whate is e sim suppoted",
            "Q:Which one beeter between Vivo 23 pro and reno 7 pro.",
            "Q:How mush Watt charger",
            "Q:How many 5g baind",
            "Q:Does this phone have wireless charger option??",
            "Q:Dollby atmos sound?",
            "Q:Bokhe Effect on Avealabl",
            "Q:Dolby atmos work on ear buds?",
            "Q:How does breathing light work by keeping silicon case is it visible or not",
            "Q:Charging kitne minutes me full hoti",
            "Q:How is display smoothness ie. is it like OnePlus fluid amoled ?",
            "Q:Is it worth for money",
            "Q:Will we be able to upgrade it to Android 12",
            "Q:How can I disable vibration at fingerprint unlock?",
            "Q:SAPPORT 90fps pubg mobile",
            "Q:do this device has built in auto call record",
            "Q:does this device has built in auto call record option",
            "Q:does it comes with dual video recording feature where you can shoot with both front and back camera",
            "Q:Metal body ya plastic body",
            "Q:Is it LPDDR4 or LPDDR5 RAM please say exactly, Thank's.",
            "Q:Does to have IR blaster ? And OIS ?",
            "Q:Can we use C-type to 3.5mm jack convertor for earphones?",
            "Q:What is antutu scor of Reno 7 pro",
            "Q:Its worth or not",
            "Q:How many android updates will we get (to be precise upto which android version android 13 or 14?)",
            "Q:Hi, Can we manually turn off-On the led light of back camera which is used for Design purposes only??",
            "Q:Portrait video shoot",
            "Q:Is it 20 x zooming camara",
            "Q:Video call feature is available or not",
            "Q:Iam confused sir Memory card slot available sir",
            "Q:Has it memory card support ?",
            "Q:Streao spekar is avaliable",
            "Q:does it support audio jack ?",
            "Q:Call recorder available ?",
            "Q:Is this mobile has dual audio?",
            "Q:How many 5g bands??",
            "Q:What is the storage capacity of Reno7 pro 5G?",
            "Q:What is the charging speed of Reno7 Pro 5G?",
            "Q:Which sensor is present in the rear camera of Reno7 Pro 5G?",
            "Q:Reno7 Pro 5G comes in how many colors?",
            "Q:can we ply free fire and pubg in high setting",
            "Q:Which Flagship chipset is present in Reno7 Pro 5G?",
            "Q:Which type of sound are used dolby atom or harman kardan",
            "Q:It has OIS? If it was I'll consider to buy,!",
            "Q:How many Android update would we get Reno 7pro",
            "Q:Pubg and bgmi games in play in this mobile",
            "Q:What is the meaning of Orbit-breathing light which is present in Reno7 Pro 5G?",
            "Q:How many android update Oppo Reno 7 Pro received???",
            "Q:What is so special about Reno7 Pro Design?",
            "Q:Does it have wireless charging?",
            "Q:In this mobile call recording is it",
            "Q:Does it have 120hz pannel?",
            "Q:Does it support screen recording?",
            "Q:Whether it is water resistance",
            "Q:Oppo reno 7 pro have curved screen",
            "Q:Can i play BGMI in 90 fps without any lag ??",
            "Q:Is this contains a glass protector?",
            "Q:BGMI 90FPS ON PHONE by default settings answer first now",
            "Q:Free fire ultra max support",
            "Q:Is side fingerprint available in oppo reno 7 pro?",
            "Q:Is side fingerprint in oppo reno 7 pro",
            "Q:5000 mh battery",
            "Q:Does it support screen recorder voice",
            "Q:Is there any problem with this mobile like heat and hang",
            "Q:How much time full charged",
            "Q:Betery backup kitna he",
            "Q:Wash proof or not",
            "Q:Oppo reno 7 pro Hot this mobile kya ye mobile hit hota hai",
            "Q:In this mobile can I play pubg with high quality",
            "Q:Does both sim support Volte at the same time? And does this phone support wifi calling?",
            "Q:How many watt charger Of this phone",
            "Q:Call recording without announcement features in this phone???",
            "Q:Any major Difference between reno 6 and 7 pro both looks premium.",
            "Q:Does it have a dedicated sd card slot",
            "Q:What is input voltage range?",
            "Q:Call recorder with out notification available ?",
            "Q:Is this phone light weight",
            "Q:Is there scratch card already fixed on screen when delivered??",
            "Q:Where is the auto call record key in Reno 7 pro",
            "Q:Can we able to uninstall unwanted app's which is given by default with phone?",
            "Q:In. This mobile have a curve screen",
            "Q:Slow motion is available or not? How much fps?",
            "Q:Is it curved display in the phone",
            "Q:Does this Mobile has 3.5mm jack ??",
            "Q:Does it provide earphones in the box?",
            "Q:Is there ear phone available",
            "Q:Does it come with pre applied tempered glass",
            "Q:Does it come with pre applied screen guard ?",
            "Q:Direct jio video calling features are available",
            "Q:Can i play bgmi in max graphic",
            "Q:Can I play ultra hd graphic in free fire",
            "Q:Is this water pruf mobile?",
            "Q:Calling display light available",
            "Q:How many time use this phone on normal mode",
            "Q:The App clone is available for all apps or some messengers only.",
            "Q:Front ultra wide angle video supporter???",
            "Q:Does it support 3.1mm headphone jack?",
            "Q:Headset including box..?"
        ],
        "answers": [
            "A:yes",
            "A:yes",
            "A:Flat screen",
            "A:yes",
            "A:Yes",
            "A:yes",
            "A:no",
            "A:Yes",
            "A:yes",
            "A:adapter",
            "A:Storage is not Expandable but you get enough storage with 128 and 256 GB options. RAM is expandable via a feature inbuilt in the Color OS.",
            "A:Yes, of course",
            "A:nope",
            "A:oppo reno 7 pro",
            "A:yes",
            "A:Yes",
            "A:yes",
            "A:no",
            "A:Yes",
            "A:No",
            "A:Yes",
            "A:Vivo v23",
            "A:no",
            "A:Reno 7 pro is anyday better...",
            "A:64 Watt",
            "A:12 +7",
            "A:No, there is no wireless charging option available. Personally, owning a OP8 Pro, Samsung Flip 3 and phone 13, i feel that wireless charging is an overrated feature, not fast enough.",
            "A:Yes",
            "A:Yes",
            "A:yes. it's work",
            "A:Yes",
            "A:30-35 mins",
            "A:Yes. It's is good.",
            "A:yes",
            "A:Yes",
            "A:IN SETTING YOU CAN DISABLE IT",
            "A:NO",
            "A:YES",
            "A:YES",
            "A:yes",
            "A:IT IS GLASS BODY",
            "A:LPDDR5",
            "A:No",
            "A:YES",
            "A:The Antutu benchmark score of OPPO Reno is 281815 points",
            "A:ITS WORTH",
            "A:13",
            "A:yes",
            "A:Yes",
            "A:YES,IT HAS 20X ZOOMING CAMERA",
            "A:Yes",
            "A:not available",
            "A:no",
            "A:yes",
            "A:No.",
            "A:Yes",
            "A:No",
            "A:Yes",
            "A:With Reno7 Pro 5G, you can multitask with up to 19GB. It comes with 12GB RAM+Up to 7GB RAM Expansion and 256GB ROM.",
            "A:Reno7 pro comes with 65W SUPERVOOCTM , which can charge the massive 4500mAh battery to 100% in just 31 minutes. With just 5 mins of charging, you can enjoy 4 hours of Video Playback.",
            "A:Reno7 pro comes with Sony IMX766 Flagship Rear Camera Sensor which has 1/1.56'' large photosensitive area and receives 85% more light.",
            "A:Reno7 Pro 5G comes in two breathtakingly beautiful colors which are Startrails Blue and Starlight Black.",
            "A:for casual gamming",
            "A:Reno7 Pro 5G comes with MediaTek Dimensity 1200-Max. With an advanced 6nm process, 1+3+4 architecture, and an integrated 5G SoC, MediaTek�s flagship SoC delivers a 5G-worthy performance.",
            "A:normal",
            "A:YES IT HAS OIS",
            "A:Two years of major Android update and three years of security patchs",
            "A:Yes",
            "A:First in the industry to use hot-bent optical fiber technology, watch dreamy starlight quietly glow around the camera piece in the form of a 3D Orbit Breathing Light in Reno7 Pro 5G.",
            "A:11",
            "A:Reno7 Pro 5G comes with Aircraft-Grade Shooting Star Design. This is the first phone to use LDI (Laser Direct Imaging) processing, which originally is the technology of the semiconductor industry.",
            "A:no",
            "A:Yes",
            "A:NO",
            "A:Yes",
            "A:No",
            "A:No",
            "A:Yes",
            "A:no glass protector in box",
            "A:No",
            "A:no",
            "A:No. In display available",
            "A:No. Only screen fingerprint are there .",
            "A:4500",
            "A:no",
            "A:No issues",
            "A:30 mitues",
            "A:12 hours",
            "A:no",
            "A:No...",
            "A:YES",
            "A:No",
            "A:65",
            "A:YES",
            "A:In every aspects Reno 7 is winner, If you want speed with huge storage then Reno 7 is the best smartphone.",
            "A:NO",
            "A:220",
            "A:YES",
            "A:yes it's light and slim but also feels premium due to aluminium frame,it's in hand feel is excellent",
            "A:YES",
            "A:IN SETTINGS",
            "A:yes",
            "A:no, but if you apply screen guard over curved display it will not look attractive. As compared to curved display+screen guard this phone screen looks more attractive",
            "A:yes, 960fps...",
            "A:No.. it'sFlat",
            "A:NO",
            "A:NO",
            "A:NO",
            "A:IT COMES WITH PLASTIC SCREEN GUARD",
            "A:YES",
            "A:NO",
            "A:Yes , absloutely",
            "A:YES",
            "A:no",
            "A:yas",
            "A:all time",
            "A:App clone only Facebook and WhatsApp . all apps not working app clone",
            "A:no",
            "A:No",
            "A:Yes"
        ],
        "likes": [
            "88",
            "87",
            "67",
            "11",
            "6",
            "4",
            "5",
            "5",
            "4",
            "4",
            "3",
            "0",
            "1",
            "1",
            "2",
            "2",
            "5",
            "3",
            "3",
            "2",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "217",
            "189",
            "139",
            "7",
            "5",
            "6",
            "2",
            "2",
            "3",
            "1",
            "4",
            "3",
            "8",
            "3",
            "2",
            "2",
            "1",
            "3",
            "1",
            "1",
            "2",
            "2",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "13",
            "16",
            "13",
            "4",
            "2",
            "1",
            "1",
            "2",
            "3",
            "4",
            "1",
            "3",
            "2",
            "0",
            "0",
            "2",
            "5",
            "3",
            "4",
            "3",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "2",
            "0",
            "1",
            "1",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "2",
            "2",
            "1",
            "2",
            "2",
            "4",
            "9",
            "52",
            "50",
            "43",
            "2",
            "1",
            "2",
            "0",
            "1",
            "0",
            "1",
            "1",
            "3",
            "4",
            "2",
            "3",
            "1",
            "0",
            "2",
            "1",
            "1",
            "2",
            "2",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "2",
            "2",
            "3",
            "2",
            "2",
            "2",
            "5"
        ]
    }
}