{
    "title": "Moto g22 (Cosmic Black, 64 GB)  (4 GB RAM)",
    "product_specification": {
        "In The Box": "Handset, TurboPower 20W Charger, USB Cable, Guides, Sim Tool",
        "Model Number": "PATW0000IN",
        "Model Name": "g22",
        "Color": "Cosmic Black",
        "Browse Type": "Smartphones",
        "SIM Type": "Dual Sim",
        "Hybrid Sim Slot": "No",
        "Touchscreen": "Yes",
        "OTG Compatible": "Yes",
        "Quick Charging": "Yes",
        "SAR Value": "Head: 1.18 W/kg at 1g, Body: 1.44 W/kg at 1g",
        "Display Size": "16.51 cm (6.5 inch)",
        "Resolution": "1600 x 720 Pixels",
        "Resolution Type": "HD+",
        "GPU": "IMG GE8230",
        "Display Type": "HD+ IPS LCD 90Hz Display",
        "Other Display Features": "Display Aspect Ratio: 20:9, Screen-to-Body Ratio: 89.03%,",
        "Operating System": "Android 12",
        "Processor Type": "Mediatek Helio G37",
        "Processor Core": "Octa Core",
        "Primary Clock Speed": "2.3 GHz",
        "Secondary Clock Speed": "1.8 GHz",
        "Operating Frequency": "4G LTE: B1/B3/B5/B7/B8/B20/B38/B40/B41, 3G UMTS: B1/B2/B5/B8, 2G GSM: B2/B3/B5/B8",
        "Internal Storage": "64 GB",
        "RAM": "4 GB",
        "Expandable Storage": "1 TB",
        "Memory Card Slot Type": "Dedicated Slot",
        "Primary Camera Available": "Yes",
        "Primary Camera": "50MP + 8MP + 2MP + 2MP",
        "Primary Camera Features": "Quad Camera Setup: 50MP Main Camera (f/1.8 Aperture, 0.64um Pixel Size, 4 in 1 with 1.28?m, PDAF, Quad Pixel Technology) + 8MP (f/2.2 Aperture, 1.12um Pixel Size, 118 Degree Ultra Wide Angle + 2MP Macro Camera (f/2.4 Aperture, 1.75um Pixel Size) + 2MP Depth Camera (f/2.4 Aperture, 1.75um Pixel Size), Camera Feature: Portrait, Photo, Video, Panorama, Night Vision, Pro Mode, Ultra-Wide, Macro Vision, Artificial intelligence: Google Lens Integration, Other Features: Face Beauty, HDR, 50M High-Res, Timer, Assistive Grid, Watermark, Video Feature: Timelapse, Snap in Video Recording",
        "Secondary Camera Available": "Yes",
        "Secondary Camera": "16MP Front Camera",
        "Secondary Camera Features": "16MP Camera Setup: (f/2.45 Aperture, 1.0um Pixel Size), Camera Feature: Portrait, Photo, Video, Pro Mode, Dual Capture, Night Vision, Face Beauty, Leveler, Assistive Grid, Watermark, HDR, Timer, Mirror, Video Feature: Snap in Video Recording",
        "Flash": "Single LED Flash",
        "HD Recording": "Yes",
        "Full HD Recording": "Yes",
        "Video Recording": "Yes",
        "Video Recording Resolution": "Rear: 1080p (at 30 fps), 720p (at 30 fps) | Front: 1080p (at 30 fps), 720p (at 30 fps)",
        "Frame Rate": "30 fps",
        "Dual Camera Lens": "Primary Camera",
        "Speaker Phone": "Yes",
        "Network Type": "4G, 3G, 2G",
        "Supported Networks": "4G LTE, UMTS, GSM",
        "Internet Connectivity": "4G, 3G, EDGE, Wi-Fi",
        "Bluetooth Support": "Yes",
        "Bluetooth Version": "v5.0",
        "Wi-Fi": "Yes",
        "Wi-Fi Version": "Wi-Fi 802.11 a/b/g/n/ac (2.4 GHz | 5 GHz)",
        "Wi-Fi Hotspot": "Yes",
        "NFC": "No",
        "USB Connectivity": "Yes",
        "Audio Jack": "3.5mm",
        "Map Support": "Yes",
        "GPS Support": "Yes",
        "Smartphone": "Yes",
        "SIM Size": "Nano Sim",
        "Graphics PPI": "268 PPI",
        "Sensors": "Fingerprint reader, Proximity sensor, Ambient Light sensor, Accelerometer, Notification LED, Gyroscope, e-Compass, SAR",
        "Upgradable Operating System": "3 Years Security Update",
        "Browser": "Google Chrome",
        "Other Features": "Water Repellant Design, Bottom Ported Loudspeaker, 1 Microphone, Side Fingerprint Reader, Face Unlock",
        "GPS Type": "GPS, A-GPS, LTEPP, SUPL, GLONASS, GALILEO",
        "FM Radio": "Yes",
        "FM Radio Recording": "Yes",
        "Battery Capacity": "5000 mAh",
        "Width": "74.94 mm",
        "Height": "163.95 mm",
        "Depth": "8.49 mm",
        "Weight": "185 g",
        "Warranty Summary": "1 Year on Handset and 6 Months on Accessories",
        "Domestic Warranty": "1 Year"
    },
    "product_description": {
        "16 MP Front Camera": "With the 16 MP selfie camera, you can take stunning selfies every time you feel like setting your Instagram ablaze. The front camera setup of this phone features a tiny aperture yet a big depth of focus, allowing you to view more of the world around you.",
        "50 MP Quad Camera": "This smartphone comes with a 50 MP Quad Camera that allows you to take crystal-clear photos in any lighting scenario. Its Quad Pixel technology improves low-light sensitivity resulting in clear and vivid photographs. Moreover, this phone boasts an 8 MP Ultra-wide Lens, Macro Vision, and Depth Sensor enabling you to take a full family picture with impeccable clarity.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "2",
            "1",
            "5",
            "4",
            "5",
            "1",
            "5",
            "1",
            "1",
            "1",
            "2",
            "1",
            "5",
            "4",
            "5",
            "1",
            "5",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "5",
            "1",
            "1",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "1",
            "1",
            "1",
            "1",
            "5",
            "5",
            "2",
            "5",
            "4",
            "1",
            "3",
            "5",
            "3",
            "1",
            "5",
            "1",
            "1",
            "1",
            "4",
            "4",
            "5",
            "1",
            "1",
            "5",
            "1",
            "4",
            "5",
            "1",
            "5",
            "3",
            "2",
            "5",
            "1",
            "5",
            "5",
            "5",
            "1",
            "1",
            "1",
            "5",
            "1",
            "1",
            "1",
            "1",
            "5",
            "5",
            "5",
            "3",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "3",
            "3",
            "5",
            "5",
            "5"
        ],
        "review": [
            "overall it is a slow category phone. sensitivity very poor. camera is not like 50 mp it is like a 20mp camera. apps r not open quickly. photo quality is normal. it is not a best choise in thi range. i m not satisfied with this product.",
            "If you like LAGGY go for it .\n\nIt's slow and hanging for even day to day task. Taking 4-7 seconds for apps to open and over that not at all smooth while using the apps. Should have been provided with atleast a decent processor which can support smooth day to day task. If your budget is 10K you can go to Moto E40 which is many times better than this faulty product.",
            "Looks are great.\nCamera is average.\nBattery is great.\nComplete Value for Money.",
            "Decent price for this phone . Camera is average .good battery backup",
            "Nice phone .moto is best.thanks Flipkart",
            "Display issue half screen dark black showing",
            "The Look is Amazing and 6.5inch display feels good in hand great Grip.",
            "Very poor phone . Very poor canera quality. Very slow processor. It takes more than 5 seconds to open any app. Even to pick a call , it takes time. Camera very poor , blurry photos , below average camera quality. Slow processor. Hanging. Overheating after using for 10 minutes. Total wastage of money. Don't go for it. I am regretting , you'll also regret if you buy it. Don't buy",
            "Very disappointed from this phone. Icons and processor feels like six to seven thousand phone. Front camera is average and back camera is very poor. This looks premium in advertisement but not in hands. I have 7years old moto G3, i thought G22 could be better than this ...but disappointed",
            "definately bad choice if you want to use heavy application and sometime not responding",
            "overall it is a slow category phone. sensitivity very poor. camera is not like 50 mp it is like a 20mp camera. apps r not open quickly. photo quality is normal. it is not a best choise in thi range. i m not satisfied with this product.",
            "If you like LAGGY go for it .\n\nIt's slow and hanging for even day to day task. Taking 4-7 seconds for apps to open and over that not at all smooth while using the apps. Should have been provided with atleast a decent processor which can support smooth day to day task. If your budget is 10K you can go to Moto E40 which is many times better than this faulty product.",
            "Looks are great.\nCamera is average.\nBattery is great.\nComplete Value for Money.",
            "Decent price for this phone . Camera is average .good battery backup",
            "Nice phone .moto is best.thanks Flipkart",
            "Display issue half screen dark black showing",
            "The Look is Amazing and 6.5inch display feels good in hand great Grip.",
            "Very poor phone . Very poor canera quality. Very slow processor. It takes more than 5 seconds to open any app. Even to pick a call , it takes time. Camera very poor , blurry photos , below average camera quality. Slow processor. Hanging. Overheating after using for 10 minutes. Total wastage of money. Don't go for it. I am regretting , you'll also regret if you buy it. Don't buy",
            "Very disappointed from this phone. Icons and processor feels like six to seven thousand phone. Front camera is average and back camera is very poor. This looks premium in advertisement but not in hands. I have 7years old moto G3, i thought G22 could be better than this ...but disappointed",
            "definately bad choice if you want to use heavy application and sometime not responding",
            "Waste of money, disappointed it",
            "very poor quality & customer never satisfy with it",
            "everything is okey but it stucks sometime... such as on scrolling reels it stucks or on performing heavy task. Don't buy you will regret.\nYou choose another option it is newly launched phone that's why it have fame which should be not.",
            "Very poor phone . Very poor camera quality. Very slow processor. Camera very poor , blurry photos , below average camera quality. Slow processor. Hanging. Overheating after using for 10 to 15 minutes. Even to pick a call , it takes time. Total wastage of money. Don't go for it. it takes time. I am regretting , you'll also regret if you buy it. Don't buy",
            "Don't buy this phone please",
            "No sound quality,hang problem,no video clearly,video pause automatically",
            "Disappointed with this product. Struggles to do basic tasks like attending and making a call. Call quality is pathetic. Display and audio are very poor. It is kind of a downgrade feeling I had after exchanging my Vivo Z1Pro. That was a gem compared to this Moto G22. In search of gold I lost a diamond 😐. Had very high hopes, Terrible product!!",
            "Very poor camera.. too noisy images.. slow display.. in this segment other brands provide much better quality phone.. regretting buying it, no option for returning",
            "Very poor performance by moto\nDon't buy this phone\nBoth Camera quality very poor.\nVery slow phone.",
            "worst experience ever, poor performance. go for samsung",
            "Photo qualities not good\nCharging time heating problem",
            "No camera quality, no battery backup, it's getting hung while trying to call someone or using the apps..",
            "Worst mobile",
            "Very Very poor phone . Very poor canera quality. Very slow hanging processor. It takes more than 10 seconds to open any app. Even to pick a call , it takes time. Camera very poor , blurry photos , below average camera quality. Slow hanging processor. Overheating after using for 10 minutes. Total wastage of money. Don't go for it. I am regretting. moto very poor brand",
            "Very poor quality",
            "Camera Quality is not good",
            "Lost money",
            "This is an worst product from moto.\nI am never expecting.",
            "Hi All,\n\nPlease don’t buy this product, its too slow and camera quality is too bad. And it can’t be return if you purchase this through online. Please be careful while purchasing it. #motorola",
            "Pls don't buy this phone totally getting worst experience camera and display quality is too bad ..same camera we can get it 5K rup",
            "Very nice at this package",
            "Poor quality of camera and slow processor... hanging while using...huhhhh...never go for it...worst product... waste of money...",
            "Very bad .....😡😡😡",
            "Excellent product easily Going Buy It…",
            "Very good 📲",
            "Nice in hand",
            "Phone was gud but poor camera while comparing to e series . Simply ok",
            "For a price like this Motorola nailed it.\nAt this price this is the best phone you could ask for. ❤️",
            "Good to receive",
            "Only good in looking",
            "Amazing phone",
            "Too slowww don't buy this product",
            "Very poor performance. So, don't waste your money",
            "Camera quality is not up to mark and phone is soo slow taking soo much time to open any app.. heating up after using hardly 10 minutes..don't buy..",
            "Slow performance\nLow speaker volume\nBad camera\nVery low on value for money\nStrongly advice against purchasing this",
            "Good budget phone",
            "Good product in this price range.",
            "Little disappointed",
            "Today I received moto g22, overall the phone is good it definitely justify the price. And camera is oK ok.",
            "Overall it's 50/50!\nIn this price range bunch of things related are appreciated and are not! LIKE;\nLove the design, Android update and battery!\nDidn't like the performance, display and camera! As a moto user for a long time been using different Motorola models and i know models of upper range provides better features display camera! But I'm appreciating this moto because can expect in this price range! And have achieved better comprises, and cost cuttings! Still would have been much better b...\nREAD MORE",
            "Very slow, phone",
            "Lazy performance... Phone weight is 200gm not 180gm as they claim...",
            "Nice Phone.",
            "Performance is poor.Phone lags in multiple apps run.\nBattery Discharge is optimised\nCamera is good.",
            "Not value for money, don't buy.No use of50MP camera when there is no proper screen to display pictures and videos.",
            "Thanks motorola value for money..",
            "Worst mobile",
            "Moto is now loosing market because if its poor products, I had same experience with moto g9. I would suggest to never buy moto mobiles in future. I wasted my money in it. This phone will have 90hz refresh rate marked but when actually using it, it ia not even 30 hz. Poor quality poor product.",
            "A very very poor quality phone. Don't buy it. Processor is very slow. Bad camera.",
            "Good phone",
            "It's a nice phone at this price range, keep display at 90hz for a smoother performance. Feels a little lag of a second for opening some functions or apps, not a bad product.",
            "Nice Budget phone.",
            "Moto g22 mobile camera very lo.. hanging Mobile",
            "Hanging problems",
            "Best budget phone.",
            "Display lighting are many times down and black screen. Lights are up down & many colours lining on screen are runing and hanged So you are requested to returns this product on urgent basis.",
            "Nice mobile phone from moto. This price range is good phone.",
            "Good quality",
            "Performance low and camera quality is not good compare to 50mp",
            "Bro..My personal opinion for this moto g22 phone is much much better for Me.... i Love this Device....\nThank U Flipkart.....",
            "Heating issue\nIf you use continue 2 hours phone will be heat",
            "Camara is 3rd class low quality.",
            "Back camera good but selfie selfie camera it's no god but phone is value for money",
            "Dont purchase this item, its extremely slow. Also Flipkart will not accept return.\n\nAt the end your money will be wasted",
            "For those who are fond of blot free stock Android experience at an economical price and a classy design, go for it.",
            "Awesome product best mobile",
            "Very good phone in this segment,\nI don't know why people gives fake ratings..\nDon't trust on any fake bad reviews,\nThis phone have only one problem , that this phone is very low in price that's why people's give bad ratings..",
            "Very poor phone and performance vry dmmm\nBattery backup is very bad totaly money waste",
            "Non Refundable product & waste of money.\nIf there is problem with the mobile, flipkart does nothing. They say that you should contact the moto company.\nDon't purchase mobile. Camera quality is very poor.",
            "The worst camera (50 mp is a joke), display and sound not worth the money. Please don't buy not worth it.",
            "Nice phone",
            "Mobile not performing as expected.",
            "Very poor phone. Don't buy it... You will regret... Camera quality is very poor... Real camera is even worst than 5 MP front & 8 MP Back. Phone working slow... So many bug.... Charging slow.... Even you can't return it.. As you have to ask Motorola company instead they'll say you to go service center....",
            "Very poor camera quality,slow software processor,hanging problem",
            "Phone is not upto mark\nChep product",
            "Nice",
            "At this price all the features the phone has are at the best. The apps stuck initially but when updated with the play store it all worked fine. Camera also shows distinct vibrant colours.\nThe device is super handy.",
            "Excellent product worth for this price",
            "Average camera. Not at all 50MP. Other than that its good for 10k",
            "Very good those for looking budget smartphones.",
            "Good but not meet my expectations 😒",
            "Very good product",
            "I purchased this mobile for my father. Display is ok in this price point of view. Icons are large and pure android phone and ad free mobile. Blindly you can purchase without any thought",
            "Osm phone",
            "Nice build quality great looking 👍",
            "Thank you filipkart",
            "Average percentage with poor camera quality",
            "Great phone at a great price",
            "The phone is very sexy,looks great\nUI looks stunning\nBut there's a bug,the lockscreen keeps lighting up without any reasons, that's the only problem i found yet\nIf you're looking a phone with great looks, awesome UI and great battery life then go for it 🔥🔥 You'll not regret",
            "Nice 👍 product value for money 🤑💰"
        ],
        "likes": [
            "0",
            "0",
            "33",
            "27",
            "70",
            "23",
            "16",
            "114",
            "0",
            "4",
            "0",
            "0",
            "33",
            "27",
            "70",
            "23",
            "16",
            "114",
            "0",
            "4",
            "4",
            "4",
            "21",
            "24",
            "16",
            "73",
            "9",
            "3",
            "3",
            "14",
            "10",
            "15",
            "11",
            "17",
            "2",
            "2",
            "3",
            "2",
            "3",
            "5",
            "4",
            "2",
            "2",
            "5",
            "1",
            "1",
            "3",
            "4",
            "2",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "0",
            "1",
            "3",
            "3",
            "16",
            "5",
            "4",
            "62",
            "0",
            "0",
            "0",
            "1",
            "3",
            "3",
            "16",
            "5",
            "4",
            "62",
            "0",
            "0",
            "0",
            "0",
            "8",
            "10",
            "6",
            "46",
            "2",
            "0",
            "0",
            "6",
            "4",
            "7",
            "5",
            "10",
            "0",
            "0",
            "0",
            "0",
            "1",
            "3",
            "3",
            "1",
            "1",
            "5",
            "0",
            "0",
            "5",
            "9",
            "6",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Does Moto G22 support Moto gestures?",
            "Q:Does Moto G22 support Fast/Quick/Turbo charging?",
            "Q:Is Moto G22 waterproof?",
            "Q:Does it support VoWiFi and VoLTE?",
            "Q:Can I use a USB-C Pen Drive on the phone?",
            "Q:What's the weight of the phone?",
            "Q:Can I capture good memories with Moto G22?",
            "Q:How is the Camera?",
            "Q:How is the performance of Moto G22?",
            "Q:Can I change the UI/UX of the mobile?",
            "Q:How's the selfie camera in Moto G22?",
            "Q:Which is the Android Version?",
            "Q:Does Moto G22 have ultra wide and macro cameras?",
            "Q:What is the Battery Capacity?",
            "Q:How ThinkShield security in Moto G22 useful for me?",
            "Q:Can I use my Bluetooth headset and accessories?",
            "Q:Does Moto G22 have good storage option?",
            "Q:What is the benefit of face beauty mode in Moto G22 ?"
        ],
        "answers": [
            "A:Yes, this phone supports all your favorite moto experiences, including moto display, chop chop flashlight, twist to open camera and others",
            "A:Yes, the phone supports 20W TurboPower charging which gives you a day's power in 30 minutes",
            "A:It is splash proof",
            "A:Yes, it supports both VoWiFi and VoLTE",
            "A:Yes, the phone�supports USB OTG for USB type C devices",
            "A:It is quite light at 185 grams",
            "A:This phone has a Quad camera camera comprising of 50MP (f/1.8) Quad Pixel technology lens, 8MP ultra-wide angle lens, 2MP Macro lens and 2MP Depth lens. There is a lens for every occasion.",
            "A:The 50MP camera supports PDAF which allows you to quickly capture pictures. You can also shoot Full HD videos at 30 fps.",
            "A:This phone has Octa core MediaTek Helio G37 SoC with 4GB RAM & 64GB storage with near stock Android 12, which gives a smooth and lag free experience",
            "A:This phone's MY UX lets you customize UI settings with advanced controls. You can create you own unique device themes by choosing fonts, colors, and icon shapes that you prefer.",
            "A:This phone has a 16MP (f/2.45) front camera, which is best in class",
            "A:It comes with the latest near Stock Android 12 Operating system",
            "A:Yes, it has 8MP f/2.2 ultra-wide angle lens with 118 degree field of view and 2 MP f/2.4 macro vision lens which allows you to fit more of the scene in your frame or to catch the tiniest of details",
            "A:This phone comes with battery capacity of 5000mAh that allows you to go through your day without needing to recharge. The 20W charger ensures your phone charges quickly.",
            "A:This phone provides Business grade security like Built-in Hardware security, Secure Supply chain,Android OS- Core Security & Policies and Elevated security protocols for E2E security and privacy.",
            "A:Yes, the phone supports Bluetooth version 5.0 to simultaneously connect with multiple Bluetooth devices",
            "A:Yes, This phone has 64GB of built-in-storage and supports microSD card of up to 1 TB which means you will not have to worry about running out of space",
            "A:Face Beauty improves your selfies by smoothing the skin to reduce blemishes or wrinkles, giving you the perfect picture"
        ],
        "likes": [
            "107",
            "127",
            "99",
            "12",
            "10",
            "10",
            "8",
            "9",
            "14",
            "13",
            "10",
            "7",
            "9",
            "10",
            "9",
            "7",
            "9",
            "7"
        ],
        "dislikes": [
            "26",
            "35",
            "33",
            "1",
            "2",
            "3",
            "2",
            "3",
            "7",
            "4",
            "2",
            "2",
            "1",
            "5",
            "2",
            "2",
            "2",
            "5"
        ]
    }
}