{
    "title": "MOTOROLA G51 5G (Bright Silver, 64 GB)  (4 GB RAM)",
    "product_specification": {
        "In The Box": "Handset, Charger, USB Cables, Guides, Sim Tool",
        "Model Number": "PAS80008IN",
        "Model Name": "G51 5G",
        "Color": "Bright Silver",
        "Browse Type": "Smartphones",
        "SIM Type": "Dual Sim",
        "Hybrid Sim Slot": "Yes",
        "Touchscreen": "Yes",
        "OTG Compatible": "Yes",
        "Sound Enhancements": "Single SPK Box with Smart PA, Dolby Atmos",
        "SAR Value": "Head: 1.34W/kg at1g, Body: 1.39W/kg at 1g",
        "Display Size": "17.27 cm (6.8 inch)",
        "Resolution": "2400 x 1080 Pixels",
        "Resolution Type": "Full HD+",
        "GPU": "Qualcomm Adreno 619",
        "Display Type": "Full HD+ LCD Display",
        "Other Display Features": "20:9 Aspect Ratio, Screen-to-Body Ratio: 83.81%",
        "Operating System": "Android 11",
        "Processor Type": "Qualcomm Snapdragon 480 Pro",
        "Primary Clock Speed": "2.2 GHz",
        "Operating Frequency": "5G NR: n1/n3/n5/n7/n8/n20/n28/n38/n40/n41/n77/n78, 4G LTE: B1/B2/B3/B5/B7/B8/B18/B20/B26/B28/B32/B38/B40/B41/B42/B43, 3G WCDMA: B1/B2/B4/B5/B8, 2G GSM: B2/B3/B5/B8",
        "Internal Storage": "64 GB",
        "RAM": "4 GB",
        "Expandable Storage": "1 TB",
        "Supported Memory Card Type": "Micro SD",
        "Memory Card Slot Type": "Hybrid Slot",
        "Primary Camera Available": "Yes",
        "Primary Camera": "50MP + 8MP + 2MP",
        "Primary Camera Features": "Triple Camera Setup: 50 MP (1/2.76 Inch Optical Format, f/1.8 Aperture, 0.64um Pixel Size) + 8 MP Wide/ Depth Camera (f/2.2 Aperture, 1.12um Pixel Size) + 2 MP Macro Camera (f/2.4 Aperture, 1.75um Pixel Size), Camera Feature: Dual Capture, Spot Color, Night Vision, Cinemagraph, Portrait, Cutout, Live Filter, Panorama, Pro, Ultra Res, Burst shot, Smart Composition, Shot Optimization, Auto Smile Capture, Gesture Capture, Time Lapse, Super Resolution, Multi-Frame Bokeh, Assistive Grid, Leveler, Watermark, RAW, Barcode Scanner, Active Photos, HDR, Digital Zoom Upto 8x, Long Exposure, Video Feature: Dual Capture, Spot Color, AR Stickers, Timelapse (W/ Hyperlapse), Slow motion, Video stabilization, Video Snapshot",
        "Secondary Camera Available": "Yes",
        "Secondary Camera": "13MP Front Camera",
        "Secondary Camera Features": "13 MP Camera Setup: ( f/2.2 Aperture, 1.12um Pixel Size), Camera Feature: Dual Capture, Spot Color, Night Vision, Cinemagraph, Portrait, Live Filter, Group Selfie, Pro Mode, Burst Shot, Low Light AI Selfie, Shot Optimization, Auto Smile Capture, Gesture Capture, Selfie Animation, Face Beauty, RAW Photo Output, HDR, Timer, Best Shot, Active Photos, Burst Shot, Assistive Grid, Leveler, Watermark, Live Filter, Video Feature: Shooting modes: Dual Capture, Spot Color, Timelapse (W/ Hyperlapse), Slow Motion, Video Stabilization, Face Beauty, Video Snapshot",
        "Flash": "Rear - LED Flash",
        "HD Recording": "Yes",
        "Full HD Recording": "Yes",
        "Video Recording Resolution": "Rear Camera: 1080p (at 30 fps/60 fps), 720p (at 30 fps), Slow Motion: 1080p (at 240 fps)| Front Camera: 1080p (at 30 fps)",
        "Digital Zoom": "8X",
        "Dual Camera Lens": "Primary Camera",
        "Network Type": "5G, 4G, 3G, 2G",
        "Supported Networks": "5G, 4G LTE, WCDMA, GSM",
        "Internet Connectivity": "5G, 4G, 3G, EDGE, Wi-Fi",
        "Bluetooth Support": "Yes",
        "Bluetooth Version": "v5.1",
        "Wi-Fi": "Yes",
        "Wi-Fi Version": "Wi-Fi 802.11 a/b/g/n/ac (2.4 GHz | 5.0 GHz)",
        "Wi-Fi Hotspot": "Yes",
        "NFC": "Yes",
        "USB Connectivity": "Yes",
        "Audio Jack": "3.5mm",
        "Map Support": "Google Maps",
        "GPS Support": "Yes",
        "Smartphone": "Yes",
        "SIM Size": "Nano",
        "Sensors": "Notification LED, Proximity, Ambient Light, Accelerometer, Gyroscope, Magnetometer (Compass)",
        "Upgradable Operating System": "Quarterly Security Update",
        "Browser": "Google Chrome",
        "Other Features": "Gradient Unibody ME, 20W Charger, 2 Microphone, Face Unlock, Google Assistant",
        "GPS Type": "GPS, A-GPS, LTEPP, SUPL, GLONASS, GAlILEO",
        "FM Radio": "Yes",
        "Battery Capacity": "5000 mAh",
        "Width": "76.54 mm",
        "Height": "170.47 mm",
        "Depth": "9.13 mm",
        "Weight": "208 g",
        "Warranty Summary": "1 Year on Handset and 6 Months on Accessories",
        "Domestic Warranty": "1 Year"
    },
    "product_description": {
        "5G Bands Support": "The Moto g51 mobile phone is compatible with 5G bands so that you can download your favourite movies, videos, and play online games without any lag.",
        "Snapdragon 480+ 5G Processor": "This mobile phone is powered by a Snapdragon 480+ 5G processor that delivers fast graphics performance, thus transforming your gaming experience into a realistic one. Also, the chipset on this mobile phone features high speed CPU and GPU performance with up to 200MHz CPU. As a result, you can enjoy seamless and responsive performance while editing photos, playing games, or multitasking.",
        "ThinkShield Security": "This mobile phone features ThinkShield business-grade security for mobile so that you can keep your data secure from malware, phishing, and other external threats.",
        "Seamless and Vibrant Display": "Moto g51 5G is equipped with a 17.5 cm (6.8) Full HD display so that you can enjoy streaming your favourite movies, TV shows, and games in a way that brings entertainment to life. The mobile also features a 120Hz refresh rate, so that you seamlessly shuffle between multiple apps without any lag. And, thanks to the 240Hz touch sampling rate, you can enjoy smooth gaming.",
        "Stunning Photos": "This mobile phone comes with a 50 MP main camera so that you can capture your favourite moments or shots under any lighting condition and from any angle. Also, this mobile phone features a Quad Pixel technology with low-light sensitivity that allows you to take sharp and vibrant pictures at all times. And, thanks to the 8 MP ultrawide and depth sensor as well as the macro vision camera, you can capture professional looking photos along with detailed close-ups.",
        "Power-efficient Battery": "No matter whether you are travelling or attending an office meeting, you don't have to worry about your battery running out, as this mobile phone runs on a 5000 mAh battery. As a result, you can enjoy up to 30 hours of uninterrupted battery life in a single full charge. Also, this mobile phone comes with a 20 W rapid charging feature, so that you can charge your phone in jiffy when your battery runs down.",
        "Near-stock Android 11": "You can enjoy the simple UI that’s free of bloatware and ads, thanks to the Near-stock Android 11 feature that allows you to avail powerful device controls. Also, you get access to the Android 12 update and 2 years of security updates. So, you can control your privacy settings, conversations, and more.",
        "IP52 Water-repellent Design": "This mobile phone comes with water repellent design so that you can enjoy worry-free protection against drops, shocks, spills, and splashes.",
        "Classy Design": "This smartphone features a clean and modern look, to deliver an aesthetic look to the phone."
    },
    "reviews": {
        "ratings": [
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "3",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "1",
            "5",
            "1",
            "5",
            "3",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "5",
            "3",
            "3",
            "3",
            "2",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "1",
            "1",
            "5",
            "5",
            "1",
            "5",
            "4",
            "2",
            "2",
            "1",
            "4",
            "1",
            "2",
            "1",
            "1",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "3",
            "1",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "2",
            "5",
            "2",
            "4",
            "5",
            "4",
            "5",
            "1",
            "5",
            "2",
            "2",
            "5",
            "5",
            "3",
            "4",
            "3",
            "5",
            "4",
            "4",
            "3",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "2",
            "4",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "2",
            "5",
            "4",
            "4",
            "3",
            "5",
            "4",
            "5",
            "4",
            "3",
            "4",
            "3",
            "5",
            "5",
            "4",
            "5",
            "2",
            "2",
            "5",
            "4",
            "1",
            "4",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "3",
            "5",
            "4",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "2",
            "5",
            "5",
            "5",
            "1",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "3",
            "2",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "2",
            "1",
            "1",
            "5",
            "5",
            "4",
            "5",
            "2",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "3",
            "3",
            "5",
            "4",
            "4",
            "4",
            "5",
            "3",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "3",
            "5",
            "2",
            "5",
            "3",
            "5",
            "3",
            "5",
            "2",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "1",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "3",
            "1",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "1",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5"
        ],
        "review": [
            "Let me tell you in details...\nCamera- good camera 9/10\nBattery- okay 8/10\nCharging time- 0to95 in 1.3hrs\nProcessor- sd 480+\nAntutu score- 240000+\nDisplay is good.\nAccording to me...Antutu score- should have been better at this price....other mobiles have Antutu score- more than 3lakhs at this price range.\nI would have been happy if Antutu score was more than 2.8lakhs.",
            "I am writing this review after using 2 days\n\n1. 2.2GB out of 4GB RAM is used by the OS and some pre-installed applications. So available RAM to the user is 1.8 GB.\n2. 24 GB out of 64GB storage RAM is used by the system and some pre-installed applications. So available storage RAM to the user is 40GB.\n3. 1GB RAM boost option is available under setting >> system >> performance\n4. Comes with NEG glass protection (Japanese Technology) equivalent to gorilla glass 3.\n5. Speaker is louder.\n6. Dolby Atmos is good.\n7. Rear camera quality is decent.\n8. Front camera quality is average.\n9. Display refresh rate can be fixed to 60 or 120 Hz or can be set as Auto select.\n10. Brightness of the display could be better for reading under outdoor sunlight.\n11. Battery backup could have been better with a super AMOLED display.\n12. A 20 watt charger charges the battery from 10 to 100% in 1.5hours.",
            "Great Value For Money phone.\nI have 2 Mi flagships launched this year as my daily driver. But could not resist buying this for the price. Moto did not disappoint.\nThe camera in daylight produces bright images ready for social media. You can reduce the warm tone in post if you like a cooler vibe. Even the wide angle is very good and produces better images than all 8mp snappers till 30K. Definitely better than my Mi 11x which I use as a secondary phone. I used latest gCam mod and found the moto stock cam to be better in 70 percent scenario.\nDisplay is good enough for the price. There is no stutters in UI as the processor is good enough. Moto even gives 1gb expansion for 4gb ram.\nBattery easily lasts a day with heavy use. Moto guestures are very convenient. The UI is clean and no boloatware, so very light on the resource.\nPeople complaining about low internal space is true. However, I think, thinkshield security and Moto softwares (which are very good once you use it) takes up that space. In my opinion hybrid sim slot could be a deal breaker for some. Atleast I wished there could be a dedicated card slot. There is also no option for you to use external memory card as internal. So you can't move your apps. Although, you can move your images and videos etc.\nVerdict: Go for it. It is definitely better than 4g phones like G40 and other 5g phones available in its price range",
            "Excellent camera with different pixel density modes, clean OS with useful UI and gesture customisations, solid build quality, long lasting battery, nice back cover, does not feel heavy due to good weight distribution, has good in hand feel, 20W charger supports fast charging.",
            "Don't Hesitate, just go for it.\nI always buy any product with lots of reserch so trust me, moto g51 5g worth every penny. Within tight 15k budget phones there are lots of phone but i can say moto g51 is best buy. I have been using this phone since last 2 weeks so let me share some pros and cons.\n\nPros-\n1. Future proof 5g with 12 band support so you don't have to worry when 5g will come to india, its a long road but its a good thing to be future proof.\n2. Amazing near stock android experience...\nREAD MORE",
            "Review after 1 week of use :\n\nPros:\n*Build quality is absolutely one of the best in this category (after using multiple smartphones of other brands)\n*Looks much attractive & eye-soothing in reality, compared to that in pictures\n*Camera quality is really great. Moto didn't comprise a single bit in quality. Portrait mode is mostly perfect & well composite with its AI processing. Colours stands out really attractive. Details are very well preserved even in ultra wide lens. Primary lens is wide, which makes it really useful in tight areas framing. Front camera is very well sorted and detailed.\n*Moto phones have really nice displays. With 120Hz , the display is the BEST YOU CAN GET IN THIS PRICE SEGMENT. Trust me I mean it (even compared to phones with budget amoled displays). Moto IS THE ONLY BRAND WHO ALWAYS DID & STILL PROVIDES glance display for quickly checking out time, notification even in LCD display.\n*The stock android experience is the smoothest compared to all bloatware loaded UIs for other brands.\n*Being the biggest phone (6.8\" display + 5000mah battery), still weighs significantly average.\n*With Dolby Atmos sound is great with earphones plugged in.\n\nCons:\n#No memory expansion & no more storage options models\n#Display maximum brightness is a little less in bright sunlight. Could have been a bit more.\n#Fast charging >20 watt should have been a feature.",
            "Pros :\n1. Daylight camera is good. Front camera is also good. Also You can install G Cam in moto Phones, I request all of you to install G Cam on this phone.\n2. UI is good and no major lags.\n3. Performance is surprisingly good. BGMI( Smooth + ultra with gyroscope runs without lags.)\n4. Display 120hz refresh rate handles good.\n5. Battery is good with auto refresh rate.\n\nCons :\n1. No option to change video resolution ( even can't see in which resolution I am shooting the video ).\n2. Very bad camera UI. It's sometime lags.\n3. Hybrid slot with 64 Gb storage is very less for storing apps also there is no option to transfer app data to SD card like One UI.\n4. Display Quality is average.",
            "Nice phone. Good performance.. It does it's duty under 15k specifications. Camera quality is acceptable. Height is little bit long.. 33w charger is best for this phone for fast charging.. Battery backup is good..Otherwise this phone is amazing. Worth for 15k.",
            "Phone is 208 gm but the grip is solid in single hand, due to 120hz display rate and processor screen performance is very good but camera need improvement (if the phone size is 6.4 inch and charger may 33watt then oh hoy hoy.।)",
            "Good performance and huge battery 🔋\nNice camera\nBetter display\nBig and vibrant processor\nTough made\nOver all super excited deal in this price range ❤️",
            "Let me tell you in details...\nCamera- good camera 9/10\nBattery- okay 8/10\nCharging time- 0to95 in 1.3hrs\nProcessor- sd 480+\nAntutu score- 240000+\nDisplay is good.\nAccording to me...Antutu score- should have been better at this price....other mobiles have Antutu score- more than 3lakhs at this price range.\nI would have been happy if Antutu score was more than 2.8lakhs.",
            "I am writing this review after using 2 days\n\n1. 2.2GB out of 4GB RAM is used by the OS and some pre-installed applications. So available RAM to the user is 1.8 GB.\n2. 24 GB out of 64GB storage RAM is used by the system and some pre-installed applications. So available storage RAM to the user is 40GB.\n3. 1GB RAM boost option is available under setting >> system >> performance\n4. Comes with NEG glass protection (Japanese Technology) equivalent to gorilla glass 3.\n5. Speaker is louder.\n6. Dolby Atmos is good.\n7. Rear camera quality is decent.\n8. Front camera quality is average.\n9. Display refresh rate can be fixed to 60 or 120 Hz or can be set as Auto select.\n10. Brightness of the display could be better for reading under outdoor sunlight.\n11. Battery backup could have been better with a super AMOLED display.\n12. A 20 watt charger charges the battery from 10 to 100% in 1.5hours.",
            "Great Value For Money phone.\nI have 2 Mi flagships launched this year as my daily driver. But could not resist buying this for the price. Moto did not disappoint.\nThe camera in daylight produces bright images ready for social media. You can reduce the warm tone in post if you like a cooler vibe. Even the wide angle is very good and produces better images than all 8mp snappers till 30K. Definitely better than my Mi 11x which I use as a secondary phone. I used latest gCam mod and found the moto stock cam to be better in 70 percent scenario.\nDisplay is good enough for the price. There is no stutters in UI as the processor is good enough. Moto even gives 1gb expansion for 4gb ram.\nBattery easily lasts a day with heavy use. Moto guestures are very convenient. The UI is clean and no boloatware, so very light on the resource.\nPeople complaining about low internal space is true. However, I think, thinkshield security and Moto softwares (which are very good once you use it) takes up that space. In my opinion hybrid sim slot could be a deal breaker for some. Atleast I wished there could be a dedicated card slot. There is also no option for you to use external memory card as internal. So you can't move your apps. Although, you can move your images and videos etc.\nVerdict: Go for it. It is definitely better than 4g phones like G40 and other 5g phones available in its price range",
            "Excellent camera with different pixel density modes, clean OS with useful UI and gesture customisations, solid build quality, long lasting battery, nice back cover, does not feel heavy due to good weight distribution, has good in hand feel, 20W charger supports fast charging.",
            "Don't Hesitate, just go for it.\nI always buy any product with lots of reserch so trust me, moto g51 5g worth every penny. Within tight 15k budget phones there are lots of phone but i can say moto g51 is best buy. I have been using this phone since last 2 weeks so let me share some pros and cons.\n\nPros-\n1. Future proof 5g with 12 band support so you don't have to worry when 5g will come to india, its a long road but its a good thing to be future proof.\n2. Amazing near stock android experience...\nREAD MORE",
            "Review after 1 week of use :\n\nPros:\n*Build quality is absolutely one of the best in this category (after using multiple smartphones of other brands)\n*Looks much attractive & eye-soothing in reality, compared to that in pictures\n*Camera quality is really great. Moto didn't comprise a single bit in quality. Portrait mode is mostly perfect & well composite with its AI processing. Colours stands out really attractive. Details are very well preserved even in ultra wide lens. Primary lens is wide, which makes it really useful in tight areas framing. Front camera is very well sorted and detailed.\n*Moto phones have really nice displays. With 120Hz , the display is the BEST YOU CAN GET IN THIS PRICE SEGMENT. Trust me I mean it (even compared to phones with budget amoled displays). Moto IS THE ONLY BRAND WHO ALWAYS DID & STILL PROVIDES glance display for quickly checking out time, notification even in LCD display.\n*The stock android experience is the smoothest compared to all bloatware loaded UIs for other brands.\n*Being the biggest phone (6.8\" display + 5000mah battery), still weighs significantly average.\n*With Dolby Atmos sound is great with earphones plugged in.\n\nCons:\n#No memory expansion & no more storage options models\n#Display maximum brightness is a little less in bright sunlight. Could have been a bit more.\n#Fast charging >20 watt should have been a feature.",
            "Pros :\n1. Daylight camera is good. Front camera is also good. Also You can install G Cam in moto Phones, I request all of you to install G Cam on this phone.\n2. UI is good and no major lags.\n3. Performance is surprisingly good. BGMI( Smooth + ultra with gyroscope runs without lags.)\n4. Display 120hz refresh rate handles good.\n5. Battery is good with auto refresh rate.\n\nCons :\n1. No option to change video resolution ( even can't see in which resolution I am shooting the video ).\n2. Very bad camera UI. It's sometime lags.\n3. Hybrid slot with 64 Gb storage is very less for storing apps also there is no option to transfer app data to SD card like One UI.\n4. Display Quality is average.",
            "Nice phone. Good performance.. It does it's duty under 15k specifications. Camera quality is acceptable. Height is little bit long.. 33w charger is best for this phone for fast charging.. Battery backup is good..Otherwise this phone is amazing. Worth for 15k.",
            "Phone is 208 gm but the grip is solid in single hand, due to 120hz display rate and processor screen performance is very good but camera need improvement (if the phone size is 6.4 inch and charger may 33watt then oh hoy hoy.।)",
            "Good performance and huge battery 🔋\nNice camera\nBetter display\nBig and vibrant processor\nTough made\nOver all super excited deal in this price range ❤️",
            "Pros:\n12 5G Bands.\nSuper fast and ultra smooth display. 120Hz Refresh Rate.\nVery smooth touch and interactive experience.\nExcellent camera quality and powerful features.\nBrilliant performance, no lags/glitches or frame drops.\nStock Android. No bloatware.\nTerrific connectivity. Faster 4G experience.\nGood battery backup and optimisation. 20W in box Type-C charger.\nMany useful additional features like peek display, attentive display, power touch, etc.\n3.5 mm audio jack.\n2 Years of guaranteed updates.\nCons:\nHybrid sim tray.\nNot available in many colours.\nSingle speaker (dual stereo not available). But the audio is clear and loud. Dolby Atmos also included. Not particularly a con but could have been better.",
            "I took this phone to use it as a portable hotspot. It has 4x4 mimo along with 5g but not sure which all bands support it.To lock band 4636 secret code can be used.i am able to lock 4g band without rooting.i am happy with it.\nHotspot with 2.4ghz is only showing max speed as 83mbps...which is something not expected.",
            "You will love the stock android experience.\nDisplay-Excellent.smooth.use it in auto mode for best experience,brightness could be better\nCamera-good but camera app is not that good\nPerformance-oh thats the USP of the device\nCall quality -motorola does the magic.crystal clear call quality,better than my iphone 8 and iphone xr.proximity sensor works perfectly,way better than xiomi and realme\n\nNEGATIVE-no onscreen lock button\n.Charging speed is only 20watt takes nearly 1.5- 2hr for full charge\n.slow face unlock",
            "Value for money 💰 phone\n\nDisplay is superb punchy colors with 120hz refresh rate.\nCall quality is way better than redmi phones .\nConnectivity is flawless getting uninterrupted network.\nPlayed PUBG smoothly on High settings without any frame lag.\nGetting 20miliseconds ping which is good.\nNo heating issues found till now.\nBattery is awesome for day to day use .\nAndroid 11 stock experience without those bs ads is just\ncherry 🍒 on top .\nDolby Atmos speaker gives well balanced sound output , crystal clear even at low volume.\n\nJust an issue on charging it takes nearly 3 hrs to charge from 10% to 100%\n\nOverall it's a bang on buck product and good for social media consumers and day to day users",
            "Nice product worth clean Android free from bloatware & bugs like Xiaomi mobiles .loud speakers adjust manual brightness or use auto mode.batter , camera superb ,Go for it.",
            "Wow! Awesome deal.\nWonderful display.\nCamera is little disappointing. Hope Motorola will fix the issue.\nPhone is equipped with twelve 5 G bande.\nAndroid 12 update is also promised by the company.\nDevice is free from bloatwares.\nOver all a good deal.\nI am very happy.👍👍👍",
            "I am giving review after been using since it's launch..For this Price , it's Awesome Deal...Jus Go fot it...This mobile is Ideal for the Users who are having Single Sim and Performance & Battery are their top priority ..I am not a heavy gamer or Generally won't take much photos. so it's suites perfectly for my dally Usage..Like it & Highly Recommended if ur budget was lessthen 15000",
            "Best phone I ever had and the best experience is the near stock Android\nPerformance wise I want to say this phone is ultra smooth and there will be no problem for day to day use",
            "GREAT PRODUCT\nIT'S GOOD PHONE WITH TWELVE 5G BAND, GOOD BATTRY BACKUP, DECENT CAMRA AND MOST INTRESTING THIG IS NO ADD PURE ANDROID",
            "Built quality is sturdy, phone has plastic unibody so prone to scratches, bettery is good for 1.5 day of normal use, gaming may reduce it to a day. Camera quality is good in day but little dull at night, other wise grt, front camera is good though.... processor is fast enough at tht price point, screen is good decent brightness even in sun.... bit tall phone tht any other competitor but easy to use.... weight distribution makes it feel lighter thn its 200+gms of weight.....\nOverall 4 star after a week long use....",
            "I'll only recommend it to casual user who doesn't need many apps and like clean os. I feel 4GB ram is not enough. Those who want a good camera also keep away from this.",
            "This is my first Motorola. Better than expected.\n1.Battery dries fast when maps used. Other than this no issues with battery. For normal use getting 30 hours backup.\n2. Camera is decent enough.\n3. Performance is smooth and good.\n4. Display is very good\n5. Pure Android no bloatwares.",
            "Nice packaging. Delivery on time. Product is genuine and authentic as per description. Mobile is working fine. Nice camera. Build & design is good. Mobile comes with pre applied protective case. Display is good with 120hz refresh rate very smooth. Fingerprint is side mounted and working fine. 5g is there with 12 bands support. So mobile is future proof. Also it's stock Android with no bloatware and no junk and ads. Also 4x4 MIMO with Carrier aggregation. It comes with 20watts fast charger. S...\nREAD MORE",
            "AWESOME mobile in this price range . Display and performance is very good after 1 month use.\nBattery may be optimised much more but good for one day use.",
            "camera is good in daylight in night it struggle but that can be overcome by gcam. performance is also good the 120hz make the phone smooth.\nOverall a good phone for the price range with near stock Android experience",
            "Pros:\n120hz and 60hz options give a very smooth experience.\nCamera is alright in day.\nScreen size is big and gaming and movies are fun to watch.\nBattery easily lasts one day even with 2-3 hrs of pubg.\nBattery charges up quickly (1-1.5 hrs).\nNear stock Android experience with 2 years of\n\nCons\nScreen is too big to be handled by one hand.\nGaming is ok but not for professionals.\nWhile changing themes, you can feel the phone stutter.\n5g is no use as of now.\nYou can only use 2 sim cards or one sim plus memory card.\n\nValue for money if you are willing to ignore the last mentioned con.",
            "Upgraded from a moto G5s+ due to screen damage. G51 5g is a decent upgrade. Indigo Colour is lovely.. storage is a less and dual sim users have to suffer.. being a non gaming power user.. it's a decent phone with great battery and good call quality. Abt 8hrs screen On time!!",
            "it is value for money all task is well performed by processor. Issue with this device is it has hybrid sim slote and only one varient of 4-64. It is well performed in daily usage with good camera quality and ready with 5g band.",
            "Best in this price range, Motorola is really doing great! Camera, built up , and UI everything is good. 💙",
            "Nice phone to these price and better than are brands",
            "Nice phone",
            "Best value added product in small budget. Camera quality is good.selfie camera quite disappointed.macro camera is best. Battery performance also good.display good.",
            "Camera quality is good",
            "I got this phone on Dec 20 and after uses of a week. I am writing just cons here because pros are already written a lot.\n1. Battery is not up to mark 5000 mah is just showcase.\n2. No quick charging\n3. Camera quality is moderate",
            "Nice camera",
            "Very good product........ But night mode r poor 😔😔",
            "In daylight situation camera is good, Display is good bt battery drain very fast. The phone performance also good.",
            "Nice phone but performance is bit average. Not so good for heavy users.",
            "Very nice mobile thanks Flipkart",
            "Best in Range. Far better than Redmi or Realme",
            "Best phone in this price range with stock Android and 5G",
            "Totaly worthy",
            "Value for money.👍\nNice performance.💪\nThanks Motorola😎😎",
            "Nice phone in this range ...smooth performance ...camera is best in this sigment ...good phone ...go for it",
            "Handset is getting shut down automatically 2-4 times in a day when it is in On condition.😠😠😠😠😠 Motorola fix this issue as soon as possible 😠😠😠",
            "Value for money!",
            "First of all the 120hz is REAL when I tried pubg/bgmi with fps meter the 90 fps were real the 5g connectivity is great I have tried it with my router the screen size is also nice overall everything thing is great best smartphone in this price segment",
            "My First mobile Thank you Motorola i love you moto",
            "out of 5 star ratings\n\nCamera - 3 ( Gcam best alternative)\nDisplay - 2\nSound- 3\nUI- 5\nBattery -3 (Dont buy if you are a gamer or pro user)\nCharging time - 2 hours\nNetwork - 5",
            "Battery capacity not good",
            "Suitable as per description",
            "Very nice performance in this price over all is good .",
            "After 3 days use...\nsoftware is superb...battery for one day....not for gamers....app launching is fast and camera quality is superb....not so bulky ....but screen is big\nfeatures are awesome like pic in pic , split screen,",
            "Good, value for money",
            "Excellent Valuable",
            "Mobile is getting very slow within 1 month of purchase. I haven’t installed any game also. RAM management is also very poor. I think Moto G31 with 6 GB RAM is better option",
            "Value for money big display fast prosesarer good camera",
            "Nice product.Good looking. If you are passionate in moto brand then must go for it. Overall good product.",
            "One will not get such daily usable long lasting 5g in this segment. So GO FOR IT",
            "Camera quality is awesome...and other features is great 👍👍",
            "Nice Phone but camera is not good",
            "Good phone, felt indecisive while buying a phone with just 4GB ram but it handles all the tasks very well.",
            "Best in class….first 5g phone with Snapdragon 480+",
            "Best cemara",
            "Hanging problem",
            "Value for money 💰 bt battery drain fast 😌 camera performance good 🥳",
            "Nice phone👍",
            "Battery and charging time not good\nOver all good product...",
            "Hurry hup!!!\nBuy for internet speed!\nBest internet speed,best performance snapdragon 480+.\nThanks Moto!",
            "Value for money .",
            "Nice phone",
            "This price is very good Android smartphone\nMoto g51 5G",
            "Nice 👍 phone..",
            "excellent",
            "Don’t buy this mobile from flipkart. Video call quality on whatshap, Duo & Google meet are very bad. Four year old moto g4 plus has better video call quality than this mobile. They will not return this product & say you are using third party apps. They are not responsible if any third party apps are not functioning on this mobile.",
            "Handset is getting shut down automatically 2-4 times in a day when it is in ON condition. It is creating worst situation when doing any official work.",
            "Ok i am happy with Flipkart",
            "Very worst camera experience ever I had even old nokia 2Mp cameras are better than this .",
            "Clear n brigh",
            "Ram capacity 4GB only so Performance not satisfied. Camera open close slowly.",
            "Honest Opinion after using for a month.\nBest in all aspects like RAM, CPU, SCREEN, BUILT QUALITY and CAMERA.\nNo complaints so far.\nIf you want good quality 5G phone under 15k budget then go for it.",
            "Too heavy to handle , very large display can not be used by single hand. Amoled display would have been better. Awkward size of mobile , length must be reduced.\nRest all are good.",
            "By Moto G51 5g",
            "Good product",
            "Motorola is standard for quality, this G 51 performance is good. Camera also performing very well, no lags while using multiple application in same time.",
            "Very nice mobile",
            "Battery not working properly as 5000 MAH",
            "best camera photo with gcam under 15k",
            "Stock Android and i love it ✌️",
            "Best in segment",
            "Ok",
            "very good phone good display good performance perfect product",
            "Camera is blurr in video call",
            "Nice camera",
            "Camera 3.5/5\nBattery 4.5/5\nDisplay 4.5/5\nPerformance 4/5\nGaming 3/5\nValue for money 4.5/5",
            "Best phone under 15000 and with 5G ❤️ । No compermize।",
            "Nice product still need update to fix some issues otherwise nice phone",
            "Good you not gonna regret after buying this product. It's 5G smartphone and quite smoothly working over-all good",
            "Best 5G mobile under 15000",
            "Best phone under 15k budget . Performance is best you wont regret!",
            "Posting this review after 4 days ,very poor performance and front camera is below ok",
            "Processor can handle daily tasks, but when it comes to gaming, it's not as good. Also, I have been facing issues with the display. It keeps on hanging while streaming hotstar at 720p which is a major con given that the amount of content people watch these days.",
            "Worst experience ever",
            "Heating product icceu",
            "Good mobile phone..loved it...",
            "Overall good",
            "Huge Phone…. With clean OS…. Awesome",
            "Good",
            "Good for normal use.. camera below average\nBattery oneday.. display good...",
            "I m so happy with Motorola I m using 4 years this is my third phone",
            "Nice product..",
            "Nice phone",
            "Value for money product at this price.",
            "It was okay product",
            "Arrived before the time mentioned, This mobile is Awesome!",
            "Value for money 💰💰💸",
            "Nice phone",
            "Ok",
            "Nice product but battery drain problem",
            "Thank u Flipkart thank u Motorola",
            "Moto great experience super phone 5g mobile in this price thankyou Flipkart",
            "Best affordable 5G smartphone.",
            "The price of the product is great.",
            "Camera is average rest others are good.\nValue for money",
            "Mind blowing",
            "Awesome phone under 15k with 5g",
            "Good product in budget price",
            "Just okay product from Motorola.\nAverage camera :(",
            "Good",
            "Nice",
            "Excellent Phone.",
            "I just have the worst network problem with this. I was using a Xiaomi phone before this and my internet was fine with Jio 4G but with this, it is just worst. It's like I am on a 2G network and it is a 5G phone. A 5G phone which can't even run 4G, which is running 4G worse than my old Xiaomi 4G phone. I have to shift rooms, go to terrace just to get network. Don't know why this is happening. (1)\n\nAlso you get 20W charger in the box, atleast 30W charger should be there. Also battery is draining faster than usual. (2)\n\nCamera performance is also just average, night performance is worse and night mode is just worst. I think it shouldn't have this night mode because no one is going to use it. If you use it, you will know why. (3)\n\nJust one word \"WORST\"",
            "It's getting switch off automatically,",
            "No Official Gallery App and No Official Music Player. No Double Touch To Lock Screen. Just These Are The Drawback. So Be Prepare Your Brain 🧠",
            "Excellent product I m happy to have this",
            "Varry bad this time motrola is dispoint me bad 🤳 cameras not good",
            "Awesome...very smooth Display and performance",
            "Am really satisfied with this phone.looks a big sized phone.. overall performance is very good..I am getting one day after full charge.. battery is not draining fast.camera is Ok...but little bit has to improve..",
            "facing issue with network connectivity\ndisplay is not so good\nfront camera is poor during low light",
            "Overall performance is slow",
            "Wars product I have ever received by Flipkart",
            "Phone is good but made me feel build not good. On pressing back. It made me feel it stick to back and come up.",
            "Battery not backup",
            "4gb Ram 64 not good",
            "Worst 50mp(back) & 13mp(front) ever",
            "Mobile calling on spiker Mike\nnot working",
            "At This Price Range Best 5g mobile\nDisplay Too Good\nCameras are Nice\nBattery Backup is Best\nNo laaag and No issues\nSD 480 plus is the power full processer\nSize is Little Big but Handy\nOver All who loves the big screen mobile this is the one.",
            "Got it after 6 days.\nPros-\nGood Built quality,\nNice UI,\nStock Android,\nDolby speaker,\nGood 120Hz display\n\nPons-\nCamera is not as good as my previous phone redmi note 9 pro. Motorola still need to work on softwares. I must agree Xiaomi is more advanced in camera.\n\n120Hz drains lots of battery.\n\nExcept this the phone is value for money. If you're a camera freak then choose another option.",
            "Good",
            "Don't waste your money to buy this low quality phone, According to price camera is below average, processor is okay, battery is okay. Camera doesn't work nicely, picture quality is very poor. Heavy, doesn't looks like classy.",
            "Nice phone",
            "This company item is very very best",
            "Good phone",
            "Buy it now",
            "Quite good!!",
            "Package and delivery was good. Opened the box and found newish moto g51. Switched on. Everything was more than expectations until now. Recommend. Comments on functioning and other features later after few days.Appreciate the services of Flipkart, seller and courier.",
            "The UI stutters a lot and that's not expected of a phone purchased at 15k. Even with a clean stock experience its not worth it. Would not recommend for anybody.",
            "Camera poor quality & battee backup poor & net slow tuch hard totally weast money",
            "Just go for it it’s totally worth the price",
            "All in one mobile",
            "good",
            "Very nice",
            "Its a good device if you are normal user. Screen is not Amoled with average brightness but is of 120 Hz. Processor is the key factor and stock Android is best for normal use and elders\nSpeeker is single but works fine\nHybrid sim slot means one sim and one memory card or two sims at a time (64 gb internal)\nMotorola service support is poor though( past experience)",
            "Amazing Smartphone Flipkart was delivered my device just in one day",
            "Awesome",
            "Best but battery is normal",
            "Good performance nice",
            "Good",
            "Worth for money",
            "This phone is not good.\nSo many feature is not available in this phone.\nCamera quality is very bad.\nAlbum is not available.\nI m not satisfied with this phone.\nOnly battery nd display is good.",
            "Good 👍",
            "I was using moto one action before it and I shifted to this one with the hope of upgrade but the cam, display, processor and weight are disappointing me a lot and the charging time of the device is just 3.5 hrs which is actually horrible...",
            "Thanks to Motorola.",
            "Loved it 😍😍😍",
            "*Battery is avarage\n*Overall performance, camera, screen is good\n* call quality and network connectivity is simply great\n* stock android, 5g, big screen and moto gesture makes it worth buying...\n*Good work moto but there is a room for improvement...",
            "Best phone in the budget",
            "Very bad product",
            "Best phone for money velu",
            "First of all worst customer support experience by Flipkart. Raised a replacement request and did not receive call back. Received wrong msgs that the executive tried to reach out.\n\nComing to the mobile:\nNot worth 15k...UI is very slow, camera quality is poor and you don't get the feel of a smartphone other than a big screen.",
            "Need to improve in battery has heating problem. Also phone has brightness is not working properly.\nOld Lenovo phone are the best🙂.but Motorola company need to improve more on\n1.selfie camera,\n2.battery heating problem\n3. Brightness problem\n4. Also should manufacturer more dual sims phones. Not hybrid sim",
            "Ok ok",
            "Well taking a look at the budget of 15000 this is the best 5G phone you could get. Perfect for a student as it has 120hz refresh rate and a decent Snapdragon 480 processor not a gaming phone . Talking about the camera it's decent not that great but yeah it's nice. I really love it's battery backup I don't play games on it so yeah it lasts about a day for me, the only cons are that it carries a 20W charger and it has only 64 GB of storage so yeah better get a sd card",
            "nice",
            "Nice product",
            "Network Reception is very poor..",
            "Awesome budgeted mobile for all time",
            "Nice 👍🏻",
            "Below par battery backup\nBut smoothest display ever, very real time google assistant\nGreat for study & streaming, heavy royal piece",
            "Front camera is waste, other than that it's value for money",
            "Nice",
            "Very good phone display is so smooth and good camera",
            "Worth the price...",
            "Stock Android best.\nBattery 🔋 good.\nDisplay nic.\nCamera need improvement.",
            "Just due to 120 hz refresh rate and big display the battery didn't give much backup rest is fine",
            "So good phone.\nBest delivery.",
            "Amazing Speed. Full on",
            "Awesome Product At this Price",
            "Worst camera",
            "Good performance by Moto",
            "Good",
            "Great",
            "Phone is good, camera is average",
            "Very good product",
            "Is it good",
            "Nice phone",
            "Under 15k, this is a perfect 5G phn with large display and big battery n it's a great deal...",
            "Good in this budget.. camera could have been better at this price segment.",
            "Everything is okey..\nDisplay, sound, display, performance is decent...\nOnly camera is not level of acceptable but you can't get any camera phone at midrange...🙂.\nYou should buy this phone...",
            "Best budget 5g phone like to use. Big display, big battery... thank you Motorala",
            "Best phone at this price",
            "Vulbe for money good product\nThanks for Flipkart",
            "Just a Line\nHello Moto",
            "Best 5g phone in the range",
            "Camera worst",
            "Good fhone",
            "GOOD PRODUCT",
            "Good phone under 15k",
            "Camera quality not that much good .. it can be better if moto do something on it .. otherwise moto G51 5G is good .. because it's a tallest phone I've ever seen ..",
            "Not bad",
            "Good but hanging sometime",
            "A value added product",
            "Best one",
            "Worst worst gaming performance ever. Game crashes while playing and lags for like 2 sec again and again.",
            "Amezing",
            "nice",
            "Only cons i feel is we don't get hard back case cover, other then that battery charging speed is fine but compare to Moto g5s plus ,moto g51 speed is low, nice mobile & value for money, internet speed is also good I use mobile hot spot 10 hrs average to connect my laptop I don't face any issue on that.",
            "Hangs frequently and processing speed is low",
            "Very very nice Phone",
            "Nice product",
            "Wonderful phone.. But it's big phone compared to others phone",
            "It's nice product at this price",
            "Simple phone\nOne line discription will be\nIt just work's and it's boring\nNothing exciting is there in it",
            "Good camera",
            "Good for Stock experience and as a non chinese brand phone.",
            "Looking so nice",
            "tHe bEst UI.\nAnd Features OH MY GOD wala",
            "Overall a good product..",
            "Good buy",
            "Don't buy waste of money",
            "Getting hang , when we keep ideal for few hours it get time to wakeup and get stuck maybe software issue is there , camara needs optimization AI is useless in the phone and storage is slow that affecting on refresh rate and app opening time",
            "Very good phone & build quality. Battery backup is good. Stock android & optimization are also very good.",
            "Mobile was good battery drain fast after playing bgmi or other games",
            "Waste of money",
            "Battery is good and display is good but night mode camera very very bad no clearly image so please update camera",
            "Awesome",
            "Nice product",
            "Not a very smooth product. Camera is not good at all, just basic. Slightly bigger in feel.",
            "Overall good phone and my ratings as below\nDisplay and interface 🔥GREAT🔥\nBuild and look 🔥Good🔥\nCamera/Battery/Network Reception ⭐ Average ⭐\nWorth for price ? Yes Definitely considering Android 11 and 5G future proof and not dis appointing in any key areas.",
            "Hi! A fine product by Moto. Overall, satisfactorily good. I am happy and recommend it. It is way better than the rest in this segment. Thanks Moto and Flipkart.",
            "It's the best product selling at affordable prices",
            "Good performance mobile",
            "Balanced phone.",
            "The phone was good but the battery performance with 120hz was not satisfied but overall if we kept the phone in Auto then it passed a whole.",
            "Camera not good",
            "Good phone",
            "The phone looks excellent with a good package at this price point but the cameras could be better! Overall nice gadget I liked it 😉",
            "Phone stopped working after 2eeek . Touch sensor not working and while calling scree never turn off result in disconnecting the call",
            "Very good phone and photos I like it so much",
            "Good device. A 90Hz AMOLED instead of 120Hz LCD and UFS storage would have been better.",
            "Worth",
            "Excellent phone and very good build quality.",
            "Nice phone",
            "This product network issu.",
            "Overall is Good camera quality is average",
            "Amazing 5G phone for the price. Almost stock Android. Great screen.",
            "Front camera could have been better, back camera is not as good as one can think from such configuration. Display is great, battery is good too.",
            "Overall a decent phone",
            "Awosam budget phone",
            "Good product by Motorola",
            "Its ok camera quality very poor",
            "Finger touch is not working properly.",
            "Better but not Great .\nAs considering 1st priority as 5G then it's the best phone under 15k till now with all they have given.\nNo any other brand offer these specifications and all things. But could have better.\nGreat job Motorola.",
            "This so very amazing product super mobile my favourite motog51 this mobile camera super 🔥🔥🔥🔥🔥",
            "Excellent mobile",
            "Dislike camera .. mood off ..",
            "Best 5G phone with in 15k, has most 5g Bands,\n\nBigger Size phone, Battery is superb, bit heavy, call recording is worse in Moto it prompts as the call is been recording.\n\nWare as in MI phone call recording is silent, no prompting.",
            "Nice product",
            "Good phone",
            "Phone looks very big, has a nice camera at this range and battery lasts almost a day with full usage too. You get a back cover with it which is very nice.",
            "Awesome",
            "Parfect to all",
            "Extraordinary experience",
            "Awesome, feel good in hand and future-proof as well with 5g. Liked it.",
            "Best 5g mobile under good budget. Nice performance, good camera quality. Overall good experience",
            "Everything is good except ,It doesn't have option of switching to 5g ..... waiting for system\nto upgrade...i",
            "Real good",
            "Only Buy if you want a clean experience and performance that a stock android provides other than that\n\nCamera Just OK\nSPEAKER OK\nPERFORMANCE GREAT\n\nAND THE MOST IMPORTANT THING IS ITS ON THE HEAVY SIDE NOT FOR REGULAR PHONE USERS",
            "Good phone",
            "Only for 5G nothing is better",
            "Very letest price",
            "Value for money phone",
            "Fabulous",
            "Really Nice Product and Awesome Phone Camera Quality is Also Very Good and Performance is very well I'm so happy....",
            "Great phone with a good display and clean UI\nCarrier aggregation and WiFi connectivity are the best\nPhone feels a little large in hand\nCamera in dull lighting is not up to the mark but works perfectly in normal/bright light",
            "Good",
            "Very good",
            "Phone is amazing..just go for it..",
            "I bought this for my mother, and for her it works flawless.\nAt this price point can't complaint much.\nThough I have seen frame drops while switching apps and lil shutter lag in camera.",
            "nice",
            "When I open camera phone hand a lot. UI is also lags some times.",
            "Good",
            "Super",
            "Value for Money",
            "Nice phone",
            "Good value under 15k.\nWith 12 bands of 5g being its key highlight, on par battery performance and clean UI experience. Not best screen quality but not bad either. Overall a well balanced 5G phone under 15k. If you don’t want best screen and best camera under 15k then it’s a thumbs up.",
            "Must buy phone in this range.\nOverall performance is best.",
            "Super",
            "Terrific purchase! Completely satisfied with performance, camera, battery backup, interface and built quality, you can blindly go for it if you're planning to buy a stock ui under 15k.",
            "Vey nice mobile and network speed also very good",
            "Can take amazing shots with gcam mod and display is also very colour accurate",
            "This phone is value to money phone. I use this it's a very nice phone.",
            "Good",
            "Excellent mobile in This price range ☺️",
            "Amazing product",
            "Ok good",
            "Display is not very sharp and bright but it's descent.\nCamera is below average.\nAnd other aspects it's very good like battery life, performance, internet connectivity (4g+ carrier agreegation) more stable in this device and also future proof because of it's 12 5g band's. Thank you motorola to giving me us a true 5g phone....",
            "Very good mobile",
            "Display size is too large. Camera quality is poor",
            "I am facing network issue",
            "Nice phone.",
            "good",
            "Good experience",
            "good mobile in budget prices",
            "Everything is good with this mobile at this price range.. ofcourse better at this price..only disappointment is with display size..too big (6.8 inch). if that is not a concern, go for it.",
            "Decent smartphone 👍",
            "I love g51",
            "Excellent mobile in this price range.",
            "Great product with extraordinary quality with superior pricing",
            "Awesome phone.",
            "best smartphone at this price",
            "Nice",
            "Very good 5g supported 12 band",
            "1.feels heavy more then my expectations\n2.display less bright because o was expecting more\n3. charging is also slow , even thought it's not so quick charging it will get heated while charging\n4 there data collection option in settings which will on by default in starting, but you cam trun off",
            "It's a really good product.",
            "Overall it's good..👍",
            "Very bad performance of selfie 🤳 n battery draining very soon as expected....",
            "No use",
            "Not as excepted waste of money",
            "Not Amoled display\n4/64 MEMORIAL\nevery good moto\nBig display good working\nCamera is good quality\nBut space memory is losss",
            "Awesome Mobile from moto",
            "Best budget 5G phone 👏🏻👏🏻👍🏻",
            "worth!",
            "App lock privacy settings not available",
            "Very good.",
            "I think best in the market of 5g mobile. This is snapdragon processor and no one give this processor in this price , so my friend in this mobile is value for money.",
            "Good Quality Best Product",
            "Network connectivity issue and while playing bgmi the ping goes high upto 600 ...if Motorola fix this issue it will become a super phone in this price range",
            "It is a nice 5G phone under 15k with no compromises.",
            "All is well",
            "Phone size is bigger for me but overall I like the phone.",
            "Really good phone",
            "Nice",
            "Selfie camera is not good",
            "Good",
            "Best phone",
            "Nice 👍",
            "Best Birthday gift for my wife, it was an upgrade from moto g4 to g51😊.\nNear stock android with moto is always best.\nPerformance good\nBattery awesome, with 20w turbo charger its really good.\nCamera is also ok.\nLooks awesome in indigo,looks bit long at first glance but later it won't make any difference.\nIt could have been better if 128gb variant or at least dedicated sim slot.\nBest5g phone in this budget.",
            "Super mobile with all advance features. Tnq flipkart and moto",
            "Nice product",
            "Worth the money❤️",
            "Amazing product.\nHello Moto....✍️",
            "Nice",
            "Ok",
            "Good product",
            "Awesome phone . Stock Android .. value for money",
            "It's just worst phone. No exchange option.\nYou guys better look for another brand.\nIt's just worst phone.",
            "Good phone. Nice performance.",
            "4 star in all things,but 5 star in 5g.",
            "Overall it's very good phone, camera they could have improved more, else budget deal. Good mid-Ranger",
            "Over all best budget friendly but not good for regular gamers\nCamera could be more better",
            "Super",
            "In this price range...its a great smartphone",
            "Superb phone great deal",
            "It's a great moto phone, the better proccessor. Flipkart doing a great deal in moto phones. Thnkx Flipkart for speed delivery.",
            "Super phone good camera , good display , good performance , good battery everything is outstanding. A budget 5g King",
            "Got whAt I was looking for",
            "Not good",
            "Camera:-3.5(front camera is not good and back camera is decant but when you zoom then pic got little blurr)\n\nDusplay-4.6(display is good ,touch responce is also good)\n\nBattry:-3.8(i got 5.30 hr non stop gamming downloard and video playing)\n\nGamming:-4.3(touch is good and game is not lagging and gamming mode is assom)\n\nOther Performence:-4.5(downloard speed is good but when i downloard many file then it leg a little otherwise it's good)\n\nFingerprint:-4.8(it's quick)\n\nThis is my review after 3 days of using so I might left something ...",
            "very good phone .",
            "Good",
            "Better in this segment",
            "Excellent",
            "Best and nice 5g phone in this renge..always moto fan..",
            "Phone is good but battery is ok ok display nice",
            "Ok",
            "Nice product",
            "Bog",
            "Very nice product",
            "Excellent Performance this Phone",
            "Best buy phone at this price.......",
            "It's amazing to use some new features slim n comfy to use.",
            "Extremely good for the price. Love the gestures features. Getting use to took some time though. Surprizingly, 50mp Camera quality is better than Samsung 64mp camera.",
            "Big phone . Medium bujjet . Good mobiles from motorola. But net work someissu. Thanks to flipkart.",
            "Good stock Android with minimal bloatware. No lag or glitch as such. Camera is average and I hope that the Android update will fix it. Little uncomfortable for usage considering the huge screen size.",
            "A value product\n👍 flipkart",
            "A lot of time I see it lags and performance is not that good, not satisfied.",
            "Good",
            "Price not worth battery backup good but camera and display not good at all",
            "Product is good",
            "Only good in budget",
            "Ok",
            "Worst Mobile Phone I've ever bought from Flipkart,\nBad Camera , not good Battery back-up,\nDisplay is just Okay.\nIt's Price should be 12k ..\nOverall Phone body is also thick..",
            "Good product",
            "Great phone,most important battery backup is good.",
            "For front camera, i would say it's not that good. And pixel get's deteriorated. Else on the whole phone is good for gaming.",
            "Overall very good phone. Selfie camera is ok...worth to buy this phone.You will not regret",
            "Everything is good but Video on OTT platform such as Sony LIV and Zee 5 not playing properly...Don't know what is the issue.",
            "BEST IN PRICE RANGE",
            "Awesome",
            "Nice product",
            "Good 5g smart phone in this price range, connectivity is best in this smartphone",
            "good mobile camera & battery are very nice i am happy with it (:",
            "Best budget 5G smartphone\nBut ram and storage (4GB Ram and 64GB) is not enough\nQuality of the mobile is Good",
            "Worst camera Choose Oppo a53s instead of this",
            "Awesome product",
            "Worst camera",
            "It is definitely value for money. Performance, ready for 5g revolution, clean UI stock android experience, battery performance motorola brand experience top class.\nOnly thing might be improved bit is camera performance, and 128GB version of phone. But theses negative things doesnt matter with this price range…Go for it guys :)",
            "M writing this review after one week use phone is working good and all features are excellent as mentioned in mannual overall it is nice phone under 15k",
            "The only disadvantage is to handle the handset because of it long screen size\nThe phone is too good",
            "Best budget mobile used for week great performance. Gaming performance is so good. Sound quality is also good you will feel the beat because of Dolby Atmos. camera quality is value for money . Camera is like OnePlus. Display is so good battery performance is better you should buy it . A long investment thing",
            "Good",
            "It’s designed and Camara and also too good",
            "Very nice phone and very very affordable phone this price segment thanks",
            "Camera 📷 not good",
            "Worst camera and battery performance very poor don't buy very disappointed flip cart return policy is worst.",
            "Great product build. Smooth UI due to near stock android. Below average camera. Good battery life. Totally value for money.",
            "Great phone in 15k🔥♥️",
            "Very cool 5G phone under 14K. Go for it.",
            "Worst function operation.. Not an user friendly",
            "Good phone must buy",
            "Ossum phone motog51",
            "Nice Display, Good battery backup, Smooth Browsing, Fast Processor and Stock Android experience. Camera snaps are pretty nice.claiming 12 5 G band support.",
            "💋💋💋❤❤❤❤nic and thanks filipkard moto is best",
            "Awesome",
            "Great camera and chargeing time 1:40 h\nAnd good display",
            "Best 5g mobile",
            "Good mobile",
            "Dual app not works and camera clarity not much good screenmirror not works",
            "I have been using Motorola from so many years, just because of stock Android and moto gesture features, but this time I somewhere felt should I think again, because The camera quality is very poor, if your are using selfie camera in any other app than camera app it clicks 2x pictures by default which is very disappointing, then camera is 12mp and they are saying it 50mp by just multiplying it 4 times, about performance It lagged ones time in 2 days don't know why, played pubg it worked well on high settings, somewhere i felt it heated up, if you are looking for 5g phone go for it otherwise there is g40 fusion, G60 in similar range",
            "My device automatically shuts down.",
            "Excellent phone I am satisfied.",
            "Initial impression very good, will update after usage.",
            "For the Price - it's a class product ... Plastic body makes it feel light and rear camera is good",
            "Really a nice phone with decent performance and no bloatware!\n\nThe 120 Hz display seems very smooth and good enough. Network reception is amazing whether it be cellular network or wifi.\n\nOverall it is a recommended and value for money phone."
        ],
        "likes": [
            "334",
            "500",
            "582",
            "220",
            "38",
            "77",
            "60",
            "21",
            "40",
            "13",
            "334",
            "500",
            "582",
            "220",
            "38",
            "77",
            "60",
            "21",
            "40",
            "13",
            "17",
            "4",
            "4",
            "15",
            "3",
            "11",
            "6",
            "5",
            "3",
            "4",
            "0",
            "0",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "22",
            "91",
            "123",
            "136",
            "141",
            "10",
            "20",
            "19",
            "61",
            "8",
            "23",
            "10",
            "11",
            "6",
            "19",
            "6",
            "9",
            "8",
            "2",
            "5",
            "5",
            "8",
            "20",
            "6",
            "7",
            "9",
            "4",
            "4",
            "12",
            "12",
            "8",
            "3",
            "2",
            "3",
            "3",
            "3",
            "12",
            "5",
            "5",
            "5",
            "5",
            "6",
            "4",
            "4",
            "5",
            "5",
            "25",
            "6",
            "2",
            "1",
            "2",
            "2",
            "1",
            "2",
            "1",
            "1",
            "1",
            "2",
            "1",
            "2",
            "2",
            "1",
            "2",
            "1",
            "13",
            "5",
            "3",
            "3",
            "3",
            "3",
            "2",
            "3",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "5",
            "2",
            "2",
            "1",
            "4",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "79",
            "131",
            "154",
            "132",
            "5",
            "11",
            "33",
            "7",
            "9",
            "0",
            "79",
            "131",
            "154",
            "132",
            "5",
            "11",
            "33",
            "7",
            "9",
            "0",
            "5",
            "0",
            "0",
            "7",
            "0",
            "6",
            "3",
            "3",
            "1",
            "3",
            "0",
            "0",
            "2",
            "1",
            "0",
            "1",
            "1",
            "1",
            "0",
            "12",
            "20",
            "25",
            "28",
            "0",
            "2",
            "2",
            "16",
            "0",
            "5",
            "1",
            "1",
            "0",
            "4",
            "0",
            "1",
            "1",
            "4",
            "0",
            "0",
            "1",
            "7",
            "1",
            "1",
            "1",
            "0",
            "0",
            "4",
            "5",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "6",
            "1",
            "0",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "2",
            "26",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "12",
            "3",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "8",
            "1",
            "2",
            "3",
            "9",
            "1",
            "1",
            "0",
            "0",
            "1",
            "2",
            "2",
            "2",
            "4",
            "7",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Show me sim Card slot.",
            "Q:Is it works on Volte?",
            "Q:Does this support any type of external storage",
            "Q:call recording option available ah?(inbuilt)",
            "Q:Does it support wifi calling",
            "Q:is it light or heavy smartphone?",
            "Q:Dual 5g and call recoding available ?",
            "Q:Memory card slot insert option for storage",
            "Q:Does it have 120 hz refresh rate?",
            "Q:Can I use this phone in abroad?",
            "Q:Does this mobile have extended RAM functionality?",
            "Q:Expandable storage available?? Hybrid sim slot or no SD card option?",
            "Q:Complete mobile protection available",
            "Q:Can we mirroring with smart tv",
            "Q:This phone comes with which charger capability 10w 12w or 20w?",
            "Q:Can we play free fire",
            "Q:Is it come with screen protector",
            "Q:Auto call recording without play message ? ( Call will be recorded)",
            "Q:Back side of phone is metallic, plastic, fiber or glass??",
            "Q:Flash light on front camera is there?",
            "Q:Can we play smoothly BGMI",
            "Q:How to enable notification LED?",
            "Q:Auto Call Record Aveleble in this Phone",
            "Q:Playstore available in this phone",
            "Q:can I upgrade the os to android 12",
            "Q:It is 4g volte mobile & it supports c type charging",
            "Q:Does both SIMs support 1. 5G 2. Dual 4G VoLTE",
            "Q:Pub g playing high grafics",
            "Q:Virtual reality, augmented reality which feature enabled on this phone?",
            "Q:Back case is available",
            "Q:Is it amolded display",
            "Q:Is this phone has IR sensor to work as a remote",
            "Q:Can we use both Sim cards and memory card slot available in this phone?",
            "Q:6g rm 128 storage",
            "Q:CAN I USE MULTIPLE PROFILE USER / ACCOUNT ?",
            "Q:How much time take to Boot (POWER ON HONE ME KITNA TIME LAGTA HAI)?...",
            "Q:Who best vi vo v23 5g ya moto g51 5gbabsbsbb",
            "Q:Is SD 480+ a 6nm processor ?",
            "Q:jio to jio vedio calling ?? or does vedio calling option is there in dialer???",
            "Q:Does it have app clone ?",
            "Q:Is back cover or gaurd available with phone in box?",
            "Q:Expandable memory....?what about Expandable memory for Motorola g51",
            "Q:Wi-Fi and hotspot same time warking",
            "Q:Is this mobile dual volte support or not?",
            "Q:Is this mobile dual volte support?",
            "Q:Screen recording function is avillable",
            "Q:Does it have Gorilla Glass protection?",
            "Q:Double tap to on off display ?",
            "Q:Can I record slow motion vdo? Or 4k",
            "Q:Does it support dual apps like 2 Whatsapp or Facebook or twitter?",
            "Q:hdr 10+/Dolby Vision?",
            "Q:Finger print sensor not visible in the pics, is Finger print sensor available or any other password free login option such as face detection?",
            "Q:Amoled is there?",
            "Q:Fast charging & C Type charger support moto g51 mobile",
            "Q:Is this phone has double audio speekar",
            "Q:Do Moto g51 support wireless charging?",
            "Q:Can we play heavy graphic games with ultra hd without any lag and heat?",
            "Q:Does this phone suppoer fast changing",
            "Q:Is the battery is optimised for this phone? I think this phone is getting less optimisation",
            "Q:What is the effective storage",
            "Q:Can I mute camera photo snap sound?",
            "Q:During call recording notify ( your call has been recorded)...?",
            "Q:Moto G51 have NFC ?",
            "Q:Does this Phone have Dynamic Ram Expansion Feature..??",
            "Q:Finger print sensor front or back",
            "Q:Will i get headset ?",
            "Q:Does it supports 4g+ carrier aggregation?",
            "Q:Does this phone support 4g at a time in both sim?",
            "Q:Video call support in direct call?",
            "Q:Q:-What about its performance? What are the equivalents of snapdragon 480+ in Mediatek dimensity , mediatek G-series and Snapdragon 700 series?",
            "Q:Does this phone supports ultra hd 4k video",
            "Q:Which 5G processer is used???",
            "Q:Memory card and dual sim support at the same time",
            "Q:It is water rirstence phone",
            "Q:How many cores are there in this phone?",
            "Q:Does this phone has front flash light?",
            "Q:Audio sound how",
            "Q:This Mobile is 5g",
            "Q:Is any Equalizer available for music, Spotify or YouTube?",
            "Q:Does it have GPU",
            "Q:Is fingerprint sensor on screen",
            "Q:Aoes it have finger sensor",
            "Q:How much time need to charge",
            "Q:Notification light available",
            "Q:What is the Charge system?",
            "Q:How many nits brightness have in this phone",
            "Q:Can I play free fire ultra quality",
            "Q:Is this phone water ressistance",
            "Q:RAM is expandable or not???",
            "Q:Does it have IPS display?",
            "Q:Can we use both 5g+5g sim at a time.",
            "Q:Expandable memory can be extended upto HOW much maximum GB ?",
            "Q:How many years of OS update it will get?",
            "Q:Does the phone have dual sim stand by . Can I use both sim 4G +4G or 5G + 4G",
            "Q:Does it come with warenty",
            "Q:About voice quility",
            "Q:Dose here available Steario Sound , Dolby autom ?",
            "Q:Does this phone have gps",
            "Q:Fingerprint sensor is avilable in this phone.",
            "Q:Can i use a 64gm memory Card?",
            "Q:Does mobile data and phone calling work at the same time?",
            "Q:I bought this phone in JAN but suprise to see it was having Bloatware app \"Dailyhunt\" but was able to uninstall it..Anyone had such experience?",
            "Q:Can I control tv with this divice like remote",
            "Q:How much required time to fill the charge",
            "Q:How is its battery performance if kept in 120hz refresh rate??",
            "Q:Is this phone support dual 5g sim",
            "Q:Use microsd memoricard",
            "Q:pubg gyroscope support",
            "Q:Both Dual sim can support 5G? And Memory Expandable Limit ?",
            "Q:Do you give tempered in box",
            "Q:can i capture videos in swimming pool...is it water resistance???",
            "Q:Does It has Space To Download 34 Games",
            "Q:How to ste up app lock",
            "Q:Can i use 4g+5g sim",
            "Q:Is phone has fast charging like type c model",
            "Q:Fingerprint senser available or not ?"
        ],
        "answers": [
            "A:It's hybrid sin slot, One for Sim and another one for Sim or Memory card, if you need to use Memory card you can use only one sim in this mobile phone(in all hybrid sim slot phones)",
            "A:Yes",
            "A:Yes",
            "A:yes bro",
            "A:yes it is support wifi calling.",
            "A:heavy",
            "A:yes",
            "A:yes.",
            "A:Yes, it has.",
            "A:Yes & its compatible to 12 5g bands ,4 mimo configured & 3Carrier aggregation for 4g bands with bonus of NFC.",
            "A:no",
            "A:Yes",
            "A:no",
            "A:Yes",
            "A:20w",
            "A:Yes,without any fear, you play free fire",
            "A:No. Only back cover.",
            "A:no",
            "A:fiber",
            "A:Yes",
            "A:yes u can😇",
            "A:cheak in Notification settings",
            "A:yes",
            "A:Yes",
            "A:YES, WHEN AOS 12 IS ROLLING OUT IN THIS SERIES",
            "A:yes sure truly support c type. and I got 20 watt fast charger in the box",
            "A:Yes",
            "A:It will have probs",
            "A:it's bigger HD screen",
            "A:yes",
            "A:No, it's not amoled display. It's only LCD display.",
            "A:No, it doesn't have an IR sensor.",
            "A:You can either use 2 sims or 1 sim and 1 memory card, the slot is hybrid.",
            "A:No, only one variant is currently available in the market.",
            "A:Ofcourse yes, you can use multiple accounts.",
            "A:3-5 seconds",
            "A:Moto g51 near stock Android experience just crushes vivo v23 phone..",
            "A:No it's 7nm",
            "A:Yes",
            "A:I don't know exactly , but when iam initially booting up my g51 5g it asked for switching ( apps , contacts etc ) from previous phone",
            "A:Only back cover is available with phone that also basic back cover. For a good back cover and guard, you have to order separately.",
            "A:There is a hybrid sim slot. You can either use 2 sims or 1 sim with a memory card.",
            "A:no",
            "A:Yes it supports VoLTE",
            "A:Yes it is",
            "A:Yes it's available.",
            "A:on screen ,no",
            "A:yes",
            "A:slow motion",
            "A:It's pure stock android ,so what and all features that support in stock android is also works here too",
            "A:yes",
            "A:face detection and side finger print sensor avaiilable ypu can unlock the device with the help of both",
            "A:no",
            "A:yes",
            "A:Nope",
            "A:No wireless charging in moto g51 5g",
            "A:bro, u can play but battery power is very low, unable to play without mobile charger",
            "A:Yes we are getting adopted",
            "A:Battery is optimised with display having set to 60hz - 36 - 40 hrs If you go for AI it will be 24-26 hrs to reach 10% level in extreme usage. For 120 hz battery will las 16-18 hrs.",
            "A:System or System Apps uses 18 Gb Effective storage would be 46 Gb",
            "A:Yes",
            "A:There is option to record call and will alert while recording once. You cannot do in without the other person not knowing it",
            "A:yes",
            "A:yes",
            "A:It on right side on power button",
            "A:yes",
            "A:yes",
            "A:Yes",
            "A:yes",
            "A:I have been using around a month, the performance of G51 is excellent & above Sd 720g & mtk 700. Go ahead.",
            "A:yes",
            "A:480+pro",
            "A:No",
            "A:Bro its splash proof! But you can trust Motorola's Build quality!",
            "A:4 cores",
            "A:no",
            "A:Has Dolby DTS TECHNOLOGY. VERY NICE 👌",
            "A:Yes, it is.",
            "A:Nope, but Dolby Atmos improves the quality of the audio twofold",
            "A:Yes",
            "A:Non",
            "A:Yes",
            "A:Maximum 1 hour",
            "A:Yes it's available, but for some reasons it won't turn on when there is pending notification, you have to root the device for led notification.",
            "A:C- type",
            "A:cool many nits brightness 75,%",
            "A:No",
            "A:Yes",
            "A:No",
            "A:Yes, it has FHD+ IPS LCD display",
            "A:YES",
            "A:It's hybrid sim slot.",
            "A:3 years the company has announced.",
            "A:5G+4G Only",
            "A:yes. Nice Phone.",
            "A:Average quality only.",
            "A:The phone has single bottom speaker. The application provides Dolby via headphones or external device.",
            "A:Yes",
            "A:yes.. on the power button at the side of the phone",
            "A:yes undoubtedly u can use 64gb 128gb too",
            "A:yes",
            "A:I also bought this phone few days back and I am able to remove all the unnecessary apps. Try uninstalling it from app management. I hope this will work!",
            "A:No you can't, better get a TV Remote for that",
            "A:around an hour",
            "A:nice",
            "A:yes",
            "A:microsd card can be used and presently I am using 64 GB SanDisk microsd",
            "A:Yeah, it supports Gyroscope. you'll definitely enjoy Pubg.",
            "A:5g network is not available yet!",
            "A:no",
            "A:No",
            "A:It has almost 48 gb space. To answer your question it's depends on your game size",
            "A:Go to settings apply lock",
            "A:Yes",
            "A:No, but it is ok.",
            "A:yes"
        ],
        "likes": [
            "18",
            "29",
            "34",
            "23",
            "3",
            "3",
            "3",
            "2",
            "3",
            "3",
            "0",
            "3",
            "3",
            "7",
            "5",
            "3",
            "1",
            "2",
            "0",
            "2",
            "2",
            "2",
            "3",
            "3",
            "2",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "43",
            "40",
            "34",
            "5",
            "5",
            "7",
            "7",
            "2",
            "4",
            "3",
            "6",
            "3",
            "5",
            "2",
            "3",
            "1",
            "2",
            "1",
            "2",
            "2",
            "0",
            "2",
            "1",
            "2",
            "6",
            "0",
            "2",
            "1",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0"
        ],
        "dislikes": [
            "0",
            "12",
            "16",
            "11",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "5",
            "0",
            "0",
            "3",
            "2",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "3",
            "3",
            "1",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "11",
            "12",
            "11",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "0",
            "2",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "15",
            "1",
            "0",
            "1",
            "6",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "2",
            "1",
            "0",
            "1",
            "0",
            "1",
            "0",
            "1",
            "2",
            "1",
            "1",
            "2",
            "0"
        ]
    }
}