{
    "title": "Infinix Note 11s Free Fire Edition (Haze Green, 128 GB)  (8 GB RAM)",
    "product_specification": {
        "In The Box": "Handset, Battery, Adaptor, USB Type-C Cable, TPU Case, Protective Screen Guard, SIM Ejector Pin, Quick Start Guide, Warranty Card, Scratch Card",
        "Model Number": "X698",
        "Model Name": "Note 11s Free Fire Edition",
        "Color": "Haze Green",
        "Browse Type": "Smartphones",
        "SIM Type": "Dual Sim",
        "Hybrid Sim Slot": "No",
        "Touchscreen": "Yes",
        "OTG Compatible": "Yes",
        "Sound Enhancements": "Dual Speakers with DTS Surround Sound",
        "Display Size": "17.65 cm (6.95 inch)",
        "Resolution": "2460 x 1080 Pixels",
        "Resolution Type": "Full HD+",
        "Display Type": "Full HD+ LCD Display",
        "Other Display Features": "120 Hz Refresh Rate, 180 Hz Sampling Rate, 91% Screen-to-Body Ratio, 20.5:9 Aspect Ratio, LCD LTPS, 480 nits, 1500:1 Color Contrast Ratio, InCell, Eye Care Mode, NEG Dinorex T2X-1 Glass Protection",
        "Operating System": "Android 11",
        "Processor Type": "MediaTek Helio G96",
        "Processor Core": "Octa Core",
        "Primary Clock Speed": "2.05 GHz",
        "Operating Frequency": "2G GSM: B2/B3/B5/B8, 3G WCDMA: B1/B5/B8, 4G LTE: B1/B3/B5/B8/B38/B40/B41",
        "Internal Storage": "128 GB",
        "RAM": "8 GB",
        "Expandable Storage": "512 GB",
        "Supported Memory Card Type": "Micro SD",
        "Memory Card Slot Type": "Dedicated Slot",
        "Call Log Memory": "Yes",
        "Primary Camera Available": "Yes",
        "Primary Camera": "50 MP + 2 MP Depth Lens + 2 MP Macro Lens",
        "Primary Camera Features": "AI Triple Camera Setup: 50 MP (f/1.6 Aperture) + 2 MP Depth Lens + 2 MP Macro Lens, Quad LED Flash, Camera Features : Super Night, Custom Portrait, AI HDR, AI 3D Beauty, Panorama, Document, AR Shots, Pro Mode, Slo-Mo Video, Time Lapse, Short Video, 2K Video Recording with Bokeh",
        "Secondary Camera Available": "Yes",
        "Secondary Camera": "16MP Front Camera",
        "Secondary Camera Features": "16 MP AI Camera Setup: (f/2.0 Aperture) with Dual LED Flash, Camera Feature: Super Night, AI Portrait, AI 3D Face Beauty, Wide Selfie, AR Shots, Time Lapse, 2K Video Recording with Bokeh",
        "Flash": "Rear: Quad LED Flash| Front: Dual LED Flash",
        "HD Recording": "Yes",
        "Full HD Recording": "Yes",
        "Digital Zoom": "Yes",
        "Phone Book": "Yes",
        "Network Type": "4G, 3G, 2G",
        "Supported Networks": "4G LTE, WCDMA, GSM",
        "Internet Connectivity": "4G, 3G, EDGE, GPRS, Wi-Fi",
        "GPRS": "Yes",
        "Pre-installed Browser": "Chrome",
        "Bluetooth Support": "Yes",
        "Bluetooth Version": "v5.0",
        "Wi-Fi": "Yes",
        "Wi-Fi Version": "802.11 a/b/g/n",
        "Wi-Fi Hotspot": "Yes",
        "NFC": "No",
        "Infrared": "No",
        "USB Connectivity": "Yes",
        "Map Support": "Google Maps",
        "GPS Support": "Yes",
        "Smartphone": "Yes",
        "SIM Size": "Nano + Nano",
        "User Interface": "XOS 10 (Based on Android 11)",
        "SMS": "Yes",
        "Sensors": "Fingerprint Sensor, Ambient Light, G-Sensor, Proximity, Gyroscope, E-Compass",
        "Browser": "Google Chrome",
        "Other Features": "TUV Rheinland Certified: Low Blue Light (Software Solution) and Safe Fast Charge System, UFS 2.2 Storage, DAR-LINK 2.0 Game Boost Technology, Dual Speakers with DTS Surround Sound, Power Marathon Tech, Video Assistant, Thunderback, Xhide, Theft Alert, Peek Proof, Kids Mode, Xclone, Photo Compressor, 360 Flashlight, Social Turbo, Wi-Fi Share, Smart Gestures, Digital Wellbeing, Dark Theme, Eye Care, Multi-Window, Bike Mode, Game Mode, Smart Panel, AI Gallery, Side Mounted Fingerprint Unlock, 3-in-1 Card Slot",
        "GPS Type": "GPS, A-GPS",
        "DLNA Support": "No",
        "Audio Formats": "AAC, AAC+, AAC+ Enhanced, OGG Vorbis, WAV,MP3, MIDI",
        "Video Formats": "H.264, H.263, MPEG-4",
        "Battery Capacity": "5000 mAh",
        "Width": "78.24 mm",
        "Height": "172.7 mm",
        "Depth": "8.77 mm",
        "Weight": "212.5 g",
        "Warranty Summary": "1 Year on Handset and 6 Months on Accessories",
        "Domestic Warranty": "1 Year"
    },
    "product_description": {
        "Immersive Display": "The Note 11S features a 16.75 cm (6.95) screen with an FHD+ display and 91% screen-to-body ratio so you can enjoy immersive visuals. Also, the phone features an LTPS LCD screen with 480 NITS brightness, 1500:1 Color Contrast Ratio, and 20.5:9 aspect ratio so that you can enjoy vibrant and clear visuals while playing games and streaming movies.",
        "120 Hz Smooth display": "You can enjoy smooth browsing and seamless scrolling through the screen, thanks to the 120 Hz refresh rate. This mobile phone comes with a 180 Hz touch sampling rate that increases the screen responsiveness, thus providing you with an enhanced gaming experience.",
        "Stellar Performance": "This mobile phone is powered by an Helio G96 Octa-core processor with 12 nm FinFET, 2.05 GHz CPU frequency, that delivers fast graphics rendering performance, thus making your gaming experience a realistic one. And, this mobile comes with the Dar-link 2.0 Game Boost Technology so that you can avail enhanced image stability free of screen tearing/stuttering while playing an intense gaming session.",
        "8 GB of LPDDR4X RAM": "Thanks to the built-in 128 GB of storage capacity, you can have enough space to store your favourite photos, videos, and more on your mobile phone. You can also enjoy fast streaming of videos, movies, and TV shows, thanks to the UFS2.2 type storage. And, with up to 8 GB of LPDDR4X RAM on this phone, you can seamlessly and quickly shuffle between multiple apps.",
        "Linear Motor": "This mobile phone comes with a haptic feedback Linear motor so that you can take delight in interactive and realistic gaming every time. Also, this phone features a unique supercool system with 3D 6-layer graphene films on the back so that you can enjoy long gaming sessions without worrying about your device heating up.",
        "Power Packed Battery": "You don't have to worry about your battery running out, thanks to the powerful 5000 mAh battery along with Power Marathon Technology on this phone. As a result, you can enjoy up to 24 hrs of Video playback, 158 hrs of Music playback, 64 days of standby time, and more with a single full charge. Also, it comes with a 33 W fast charger with a USB Type-C cable so that you can effortlessly charge your phone using the cable.",
        "50 MP Wide Aperture Camera": "This phone is equipped with a 50 MP wide aperture AI triple rear camera so that you can capture high-resolution pictures every time. Also, it comes with a 50 MP primary lens (f1.6 wide aperture), 2 MP depth sensor, and 2 MP macro lens, along with Quad-LED flash that will help you to capture bright and clear pictures wherever you go. Also, this mobile phone comes with additional features such as super Night mode, short Video, document mode so that you can capture stunning photos under any light and from any angle. You can enjoy shooting high-end videos on your phone, thanks to the 2K high resolution video capture",
        "16 MP In-display selfie": "This phone comes with a 16 MP AI In-display selfie, f/2.0 aperture, and a dedicated Dual LED flash to add a shine to your sharp and vivid selfies. Also, enjoy the features such as AI Portrait, Super Night Mode, Wide Selfie, 3D Face Beauty mode to further enhance your selfies. Thanks to the 2K high resolution video feature, you can capture high-resolution video with your mobile camera.",
        "Elegant Design": "This mobile phone features a frost design so that you can enjoy smudge-free and finger-proof usage on this phone every day. Also, this phone is equipped with the NEG Dinorex T2X-1 Glass Protection feature to offer durability. And, thanks to the Cinematic Dual Speakers, along with DTS Surround sound, you can enjoy immersive sound while streaming videos or playing games.",
        "Easy Multi-functional Fingerprint Access": "You can unlock your phone with just a tap of your finger, thanks to the side-mounted multi-functional fingerprint sensor. Also, you can tap your fingerprint sensor to dismiss the alarm and answer calls. Moreover, you can jumpstart your favourite apps by synchronising them with different fingers. Also, you can safely and quickly unlock your phone in less than a second thanks to the Face unlock feature.",
        "XOS 10 on Android 11": "Intensify your user experience with the XOS 10 powered by the Android 11 operating system on this mobile phone. As a result, you can enjoy the benefits of additional features, such as Ultratouch, Thunderback, Secure Card, Theft Alert, Xhide, Xclone, Video Assistant, Wi-Fi share, and more."
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "3",
            "5",
            "2",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "1",
            "1",
            "1",
            "5",
            "4",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "1",
            "2",
            "1",
            "1",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "3",
            "3",
            "4",
            "4",
            "1",
            "5",
            "4",
            "3",
            "5",
            "3",
            "1",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "4",
            "3",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "2",
            "3",
            "1",
            "1",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "3",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "1",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "2",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "4",
            "2",
            "4",
            "5",
            "5",
            "3",
            "3",
            "5",
            "4",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "4",
            "4",
            "5",
            "5",
            "1",
            "3",
            "5",
            "4",
            "5",
            "5",
            "4",
            "1",
            "3",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "3",
            "5",
            "1",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "2",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "1",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5"
        ],
        "review": [
            "Very good👍👍👍 phone good display good performance good battery performance design 👌👌👌camera good keep it up infinix good job",
            "😉Value for money\nCamera is awesome, picture quality is fine\nGaming performance is good 👍\nNo overheating issue like other smart phones under this range\nSize of display big 😱😱😱but it's okey 😘i love it\nBattery performance is average bcz of large size of screen it consume more battery as compare to other smart phones\nit's best smart phone for those who want large size screen for gaming and selfee 😅",
            "Very good 📱. not getting hot while watching movies for long time, fast charging, no laggings, smooth touch, More number of in-built application's. and many more. except the camera all are working fine. some more updates are required for camera quality. Except for this budget it is the best mobile.",
            "If you this buy new smart phone.\nSo must buy this mobile...\n\nAll experiences after 10days review.\nAnd this phone use in minus 35°C temperature without battery🔋 drain......\nSo I love it... First time buy dream phone..\nCamera *****\nBattery *****\nMobile *****\nDTS sound*****\nPrice*****\n33 watt fast charging*****\nGaming experience*****\nFront flash for selfie and torch*****\n120hz Refrsh display.*****\n\nAwesome infinix Note 11s.*****",
            "It's all good velu for monycamara only not satisfied othar wise call quvaity spekar and all good",
            "Such an awesome mobile under the budget category. Ordered 2 phones for my friend. Display is just smooth as butter. Simply loved the product.",
            "SUPERB WORK FROM INFINIX TEAM... GOOD ALLROUNDER PHONE INFINIX NOTE 11S FREE FIRE Edition. ❤",
            "Best phone considering the price. 120 hz screen, dual speakers, 33w fast charging with charger, good processor, 50MP camera, 8gb ram, ufs storage, and not chinese. Undoubtedly these features make this best in its category.",
            "Dont think much\nI am using these phone since last many weeks and these phone is a BEAST\nthe phone comes with many PROS\n* OUTSTANDING BATTERY WITH LEGIT CHARGING SPEED\n* CAN PLAY GAMES FOR HOURS\n* SOUND QUALITY IS JUST TOO GOOD\n* THE FREE FIRE EDITION COVER GIVES YOUR PHONE A REAL GOOD LOOK WITH GRRAT HANDLE\n* TOO BIG DISPLAY IS GREAT FOR MOVIES\n* HUGE PHONE BUT STILL NOT THAT HEAVY\n\nSome CONS too\n* Not that good camera but 50M mode is good\n* Cant use with single hand but a single hand mode is given which still is good\n* In terms of display not that bad but if we had amoled then it can be 10/10\n\nOverall i must say if you need something powerful in these budget no one can be compared with these Beast\n\nINFINIX, Loved the device❤️",
            "Only one thing to say that Steady Shot is not given in camera which is really very essential. When shooter's hand shakes onw can observe blurry picture...single issue which is disappointing. Hope to get it clear by gaining an update. And no other issues. All are excellent. I have no issue with camera as i am not a camera lover. I just want a massive powerfull phone so i choose it. Anyone who has same view he or she can go for it. All are awesome nothing to say only single piece to say that is...\nREAD MORE",
            "Very good👍👍👍 phone good display good performance good battery performance design 👌👌👌camera good keep it up infinix good job",
            "😉Value for money\nCamera is awesome, picture quality is fine\nGaming performance is good 👍\nNo overheating issue like other smart phones under this range\nSize of display big 😱😱😱but it's okey 😘i love it\nBattery performance is average bcz of large size of screen it consume more battery as compare to other smart phones\nit's best smart phone for those who want large size screen for gaming and selfee 😅",
            "Very good 📱. not getting hot while watching movies for long time, fast charging, no laggings, smooth touch, More number of in-built application's. and many more. except the camera all are working fine. some more updates are required for camera quality. Except for this budget it is the best mobile.",
            "If you this buy new smart phone.\nSo must buy this mobile...\n\nAll experiences after 10days review.\nAnd this phone use in minus 35°C temperature without battery🔋 drain......\nSo I love it... First time buy dream phone..\nCamera *****\nBattery *****\nMobile *****\nDTS sound*****\nPrice*****\n33 watt fast charging*****\nGaming experience*****\nFront flash for selfie and torch*****\n120hz Refrsh display.*****\n\nAwesome infinix Note 11s.*****",
            "It's all good velu for monycamara only not satisfied othar wise call quvaity spekar and all good",
            "Such an awesome mobile under the budget category. Ordered 2 phones for my friend. Display is just smooth as butter. Simply loved the product.",
            "SUPERB WORK FROM INFINIX TEAM... GOOD ALLROUNDER PHONE INFINIX NOTE 11S FREE FIRE Edition. ❤",
            "Best phone considering the price. 120 hz screen, dual speakers, 33w fast charging with charger, good processor, 50MP camera, 8gb ram, ufs storage, and not chinese. Undoubtedly these features make this best in its category.",
            "Dont think much\nI am using these phone since last many weeks and these phone is a BEAST\nthe phone comes with many PROS\n* OUTSTANDING BATTERY WITH LEGIT CHARGING SPEED\n* CAN PLAY GAMES FOR HOURS\n* SOUND QUALITY IS JUST TOO GOOD\n* THE FREE FIRE EDITION COVER GIVES YOUR PHONE A REAL GOOD LOOK WITH GRRAT HANDLE\n* TOO BIG DISPLAY IS GREAT FOR MOVIES\n* HUGE PHONE BUT STILL NOT THAT HEAVY\n\nSome CONS too\n* Not that good camera but 50M mode is good\n* Cant use with single hand but a single hand mode...\nREAD MORE",
            "Only one thing to say that Steady Shot is not given in camera which is really very essential. When shooter's hand shakes onw can observe blurry picture...single issue which is disappointing. Hope to get it clear by gaining an update. And no other issues. All are excellent. I have no issue with camera as i am not a camera lover. I just want a massive powerfull phone so i choose it. Anyone who has same view he or she can go for it. All are awesome nothing to say only single piece to say that is Go For It.",
            "It's the best phone i get in 2021\nMy experience was like whole new level like literally\n120Hz display in very reasonable price and Helio G96 processor the performance which I got was amazing\nI tried playing high GPU games like BGMI , Free Fire there was not even a single lag in high settings\n\nThe camera was okay but it can be better i think the settings in the software was not optimised i think this problem may also be fixed from the updates\n\nAnd The Updated XOS version 10.0.0 i like so much with new customisation but it's not fully optimised for the battery\nI faced a little bit problem from battery as it uses more resources even being 5000mAh it's giving In-Display time upto 5~6 hrs which i don't like\n\n\nThe OS still need to be optimised\n\n\nAnd the most i like form this phone is it's 6.95 inch Display wow it's so big and it's changes the exp in the game\n\nBut one problem it has Wide 1 L3 certificate with means u cannot enjoy the full HD experience in ott platform u can watch upto 540p clearly sadly",
            "Sincerely in this Price with 8gb ram and 128gb rom and with Gaming processor G96 it's amazing fit on this range .\nCamera is awesome and 5000mh battery make it a lovable mobile for use . In this price no other brand give me this feature.",
            "Nice phone worth for money camera is good battery life is 1 full day touch is very smooth",
            "Pros:\n1. Very good gaming phone at this price point.\n2. Decent gaming performance at higher quality settings.\n3. Smooth and vivid display with better colour production when compared to IPS display but not as great as AMOLED.\n4. Battery easily lasts a day and a half with moderate usage and quick charging works well.\n5. Good signal reception.\n6. Dual speakers sound quality is really good.\n7. Some features of XOS10 are good and useful.\n8. Accurate and sensitive fingerprint sensor.\n\nCons:\n1. ...\nREAD MORE",
            "In This budget it looks fine and @Infinix developing team should concentrate on XoS operating system, heating issues, camera is average , processor speed is Medium,Back case is Good 👍,\n\n\n\nFinally it Good who wants 8g ram and 128 rom in 15k budget should be best choice",
            "It's been wonderful to have the product like this...First infinix product..... 120hz refreshing rate is amazing... Not so much heavey... The ratio of weight and size is balanced.. Overall wonderful product in this prize range.. You will not get the same feature any where.... Specifically 120hz disply... Helio g96.. 5k battery... Etc... For the technocrats like me.... It's great experience",
            "Bought this phone with lot of expectations but it's not worth it.\nPros -\n1. Good battery life\n2. Fast charging.\n3. Okay camera\n\nCons -\n1. I THOUGH BIGGER DISPLAY IS BIGGER FUN but it proved me wrong. It's quite uncomfortable actually.\n2. Cannot perform Heavy duty (Crashes and apps stops working, keeps disconnecting from wifi automatically and other devices doesn't do that\n3. Because graphics is not that good. Compared to Realme 8 and redmi note 8 pro, those phone never hanged while doing something. And I have not even used 3gb ram out of 8.\n\nI would say don't go for it, it's not better than Realme and Redmi",
            "I initially, hated infinix for their Bloatware and not so clean OS, But i bought this phone as it is coming under my budget. And know what, I loved the optimisation and the feel of it. Os is clean and the touch response is the main highlight. Camera is decent. Not up to the mark but ok. If you are looking for a beast in performance, go for it",
            "Battery is not good and going down faster and also camera is not good so it is not good phone",
            "Good osum",
            "Very good product in this price then Other brands.",
            "I JUST LOVED THE DISPLAY OVERALL THE PHONE PERFORMANCE OF THE PHONE IS ALSO GOOD BEST PHONE IN THE BUDGET",
            "supar mobile",
            "Best Mobile value for money......",
            "Awesome value for money, u can't expect more go for it",
            "Nice phone..",
            "Best gaming mobile",
            "Good 👍",
            "I love this phone",
            "Been using it as secondary device for almost 2 weeks the only problem I faced that is the bloatware apps which doesn't get uninstalled and the device is pretty big but it does't matter. Rest everything is good",
            "Very nice mobaile",
            "BEST GAMING MOBILE AND PHOTO ALSO GOOD",
            "Super this",
            "Nice mobile",
            "Good phone my favorite mobile thanks flipcart",
            "Nice looking phone camera nd battery is so bett",
            "Overall the product is good but camera is not at all value for money so if camera is highly required so this is not ur type phone go with other's.",
            "Good job 👌👍👌👌",
            "Good & very pawarful mobile",
            "Just woww... ❤\nThank you Flipkart 🥰",
            "Good",
            "Infinix note 11s best smartphone, big screen powerful",
            "I am purchase infinix note 11s 8gb 128gb variant free fire open in 21 second to good performance",
            "very nice phone I am happy thanks Flipkart",
            "Nice smartphone but size lil big 6.9 inch",
            "OSM mobile\n\nValue for money 💸😍",
            "It is too good",
            "Very good product",
            "Super and excellent battery",
            "I like this phone back camera is 😔😔😔😔😧😧",
            "Great",
            "Excited mobile phone good camera and battery life and velu of moni in mobile phone and spiker osm",
            "Very good😘😘😘😘😉😉😉😊😊😆😝😝😝🎅💃🏽💃🏽💃🏽",
            "Wonderful for everything except for photography\nSo if you want to buy it for gaming or performance then buy it blindly....",
            "It is Somach very very good infinix note 11s mobile vellue for money My Name is Md Sarwar ali",
            "Very powerful💪 phone",
            "Very nice",
            "Don't buy mobile phone in flipkart cam is bummy",
            "Fast charger✅\nDisplay excellent✅\nCamera Average✅\nSlow motion recording ✅\nLots of custom featuers\nLove it\nWorth it you should buy this weapon🔫",
            "Night Mood Camera Is Very Good And Battery Life Time Is Very Good.",
            "Omg in pubg graphics is osm",
            "Best gaming phone under 15k 😍",
            "The phone is great!!!\nGreat value for money.\nGreat performance.\nBIG BIG BIG Screen.\nGreat camera.\nGreat processor.\nGreat memory and storage.",
            "Excellent product. Really worth the money. I really didn't expect the camera quality after reading and watching some reviews but it's Good. performance is Awesome.\nMedia performance is good. Compare to other products of 15k-20k range camera and media performance is just average. In other aspects it is far better. 8GB-120Hz and G96 processor gives a damn good performance ❤️",
            "I bought infinix not 11s i really appreciate of infinix brand which is providing G96 processors huge 6.95 display 8/128. I just want to say increase brightness nits and L1 support for watching FD+ video on Netflix by Software update.",
            "Good phone 📱\nBulid quality is super\nScreen size is too big\nCamera is good\nOverall is good",
            "Good Phone On Gaming Experience\nBest battery life best camera value for money",
            "Very nice this phone camera good battery good low price thanks infinix",
            "Super phone. Best display\nBest battery. Audio super. Slim size.good camera",
            "Good pic , ram management is good, smooth discplay, picture quality is also well",
            "Good",
            "Lag free pubg, free fire, cod, republic, like makkhan",
            "Worth it phone....if you can ajust with the camera you can consider the phone",
            "Nice camera 📷\nNice battery backup 🔋\nNice display 📱",
            "Osom quality this photo",
            "Nice phone",
            "Good",
            "Best in this price segments\nAwesome camera quality\nPowerful battery\nBig display",
            "It's a perfect phone for Gaming 🙂",
            "Great phone",
            "Good product",
            "Good",
            "The battery is so fast drain 😩....\nAnd phone is when i play game 😶...\nI play free fire max in ultra satting ..\nBattery is so fast drain and hot 🥵",
            "Fabulous😋✨... Fantastic product infinix forever 💕... I am used infinix mobiles only...",
            "Nice 👌👌",
            "Mobile displays very worst quality please don't buy any one\n\nCustomer service center not there and not responding my money wasted 😤 😒 😑 🙄 🙃 😐 😤",
            "Very bad mobile screen light is low",
            "Seems Slow",
            "Awesome👍 Phone And Big Battery Big Display And Nice Look For Camera.",
            "Reviewing after 1 month ------\n1. Phone is fantastic🤘😝🤘.\n2. But one issue. This phone Hertz feels slow when your battery is around 25% or less.\n3. Camera is okay but little worse than other phone in this range.\n4. Phone performance is Osm 😎😎\n5. I never played too much game in this phone but even when I was playing game, phone performance was hard✌✌✌👌👌\n6. Go for it",
            "Good mobile camera, display, playing, but battry performance is drain",
            "Fine this product.",
            "very budget and handy product this is very useful budget phone",
            "I am very happy 😊😁",
            "Superb Mobile",
            "Vallue of mony",
            "Out standing phone.",
            "Good phone",
            "Very nice & perpect game play... 😘😘😘❤",
            "Mind blowing",
            "Vara level la irruku gaming free fire play pandra allurum indha phone vaguga....\nFast charge lam vara level... 100 percent sema phone",
            "One of the greatest phone I ever used.",
            "Overall good mobile and good performance 👍",
            "After using 10 days mobile performance is good and also bettery backup is long life",
            "Call history takes much time to load every time i want to check my last call record. Call recording option block my voice for another caller, so i have to disable this function. Camera quality is also low if i compare my Realme 5 pro, which has only 48mp.\nI request infinix to fix these problem or replace my mobile.",
            "it is really great experience to buy this product and infinix is really good and owesome product, thank you flipkart",
            "Very good Best",
            "Super support's And feature's then stylish also I am used lot of phone but this is the best feature mobile",
            "Best mobile under this price range",
            "Nice",
            "worst purchase of my life time do not buy this phone for free also its a cheap chinese product will not last for 5 days also customer care number does not work",
            "Don't by such type of phones",
            "Screen not touching on side",
            "Worst camera no refund available 😡😡",
            "Worst performance worst service and worst camera and worst hanging and worst advertisement",
            "i been using it for 3 days so far i didnot face any problem but yet they should improve the UI .hm and the camera is average i bought this mobile for a performence not for camera so i am satisfied with it",
            "Excellent mobile,I am telling no words",
            "Rear cam is not so good ,it's an average only\nSelfi shooter is Oki\nLight weight and design is good\nInbox: case is ok but provided tempered glass is very poor quality",
            "Mst super 🤘😝🤘",
            "Happy",
            "The best mobile under 15000",
            "UI is very very poor, bugs are there, phone lags. Performance needs to be improved much. Camera has disappointed very much. 50MP is working like 2MP. Speaker do not have bass. Infinix must read this review and fix these fast.",
            "Good",
            "Nice product",
            "Best phone",
            "The 120hz ultra smooth display is not working properly\nAnd phone is over heat\nPlease don't buy and return my product",
            "Great",
            "Night Mood Camera Is Very Good And Battery Life Time Is Very Good.",
            "Camera not so good. Performance not upto the mark.",
            "Nice mobile",
            "Average... Camera worst",
            "Poor quality.\nOverHeating, touch work not accurate.\nCamera say sometimes ' can't open.\nPoor camera quality,\nSoftware contain bug which make your phone freeze for a while in between usage...",
            "Very very nice mob",
            "Poor quality heating problem hanging problem",
            "Valueable mobile worth to buy highly recommend that...🔥🔥🔥🔥🔥",
            "Good phone",
            "Super",
            "Valu for message",
            "Value for money\nPerformance is good 👍 I love this phone",
            "Not bad 😊",
            "Very nice👍👍👍",
            "Video called is not good.",
            "Lovely mobile",
            "Good",
            "Great product",
            "Best phon Best prformens",
            "Best in secment",
            "Excellent",
            "Good looking mobile",
            "Battery is good.\nDisplay is somwhat good.\nPerformance is excellent.\nNice phone in this price range.",
            "Nice",
            "One of the best mobile in this price range. UI can be improved, Camera can be slightly better. Many essential accessories of this mobile are not available in market yet. Other than that this mobile is worth the buy.",
            "Superb mobile",
            "Almost good 👍👍",
            "Mobile is good but it is heating too much",
            "Good",
            "Thanx Flipkart, your delivery guy is good.\nVery happy, descent phone for me\nDisplay good and i like this size\nSpeed is ok\nCamera not very good but ok for me coz am not camera guy\nBattery 🔋🔋 is quit descent, assured of one day of usage. It tends to go very fast more especially in 120 refresh rate, i think the phone could be much better with 6000mah.\nAll in all good value for money.",
            "Very Very Nice Phone",
            "Good product",
            "Good",
            "Very good",
            "Excellent phone gaming is also very smooth",
            "Display stuck aagudhu apo apo🤨😤",
            "Good nice product",
            "Best look and device favirate color grey",
            "Excellent",
            "Phone quality is good but battery backup problem",
            "Nice phone every thing which is given by company in the box is good but the cover of the phone is looks very primium and after purchased the phone it also looks primium ❣️",
            "Value for money very good battery backup. Overall good 👍",
            "Good mobile",
            "Okay",
            "It is very good product I am very happy",
            "Awesome flipkart i loved it",
            "Cammera quality is so rough",
            "Good but another phone you can serch in budget",
            "Worst product... Not based on my expectation",
            "Phone heat🔥 problem",
            "Super",
            "Nice phone",
            "Phone very heat don't buy",
            "Nice",
            "Very nice & perpect game play... 😘😘😘❤",
            "Very super cemara quality",
            "Nice phone with excellent features.",
            "Good mobile",
            "The phone was very good and better than I expected",
            "Excellent",
            "Awesome",
            "this phone is 100percent good interms of camara performance and especially features i",
            "Nice",
            "Battery backup very week",
            "Love It. Amazing Phone. Please remove sponsored/preinstalled apps. That's one major reason, why few clicked and others failed.",
            "Amazing Phone..Worth the money. High Impact. Please remove pre-installed apps. Don't force to use sponsored apps.",
            "It is best for low budget gaming but performance is good in game. In summer it heat 🔥 more if you play heavy game 👾.",
            "It is a very nice phone. Value for money. 👍🏻👍🏻",
            "Worst phone.. Only battery is good.. Call will not come..",
            "Osm product",
            "This is awesome phone",
            "Best Mobile.\nBig screen for big performance.\nBattery quality is just wellfurnished.\n120Hz refresh rate of screen is very better.\nBack cover (in box) is amazing \"FREE FIRE\"tatoo design.\nIn the box of mobile is a big tatoo of FREEFIRE💞💞 just amazing.\nVery very better mobile for FREEFIRE gammers' .\nJust unbelievable phone.📱",
            "It's good you can go ahead and buy this product",
            "Budget killer phone📱",
            "The best phone i have ever used 🤯",
            "It's good",
            "Phone is very nice and infnix i love this brand this price",
            "Awesome",
            "Good",
            "Average as per my experience",
            "Very best phone under this rangev",
            "Very nice . phone buget phone 📱📱📱",
            "Nice one value for money",
            "Very good",
            "Worth mobile❤❤",
            "Superb...",
            "Nice 👍",
            "Awesome smart phone",
            "Good",
            "Nice mobile",
            "Good mobile",
            "Satisfied",
            "Very nice",
            "Amazing performance, bright display with 120Hz refresh rate. Camera is not so good specially in low light.",
            "Good",
            "Good product",
            "I like",
            "This is a pure fire 🔥🔥🔥🔥🔥",
            "Camera is not that good quality but good for the price range",
            "Nice for general use ,and who loves to watch movies this gadget is good for it ,but in place of lcd it is better to give amoled display,if it is given that will be perfect.",
            "Good 👍👍👍😊😊😊",
            "Not good",
            "Overall it is good mobile",
            "Very nice",
            "Good",
            "Good",
            "Best phone in this price",
            "Nice",
            "Excellent phone.",
            "Every thing is awesome but size of screen is bit big so it want extra handling care",
            "Super",
            "This phone is awesome so big display with fast charger and 50 mp rear camera\nI am totaly satisfied with this phone",
            "So good plz buy this phone",
            "BOGAS ITEMS",
            "Vary vary good product",
            "Nice product",
            "Camera only folt another all best",
            "Super good products",
            "Some times upper side of the screen (touch)not working and heating problem also there...\nNetwork speed is slow\nTotally bad experience with this mobile",
            "Very nice game play and everything is good",
            "Super phone",
            "Is a bad quality this is damaged",
            "Really a good product by infinix",
            "Good phone",
            "Excellent product from lowest rate\nI got offer prize 14999 to 8/128\nGood one from🔥Infinix🔥\nOthers are huge rates.....\nThank you INFINIX",
            "Nice",
            "I think this is one of the best budget phones.\nI seriously loved it it's camera, battery and gaming performance it's just a very good budget phone",
            "Best mobile phone 🤳🏻🤳🏻",
            "Nice",
            "Value for money",
            "Super mobile",
            "I got best phone",
            "World number one phone",
            "Best phone best price. Atleast one time have to buy everyone. This is brilliant. My side 10/10 thanks infinix",
            "It is very good product",
            "Mobile performance was good but camera was very poor..it's only for gaming...",
            "It's sooo awesome and has high clarity for camera. We can also change the refresh rate according to the use. I love the display and processor... It's soo smooth and great value of money...",
            "Nice mobile",
            "Very good",
            "Very good mobile nice",
            "Excellent mobile,no heating and battery backup is so well.",
            "Nice n big mobile",
            "Best in its segment.",
            "Good phone at this price range.",
            "Amazing phone\nSuper powerful phone",
            "Oo\n\n\nGood battery\n\n\n\n\nGood display",
            "Best phone for budget gamers ❤️❤️❤️❤️❤️",
            "Good 😊😊😊😊",
            "Everything is good but it's display was very bad and they can give amoled display and it will be game changer phone. In this price range.",
            "Realy good product. Go for it",
            "Mobile is just awesome according to price point but first time when you will click images from it, you will not be very happy after sometime it will look normal and good images.sharing some photos(samples )",
            "It is the good mobile phone from infinix, this is good performance phone but battery percent draining fastly I think but no any issues like hanging or other any isuues",
            "Very good",
            "Good performance and good looking but camera quality and some things average area limit and it's not 5g phone and Infinix give us budget phone and advance features in this price",
            "Good product worth offmoney",
            "Good phone",
            "This phone is challenge to poco x3 pro",
            "Good",
            "Love",
            "Nice phone in this price segment\nWith good display size and camera\n\nNice",
            "Nice👍👍👍 infinix note 11s good phone because one problem not full screen ine game",
            "Nice but mobile very very heat",
            "Very nice",
            "Good",
            "Excellent mobile",
            "Super mobile",
            "Fully loaded with functions battery display and many more with very reasonable price range.No branded can offer you this function in this price.",
            "Good low cast and best features",
            "Very nice response. I liked it very much. I play free fire game very smoothly. Nice product",
            "Very very nice",
            "First thing phon is very smooth and very big\nAnd you never find any phone with 8 gb ram in only 15999",
            "Best phone go for it",
            "Good and best",
            "Phone battery backup not good. Am sorry to say. Wrong phone selection. Bad luck",
            "Nice phone",
            "Badget friendly phone",
            "Nice",
            "Not as mentioned display is big but useless having touch issue",
            "Super mobil",
            "Nice phone...",
            "Very good",
            "Super mobile phone is perfect mobile",
            "I am Very happy",
            "Best phone in this range",
            "Good phone\nWorth for price",
            "Nice product",
            "heating issue and bettery life issue",
            "Good",
            "I have already using Infinix hot4 pro and 100% satisfy with my choice\nso again i have purchased infinix 11s free fire addition and satisfy with\nlook-wise and performance",
            "Trending set for students l",
            "Nice",
            "Cinematic experience is good.\nCamera quality is very bad.\nDecent battery life.\nSometimes hang.\nOver all at this price point 3 out of 5",
            "Best phone for gaming, totally beast. No other phone can compete this phone under this price range. Performance is superb. Battery performance and quality of phone is awesome. Truely deserves 5 stars under this price segment.",
            "Very Good if display is OLED then excellent",
            "Bast products",
            "Lovely product",
            "Excellent product",
            "Good",
            "Nice cemra",
            "Very nice",
            "Good Quality Product 👍\nThank you Flipkart 🙏",
            "Nice ang good performance mobile",
            "Awesome smartphone must buy....❤️❤️❤️",
            "Camera quality is not good and i am facing a problem with brand new mobile show connecting handfree but handfree is not connected some time show some time removed automatically bad experience infinix...",
            "THIS PHONE WAS AWESOME AND I JUST LOVED IT",
            "Good",
            "Value for money",
            "Good",
            "Good",
            "Best for the price range",
            "Very bad front camera and feature",
            "Good quality",
            "Very very good mobile",
            "This phone is op for free fire",
            "Infinix note 11s mobail is very osm",
            "Touch not working accordingly\nNot good performance",
            "Camera is not up to expectation,poor !",
            "Good budget phone 📱🙂😍",
            "Good",
            "Amazing",
            "I brought this phone after seeing somany negative comments but the product in this price range is fantastic Camera is not great like I phone but perfect for taking clear photos and affordable to a medium budget buyer screen size is big and sound is amazing with DTS surround sound...\nNice phone",
            "Just received only four days. Let's see in coming days. It's good as of now",
            "No good",
            "Good",
            "So super",
            "Good product value for money .. Who need big screen can blindly go for it ... Camera average but at this rage its worth to buy this mobile",
            "Good phone except camera.",
            "Must go money down cam3ra worst after one month",
            "Good",
            "Not good work",
            "Nice",
            "Nice",
            "Nice mobile",
            "Infinix Note 11 s Free Fire Edition phone is great. Go for it. More than 5 stars from me. Screen size, battery performance, camera, ram, storage capacity all perfect in this price range. In a month I hv bought 2 Infinix brand phones 1. Infinix Note 10 Pro and 2. Infinix Note 11 s free fire edition for my daughter. We both are super happy. These phone is up to the mark for all my phone requirements. 5⭐️⭐️⭐️⭐️⭐️",
            "It's great . Working fine . I was a bit reluctant at first but this mobile phone stood upto my expectations .\nAt this price range I couldn't have asked for better infact I guess its far more that what I had expected . If you are a student or wa working professional who has heavy task to do on mobile which consumes higher computation resources as well as needs a good performace overall with long battery and fast charging this is the one .",
            "All are ok",
            "Awesome",
            "superb",
            "No coment",
            "Nice .,...good quality phone ...only super use for free fire.game ...perpose",
            "Ok",
            "Happy",
            "Regret on this purchase 😪\nNetwork issues..\nNot a user friendly ui.\nTotally complicated settings and filled with unwanted bloatwares.I bought it is an Indian made phone but for my daily drive my option went wrong.",
            "BEST PHONE FOR GAMING UNDER 20000 GOOD DEVICE",
            "Pros :\n\nGood price, loud sound with dual speaker, big screen, capable processor, no heating, fast charging.\n\nCons :\n\nBattery should be 6000mah, feeble haptics with average vibration even without LRA, 120Hz doesn't feel anything, average camera.",
            "Awesome product....",
            "Super Performance I recommend to Buy",
            "Very good👍👍👍👍👍",
            "Awesome",
            "BEST VIBRATION...BEST DIAPLAY ITS BIGG..AND PRETTY ENOGH BRIGHNESA....CAMERA OKK LEVEL.... PERFORMANCE IS BEAST..😇overall its worth your koney.",
            "Good",
            "Nice",
            "Value for money",
            "Good one but battery required to Improved,",
            "Very fast phone",
            "Very nice product",
            "Nice product....\nEverything is nice, only the size of the display is big",
            "camera is poor, there might be some improvement in handset",
            "Front cam is extremely good",
            "Super and fantastic",
            "Nice phone at this price",
            "Awesome",
            "Very smooth and good but it's so big but it's good",
            "Good",
            "Good",
            "A very, very good but underrated phone. Extremely smooth to operate and has an outstanding battery. Charges very quickly and with my kind of operation, phone, banking related work and a lot of OTT and TV viewing the same lasts 2 days. The only thing that I need to know is about the service centers",
            "Camera quality is good, Big display and good battery back up",
            ", charging is good.camara desply is not good. And this is not gameing phone. lagging is high. Value of money is good.normel use like if we not play games this is best phone. If play the game Please ignore this phone.",
            "Ok",
            "Super",
            "Very good product. Camera is OK. You must be by",
            "Osm mobile",
            "Hiting problem",
            "Super everything in this phone it's next level fresh rate, camera, battery, charging speed and many more",
            "Worst mobile phone\nBrighness low\nMobile camera quality low\nWhatsApp status sound problem",
            "Fantastic phone.",
            "Nice phone undur budget",
            "Really good handset.... What iam expected...",
            "Op phone should buy the because of amazing display , Pofermance and camera",
            "This item is not good",
            "Good",
            "Mobile is excellent but display was quite larger can't hold in single hand overall good for this price range",
            "Goob",
            "Average budget phone",
            "Good product",
            "It's a great deal with 15k.",
            "Nice mobile",
            "Phone is good.finger.frient no",
            "All things good except camera. I M not accepting that infinix will Launch how much poor camera.",
            "When I received I am very happy key is feature best very smooth and no hanging",
            "Good. This is France origin best mobile nowadays",
            "Best phone only for free fire lover 🔥",
            "Best phone for gaming",
            "Good mobile in this price Range less weight mobile normal usage ok buying for gaming avoid this mobile slow down ( hang) 😌😟🥶😬",
            "Lovely phone",
            "Very good",
            "Just awsm buy now.",
            "Mind blowing performance.. 🙏",
            "Super nice",
            "Good but display normal",
            "Nyc phone",
            "It's a good phone",
            "Nice device",
            "Awesome product, just loved it\nElegant look 😋❤️",
            "Best phone under 15999",
            "Great",
            "Awesome 👌",
            "Best",
            "Good",
            "Phone look. performance batteri display very very good i like it thank you flipkart",
            "Best phone in the market.. Too good quality",
            "Nice",
            "Best Phone Under This Price.",
            "Awesome",
            "This is amazing. I like it very much.",
            "Nice mobile",
            "Super and nice",
            "Not much as expected. Camera quality is very poor",
            "💯 for this price range...nice experience",
            "Best product",
            "I just love ❤ it......nice mobile..🙂",
            "I was used Past one week there are no heating issue no lag on gaming performance\n\nand the battery was working awesome\nand 33 w chargeer also supports good",
            "At this price range it is worth buying",
            "Best camera",
            "Good mobile for thi price, All features are good must buy",
            "Simple awesome",
            "Osam",
            "Very good👍👍👍👍 👌👌👌👌✋",
            "Phone has amazing performance. It's just more than what I expected.",
            "Quality is very nice....",
            "This phone is too good as I accepted. This phone is best for all work as well as gaming. And flipkart delivers this phone very quickly and very safely. I am so happy with this product. All the features of this phone is so nice.Camera quality of this phone is very very nice.It is a big myth in mind of people that infinix phone are not good but there is nothing like that.This phone is better than all Chinese phone.You should also try this phone.At last I love this phone very much. ❤💖\n\n\nImportant Note For Infinix-Please provide a ear phone inside the box.\n\nOne Cons-You should have to give secondary mic(Noise cancelation mic).\n\nGood 👍👍👍👍",
            "Good",
            "v good",
            "Very Good Product.",
            "Good",
            "Nice, very beautyful mobile...but where is back butten?",
            "Good battery pickup good gaming",
            "Good I love it",
            "Nice product and also with in the budget.",
            "Very nice and very fast",
            "I am Really Impressed......🔥👌🏻🤝🏻✌🏻",
            "Nice",
            "Good phone",
            "Nice phone with large display.",
            "Giving review after 13 days used.. Very good experience with Infinix note 11s free fire edition",
            "As much as I expected",
            "This Phone is Beast in this Price segment for everything. All sensors work to the best perfect. Gyroscope is very fast and responsive (for Gamers).\nBut this phone lacks sime camera features. It has average camera performance. photos are over-exposed and cannot adjust light conditions. Video mode is very poor. Not optimised.\n2.5 hours of continuous BGMI, no heating issue no lag.\nBattery is good and fast charging is impressive.\nXOS 10 is very impressive and smoother.\nReal-time 120hz Experience.",
            "Very nice products",
            "Every thing is above the expectations, value for money , camera is awsm, go for it , thanks for Flipkart for very fast delivery",
            "This mobail is bad",
            "Very good👍",
            "Design, look, everything is ok. But UI problem. It's stopping. Phone is not working well.",
            "Worth for money spent.",
            "Amazing phone at this price range.",
            "Nice phone",
            "Classy phone awesome smooth faster"
        ],
        "likes": [
            "458",
            "382",
            "235",
            "123",
            "63",
            "82",
            "11",
            "8",
            "16",
            "14",
            "458",
            "382",
            "235",
            "123",
            "63",
            "82",
            "11",
            "8",
            "16",
            "14",
            "5",
            "12",
            "4",
            "14",
            "3",
            "6",
            "2",
            "1",
            "6",
            "731",
            "180",
            "305",
            "229",
            "114",
            "67",
            "248",
            "104",
            "60",
            "93",
            "30",
            "204",
            "170",
            "37",
            "10",
            "8",
            "33",
            "30",
            "11",
            "28",
            "16",
            "10",
            "6",
            "6",
            "15",
            "9",
            "9",
            "16",
            "5",
            "8",
            "46",
            "4",
            "4",
            "4",
            "6",
            "126",
            "14",
            "7",
            "7",
            "129",
            "3",
            "2",
            "3",
            "2",
            "5",
            "8",
            "8",
            "6",
            "6",
            "6",
            "5",
            "6",
            "2",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "2",
            "2",
            "3",
            "3",
            "3",
            "2",
            "6",
            "15",
            "7",
            "30",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "1",
            "1",
            "4",
            "2",
            "2",
            "3",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "3",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "65",
            "57",
            "38",
            "21",
            "9",
            "15",
            "0",
            "0",
            "3",
            "2",
            "65",
            "57",
            "38",
            "21",
            "9",
            "15",
            "0",
            "0",
            "3",
            "2",
            "0",
            "4",
            "1",
            "12",
            "1",
            "7",
            "1",
            "0",
            "24",
            "64",
            "13",
            "26",
            "22",
            "9",
            "5",
            "31",
            "11",
            "5",
            "13",
            "2",
            "45",
            "38",
            "5",
            "0",
            "0",
            "8",
            "7",
            "1",
            "7",
            "3",
            "1",
            "0",
            "0",
            "3",
            "1",
            "1",
            "4",
            "0",
            "1",
            "26",
            "0",
            "0",
            "0",
            "1",
            "109",
            "7",
            "1",
            "1",
            "125",
            "0",
            "0",
            "0",
            "0",
            "1",
            "3",
            "3",
            "1",
            "1",
            "2",
            "3",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "5",
            "20",
            "7",
            "57",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "7",
            "3",
            "4",
            "7",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "2",
            "2",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Can i play free fire in this phone",
            "Q:Is it support VoLte",
            "Q:Battery removable or fixed this mobile ??",
            "Q:Can i play free fire with on screen recorder",
            "Q:this product free fire edition or normal",
            "Q:Fingerprint available in this phone?",
            "Q:How many minutes will be required to charged fully??",
            "Q:Realme 8i vs infinix not 11s ?",
            "Q:Dual Apps support or not sir ji...",
            "Q:It is best gaming processor",
            "Q:Free fire pre installed or not",
            "Q:It provides the case",
            "Q:Does it have remote sensor",
            "Q:Can I play bgmi in 90 fps",
            "Q:Can I Record Screen With Internal Sound?",
            "Q:game voice changer available or not",
            "Q:Fingerprint front or back side",
            "Q:How many min quick charge",
            "Q:Earphone available or not",
            "Q:1+1 jio sim working",
            "Q:Is this display HDR support or not",
            "Q:Can it send charging to other phone",
            "Q:Can this lag or heating issue while playing BGmi for long time with 90 fps or ultra hd quality graphics",
            "Q:WHAT IS IN THIS BOX",
            "Q:I can play call of duty",
            "Q:I can play pubg mobile lite with 0lag",
            "Q:This phone will support pubg 90 fps or not",
            "Q:Realme 9i vs infinix note 11s which one win",
            "Q:Gameing phone free fire",
            "Q:does it have a front light",
            "Q:Water resistant mobile or not",
            "Q:Is there any heat problem ?body heat",
            "Q:It has slow motion video recording",
            "Q:Sir this mobile can be a anble to Wi-Fi calling",
            "Q:Vani use wired earphone",
            "Q:Realme 8i vs infinix not 11s . Who is best ?",
            "Q:Can support 5g Sim card",
            "Q:Does jio sim works in it?",
            "Q:Can I use wired earphones",
            "Q:Can we update Android 12 , 13 updates",
            "Q:is android 13 support?",
            "Q:Does it have a pen",
            "Q:Is it support dual 4G SIM at same time",
            "Q:Is it support dual 4g sim in this phone",
            "Q:Can I play genshin impact without any lag?",
            "Q:Is it better than Redmi note 10s?",
            "Q:Can i play bgmi in 60 fpspleasnan",
            "Q:Battery 6000 mAh",
            "Q:Does it have amoled display if they have so this good",
            "Q:It has compass",
            "Q:33 w chargar",
            "Q:No headphone jack to this phone?",
            "Q:Is there any night mode in camera ? Realme 8i or infinix which is better?",
            "Q:Is it can hydraulic sim slot",
            "Q:Is Face locked in it explain it",
            "Q:Does native video call available in this phone or not That is direct video call without any third party application",
            "Q:Second space available",
            "Q:Is this 5 g or not",
            "Q:Dual apps features available in the phone",
            "Q:How many renge zooming this mobile",
            "Q:Charger details ? 10W or 18W or 33W or anything else ?",
            "Q:Screen recorder yes or no",
            "Q:I came play freefire",
            "Q:Liquid cooling system is available in this phone?",
            "Q:Can I play free fire ultra graphic",
            "Q:Does it have screen recording option",
            "Q:Is automatic Call recording is available",
            "Q:Realme narzo 30 4g vs infinix note 11s ? How is winner",
            "Q:It is 4g or 5g",
            "Q:The storage is expandable",
            "Q:Gaming support is there like poco x3pro",
            "Q:Redmi note 10s vs infinix note 11s which is better for gaming free fire",
            "Q:How dose gyroscope in pubg work in this is phone phone",
            "Q:Q: bluetooth are avelable yes or no",
            "Q:Will it support BSNL sim",
            "Q:This is support 3.5mm audio jack",
            "Q:Waterproof or not",
            "Q:O T G support...?",
            "Q:Is it double sim and one memory slot available???",
            "Q:How is the camera quality?",
            "Q:Is there any lag in mobile after 1year or few months while playing free fire",
            "Q:Is it good for gaming",
            "Q:z it supports dual applications",
            "Q:Mobile body plastic & metel?",
            "Q:What is the sound of this phone???",
            "Q:Can I play Pubg in ultra HDR graphics",
            "Q:Headset is there?",
            "Q:Virtual ram support?",
            "Q:All camera works or not?",
            "Q:Online classes can do or not",
            "Q:Is the phone processor good or bad",
            "Q:Is G96 this processor is better than mediatek helio G95",
            "Q:Both sim slot 4g supported.",
            "Q:Is the bottom speaker",
            "Q:Fast changing available with phone or what",
            "Q:Battery mah what ??",
            "Q:Call recording option ??",
            "Q:This phone is of which brand",
            "Q:Bgmi fps setting",
            "Q:Voice change option available",
            "Q:How many hours we can constantly work on this phone?",
            "Q:Have best giro settings for playing pubg????",
            "Q:Does it support bgmi",
            "Q:does it charge fast",
            "Q:Realme 7 pro or infinix note 11",
            "Q:How much ram we can expandable plz teel",
            "Q:Gorila glass konsa hai",
            "Q:Can I play bgmi in high grafix",
            "Q:Is its UI is good ??",
            "Q:How many time to gets fully charge 0 to100",
            "Q:It's network volte or LTE",
            "Q:Does it contains tempered glass",
            "Q:Does it have gorilla glass???",
            "Q:Fm radio yes on",
            "Q:Did i get lcd display tv with it",
            "Q:Does free fire game inbuilt installed or not",
            "Q:Does it has screen guard in jt already",
            "Q:Is it slim?",
            "Q:Dual sim jio , dual volte",
            "Q:Can we upgrade it's storage",
            "Q:Does the phone have heating issues",
            "Q:finger print yjcvyu",
            "Q:ppi of this phone is",
            "Q:This phone voice change option available for gaming",
            "Q:Voice changing in mobile",
            "Q:Will it be 5g after the update?",
            "Q:This is waterproof phone",
            "Q:Can I play Minecraft and free fire",
            "Q:How much thin the mobile",
            "Q:z it supporting dual appa",
            "Q:We can change voice in game in free fire and call"
        ],
        "answers": [
            "A:Yes",
            "A:Yes",
            "A:Fixed",
            "A:Yes of course or you can also do live streaming on YouTube while playing on this phone.",
            "A:Free Fire Edition.",
            "A:Yes",
            "A:70 minutes",
            "A:infenix is very good phone",
            "A:Yes, Through Clone mode",
            "A:Nice",
            "A:no",
            "A:For free fire ed, a plastic back cover is provided. But do get a flip cover.",
            "A:.. No",
            "A:yes",
            "A:Yes...",
            "A:yes",
            "A:right side",
            "A:50 minutes",
            "A:No, Earphones are not in the box.",
            "A:2",
            "A:yes",
            "A:yes",
            "A:Till now I didn't face any heating issue, playing for 3hrs",
            "A:handset, phone cover, charger with usb cable",
            "A:Yes of course and it is so super smooth. Pls buy 8gb variant if you want to buy this",
            "A:pubgm lite ? yes you can play without lag but in pubgm it's only supports Ultra - Smooth",
            "A:no",
            "A:Infinix Note 11s",
            "A:yes its gaming phone",
            "A:Yes",
            "A:Not sure about it. You can check the description",
            "A:No heating issues found on my 8gb variant, freefire edition",
            "A:Yes, it has it and I really love to use this Slo-mo feature.",
            "A:Yes",
            "A:Yes",
            "A:Real 8i",
            "A:It's a 4G phone",
            "A:Yes of course. Nowadays, every phone has Volte support so don't worry. You can use Jio 4g",
            "A:Yes",
            "A:No",
            "A:No,after its update it may be Android 13",
            "A:no",
            "A:yes",
            "A:no",
            "A:Yes you can play",
            "A:No",
            "A:no",
            "A:Yes",
            "A:No, it has Full HD+ display only",
            "A:Yes, it has",
            "A:Yes",
            "A:yes",
            "A:Infinix is better in performance only, it's camera is worst. I don't even open it's camera because that is of no use. If you are looking for good camera phone please buy latest smartphone from OPPO",
            "A:no dedicated",
            "A:yes , and it perfectly works. This device gives you almost ever features you want in low budget.",
            "A:Nice video call facility available in this without having any third party application",
            "A:Yes, it must be there.Or you can use 3rd party app like parallel space",
            "A:Not",
            "A:Yes, it is there. You can also install parallel space if incase you don't find it",
            "A:50mp",
            "A:33 w charger",
            "A:Yes",
            "A:yes so smoothly",
            "A:yes",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:Infinix is the winner.",
            "A:4g",
            "A:yes",
            "A:Yes",
            "A:I would go for Infinix note 11s. Because feature and price wise Infinix is a better phone.",
            "A:very good work",
            "A:YES.....",
            "A:yes of course",
            "A:Yes supported",
            "A:No",
            "A:Yes",
            "A:Yes",
            "A:good",
            "A:Till now I haven't found any lags or heating issues on my 8gb+128gb variant (freefire edition)",
            "A:Till now I have tried just Cod mobile and Nfs no limits where I have found no issues. I have played in hd mode and it's quite good. You can definitely go for it",
            "A:Yes, it has dual apps running capability at the same time",
            "A:Plastic",
            "A:sound of the phone is good, not loud enough but very good for having a good experience",
            "A:yes",
            "A:Yes",
            "A:no",
            "A:All works, but quality is poor",
            "A:yes it good for all uses",
            "A:very good",
            "A:yes",
            "A:Yes",
            "A:yes,very good",
            "A:Yes 33watt",
            "A:5000",
            "A:not",
            "A:infinix",
            "A:60fps",
            "A:No, there is not any such option.",
            "A:if you are playing a game then around 18-20 hours. If doing some work then 22-25 hours",
            "A:no",
            "A:Yes",
            "A:very fast",
            "A:realme 7 pro",
            "A:upto 5gb. but not so effective performance",
            "A:Not mentioned.",
            "A:No",
            "A:yes",
            "A:max to max 1.15 hour",
            "A:Volte",
            "A:no, it's not a temper glass",
            "A:no",
            "A:yes",
            "A:yes it's very nice",
            "A:No it's not.",
            "A:yes",
            "A:nope",
            "A:yes",
            "A:not required...",
            "A:no",
            "A:Yes, side mounted finger sensor",
            "A:You can check on the description",
            "A:no voice changer option",
            "A:no",
            "A:5g capability is not provided in this phone on the hardware so it won't become 5g after update. This is just a 4g phone and it is better to buy it",
            "A:No dude",
            "A:Yes of course. I would recommend you to go for 8GB variant if you want to buy it",
            "A:Please look at the description for your answer",
            "A:Yes dude, it does.",
            "A:No"
        ],
        "likes": [
            "168",
            "103",
            "110",
            "12",
            "19",
            "12",
            "5",
            "5",
            "4",
            "5",
            "10",
            "3",
            "4",
            "6",
            "6",
            "7",
            "7",
            "5",
            "5",
            "5",
            "6",
            "3",
            "4",
            "5",
            "3",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "2",
            "1",
            "3",
            "1",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "233",
            "156",
            "176",
            "13",
            "17",
            "14",
            "14",
            "21",
            "8",
            "9",
            "13",
            "10",
            "6",
            "8",
            "9",
            "22",
            "5",
            "5",
            "4",
            "5",
            "8",
            "3",
            "3",
            "4",
            "4",
            "12",
            "8",
            "9",
            "7",
            "3",
            "3",
            "3",
            "1",
            "1",
            "2",
            "2",
            "5",
            "3",
            "1",
            "2",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "0"
        ],
        "dislikes": [
            "29",
            "17",
            "21",
            "0",
            "1",
            "2",
            "0",
            "0",
            "1",
            "0",
            "2",
            "1",
            "0",
            "1",
            "1",
            "4",
            "1",
            "1",
            "0",
            "1",
            "2",
            "0",
            "1",
            "3",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "7",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "25",
            "18",
            "30",
            "0",
            "1",
            "1",
            "1",
            "3",
            "0",
            "0",
            "1",
            "1",
            "0",
            "1",
            "2",
            "9",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "7",
            "3",
            "7",
            "3",
            "0",
            "3",
            "1",
            "0",
            "1",
            "0",
            "0",
            "8",
            "3",
            "1",
            "5",
            "3",
            "6",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "2"
        ]
    }
}