{
    "title": "APPLE iPad Air 256 GB ROM 10.5 inch with Wi-Fi+4G (Gold)",
    "product_specification": {
        "Model Number": "MV0Q2HN/A",
        "Model Name": "iPad Air",
        "Color": "Gold",
        "Connectivity": "Wi-Fi+4G",
        "OS": "iOS",
        "Operating System Version": "12",
        "Voice Call": "No",
        "Display Resolution Type": "Full HD",
        "Supported Network": "GSM, WCDMA, 4G LTE",
        "Display Supported Network": "LTE",
        "Processor Type": "A12 Bionic Chip, 64-bit Architecture with Neural Engine and Embedded M12 Co-processor",
        "Additional Features": "Built-in Stereo Speakers",
        "Display Size": "26.67 cm (10.5 inch)",
        "Sales Package": "iPad Air, Lightning to USB Cable, USB Power Adapter, User Manual, Warranty Card",
        "Display Resolution": "2224 x 1668 Pixels",
        "Primary Camera": "8 Megapixels",
        "Internal Storage": "256 GB",
        "Sim Size": "Nano SIM",
        "Multi-touch": "Yes",
        "Sensors": "Touch ID, 3-axis Gyro, Accelerometer, Barometer, Ambient Light Sensor",
        "Sim Type": "Single Sim",
        "ROM": "256 GB",
        "Battery Type": "Lithium Polymer",
        "Play Time": "Upto 10 hrs",
        "Document Viewer": "Yes",
        "E-mail": "Yes",
        "Secondary Camera": "7 Megapixels",
        "Video Recording": "Yes",
        "Full HD Recording": "Yes",
        "HD Recording": "Yes",
        "2G": "Yes",
        "3G": "Yes",
        "Edge": "Yes",
        "GPRS": "Yes",
        "Bluetooth Version": "v5.0",
        "USB": "Lightning Connector",
        "Browser": "Safari",
        "Headphone Jack": "3.5 mm",
        "Wi-fi Version": "802.11 a/b/g/n/ac",
        "Other Connectivity Features": "Bluetooth Support, 2.4 GHz and 5 GHz Dual Band Wireless Connectivity",
        "Other Display Features": "LED Backlit Multi Touch Display, Wide Color Display (P3), Fingerprint Resistant Oleophobic Coating True Tone Fully Laminated Display, Anti-reflective Coating, 500 nits Brightness, Supports Apple Pencil",
        "Display PPI": "264 PPI",
        "Video Formats Supported": "AAC (8 to 320 Kbps), Protected AAC (from iTunes Store), HE-AAC, MP3 (8 to 320 Kbps), MP3 VBR, Dolby Digital (AC-3), Dolby Digital Plus (E-AC-3), Audible (Formats 2, 3, 4, Audible Enhanced Audio, AAX, and AAX+), Apple Lossless, AIFF, and WAV",
        "Full HD Playback": "Yes",
        "HD Playback": "Yes",
        "Video Playback": "Yes",
        "Audio Formats Supported": "H.264, MPEG-4, M4V, MP4, MOV, M-JPEG, AVI",
        "GPS Support": "Yes",
        "GPS Type": "A-GPS, GLONASS",
        "Map Support": "Maps",
        "Memory Card Support": "No",
        "Warranty": "1 Year",
        "Warranty Summary": "1 Year Manufacturer Warranty for Device and In-box Accessories Including Battery from the Date of Purchase",
        "Warranty Service Type": "Carry In",
        "Covered in Warranty": "Manufacturing Defects",
        "Not Covered in Warranty": "Physical Damage",
        "Warranty Period": "1 Year"
    },
    "product_description": {
        "Lightweight and Portable": "This iPad is happy to keep you company where ever you go. It is lightweight, slim and easy to carry at only 464 grams. It has a battery life that lasts up to 10 hours. 256 Gb of storage space lets you carry your media around with you. You can connect to the internet via Wi-Fi and a 4G connection.",
        "Powerful Chip": "The A12 chip featured on this iPad is powerful enough to handle the most demanding apps.",
        "Retina Display": "Watching anything on this iPad’s immersive display is a pleasure as it has a stunning colour reproduction. Reading is easy under any ambient light source.",
        "Cameras": "It features an 8-megapixel rear camera and a 7-megapixel front camera. Both cameras are capable of recording HD videos.",
        "Apple Pencil": "This Apple iPad Air now supports the Apple Pencil so you can enjoy taking down notes and drawing with pixel-perfect precision.",
        "Smart Keyboard Enabled": "You no longer will have to charge or pair your keyboard. Just open the keyboard and type away to glory."
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "1",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "2",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "2",
            "5",
            "1",
            "1",
            "2",
            "2",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "4",
            "2",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "1",
            "4",
            "4",
            "5",
            "3",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5"
        ],
        "review": [
            "This ipad is the best tablet for students. Students doesn't really need the Pro model to do daily tasks like note taking, reading, playing games, sketching and media consumption. This ipad can do all these tasks without any hick up because of its powerful A12 bionic processor.\nBattery backup is also on point. For the past 1 month I've been using this ipad with an avg. of 10hrs screen on time daily. At the end of the day 20-30% of battery still left if I start my day with full charged.\nBuy the apple pencil 1st gen. to use this ipad to its max. potential. Pencil is a must needed item for student.\nIf money isn't an issue for you then ipad pro is obviously the better choice. But if you doesn't care about pro-motion display,minimum bezel design, if you wanna save some money, then this is the ipad to go for. And if you can afford 256GB model then its better you buy the Ipad pro 2020 11inch 128gb.",
            "If you are a med student just go for it. It has a larger display than the basic iPad and a laminated display, best for reading books; also good for media consumption. With the a12 bionic chip it's Smooth AF😍 . You will have a pro like experience. If you are willing to take note u have to buy an apple pencil. Camera is only downside , but having a a good camera phone who needs a camera on iPad any way. Overall I'm just loving it.",
            "Must buy product for reading and entertainment. Awesome product made by Apple. Delivery was fast but this time flipkart packaging was not good.. else Ipad air is awesome to have .\ngot it at 36000/- in Big Billion Day 2019...",
            "Excellent. butter smooth performance. Camera could have been better way better than ipad 2018. Overall great AIR in polluted environment.",
            "Beast at it's price if u are looking into a mid range of an ipad this won't disappoint you it covers almost all good features apart from the pro motion and stuff like that but believe me the optimisation is excellent even for the 60 hz display the internals are beefy and software experience is just on another level given that it runs on Ios 13 overall as a medical student really liked the ipad it changes my experience as a whole\nbattery life is excellent as well can get you around 1 to 1 and a 1/2 day even after quite heavy usage easily overall a worthy purchase for the 64 gigs variant",
            "Cons;-it get little hot while charging as usual Apple devices.it takes 3 hours to full charge and camera is average but enough for face time,rest all things are perfect.2 speaker are above average but not like the 4 speakers of pro.",
            "Best value for money ipad. Very good performance. It have a similar processor as ipad pro. Flipkart has a very fast delivery service.",
            "Everything is perfectly placed in this one iPad Air 3..... Helpful in highlighting important topics and make notes out of newspaper and articles.... Buttery screen...\nJusss go for it....",
            "I just bought ipad Air 3 .\nI will write my review after a few days.",
            "Better than a laptop when it comes to study and taking notes, taking notes with apple pencil is easier and quicker. Retina display is too good,,the sound is pretty awesome good battery backups almost keeps charge for 20 hrs (varies.on use). With apple pencil the experience will be truely amazing. If you are a student or an artist, it will help you lot.",
            "This ipad is the best tablet for students. Students doesn't really need the Pro model to do daily tasks like note taking, reading, playing games, sketching and media consumption. This ipad can do all these tasks without any hick up because of its powerful A12 bionic processor.\nBattery backup is also on point. For the past 1 month I've been using this ipad with an avg. of 10hrs screen on time daily. At the end of the day 20-30% of battery still left if I start my day with full charged.\nBuy the apple pencil 1st gen. to use this ipad to its max. potential. Pencil is a must needed item for student.\nIf money isn't an issue for you then ipad pro is obviously the better choice. But if you doesn't care about pro-motion display,minimum bezel design, if you wanna save some money, then this is the ipad to go for. And if you can afford 256GB model then its better you buy the Ipad pro 2020 11inch 128gb.",
            "If you are a med student just go for it. It has a larger display than the basic iPad and a laminated display, best for reading books; also good for media consumption. With the a12 bionic chip it's Smooth AF😍 . You will have a pro like experience. If you are willing to take note u have to buy an apple pencil. Camera is only downside , but having a a good camera phone who needs a camera on iPad any way. Overall I'm just loving it.",
            "Must buy product for reading and entertainment. Awesome product made by Apple. Delivery was fast but this time flipkart packaging was not good.. else Ipad air is awesome to have .\ngot it at 36000/- in Big Billion Day 2019...",
            "Excellent. butter smooth performance. Camera could have been better way better than ipad 2018. Overall great AIR in polluted environment.",
            "Beast at it's price if u are looking into a mid range of an ipad this won't disappoint you it covers almost all good features apart from the pro motion and stuff like that but believe me the optimisation is excellent even for the 60 hz display the internals are beefy and software experience is just on another level given that it runs on Ios 13 overall as a medical student really liked the ipad it changes my experience as a whole\nbattery life is excellent as well can get you around 1 to 1 and a 1/2 day even after quite heavy usage easily overall a worthy purchase for the 64 gigs variant",
            "Cons;-it get little hot while charging as usual Apple devices.it takes 3 hours to full charge and camera is average but enough for face time,rest all things are perfect.2 speaker are above average but not like the 4 speakers of pro.",
            "Best value for money ipad. Very good performance. It have a similar processor as ipad pro. Flipkart has a very fast delivery service.",
            "Everything is perfectly placed in this one iPad Air 3..... Helpful in highlighting important topics and make notes out of newspaper and articles.... Buttery screen...\nJusss go for it....",
            "I just bought ipad Air 3 .\nI will write my review after a few days.",
            "Better than a laptop when it comes to study and taking notes, taking notes with apple pencil is easier and quicker. Retina display is too good,,the sound is pretty awesome good battery backups almost keeps charge for 20 hrs (varies.on use). With apple pencil the experience will be truely amazing. If you are a student or an artist, it will help you lot.",
            "Wonderful device I got best deal for just 36k during big billion day sale . This device is suitable for students. If u r student the best device for u",
            "This is first apple device in my life. Got it in 25may 2020. Packaging was good,product is superrr. As a android guy now I can feel and understand what apple really is. Never experience before such smooth performance in my life. I bought it mainly for UPSC CSE preparation and also heard that ipads are super amazing in terms of gaming also so installed PUBGM and when for the first I opened it I laughed for 5minutes and shocked because I have never experienced such smooth and that big clear view in this game before.I feel like a newly throned KING in PubgM like no one can beat be and confidence goes up to 1000% lol.After using A12bionic in it I feel like what I have just explained(soo over powered omg).... If I write all my feelings about this ipad it will take atleast 1 hour. So I would like to ended up hear with big thank you to flipkart with so much love.",
            "I just loved this purchase.. Worth the money spent.. Prompt delivery of the product.. If you are looking for cost effective ipad just go for it.. The processor is similar as of ipad pro.",
            "This is my 1st iOS device. And believe me it’s a gem in the tablet section. iPad latest 3rd generation is completely power packed device with awesome stunning display with a charismatic performance. If u planning for a basic iPad with a larger display and good performance just go for it. Thanks to Flipkart for flawless service.",
            "I have been really pleased with the overall experience of using ipad air 3rd generation. It has got an amazing screen and one hell of a great battery life as i am easily averaging about 10hrs of screen on time per charge. Add to this it has A12 bionic chip which is a very powerful processor hence, the performance is buttery smooth. If u like browsing, watching content on prime, netflix & youtube etc. and take ocassional notes you could easily replace ur laptop with ipad air 3. I would also re...\nREAD MORE",
            "I'm using this iPad for more than 15 days now with ipencil of course.. most of the my uses are educational purpose oriented so I make notes, read , underline important points etc... It's best replacement for pen and paper.. sound quality is good.. camera quality is also good and you can't expect awesome camera quality as that is not the primary feature or function of iPad.. overall its best.. 👍👍",
            "Omg i was so scared to order now in covid but it was worth ..i stay in banglore nd we are still in lockdown but still received the package safe and authentic in 5days was really happy thanks to flipkart and ekart\nWell packaged no damages\nAuthentic product ..i checked\nReally appreciate ..well little bit frustrated with battery but its ok ..its worth it",
            "Received the authentic product within day, happy with Flipkart for that.\n\nComing to device itself: Best display, battery life and no tablet can beat A12 in terms of processing. Also the audio output is loud enough and you will notice a good amount of bass. The speaker is far more superior from our mobile speakes.\n\nOne thing to keep in mind it does take 3.5hr to fully charge with provided 10W charger. Around 30% in an hour\nOne good thing is it does support Power delivery (pd) fast charging protocol (18w to 30w).\nSo if you want fast charging you will need to spend extra 6200 (4500 for apple 30w charger and 1700 for type c to lightning cable). I purchased both from apple store and charging time is reduced to almost less than half till 80%. After 80% the charging rate will go to normal mode. Within in one hour the ipad charges to 60 to 65% from zero.",
            "If you are a med student, definitely go straight away with iPad air. If you need more storage than 64gb, then go to 128gb 7th generation. But air has more better performance and display than the 7th generation. So think and buy. Just my personal opinion. The display itself is self explanatory for it's performance and cost. This is my first Apple product and I love it so much. Thank you Flipkart for this amazing product...",
            "possibly one of the best Ipad recommended if you are a Streamer who streams Games. Since you have to use 3.5mm jack i woild recommend this ipad instead on wasting your money on Ipad Pro. It does the jib absolutely fine. Touch response is great and so is Display. If you are PuBG player and you are sick of your Ipad 2018 9.7 , then this is best buy.",
            "This is my third month I am using this product. This is one of the most valuable product I have bought in 2019, though I believe IPAD pro 11 inch would be better, nonetheless this is good product if your aim is to read, surf though I have not played any game (not a game guy). I have not faced any software issues, the camera is kind of good for IPAD, the size of the IPAD is perfect it is like a book, so reading book in IPAD gives a feeling that I am actually reading a paper book. If you planning to go for lower version I would say spend little more money and get this product.",
            "The perfect iPad for those who have moderate budget but want a sincere performance. The camera quality is good but not excellent, if camera is your priority better go for iPad Pro or better an iPhone.\nThe display is really good. Its bright enough and not at all bad.\nThe speakers are only 2 in number and at the bottom but are loud enough with great crisp sound and bass.\n\nThe battery life. Oh man its freaking awesome! It can easily last you for more than 1 day for light users and can last for a...\nREAD MORE",
            "Very good tab go for it is the best in 40k segmet a beast at gamig great battery life 64 gb is a better option if you dont put photos and vids or files on your ipad, use an external adapter and sd card and you are good to go",
            "The Best iPad that I think in this price better than iPad pro...\n\nGo for it without thinking... 😁😁\nLove 💗 this iPad\n\nLet me talk about some pros and cons 😂😂\n\nThis is my first Apple product. I was eagerly waiting for it (because of Lockdown)\n\nPros:-\nA12 Bionic Chip is God.\nPerformance is like butter.\nIt has 60hz display but better than 90hz of Android.\nPUBG runs like a butter with recording.\n\nCons:- 🤣🤣\nI think I am fool that I am talking about cons but Camera 📸 could be better.\nOther than it has no cons only camera could be better..",
            "Awesome quality of this product. Buttersmooth experience i am buy my first Apple product and i am happy very happy with this product i am buy in big billion sale 2020 with Rs 38000.\nAwesome Experience Awesome in this price Experience also Super .\nOverall Ratings 9.5/10",
            "i have been using ipad air 3 since 1&half months. the battery life is exceptional and it is best for playing pubg and watching videos like netflix and prime video. it is also best for students as it is light weight",
            "It’s amazing product thanx to Flipkart i got it bcoz of u i saved 10k something\nSuperb speech of touch and everything is so fast and clear i pad matlab tashan wali life\nJiyo jee bhr k\nThanx apple nd Flipkart again and again",
            "Display is too good and I love it.\nCamera quality is average but anyways apple has its best camera clarity for its given mega pixels.\nThis iPad has a very great battery backup.",
            "Only if apple could give a fast charger inside the box...but again...its apple.....no amount of money is enough for it...still worthy product...you'll feel the power of the device as soon as you hold it in your hand. The processor is way too powerful and its surely going to live on to your expectations for at least 3-4 years down the line! Got this beauty today...kudos to the faster delivery timeline of flipkart!",
            "If you are looking for the regular ipad .. then it is a good iption than ipad 8 .. the display is good .. no problem with camera because no one takes photo with it..it only used for scan documents and pages. Good battery backup.. good performance",
            "It's perfect for students like me. It can never replace a laptop but if you want to make notes, play games it's the best you can get.",
            "Firstly, this my first Apple Product. I was very nervous to invest such a huge amount, but then thought of taking a risk. Well this purchase seems to be true value for money.\n\n10/11/2019:\nAfter using this product for a month here are few pros and cons listed below;\nPros: Great Battery Backup, can easily last upto 3-4 days for light-moderate usage.\nGreat processing, Not a single lag. (15-20 apps open in background)\nUse with Pencil is quite awesome.\n\nCons:\nNot good camera (Doesn't Bother much coz, camera wasn't my priority)\nNO WHATSAPP, A biggest con (Anyways Telegram is an option)\n\nConclusion: As my usage is for browsing Charts, it's awesome and laag-free, so it definitely suits my works.",
            "Probably the best device i've got. Amazing & blazing fast performance. Camera could have been better. All apps & games runs buttery smooth. Popular games performance will be upload later...",
            "It is very nice phone good value for money but they could have given better camera the display is very nice the battery sometimes drains fast overall I will rate is 4.5 out of 5",
            "1st of all a big thanks to Flipkart for Secured delivery of the beast ipad. I hve heard a lot of online scams with such costly products and I was a bit tensed of the delivery of the original Ipad. In our area Ekart started delivery of such costly products by appointing another person with the regular delivery guy with a instruction to unbox and deliver to the concerned person. I am very satisfied by the service and the ipad was delivered in time..\n1. This ipad Air 3rd generation 256gb is simply a beast..\n2. From a student to a professional anybody can use it for their purposes.\n3. Battery bckup is simply amazing.\n4. Display is very much like a crystal.\n5. Sound of the Ipad is very sweet.\n6. Charging time is not faster beacuse it doesn't support Fast charge.\n\nCant write more...😊\nAnyone can blindly go for it..\nIts a multitasking beast..👍👍",
            "Best iPad for this price ..... very smooth experience with A12 bionic chip...well optimisation . I've bought this for note taking and media consumption. I've bought ipad pro 12.9 inch for designing work, but this is best for note taking and portable as compared to my ipad pro. Very happy with this product 😉",
            "1) Don't buy cellular version cuz it has no any significant use except for accessing internet. In cellular version of ipad you can't do text message, voice calling, whatsapp etc\n\n2) Good for students for their study purpose, playing games, watching movies, online shopping and all.\n\n3) Display is good, light weight, ipad os is great, apple pencil is awesome for taking notes.\n\n4) Buy a min. 64 GB variant and higher.\n\n5) basic ipad is pretty much same as ipad air so save your money and choose wisely.",
            "Nothing less than a beast. Any app which we normally use are running smooth as butter. Display is quite good, less reflective. Best for study purpose. Battery backup is also long as it says. Sometime just the lack of flash with the main camera makes it irritating while scanning any document or taking picture in low light. Overall very useful with a smart thin look and light weight. Also very good for gaming 😁😁 but a little bigger for gaming, I think ipad mini will be the best choice if one want for gaming purpose.",
            "It’s already been 8 month since i bought apple ipad and must say its One of my best buys of this year. Since i do a lot of editing related work,the fast and smooth processor really makes the work quite easy!!! Good Buy!!",
            "this is the first experience in apple iPad air... one of best gizmo I ever had... its the best replacement for laptop.. video editing software is simply super.. .almost everything is superb in this... I recommend this",
            "Just awesome very light weight and thin. Great performance. A great buy if you like big screens just go for it.",
            "A really good product",
            "My first apple product and every bit of this is worth the price ... Bought it for 36K !!!! Love it !!!!",
            "I really loved it",
            "the best value for money ipad in 2019",
            "AFTER 15 DAYS OF USE.ITS OSM. PUBG RUN IN 60FPS NO LAG .MY KD IS INCREASING TO 5.57 NOW IN GAME NAME IS (LOG IN OP). DONT THING BUT IT IF U R A GAME LOVER .",
            "very good",
            "super performance and battery backup. This will made you a legend in pubg mobile. No heating No laging. Just awesome purchase\n.",
            "The display of this Air is very smooth.. You can easily find differences from ipad 6th gen. Everything is fine and also camera needs some improvements. There are little bit bugs in ipados13.1 but i'm sure that apple gonna fix it very soon. So highly recommended for students infact i am a Med student so i bought this to watch Prepladder video lectures..",
            "I ordered it as soon as it was available on Flipkart. Got this baby within 3 days.\n\nPros:\nButtery smooth performance with A12 Bionic Chip and 3 GB RAM.\nGames, apps run seamlessly. Gaming performance is mind-blowing. 60 frames per second even in hd graphics. No frame drops, no lags.. phenomenal performance.\nBattery easily runs for 10 hours.\nI used to play PUBG in Realme 2 Pro. But, gameplay in this iPad Air 2019, is totally on another league.\n\nCons:\nCamera could have been better.\nThey should have used usb type c for charging.\n\nFinal Verdict:\nYou can go for it blindly. You won't regret.\nOne advice though; please apply a tempered glass on the screen. This is a laminated screen. So, you accidentally scratch or damage your screen, it's going to be a costly repair.",
            "I purchased in 36k during festive offer.... really value for money....intially tensed abt genuinity of product but later found it original Apple product....\n\n5 star for display and performance....camera is should have been better...",
            "Good product ..it is too big in hand ....every thing is nice......Good product ......",
            "I am writing this review after using this iPad for 6 months. battery last for average rate of 8 hrs. I'm not a gamer so no gaming apps tested. Gives much optimal performance while reading and writing. true tone display and dark mode are awesome for readers and note making is easy. I'm using 1st generation apple pencil which has no lag. But now u can buy ipad 8th generation WiFi 128GB at much lower price than this.",
            "The item I received has a defective screen. There is a small dot/patch on the screen. And this dot is quite noticible while viewing the screen. Flipkart won't replace this item and now I end up with a defective iPad.\nNot sure if this defect was the reason for selling this on a discount.",
            "really happy with smooth performance....value for money...",
            "Average",
            "booked day one",
            "Apple is done apple things with that iPad Air..A class product...You guys don't hv to see the reviews for this product if u guys can afford this then definitely go for it..Love this iPad Air..",
            "It is nice for students for study purpose, but in high performing task and entertainment vise also it is good ,pubg can run on HDR with ULTRA and COD M can be run on Battel Royal with low setting bcuz it not lag in that and in multiplayer it can run in highest setting.it support high setting on COD M battel Royal , but it lag in that 😓😓😓😓",
            "Best product in the market. If you have lower budget go for iPad mini. The performance is absolutely same just the screen size difference. Best for gaming and video editing.",
            "Brilliant one for students,just go for it without any doubt.🤩",
            "Nice",
            "Apple never disappoint you , If you looking for best gaming ipad in budget, then go for it , Pubg play very smooth in this ,, Flipkart packing is not good , I got with one side opened Flipkart seal pack ,I was worried but I got right product",
            "excellent and well suited for photo shopping and gaming",
            "product is good and genuine.\nvery satisfied",
            "Got defective product. Touch id not working. Loose power on off key.\nDisplay is good.\nNo way to return . Flipkart wont accept returns. Not all products are defective.Its just my bad luck.",
            "It's my first iPad .\nButtery smooth 😘😘\nReally worth it for money.",
            "Awesom Performance of A12 Bionic Chip. Worth to buy in 2020 too.",
            "Very delicate screen... Must use screen protector.",
            "Perfect for reading, content consumption. does the job. the new A12 chipset is amazing. go for it. value for money.\n\nBattery life is Amazing, but takes 3 hrs to completely charge.\nquality is outstanding.",
            "Completely satisfied. I used a 7 inch Android tablet previously. I would still use Android phones. But for tablets, I ain't going back. This, along with Apple Pencil, has boosted my productivity by leaps and bounds. And I am attempting to use it as a replacement for my PC as much as I can (even programming on server using SSH). Could've completely replaced my PC had compilers for programming languages been available.",
            "Quality product. totally reliable.",
            "Screen issue . Touch response is slow . Sometimes not taking . Apple has issue a free screen replacement program for Air 3. But then why get a faulty product by paying so much .\nRepenting the purchase .",
            "Many time Touch Not Work During the Charging.",
            "camera can be better\nface unlock option isn't there\nbutterly smooth touch and performance..",
            "Literally the best Ipad in this midrange ..great performance...great smoothness..gaming experiance was a delight..camera are average (though you cant expect that in a tablet)..sound is more or less good only...satisfied with the product.",
            "BEAST.. OVER POWERER TAB.. .. ANTUTU SCORE 389000. . PUBG RUNS SUPERB ON ULTRA HD EXTREME.BATTERY BACK UP IS JUST MIND BLOWING. . SPEAKERS R JUST SO SO LOUD. ITS MORE THAN OTHER TABS. CAMERA IS OK TYPE. .. OVERALL TRUE TRUE VALUE FOR MONEY AND YES BUY APPLE PENCIL ALSO FOR DRAWING PAINTING NOTES MAKING. FOR ME THIS IPAD ISy 10/10✌",
            "Value for money product, we paired it with apple pencil and it is now complete companion for our kids. Study, art and games",
            "It’s good",
            "Would have been better if it has longer battery",
            "A great buy. And good seller\n100% Genuine Product.\n😁😁",
            "Great product apple always nailed it...\nWon’t regret buying these\nPackaging was also good\nGreat product and seller 👍🏻👍🏻👍🏻",
            "Product looks refurbished and repacked as if it's new",
            "Worth it. Go for this instead of pro. It has better ROI",
            "All the specification are really appreciated, if you are planning to buy then go for it.\nthere are so many students who wants to buy Apple iPad pro, but this is really good with the same processor as pro,\n\ncamera quality : Good\ndisplay quality : Really good\nbattery backup : up to 6-7 hours in continuous use\nperformance : Best",
            "Really super,",
            "Absolutely Fantastic!!!",
            "Kya hi btau really very very good 😎👍👍👍 go for it",
            "Pros:\nExcellent battery backup, enough storage, good browsing experience, perfect processor for gaming and other multimedia tasks, lightweight (without cover).\nCons:\nBit costly, limited apps than android, poor camera that iPad Pro.\n\nFinal verdict: it I’d completely different from android and windows operating system so, if you’re android fan and have poor budget don’t buy it, as it have much paid application and numbers of apps which are not optimised for iPad (such as jio apps). Initially yo...\nREAD MORE",
            "Nice value for money ipad and also ipad os 13 addes 5 stars to the performance of the device.",
            "Okay so first thing first! Its still worth buying in Nov 2020 if you get it for lowest price possible.\n\nCant write whole review atm but soon...!",
            "such a good device for gaming(our fav. pubg?)",
            "Good Go For It",
            "Best for gaming and watching videos",
            "Just fabulous... Except Camera everything is good..",
            "Device dead after 1.5 years of usage, Apple store chares 37000 for repair.",
            "Good for note taking",
            "Excellent",
            "Good product",
            "Good Product...Love it",
            "Only problem is the 10w charger . Except that everything is awesome 😊",
            "Good and very nice all system",
            "Very good product and value for money, go for it",
            "Those who are willing to buy it for study purpose without hesitation go for it.only study purpose doesn't mean that it's not for gaming and media consumption, these things can also be easily done.further I will ensure you that camera is only for document scanning",
            "Awesome product. Apple nailed it Air model. Smooth performance. Rough usage. Finally value for money.",
            "Nice product",
            "Value For Money Product\n1.camera - never expect camera quality in ipad hope you never buy ipad for it 7/10\n2. Performance - 10/10\nUltimate performance\n3.experience - 10/10\n4.gaming and entertainment - 10/10\nPros\nOverall is a must buy products only if you can afford\nA12 powerful chip\n10.5 display quality very good\nGood for on-line classes\nCons\nCamera not upto mark\nPrice",
            "Nice product ...",
            "It's one of the more efficient and powerful device that i have ever used",
            "Great...... first apple product.",
            "Love it ❤️❤️",
            "Best Ipad at a good pricing",
            "Best value for money tablet.\nDoesn't even drops a frame.\nSo smooth. No lag. Go for it 👍",
            "it's a great experience but little bits disappointment with camera quality others are super",
            "Crazy performance. PUBG is one of the things that run really well. Others are video editing and photo editing apps which run super smooth. Display is very clear and is perfect for reading a lot.",
            "price is very costly",
            "camera quality is poor otherwise everything is best in this price.camera quality can be improved a lot.",
            "got this beast for 40k",
            "Beautiful piece",
            "it's amazing in this year sale don't think buy it pubg no lag charging also excellent it's comes a12chipset",
            "Amazing experience...camera could have been a bit better... battery performance is good.... great for day to day work and playing games.",
            "display is amazing\nworking very smoothly\nshould go for if you want apowerdevice with big screen",
            "Excellent product of this prise",
            "Awesome product",
            "awesome product.",
            "Superb device... Im a very happiy with product and delivery.",
            "Fantastic product overall! Just the one sided speakers is a big turn off.\n\nP.S.\nThe package was severely damaged, something that is not expected with Flipkart. Thankfully the product was not harmed.",
            "apart from the camera everthing is good. This ipad delivers all what you expect from apple. Nice product to consider if you are specifically looking for tablets",
            "Awesome product but camera is not good. Otherwise greatest product",
            "great delivery and good product",
            "5 stars for the product. even with so many background apps tab doesn't slow down and is superfast. display is excellent. camera is average",
            "Super cool",
            "Amazing product. Display, battery and performance is very good.",
            "Battery is the best thing in this Apple product... Moreover Retina display is awesome... Camera is worth of money not too good...",
            "Good",
            "it's very good",
            "Excellent Product , I bought this to solve air pollution in my area.",
            "Must buy product",
            "Ipad display stopped working on second day",
            "I bought my first ever apple product and not even a month, it has hanged up and got repaired and nw for service I need a invoice which I'm not getting from flipkart..frustrated",
            "Awesome product by Apple. I saved lots of money to buy this. It will never disappoint anyone. If you want to read with the help of this gadget. Then, go for it without thinking for a second. 👍👍👍",
            "iPad with an innovation",
            "Wonderful performance. You can go for it.",
            "It's working great.good product for the Appel lovers.",
            "Awesome performance",
            "I have used multiple tablets, still have two android ones except this.\nDisplay: above average, samsung is better\nPorts: only lightning\nAudio:\nheadphone - above average\nIpad - below average, torn sound in multiple YouTube videos just like the iphone XR\nBattery life: good\nFile system: still below average, far from android utility and ease\nLook: good\nWeight distribution and feeling: above average\nCamera: both average\nIcloud: fine, not like google drive and not even near to dropbox\nIcloud email: at learning stage compare to gmail\nApplication support: Great\n\nIf you are used to android tab, go with it. You will find ipad as a handicapped device for similar use. Just that you get many games designed especially for it. Entertainment purpose only device.",
            "after 2 weeks Divice screen was frezz and not responding",
            "I was super confused between ipad pro and air..however, I realised that Air (2019) gives me almost everything that I need for my purpose - that too at an affordable price...unless you are really hung up on true motion (which you can barely notice), usb c charging etc...go for ipad Air 2019 ...",
            "camera is blurry\ni got it after 10 days\nbut everything else is very good",
            "It was a horrible experience for me of buying this product from Flipkart actually what happened with me I m going to write I ordered this iPad on 22nd Dec and I had got the product on 19th jan and in the main time I had been given two promised delivery date but they was unable to deliver and I was toid the product was damaged on the way and it made me very tensed and made loads of suffer when refund also got late and now finally I have got the product and no doubt the product is very good and I m waiting for my defferenciate amount",
            "are these products original? they stopped working after 1 year",
            "Battery is very poor...have to recharge frequently",
            "Best purchase in best price love flipkart💞",
            "Excellent performance & great experience!!",
            "Awesome Original Apple product !!!! THANKEW FLIPKART. DEVICE IS AMAZINGLY SMOOTH AND BATTERY IS REALLY EXCELLENT SOO FAR.",
            "Got defective product. Screen had a tiny scratch which I didn't see within return period. Very disappointed with both Apple and Flipkart.",
            "Ok",
            "Nice Products 👌",
            "Excellent performance. Everything is nice.",
            "Nice",
            "My screen has developed a white dot after normal usage.",
            "Fantastic ipad..go for it",
            "Overall good",
            "nice love it 😊",
            "Good product",
            "So nice",
            "Product is excellent but the delivery repeatedly got delayed",
            "Best iPad with best value",
            "Worst product ever\nButton not working",
            "Simply superb",
            "Awesome ipad.For Medical, Engineering and Study.",
            "Best in class.",
            "I luv it... Everyone can buy this.... Value for money",
            "Very good product. My brother wanted a laptop but I bought him this ipad now he doesn't like it. And indirectly this ipad Became mine.",
            "A decent buy and as usual Apple is a highly priced product but quality explains it all. Was a bit worried buying Apple products online. But once u register you can find the warrenty details online. Flipkart purchase for Apple products is a clear thumbs up as the price is good during sale...",
            "Amazing product, no wonder you get hooked to apple once you start using it...",
            "Good product. Got it in 37k",
            "Well thought product with good combination of quality and performance but requires improvement in camera and connectivity department.",
            "Excellent... better than ipad 8th gen 128gb...got it for 36240..",
            "Amazing performance",
            "Adapter stopped working after 2 weeks, Flipkart is not much of useful in replacing the product or accessories .",
            "Let me not go into the details of the ipad air 3 because iPad is ipad and moreover there are enough informations and reviews on youtube and other websites. (Please do check for some of the comparison videos. It helps us decide on which model will serve our purpose better). In short, if you are planning on buying 8th gen, you can invest a little more and go for air 3 instead. This gives you a better display (Laminated display). But if you don't have a problem with the display, 8th gen and air 3 are almost identical.\n\nI was very sceptical of ordering it online (because I have even heard stories of people receiving soaps and others instead of what they ordered lol). But anyway, the packaging was real good and everything came intact as it was suppose to be. No bends, no cracks, or any scratches. I have checked the serial number to know if incase it is a refurbished one, but no it isn't. Can't review on the battery life because it has been only a week since I had it with me but so far so good.",
            "Awesome 🍎🍎🍎🍎🍎🍎🍎🍎🍎🍎",
            "Amazing product",
            "THANKS ALOT FLIPKART. Purchased it in 32K Rs. With axisbank credit card. Also delivery was lightening fast, roughly in 28 hours. Product is awesome in first look.",
            "Thank you flipkart for speedy delivery. I was skeptic about buying at first, but it was as easy with you. :)",
            "Beautiful device.... display amazing, smooth buttery performance , sound good...best for daily use..,",
            "Nice product by apple go for it",
            "I was very worried that my Apple iPad Air 3 wouldn’t be the original one but once I got it I checked it online on Apple.com and luckily it is an original iPad . I would like to thank the seller for sending an authentic one .",
            "Please don't buy this ipad air because after some days of use the screen stops working sometimes..... because there is no air gap ,so if we use continuous for 2 3 hours then pressure is formed in display makes unresponsive sometimes........ Other ipad except ipad air are good.....",
            "Got the defective product, sound is not coming properly, speaker has problem.very sad condition, if u see such a defective piece right after unboxing.",
            "Bought it at MRP 2 days before the sale. Besides the drop int he price, the ipad is flawless and wonderful piece of machine.",
            "Fine",
            "Awsome Product.....",
            "Amazing product.....buy",
            "Amazing Product ! Satisfied",
            "Initially loved it. Best with pencil.\nBut after using 9month i can say it hangs quite often n it has memory issue. It has screen recording issue like saya cant save -5826 error.",
            "Apple ! Very Good !",
            "I pad is very handy and easy to use .",
            "I am very happy with this product",
            "Product is good but wrong information in shifting..",
            "Nice it is a must have ipad product",
            "With regard to ipad every thing is good about it except camera. If you ignore the camera it's still worth in 2020.\nBut flipkart package is very poorly packed",
            "Great product value for money great performance ....flipkart has good service ..",
            "Very good product as expected from apple. Only negative is camera quality otherwise very nice product.",
            "Charger not working out of box.",
            "Ridiculously amazing!!",
            "Excellent Product. Buy it no Doubt. Happy Shopping 😀",
            "Awesome",
            "Must buy if your budget allows. :)",
            "You can definitely go for it.",
            "One of the best product introduce by apple best model of air series",
            "My first apple device, everything runs well and smooth, so far no issues but giving 3 star for WORST PAKAGING",
            "Fabulous",
            "Valuable product . If you need mid range ipad I prefer go for it.",
            "This is it. Best of best.",
            "Loved it...",
            "What a brilliant piece.ty true retail for authentic product.",
            "In few day I became an Apple fan by using this. Planning to change my ecosystem to apple. Although Apple pencil is a miss here but no issue.",
            "I had a unit with a defective screen and an unusually quick draining battery.",
            "If you are a PUBG player than go for it bro no other android tab or phone can beat the level",
            "It's an awesome product,\nGo for it without hesitation, gamming performance is pro level,camera performance 3*/5*,",
            "A best gaming device 😎😎😎",
            "Very nice product",
            "Awesome product, If you are looking for a pubg gaming device then believe me this one is beast. Don't think before buying just go for it..??",
            "very helpful for study purpose. I am satisfied with battery backup although it takes 5-6 for 100% charge. Charging is slow.",
            "Superb,express delivery,original product",
            "superb",
            "Best product",
            "If you are planning for tablet... This is the best option.",
            "It's Awesome!",
            "this is an exceptional product for its value ....",
            "Two words - \"Beast Incarnate\"",
            "No doubt this is the best for study purpose and entertainment",
            "good ipad",
            "It's a good product for productivity and creativity. It does all the jobs in day to day life. It is also great for gaming, inclusive of free video editor. But for coding you would need to use cloud computing. And keep in mind, it'll do everything you want, just be productive!✌🏻",
            "This table is worth buying, you will never regret your decision",
            "wonderful product",
            "Good Quality.",
            "This iPad Air 2019 is Value for money",
            "it's a great upgrade to the ipad but lacks some stuff when compared to pro. two things being the screen and usb c",
            "Best product for a optimal usage",
            "only one speaker works at a time..",
            "awesome",
            "good one I like it.\nVery good performance\nGood battery life\nGood IPS Display\nAverage camera",
            "cent percent satisfied",
            "Awesome quality...better than pro",
            "not working within a month",
            "Not bad, but not worth the money.",
            "good Apple product in affordable price.",
            "This one is a beauty. Go for this colour.",
            "My 10 days new i pad the camera is not upto the mark i can say its worse bcz of the shedded pics from it nd a doubt that wether i got a new one or a used one. Frm flipkart.think before u take",
            "love it",
            "very good product",
            "Just awesome u can play pubg like pro and it is vser usefull for study also. First time iam using ios iam dissapointed for one thing i.e it doesn't show how much downloading in appstore like android (percentage) and also copy or moving files",
            "ipad for most of us",
            "Nice Product. Got it during sale, Value for money",
            "The product is awesome, Seriously it's like air.\nthe product is way better than the review I write 😁.\nYou Know , it's 🍎. Never compromise",
            "10.5\" is better specially if you are taking it for reading purpose..",
            "best ..... value for money if get it in discounts",
            "worth for the mid range flagship in I pad segment",
            "best iPad for student.",
            "the package which I received had no seal. but the product was good. also the outer box of ipad was damaged in all corners. But the product is at good condition.",
            "Make your mind and buy it. Compared to 6th generation 2018 , it is far more superior .",
            "I’m loving it ❤️",
            "awesome product",
            "Super awesome product ✅",
            "I buy it for 36k..worth and value for money..",
            "No words to say.. just love it❤️❤️",
            "I m fully satisfied with this products.....",
            "Simply Awesome!!!!",
            "awesome",
            "good product",
            "Good",
            "First Apple product. Best one yet.",
            "Great product to have. Amazing performance and completes all of your entertainment needs!"
        ],
        "likes": [
            "180",
            "265",
            "344",
            "383",
            "44",
            "54",
            "39",
            "35",
            "26",
            "8",
            "180",
            "265",
            "344",
            "383",
            "44",
            "54",
            "39",
            "35",
            "26",
            "8",
            "11",
            "14",
            "7",
            "7",
            "17",
            "6",
            "7",
            "7",
            "4",
            "4",
            "8",
            "6",
            "12",
            "7",
            "3",
            "2",
            "3",
            "2",
            "3",
            "0",
            "1",
            "1",
            "3",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "48",
            "15",
            "45",
            "185",
            "75",
            "131",
            "115",
            "53",
            "161",
            "16",
            "6",
            "5",
            "22",
            "4",
            "10",
            "16",
            "15",
            "7",
            "7",
            "4",
            "3",
            "4",
            "3",
            "4",
            "12",
            "6",
            "3",
            "3",
            "3",
            "9",
            "3",
            "4",
            "4",
            "3",
            "5",
            "7",
            "1",
            "1",
            "1",
            "2",
            "2",
            "2",
            "2",
            "1",
            "2",
            "2",
            "3",
            "5",
            "3",
            "1",
            "3",
            "2",
            "2",
            "2",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "5",
            "3",
            "3",
            "2",
            "40",
            "3",
            "1",
            "1",
            "0",
            "3",
            "2",
            "1",
            "6",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "17",
            "50",
            "71",
            "81",
            "12",
            "35",
            "18",
            "10",
            "3",
            "0",
            "17",
            "50",
            "71",
            "81",
            "12",
            "35",
            "18",
            "10",
            "3",
            "0",
            "0",
            "2",
            "0",
            "0",
            "3",
            "0",
            "1",
            "1",
            "0",
            "0",
            "2",
            "1",
            "5",
            "2",
            "0",
            "0",
            "0",
            "2",
            "2",
            "0",
            "0",
            "0",
            "4",
            "4",
            "1",
            "2",
            "2",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "5",
            "34",
            "12",
            "24",
            "27",
            "10",
            "47",
            "3",
            "0",
            "0",
            "6",
            "0",
            "2",
            "5",
            "5",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "2",
            "0",
            "0",
            "0",
            "5",
            "1",
            "0",
            "0",
            "1",
            "2",
            "5",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "5",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "7",
            "3",
            "4",
            "2",
            "179",
            "6",
            "1",
            "1",
            "1",
            "10",
            "7",
            "2",
            "54",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:WHAT HEADPHONES DO I NEED TO BUY FOR THIS IPAD??",
            "Q:is this a latest ipad air 2019",
            "Q:What is ram of this air",
            "Q:Does Ipad Air support smart keyboard?",
            "Q:Can I play fortnite",
            "Q:How much battery mah?",
            "Q:Which version is this air 2 or air 3",
            "Q:ipad wifi version have gps",
            "Q:is this compatible with ipencil?",
            "Q:can we play gta v on it",
            "Q:will i get the same colour which i would order?",
            "Q:can i play pubg without frame drop and which ipad is best for gaming ipad air or ipad mini and this device best for gaming stream",
            "Q:Can I play pubg without any lag in smoothe",
            "Q:i play pubg",
            "Q:Is the screen Scratch resistant????",
            "Q:will 64GB be enough for study purpose in long term use if I don't do any gaming or photo/video editing?",
            "Q:Will this I pad have apple pencil or will have to buy individually?",
            "Q:galaxy tab s6 or the ipad air 2019( mostly what confuses me is the dual camera setup in tab s6, spen included in box itself, quad speakers, super amoled display) how's experience with ipad air 2019.",
            "Q:can i use Microsoft word in pad for college assignment?",
            "Q:doed this ipad air have editing software",
            "Q:can I play pubg battleground in this",
            "Q:Is this iPad the best for videos editing?",
            "Q:How is its sound quality in headphone?Is it same as iphones?",
            "Q:telegram app works on it??",
            "Q:what accessories do I get with iPad?",
            "Q:is this the latest ipad air 3(2019)?",
            "Q:Which is best ipad pro 2020 or Ipad air",
            "Q:what is the sound quality of it",
            "Q:The charging adaptor provided in the box is of how many watts?",
            "Q:what is Ram of this product ?",
            "Q:which processor it has?",
            "Q:can i use pendrive on it like ipad 7 th generation?",
            "Q:does it support fast charge? if it does Apple give u one?",
            "Q:battery how much?",
            "Q:Does it come with latest ipad os 13???",
            "Q:can i play pubg m in highest posible setting..",
            "Q:Can i connect this device to Android hotspot????",
            "Q:dose this support pubg",
            "Q:can i use 18 watt mobile charger to charge it ?",
            "Q:Can i insert 4G sim on it",
            "Q:Is this the latest 2019 iPad air?",
            "Q:Does Apps like Netflix, Prime, Hotstar, WhatsApp, Instagram are available for iPad Air??",
            "Q:Is it 3rd generation ?",
            "Q:can we insert a sim and use it for calling?as it us wifi+4g",
            "Q:what is refresh rate of the screen?",
            "Q:can we use Photoshop in it?",
            "Q:which headphones is best for this ipad",
            "Q:Is there blue light filter option?",
            "Q:this product support Apple pencil??",
            "Q:Is this product support OTG ?",
            "Q:does it support eSim",
            "Q:Does it supports java and c++",
            "Q:whatsup can be used or not",
            "Q:Can we play pubg mobile in HDR graphics??",
            "Q:can we enter sim card",
            "Q:It can support Google classroom and Google meet for online classes?",
            "Q:I purchased the iPad but I'm unable to update it. It only search for the time remaining and get's failed. Does anyone know how can I update it?",
            "Q:It come with pencil",
            "Q:Can I writing on this",
            "Q:should it support ssd card can i transfer movies from my ipad to other laptops with the help of ssd card nd usb",
            "Q:Sim facilities is there in this",
            "Q:Which one to choose ipad air 3 or ipad 8th gen",
            "Q:can we run c program",
            "Q:Do we get a free apple pencil with it",
            "Q:will i get ipad0s14 in this?",
            "Q:Can I access Google websites on ipad",
            "Q:Did this product support SD card or not",
            "Q:Does keyboard comes with touchpad?",
            "Q:Does this product have call facility/SIM support?",
            "Q:is the pencil including",
            "Q:very use only Wi-Fi or data also",
            "Q:Do we get a stylus free with this or we have to buy it separately?",
            "Q:Only bottom firing stereo speakers like older ipad air?",
            "Q:does it has laminated display??",
            "Q:which generation ipad it is",
            "Q:ipad air tablet comes with smart keyboard?",
            "Q:Does it support usb type c .",
            "Q:can i use ms word? and if yes do i need to pay for it?",
            "Q:does it support fast charging?",
            "Q:Does it comes with apple tv subscription",
            "Q:What is the available storage in 64gb variant out of the box ??",
            "Q:CAN SOMEONE TELL ME DO WE GET IPAD OS 12 OR OS 13 SOFTWARE???",
            "Q:Can i send text msg in the cellular version",
            "Q:is its memory expandable?",
            "Q:Does this comes with screen protector on?",
            "Q:can it be used for programming like c++ java etc?",
            "Q:does it has m s Excel",
            "Q:Does it supports external hard drive?",
            "Q:will I be able to connect my bluetooth headphones to this I PAD?",
            "Q:Has it Bluetooth and hotspot?",
            "Q:does it support 4g volte on wifi +4g varient?",
            "Q:Can we do phone calls",
            "Q:what's app will work without cellular mode ?",
            "Q:it says it's gold but in the featured photographs, all i can see is rose gold. what's up with that?",
            "Q:Is this have flashlight back side",
            "Q:does it have face id",
            "Q:Is this the Rose Gold color? The one mentioned on apple's website is a different shade of gold...",
            "Q:it can support Apple pencil",
            "Q:is this the new iPad air ? launched in 2019",
            "Q:can magnetic covers works with this ?.",
            "Q:could anybody say what is EXACT FREE STORAGE we get on new ipad air 64gb",
            "Q:Can we connect external Hard Disk ?",
            "Q:Can i play pubg in this with the High graphics nd enen high Fps",
            "Q:what are in box ?",
            "Q:can I put 1TB hard dicks on it?",
            "Q:what is different between ipad pro and ipad air???",
            "Q:Does apple earphones are available in the box?",
            "Q:which is better ipad mini 5 or ipad air ??(64gb)",
            "Q:what is its display refresh rate?",
            "Q:What is the weight of I Pad Air ?",
            "Q:How long does it take to fully charge this device with the charger provided on the box?",
            "Q:Does it has supported aim and memory card",
            "Q:what is size of RAM",
            "Q:Does it come with keyboard attached",
            "Q:Does WhatsApp run on the cellular version?",
            "Q:which one is better for gaming iPad(7thgen) or iPad air",
            "Q:in ipad fingerprint is there?",
            "Q:its comfortable for pubg i want buy",
            "Q:Does it heat too much while playing pubg?",
            "Q:can I play ping at HDR with extreme frame rate ?",
            "Q:can we put the sim?",
            "Q:can i use apple pencil",
            "Q:Does it work with Apple Pencil?",
            "Q:How is the camera of ipad air 2019?",
            "Q:Is ipad pencil present or not????",
            "Q:does it have 3.5mm headphone jack ??",
            "Q:Can we update iso 12 to 14 in this ipad?",
            "Q:Is it connects with android phone hotspot",
            "Q:can we use otg on it ? to use pen drive",
            "Q:does it heates quite while playing PUBG Mobile",
            "Q:Can we use marrow app in it?",
            "Q:i am looking to buy 64 gb .would that be enough?",
            "Q:can i used Microsoft office in it ,like Microsoft word, Excel, and PowerPoint",
            "Q:can i connect bluetooth mouse and keyboard?",
            "Q:in ipad air can we use pendrive????",
            "Q:which generation it is 1 2 3",
            "Q:is 3gb RAM enough for multitasking?",
            "Q:Can it stores large files",
            "Q:Can I use it as a PC?",
            "Q:which headphones i get after buying this",
            "Q:Please tell the problems faced in iPad Wi-Fi in Pubg game talking, Skype video calling, whatsapp calling, facebook and other apps related to internet calling facilities????",
            "Q:who is the seller? which is more authentic to buy online or offline?",
            "Q:OTG can used in it",
            "Q:can we use this ipad as pc",
            "Q:Can we do split screen??",
            "Q:Can I play free fire without lag ?",
            "Q:How many fps i will get in pubg",
            "Q:Can be use like laptop and for cording and i use for cyber security?",
            "Q:Does it made up of metal?",
            "Q:Which type of USB present?",
            "Q:Can 1st gen pencil be charged by \"magnet charging\" of ipad air, that is, attaching 1st gen pencil magnetically along the margin of this ipad air for charging ?",
            "Q:Is it brand new seal intact ??",
            "Q:My charger is heating up, is it the same case with everyone?",
            "Q:Which generation iPad is this ?????????",
            "Q:iPad 8 generation or ipad air",
            "Q:Ipencil comes with it in box",
            "Q:Can i download any pdf maker/scanner",
            "Q:Ipad mini 1 or Ipad air?",
            "Q:Does it support what's app",
            "Q:IPad with apple pencil in same package ?",
            "Q:Is it campatible to use pendrives?",
            "Q:Can we play free fire in it with high graphics and every thing downloaded",
            "Q:can we do coding(java,python,c++) on it??",
            "Q:Can we use it as laptop ? Can it be attached by a Keyboard ?",
            "Q:Is there the key board and pencil when we buy it..",
            "Q:what is display sisze of ipad air three",
            "Q:can we use Bluetooth headphones for ipad air",
            "Q:is this use full for neet students",
            "Q:is it a good chlice for drawing and digital painting? photosjop, illustrator will work smoothly? and is it better than 6th or 7th generation?",
            "Q:Does it come with pen and keyboard or do we have to buy it externally ?",
            "Q:is there 128gb rom?",
            "Q:does it include pen?",
            "Q:does it contain stylus pen with this?",
            "Q:Is this pad have gyroscope sensor",
            "Q:can i use sim card and memory card in this ipad ???",
            "Q:Does it have 120 hz refresh ra like ipad pro",
            "Q:google duo works on it",
            "Q:which is worth for a medical student 64gb or 256gb ipad air",
            "Q:it have tempered glass??",
            "Q:is apple pencil compatible with this device"
        ],
        "answers": [
            "A:Any pair of headphones with 3.5mm jack.",
            "A:Yes. I have bought the same.",
            "A:3 gb",
            "A:Yes and first gen apple pencil as well",
            "A:very smoothly 👍",
            "A:8134 mah....wow it's very huge",
            "A:Air 2019 is 3rd Gen",
            "A:yes",
            "A:1st generration apple pencil.",
            "A:No...GTA V is a PC game",
            "A:Yes",
            "A:yes",
            "A:This ipad process pubg very smoothly. And have very good graphics quality compare to another tablet",
            "A:yes",
            "A:Yes.It is",
            "A:It will suffice for pdf's(e-reading) but if you want extensive video tutorials(say 200-300 720p videos) u might want to upgrade. Although it can fit 100s of pdfs and videos.",
            "A:all apple accessories are sold separately ...so yes if you want to use the pencil you have to buy it separately.",
            "A:ipados13 is far better than any android version. it is very much user frndly, very smooth,no heating problem no hang over all very good experience.",
            "A:ofcourse, whole Microsoft apps, excel, power point, and many more evernote, it has ligit apps for taking notes, you will not regret after buying it.",
            "A:No",
            "A:oh hell yes",
            "A:Yes...download I movie for editing... don't forget to update software ios13",
            "A:Yes, sound quality of ipad air is awesome and best among all tablets",
            "A:yes it works absolutely fine. just need to enter an OTP and that's it",
            "A:Only charger and charging cable. Nothing like accessories.",
            "A:yes",
            "A:It depends on money and your usage. Like if U R a student ipad air would be sufficient if U R tight on budget, but if U have the bucks to spend then ipad pro is the best option...",
            "A:good",
            "A:It is a normal 10 watt charger",
            "A:it doesn't matter it runs like a charm",
            "A:it runs on the same processor which is in iPhone Xs,Xs max and Xr.A12 bionic chip",
            "A:Yes you can provided you use the lightning to USB adapter.",
            "A:no it takes hardly 2 hrs to charge",
            "A:battery is quite good. Its gives you around 12hrs standby time.",
            "A:No. You have to update it. Update is available as soon as you connect your device to internet",
            "A:Yes.actually am playing and not a single time it shows any kind of lag",
            "A:yes",
            "A:yes",
            "A:should work but it might deteriorate battery health in the long run.",
            "A:you need to get the LTE version for that and this is WiFi only verion",
            "A:yes",
            "A:yes",
            "A:Yes",
            "A:yes",
            "A:Nothing extraordinary. maybe normal 60Hz",
            "A:yes, A12 bionic chip is very powerful. you can run photoshop like a charm",
            "A:any headphone u can afford that is best,or u can go for sony ,senhiser",
            "A:Yes , by true tone blue light is filtered a bit . Beside that you can put warm tone colour to reduce blue color",
            "A:Yes, 1st Generation",
            "A:yes",
            "A:no",
            "A:no, it does not support java and c++",
            "A:it can be used",
            "A:yes",
            "A:No",
            "A:yes",
            "A:are you talking about the software update? cause that happens when you plug in. it shall provide the time for the update and at that time your iPad needs to be plugged in to the charger",
            "A:Nope",
            "A:depends on u if u want to write or not. buy apple pencil separately.",
            "A:yes, you can connect ssd with lightning adapter.",
            "A:No Sim facilities.",
            "A:ipad air 3 because of laminated display and bigger screen size, that's it.",
            "A:yes",
            "A:No",
            "A:Yes. I have got.",
            "A:yep you can, infact Safari browser default search engine itself is google and u can even install chrome if you want more access.",
            "A:no external card is supported",
            "A:No",
            "A:No, it supports�Wifi�only",
            "A:no",
            "A:Both",
            "A:Separately",
            "A:Yup! But don't worry...they're loud enough and the clarity is awesome!",
            "A:yes it is",
            "A:3rd i guess",
            "A:NO..YOU HAVE TO BUY IT SEPARATELY..!!",
            "A:No it doesn't",
            "A:Yes u can use it,,",
            "A:10W adapter come in the box, max limits is 12W charge",
            "A:no you have to purchase the subscription additionally",
            "A:about 50 Gb",
            "A:i have recently purchased ipad air, by default it comes with os 12, but after that you will get software update for os 13.",
            "A:No..you can't text or call. But you can use facetime and iMessage.",
            "A:No",
            "A:no. it does not have any screen protector",
            "A:This could not be used primarily for this purpose.",
            "A:yes",
            "A:No",
            "A:yes u can connect with it.",
            "A:Yes",
            "A:no wifi only",
            "A:No you can't.",
            "A:no...but u can use some apps like whatspad which uses whatsapp web version",
            "A:yes...it will say Gold... but u will get the rose gold colour",
            "A:no",
            "A:no",
            "A:no it's gold",
            "A:yes 1st gen only",
            "A:Yes",
            "A:yes.",
            "A:58gb",
            "A:Yes you can, but you must have the connector.",
            "A:Yes, you can play with high graphics. You will get 60fps(extreme frame rate) upto Basic settings. With HD and above, frame rate goes down but don't worry even with basic extreme, experience is amazing",
            "A:iPad ,charging cable and adapter , two apple stickers.",
            "A:Yes you can put Any hard disk to it.. but you need two things.. 1) Apple Lightning to USB3 Camera Adapter- which you cant find in India.2)You need to power the hard disk separately via usb hub",
            "A:price and if you use it for photo talking then pro otherwise editing apps are same",
            "A:no",
            "A:I PAD AIR",
            "A:60 hz",
            "A:462g",
            "A:0 to 100,at least 3 hours and then it easily stands the entire day.",
            "A:No . It has its own inbuild memory",
            "A:3 GB RAM",
            "A:Not at all",
            "A:no..it doesn't",
            "A:iPad air",
            "A:yes",
            "A:Yes , comfortable for pubg . Playing in phone and playing in iPad gives big differences.",
            "A:No",
            "A:You will get HDR but for frame rate go for ipad pro as it has better refresh rate",
            "A:no",
            "A:yes you can but only 1st Gen apple pencil",
            "A:Obviously",
            "A:good",
            "A:No",
            "A:Ya, It Has 3.5 mm Jack... You Can Use Any Headphones.",
            "A:Yes. I have updated it to 14.2 recently.",
            "A:yes",
            "A:yeah but you have to use the official Apple Lightning to USB adapter.",
            "A:yes",
            "A:Yes sure!",
            "A:for study purpose it would be useful , but for storage like movies songs etc you need more storage bcz mostly apps are occupying more of the space so it depends on ur need",
            "A:Yes absolutely, And Office 365 subscription is also available.",
            "A:yes ofcourse",
            "A:No you can not",
            "A:iPad air 3gen",
            "A:for iOS devices.....of course it is!! because ios ability to manage ram is very far better than Android devices",
            "A:Yes",
            "A:yes",
            "A:you will get nothing",
            "A:You cannot do whatsapp calling since whatsapp for iPad is not available. You will need to login into web version to access chat threads only. skype works perfectly fine.",
            "A:online fr flipkart and off line from Apple store are authentic. you can check the warranty of your device I'm settings .",
            "A:No",
            "A:It depends on what type of work you are doing on it. If normal microsoft office or documentation type of work you can use as pc. But it cant completely replace pc.",
            "A:yes",
            "A:Obviously",
            "A:60 FPS",
            "A:Yes",
            "A:yes",
            "A:It's Type A to lightning cabel.",
            "A:No, it's not magnetically chargeable. the charging Jack at the bottom of the iPad is where you connect the apple pencil.",
            "A:yes",
            "A:yeah. its the same.",
            "A:3rd generation",
            "A:Ipad Air",
            "A:no.you have to buy it separately.",
            "A:yes,you can download any which are available on apple app market. Also apple notes has the functionality.",
            "A:air",
            "A:This wifi version of iPad won't support.",
            "A:No. Apple pencil should be bought seperately if you want it. It doesn't come with the iPad package.",
            "A:no , not compitable",
            "A:yes",
            "A:yes",
            "A:If a laptop is just \"a screen with an attached keyboard\", then sure, this is a laptop. If not, you will have a hard time emulating anything that you do on a laptop. Yes, you can attach a keyboard.",
            "A:No",
            "A:10.5inch",
            "A:Yes,you can",
            "A:Obviously it is good for medical study...bt price is matter..",
            "A:yes it is better than 6th and 7th gen . works perfectly with everything . can go for it at any time .",
            "A:We have to buy it extra and it would cost you some good amount of your savings ....",
            "A:please check spec.",
            "A:No",
            "A:No",
            "A:Yes. It has a gyroscope sensor and it's very sensitive.",
            "A:No",
            "A:No, it's 60hz",
            "A:Yes",
            "A:256 GB",
            "A:no",
            "A:yes. generation one pencil is compatible"
        ],
        "likes": [
            "257",
            "240",
            "250",
            "16",
            "12",
            "15",
            "11",
            "5",
            "5",
            "17",
            "4",
            "11",
            "9",
            "9",
            "17",
            "4",
            "3",
            "39",
            "20",
            "11",
            "7",
            "4",
            "5",
            "5",
            "4",
            "5",
            "1",
            "3",
            "3",
            "5",
            "3",
            "3",
            "3",
            "3",
            "1",
            "5",
            "4",
            "4",
            "3",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "3",
            "3",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "36",
            "38",
            "60",
            "135",
            "9",
            "41",
            "7",
            "28",
            "3",
            "3",
            "3",
            "5",
            "9",
            "9",
            "6",
            "7",
            "2",
            "2",
            "1",
            "5",
            "3",
            "3",
            "3",
            "3",
            "2",
            "2",
            "2",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "1",
            "3",
            "3",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "73",
            "72",
            "81",
            "2",
            "1",
            "2",
            "1",
            "0",
            "0",
            "5",
            "0",
            "3",
            "2",
            "2",
            "8",
            "0",
            "2",
            "34",
            "13",
            "6",
            "3",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "0",
            "0",
            "4",
            "1",
            "2",
            "1",
            "1",
            "0",
            "3",
            "2",
            "2",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "4",
            "1",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "1",
            "3",
            "4",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "0",
            "7",
            "9",
            "22",
            "65",
            "1",
            "25",
            "2",
            "20",
            "2",
            "0",
            "0",
            "1",
            "4",
            "4",
            "3",
            "4",
            "0",
            "0",
            "1",
            "3",
            "1",
            "3",
            "2",
            "2",
            "1",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "0",
            "0",
            "5",
            "3",
            "2",
            "1",
            "2",
            "0",
            "1",
            "1",
            "5",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "summary": {
        "pros": {
            "Performance": "The A12 Bionic chip is powerful enough to handle all the demanding apps and gives a seamless experience.",
            "Battery": "The iPad Air comes with an impressive battery that gives an excellent life of around one and a half day even on heavy use.",
            "26.67-cm (10.5) display": "The 26.67-cm (10.5) display of this tablet is impressive and gives a pleasurable experience with stunning color reproduction.",
            "Sound quality": "The iPad Air features built in stereo speakers and give amazing sound quality."
        },
        "cons": {
            "Camera": "The 8MP rear camera and 7MP front camera are decent enough but not of awesome level as this is not the primary feature of this tablet."
        },
        "verdict": "The APPLE iPad Air is a perfect choice for students to effectively do their daily tasks like note taking, reading, sketching etc.",
        "Additional Information": "Supports magnetic covers, External hard disk support, 60hz refresh rate."
    }
}