{
    "title": "SAMSUNG The Frame 2020 Series 163 cm (65 inch) QLED Ultra HD (4K) Smart TV  (QA65LS03TAKXXL)",
    "product_specification": {
        "In The Box": "1N LED TV, 1N POWER CORD, 2N BATTERY-ALKALINE(AA Size), 1N REMOCON, 1N STAND-LEFT, 1N STAND-RIGHT, 1N OC",
        "Model Name": "QA65LS03TAKXXL",
        "Color": "Black",
        "Display Size": "163 cm (65 inch)",
        "Screen Type": "QLED",
        "HD Technology & Resolution": "Ultra HD (4K), 3840 x 2160",
        "Series": "The Frame 2020 Series",
        "Smart Tv": "Yes",
        "Motion Sensor": "Yes",
        "HDMI": "4 Side",
        "USB": "2 Side",
        "Built In Wi-Fi": "Yes",
        "Launch Year": "2020",
        "Wall Mount Included": "No",
        "LED Display Type": "Edge LED",
        "Refresh Rate": "120 Hz",
        "Number of Speakers": "2",
        "Speaker Output RMS": "40 W",
        "Other Audio Features": "Active Voice Amplifier, Adaptive Sound+, Dolby Digital Plus",
        "Ram Capacity": "2.5 GB",
        "Storage Memory": "8 GB",
        "Supported App - Netflix": "Yes",
        "Supported App - Youtube": "Yes",
        "Supported App - Disney+Hotstar": "Yes",
        "Supported App - Prime Video": "Yes",
        "Supported App - Others": "SonyLiv, Eros Now, Jio Cinema, Gaana, Youtube, Facebook, Spotify, India Today, Aaj Tak, Sun Next, Big Flix",
        "Operating System": "Tizen",
        "Screen Mirroring": "Yes",
        "Content Providers": "Netflix, Prime Video, Apple TV, Zee5, Hotstar",
        "Bluetooth": "Yes",
        "Touch Remote": "No",
        "Smart Remote": "Yes",
        "Other Remote Control Features": "One Remote Control for all functions",
        "Power Requirement": "AC 100 - 240 V, 50/60 Hz",
        "Power Consumption": "0.5 W (Standby)",
        "Other Convenience Features": "Brightness and motion sensor, One connect box, Filmmaker mode",
        "Width x Height x Depth (without stand)": "145.9 cm x 82.94 cm x 4.58 cm",
        "Width x Height x Depth (with stand)": "87.65 cm x 29.08 cm",
        "Warranty Summary": "1 Year Comprehensive Warranty on Product and 1 Year Additional warranty on Panel",
        "Covered in Warranty": "Defect Arising Out of Faulty, Defective Material or Workmanship are Covered in Warranty",
        "Not Covered in Warranty": "Warranty does not Cover Any External Accessories (Such as Battery, Cable, Carrying Bag), Damage Caused to the Product due to Improper Installation by Customer, Normal Wear and Tear to Magnetic Heads, Audio, Video, Laser Pick-ups and TV Picture Tubes, Panel, Damages Caused to the Product by Accident, Lightening, Ingress of Water, Fire, Dropping or Excessive Shock, Any Damage Caused due to Tampering of the Product by An Unauthorised Agent, Liability for Loss of Data, Recorded Images or Business Opportunity Loss",
        "Warranty Service Type": "Technician Visit",
        "Installation & Demo Details": "We'll facilitate the installation and demo through authorized service engineer at your convenience. The installation will be done within 48 hours of delivery of the TV. The service engineer will install your new TV, either on wall mount or on table top. Installation and demo are provided free of cost. The engineer will also help you understand your new TV's features. The process generally covers: Wall-mounted or table-top installation, as requested. Physical check of all ports, including power and USB ports. Accessories also checked. Demonstration of features and settings Quick run-through on how to operate the TV"
    },
    "product_description": {
        "QLED Technology": "This TV features Samsung Quantum Dot Technology to deliver an impressive full-color volume. Also, the Dual LED technology enhances the contrast according to the backlight temperature to deliver optimum color tone. As a result, you get to watch realistic shades with rich details and textures.",
        "Frame Design": "This Frame TV features a modern design with an elegant frame. It blends with your contemporary home decor seamlessly to offer an artistic appeal to your living room or bedroom.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "3",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "3",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "5",
            "3",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "1",
            "1",
            "4",
            "2",
            "5",
            "5"
        ],
        "review": [
            "Splendid product, nice installation system within few hours, vibrant colours filled with nature like pigments.\nThanks# Samsung India ,# Flipkart.",
            "Beautiful tv.... Amazing quality. This Qled 55 inch in this range is the best option for people who are wanting the latest qled and hdmi technology.\nGo for it.",
            "The Frame- as the name suggests is more for as a decor than being a TV. You can get a better configuration TV at a cheaper price but this one has an edge due to its aesthetics.\nIn standby mode the image gallery gives a look as if an art piece is hanging on a wall. The wallpaper can be put in a slideshow and it keeps on changing.\nOne Connect is another feature which makes this TV almost wire free. Due to its zero space stand the Frame almost attaches to the wall without any gap.",
            "Writing this after just 3 days of usage.\n\nThe Frame TV stays true to its title. The art mode really gives a feel of having a real high quality painting hanging on your wall\n\nPros\n- Picture Quality : The movies look amazing on the TV. The picture produced looks almost real .Even the quality with Tata sky is good\n-Sound: Better than what you would expect from a TV. Slight base too gives an additional zing.Although ,I have to keep the sound level above 60 mostly.The TV is not so loud even at full volume.\n- Art Mode : This is what you should buy the TV for. Don't forget to avail the 3 months free subscription\n- Remote : Minimal and feels premium to hold (Except the volume and channel button which are slightly flimsy)\n-Ambient Mode : Music visualizer is a cool feature\n- You can install the most popular apps\n- Tizen OS : Runs super fast and smooth on the tv\n\nCons\n- Universal remote is a little buggy with Tata Sky with back function not working and some more issues\n- Bixby is not the best voice assistant out there.Takes 2/3 narrations to do what i am asking it to do\n-Art mode doesn't have a slideshow mode (or I couldn't find it)\n-App store still is not as rich as android tv\n\nOther Observations\n- No indication on one connect box whether its on or off\n- The engineer is more scared than you to handle the one connect cable\n\nOverall , If you are looking for a new TV in this price range,This will give you the most differentiated experience\n\n& Impress your guests with the art mode\n\nWell done Samsung !",
            "Excellent TV for the price we opted for the 50\" as the viewing distance was comfortable for us,At first i thought the 50\" wont be as good as 55\" but to my surprise it is fantastic as the volume is sufficient for the room consideration 20w viewing angles are great using this TV for 1 month and can definitely say worth the buy rather than LG & Sony in this range as they won't offer Qled at this price & their Oled's are more than 1L,The 4k looks excellent with major OTT platforms (Netflix, Amazon prime,Hotstar) Ai upscaling is also great1080p is also great dosent look like a downgrade at all.Also the concept of no gap wall mount is awesome which generally no other companies offer whic looks cool as there is negligible gap between tv and wall which offer much cleaner looking Fame look to your TV.Just go for it you won't regret.👍",
            "This is the first high-value product I have brought online and this TV is amazing.\n\nPros:\n-Awesome Display\n-Awesome Flipkart and Samsung Installation service.\n-Amazing Audio Quality. Thank god it has a 40W speaker for 55inch. I would recommend going with 40W speaker TV.\n\nCons:\n-It's costly. as per the concept of FRAME TV, I don't think in India it will help unless you have a big wall with many frames and I don't think so anyone would keep the TV switch on while leaving home or sleeping for Art Display.\n-It's Frame TV without giving Frame and there is no way to find a Frame online in India, not on Flipkart or on Samsung site.\n\nIf you find similar tv with the same specifications at a lower price, it's worth thinking about.\n\nGiving 5 Stars rating for the Audio, Display quality, and Service of the Flipkart.",
            "I got this only for my PS5. QLED and 120Hz Refresh Rate were my major reasons to choose this TV and now super happy with my purchase. Crystal clear visuals and butter smooth gameplay. Also watching movies feel like being infront of a theatre because of its booming speakers. Trust me you wont require any external speakers for this TV. Blindly go for it. ❤",
            "Excellent buy, value for money. If you are looking for a tv in the 75-90k budget, then samsung frame is the best choice right now. The most value for money tv, no other brand comes close in this price sector. The frame concept is excellent but even without it, the TV stands high on its picture and performance. The Tizen os is a bit laggy but besides that this is the best tv to buy, the 55 inch version is most aggressively priced and should be the one to be bought. :)",
            "The frame experience hanging on the wall is great.\nGood quality material, high clarity picture display, ease of operation, good sound output, best part is just one single wire to the TV and there is no clutter of wires... Awesome",
            "Gift for my parents and Good product must buy. But in my area it is first TV no other have and installation person was also new for that. I don't know whether he installed properly or not. As TV say no gap wall mounting but gap is there. Samsung has to Verify the installation once. Request please forward to Samsung. Thank you.",
            "The watch is very good and the price is also good it is also beautiful to look i hope all people take this watch",
            "Watch was good ☺️\nHope it works good.",
            "Good watch thank you quality very happy very nice piece",
            "Very good and good quality",
            "watch is Amazing look classy & sporty\nthanks for right time delivery\nI m very this service",
            "simply smart value for money ....good quality😙😗",
            "I really like this , Very attractive and stylish watch in such a good price . Quality is also good .Worth it",
            "Very good product\nNice quality\nI am so happy",
            "Feel nice 😊😊 and wonderful watch . I am very happy to Flipkart . Nice design and good quality",
            "Low price is beautiful product",
            "highly recommended must buy product quality is very good stap quality is amazing stylish good for every day use",
            "Thanku flipkart.. awesome product ever😀",
            "Amazing product by Flipkart and value for money ❤️❤️ i love this product and if anyone wants to buy a watch on this budget I recommend you to buy this watch....\nRead full review",
            "Better than expectations 🙌",
            "I was not expecting such a good quality product at a very low price .\nBut wow the quality of the watch is too good . I am satisfied . I bought it for my you...\nRead full review",
            "so buty full nice product",
            "watch is much smaller than it appears here. the dial is very little but cute, the straps are thinner than they appear in image but overall it looks good whil...\nRead full review",
            "Its not wat it looks like in the picture...its silver dial and looks tiny as if its of 3yrs old child watch",
            "Before telling about the product, the delivery is quite great. I got it on the exact day it was about to came, I mean no delay or something.\nAbout the produ...\nRead full review",
            "Really ...nice I like this very muchh",
            "It has a very sleek design with great quality. The dial is just perfect. Such an amazing product just loved it♥️",
            "Verily attractive just awesome",
            "I really loved it ..I didn't expect the product like this much cool 😎 valuable for money 💵 must buy it",
            "Looks very nice and cool. The issue was I ordered for the Beige Color but received Green one. This happened twice. But decided to keep one as it looks cool w...\nRead full review",
            "Value for money. Very nice . We like it",
            "Nice experience 🙂\nGood quality 👍",
            "Thank you so much to Flipkart, Ekart and delivery boy.. such a lovely watch..it's a father's Day gift my dad.. he liked it. timely delivery.. delivery boy de...\nRead full review",
            "Not good quality, giving very bad things, I'm not impressed, whithin few days it's not working...",
            "Nice awesome product worth for prize i love it",
            "Very good product",
            "VERY GOOD PRODUCT,NICE AND COMFORTABLE AND VERY CHEAP BUT IN LED WATCH TOO TOUGH TO SET DATE AND TIME.THANK YOU FLIPKART FOR THIS AWOSOME PRODUCT.",
            "Automatic light on this watch",
            "It has a very sleek design with great quality. The dial is just perfect. Such an amazing product just loved it♥️",
            "Verily attractive just awesome",
            "Value for money. Very nice . We like it",
            "Nice experience 🙂\nGood quality 👍",
            "So nice best of luck with the wedding and I hope you are having a great week too 4 ⚃ I hope you are having a great time ⌚",
            "My Lover so Happy🥰 i love it flip cart",
            "I have ordered 2 pieces but one piece is not working properly I m not satisfied with product. Its not that good",
            "Nice one I gifted it to my little brother. He liked it. He was so happy",
            "Thank you so much to Flipkart, Ekart and delivery boy.. such a lovely watch..it's a father's Day gift my dad.. he liked it. timely delivery.. delivery boy de...\nRead full review",
            "Not good quality, giving very bad things, I'm not impressed, whithin few days it's not working...",
            "Nice awesome product worth for prize i love it",
            "Very good product",
            "Good watch go for it👌👌👌👌👌👌👌😍😍😍😍😍😍😍😍",
            "Good watch go for it👌👌👌👌👌👌👌😍😍😍😍😍😍😍😍",
            "Allen Solly wrist watches are made by Timex. So don't hesitate while buying this watch.\nI'll update my review after 1 year usage.",
            "It's really good product",
            "The watch looks as given in the image\nI jst loved it and thanx to flipcart for this awesome watch got the watch box in very good condition.\nthe leather of b...\nRead full review",
            "My dear loved it Iam so happy 🥰🥰",
            "Awesome",
            "Awesome",
            "looking so nice and quality is a one",
            "Super product but the issue is with dail is very big to my mom hand",
            "Looking vry nice 😍 this watch is outstanding performance..... I like it 👍Flipcart is gud work ever .",
            "Awesome watch. Looks stylish. Thank you Flipkart.",
            "Excellent design. Good quality product.",
            "It is a good product but the colour gose",
            "Watch bhut badhiya h...look same as given in product photo..\nBest gift for your mother, sister, wife or girlfriend 👍\nWorking nice and colour is beautiful be...\nRead full review",
            "Worst experience Maxima...damaged product recieved.. watch didn't runs a single day..",
            "Although delivery was too late but i got so beautiful watch along with good quality...I gifted it to my sister in law..she really liked it very match...th...\nRead full review",
            "I gifted my Maa a lot she liked it.thank you flipkart👌☺️🤩🥰❤️",
            "it's a very good and suitable watch",
            "Watch is nice but glass is broken",
            "Waste money don't buy this product",
            "This was a very good product for child and it's magnet belt is also very good of watch 👌👌\n\nThanks 👍😍",
            "everything is super👌🏻👌🏻👌🏻 packing box not well",
            "Nice looking 👌 👍 💯 💖💖",
            "The watch is attractive nd classy... really a best product.. I just luv ❤😘the soooooo much....... it is looking soo attractive... thank you flip kart for th...\nRead full review",
            "Must buy. Value for money 👌👌👌👌",
            "I love it very much its design is really amazing 😍 PLZZ guys do buy it why r u waiting for? It's packaging also good\nThank you Flipkart 💙",
            "Nice watch this price range",
            "Nice not bad but i expect for better quality but still nice product",
            "Watcg quality looking nice in Flipkart but I received this item TOTTLY useless don't buy this item TOTTLY west Money 😦",
            "Such a beautiful watch i like it❣️",
            "Wow it's everything is awesome product , service\nAnd I am very happy for this watch . Its so beautiful.\nMust buy this watch it's very good product..\nThank ...\nRead full review",
            "such a nice product.......\nquality is very good ......",
            "This product is very nice\nI like it very much\nI always like your all products\nI like all your apps😘❤️❤️",
            "nice packing. smooth finishing. nice color. stylish. feeling comfortable in wrist. good looking... worth it.... love it..",
            "Looks Good and Feels Comfort....",
            "Awesome. no words to explain I got this for my boyfriend on our anniversary. nd he loved it like anything. thank you!",
            "Watch is good but more good options are available in this price .",
            "After one month of use I can confidently say that this product is worth buying😘. It suits whether you wear on western or traditional. It looks really good a...\nRead full review",
            "Excellent product",
            "Very bat watch digital digital is not work to waste",
            "Very bat watch digital digital is not work to waste",
            "It looks decent. The first time I wore it it didnt felt that comfy bcz the edges were pretty sharp ( ofc not like a knife!) But eventually I got used to it. ...\nRead full review",
            "Watch quality is good. Bt it is not running. It's dead. I am disappointed ☹️",
            "It's one of those masterpieces which you won't want to get off your wrist.\nThe watch is a little bit heavier as compared to the ones available from other bra...\nRead full review",
            "The best watch to wear and it’s classy. Compare the price while you buy."
        ],
        "likes": [
            "129",
            "238",
            "461",
            "403",
            "223",
            "145",
            "78",
            "38",
            "23",
            "51"
        ],
        "dislikes": [
            "13",
            "36",
            "130",
            "115",
            "69",
            "48",
            "25",
            "16",
            "4",
            "16"
        ]
    },
    "qna": {
        "questions": [
            "Q:Can we connect pan drive .",
            "Q:will ps5 be able to run on this tv?",
            "Q:Does it run 120hz on 4k? or only on 1440p?",
            "Q:what is peak brightness?",
            "Q:Does this TV work with Google assistant?",
            "Q:Does this model have 60 refresh rate ? 2019 model had 120 refresh rate.",
            "Q:can this be used with a stand on a table..or is it wall mount only?",
            "Q:Is this the 2020 edition?",
            "Q:So how's the gaming experience om this. Since it supports 4k at 120hz.? Both pc and console.",
            "Q:Do they give stand and wall mount in the package ?",
            "Q:How to get customised Frame",
            "Q:Does the TV has 'IPS' or 'TN' or 'VA' panel ?",
            "Q:Can we use this tv as a monitor?",
            "Q:Does it has chromecast built in",
            "Q:Does this tv support 5ghz wifi?",
            "Q:wall mount available for this TV ?",
            "Q:Can we use as art pictures our own pictures without talking art memberships subscriptions",
            "Q:Can I use Airtel Xstream in this TV??",
            "Q:Can we extend the length of wall mount stand or we have to buy seperately ?",
            "Q:Why is this TV so thick compared to competitors?",
            "Q:How many hdmi 2.1 port does it have?",
            "Q:How many nits used in this tv",
            "Q:on tv they mentioned 55inch(138cm) but in details specification its width is only (128cm) how to know right size",
            "Q:can i play pubg",
            "Q:can we connect wi-fi enabled speakers to it? or speakers via bluetooth? if speakers are connected via bluetooth, can it still accept bluetooth connection via keyboards and mouse, simultaneously?",
            "Q:does it comes with studio stand",
            "Q:is this product is qled or just 4k ultra hd?",
            "Q:Can I use 2 TB external hard disk?",
            "Q:Does it have Dolby Atmos and dts-X, hdmi eArc? ?",
            "Q:Can we connect Apple TV device to this TV through HDMI port? Will that work?",
            "Q:For 3 months art gallery us free ? Then how much it cost for 1 year subscription ?",
            "Q:Does Youtube cast works?",
            "Q:Does it have personal computer mode and home cloud mode like the serif or samsung tu8570 etc",
            "Q:how are the viewing angles? is the clarity same for the person viewing the screen at 50 degrees? Please reply.. Thanks in advance",
            "Q:does it have hdmi 2.1",
            "Q:Wall mount available inside the box?",
            "Q:App Store or Play store is available or not as i can see in the features it is not showing up",
            "Q:this 55inc TV support browsing website? gio fibre?",
            "Q:Is the screen reflects when outside or room lights comes to the tv ?",
            "Q:can i install airtel app and airtel xstream app in tizen os..ia it avaiable ..plz say",
            "Q:Does they give frame along with TV.if they give which colour.",
            "Q:Does it have optical cable Output?",
            "Q:Has it Bluetooth remote or InfraRed remote..?",
            "Q:Where can I buy white besel frame for this TV?",
            "Q:Does this TV support Dolby Atmos through HDMI arc",
            "Q:Weight of One Connect Box?",
            "Q:Does this TV has HDMI 2.1 ?",
            "Q:What is the length of the one connect cable?",
            "Q:difference between this model and QA55LS03RAKXXL",
            "Q:How to select Beige color Frame ? is it customizable or not",
            "Q:Does it works with Alexa. I've a Alexa Eco Dot.",
            "Q:What is the power consumption of tv not shone in spacificationc.",
            "Q:does it have 2.1 hdmi",
            "Q:which to buy sony 49x8000H or samsung frame",
            "Q:what is the brightness of the tv?",
            "Q:Where is the speaker located?",
            "Q:Difference between qled & oled",
            "Q:Does it have Bluetooth connectivity?",
            "Q:Is frame provided with the box or we have to buy it separately??",
            "Q:What is percentage GST in this product .",
            "Q:Does it have HDR?",
            "Q:Can we installed apps.",
            "Q:What is the height of the One connect box?",
            "Q:can we keep our own pictures as frame?",
            "Q:I had purchased samsung the frame 138 cms tv .I found that there was some gap between the lower side of the screen and the bezel. Is this thing normal or defect in the TV?",
            "Q:What is the dimension of one connect box (2020 Model)",
            "Q:Why is the connectivity rating so low for a premium TV is there a issue with the TV signal strength?",
            "Q:Screen mirroring option",
            "Q:Can you tell me the dimension from end of the TV to the stand that rests on a table on both sides.",
            "Q:As Samsung doesnt support Dolby Vision, How good is the Dolby Vision content on this TV ? Netflix has many Such content. How good do they look ?",
            "Q:Is stand Available for this tv? As I can't mount on wall in rented house.",
            "Q:Can we turn off adaptive brightnes ?",
            "Q:Can I connect Sonos arc sound bar to hdmi earc to get Dolby atmos sound to this Tv ?",
            "Q:Is the wall mount is movable. If movable, at what angle we can rotate?",
            "Q:How many refresh rate in 50 inches frame",
            "Q:iam having a sony htrt3 home theatre when connected via hdmi arc in frame tv eARC port audio is not continuous... optical audio is fine but audio through hdmi e ARC port is bad...",
            "Q:4k hdr videos are dark...can someone help how to make it brighter",
            "Q:Does this ship with oneconnect box,and no gap wall mount",
            "Q:Does it support jio tv app",
            "Q:Rca cable out have or not",
            "Q:What STIBLIZER i want to use in this tv",
            "Q:Can I use a pendrive to increase the internal memory and transfer some installed apps into it?",
            "Q:What is the life of this tv",
            "Q:Can I Download Games In It?",
            "Q:Is the set top box inside the television",
            "Q:Does 2019 55 inch model support HDMI 2.1?",
            "Q:Name the app which I can install from this TV",
            "Q:Will this tv be able to mount on a 1/2 inch plywood?",
            "Q:Is stabilizer required for the 55inch model?",
            "Q:My hall distance was 5feet can i buy 50inch it was good or not",
            "Q:Lgum7300 is better than this tv or not",
            "Q:Is it supports 5G",
            "Q:Which TV's picture quality is good Samsung The Frame 55 or Sony X9000H or Sony X9500G.",
            "Q:My set up box has audio vidoe cable output. How can i connect to Onebox. Whether connetor is included in the TV supply.",
            "Q:Is chrome avalable on tv",
            "Q:Is stabilizer needed",
            "Q:Stabilizer required or not this tv",
            "Q:Stabilizer required or not",
            "Q:Can i watch 4k movie which was 15 gb",
            "Q:Is HDMI 2.1 cable required to connect any DTH set top box? I have normal HDMI cable and the engineer came for installation asked to use 2.1 cable only.",
            "Q:Is it compatible with JIO network",
            "Q:When it is close to the wall when wall mounted does it has ventilation problem and thus tv gets damaged",
            "Q:How can I cast my mobile without lag??",
            "Q:Doest it supports hotstar",
            "Q:What is the difference between 50 inch and 55 inch other than size?",
            "Q:Does it support 5tb external hard drive",
            "Q:Is the5tb external hard drive supported?",
            "Q:What is the frame/bezel thickness in 65 inch TV ?",
            "Q:This tv support sony Blue Ray home theater",
            "Q:Do we need to use Stabilizer with this TV..!?!",
            "Q:What is the screen to body ratio",
            "Q:Qled tv weight",
            "Q:Does this tv support webcam?",
            "Q:What is Bluetooth version",
            "Q:Can I download MX player or alt balaji or other tv app",
            "Q:How thick is cable connector of one connect cable.",
            "Q:How to clean the screen",
            "Q:Does it has ambient mode(Setting which can set background wallpaper on the screen)?",
            "Q:Can an IR blaster cable be connected to one connet box with TataSky set top box?",
            "Q:Does it have Mirror Casting ?",
            "Q:Do we have to install the TV ourselves if we want to wall mount?",
            "Q:Which video formats it supports ? Like .mov,.mkv,.MP4,?",
            "Q:In stand by mode what is Power consumption?",
            "Q:Is it good for ps5 for gaming at 4k 120hz.?",
            "Q:Can I watch with tv in dark",
            "Q:Which gaming controller this TV supports to play Android TV games? I've this TV with Airtel Xstream Box so just wanted to check which gaming controller I can order.",
            "Q:Do u need to buy the frame magnetic fitting separatly?",
            "Q:Does 50 inch' model have hdmi 2.1?",
            "Q:Does the TV have a separate power cable or it powers through the one connect box",
            "Q:Does it support 3g dongle plug and play",
            "Q:Does the installation person use toggle bolts to wall mount the TV?",
            "Q:Can we set photos of our own as frames screen saver",
            "Q:Does it have personal computer mode and home cloud",
            "Q:Can this tv be tilted upward downward with no wall gap mount?",
            "Q:Does this tv has MEMC",
            "Q:play gta 5 in this tv",
            "Q:Art is shown after plug off or only when on standby mode?",
            "Q:Does the new 2020 model has the AV port ?",
            "Q:It has dled or eled?",
            "Q:What is the viewing angle of this TV?",
            "Q:What Hotkeys does it have on remote control of Tv?",
            "Q:what is the length of connecting cable?",
            "Q:Is this 2020 model????",
            "Q:what is the length of power cord?",
            "Q:can i install airtel xtreme app",
            "Q:How are the black levels of this Tv ?",
            "Q:How much is the RAM and storage on this tv?",
            "Q:Does this tv have usb 2.1?",
            "Q:Do we get samsung one connect box for 50\" frame tv?",
            "Q:Does this model has hdmi 2.1 , please answer.",
            "Q:Which android version ? Will android update available till 10/11 ?",
            "Q:supports hdr10 plus?",
            "Q:this tv works with anybrand mobile or only Samsung Mobile is compatible??",
            "Q:Google Play is there in tv",
            "Q:Is it being sold by Samsung authorised dealer?",
            "Q:How this frame tv is going to hang on wall without wall mount?",
            "Q:Is this the new model of year 2020 ?",
            "Q:Does it support 4k@120 hz?",
            "Q:Can it support hdmi 2.1 ?",
            "Q:can I run games at 4k 60fps or 120fps in this tv.",
            "Q:what is difference between new and old version of frame..?",
            "Q:How much watt is this tv ?",
            "Q:Does Samsung has anything link Playstore from where games can be downloaded?",
            "Q:What is the reponse time for gaming?",
            "Q:does it have HDR 10 or Dolby vision support",
            "Q:Does the 55 inch samsung frame tv have hdmi 2.1 version?",
            "Q:How many inch varient have 4k/120fps and hdmi 2.1",
            "Q:This tv remote universal remote",
            "Q:Can I still mount if there are switches on the wall?",
            "Q:can we connect ps5 at 4k120hz hdmi??",
            "Q:does it have hdmi port",
            "Q:will it support android apps?",
            "Q:Is this is an android smart tv??",
            "Q:How to get 4k 120 hz from ps4pro on it",
            "Q:Does it have Music Player mode like its in The Sherif ?",
            "Q:information about using the back button on universal remote",
            "Q:which panel it had.. EDGE LED or DIRECT LED",
            "Q:what is the dimensions of the connect box of frame tv (55inch)?",
            "Q:how is the picture quality in hd set gop box channel ?does it have upscaler?",
            "Q:Can we manually select images for the art mode Or Is it only pre installed images"
        ],
        "answers": [
            "A:You cannot connect a pan drive but you can connect a pendrive.",
            "A:Yes you can connect any Console to any tv with HDMI. Most TVs should have HDMI 2.0 now (which limits 4k to 60hz). Some TVs like this tv (55inch and above) and Sony X9000H have HDMI 2.1 (4k upto 120hz)",
            "A:It can run 120hz upto 4k (55 inch and larger variants). But for the tv to do so via HDMI you need a 2.1 source and use a 48 Gbps bandwidth cable that is connected to port 4 which is the only 2.1 port.",
            "A:HDR Real Scene Peak Brightness 524 cd/m² SDR Real Scene Peak Brightness 501 cd/m²",
            "A:Google Assistant is now available as an App after a software update. Now there are 3 voice assistants, Samsung Bixby, Google Assistant and Amazon Alexa",
            "A:55 inch and above have 120hz refresh rate.",
            "A:It can be used both ways. It come with table stands and Wall mount both",
            "A:yes",
            "A:Its awsome, I use it for my PS4 and experience is really awsome.",
            "A:yes",
            "A:not yet available in india",
            "A:Its a VA panel.",
            "A:Yes it can be used with HDMI cable or wifi screen cast.",
            "A:No but you can still cast screen",
            "A:yes",
            "A:Yes, top quality wall mount.",
            "A:Yes",
            "A:Yes, I am using Airtel XStream and the upscaling on SD content is decent.",
            "A:no you cannot extend the length of the wall mount. But the wall included is sufficient enough to cover up the general requirements",
            "A:Its to give the illusion of a picture frame",
            "A:Only one, The HDMI 4 Port has hdmi 2.1 facility👍",
            "A:550 nits",
            "A:55 inch or 138 cm is the size of the TV which is always measured in a diagonal. The width of the TV is the horizontal width which is around 120cms",
            "A:the tv comes with tizen os, i dont think we have pubg installer for tizen, how ever you can connect any android compatible sticks like fire sticks and can install pubg in it and then you can play.",
            "A:Yes, wifi speakers can be connected. Yes it accepts bluetooth connection from keyboard and mouse while being connected to a bluetooth speaker.",
            "A:It comes with a zero-gap wall mount and a table stand.",
            "A:Its Qled",
            "A:Yes",
            "A:Yes",
            "A:Yes. It has 4 HDMI ports. It also has the Apple TV application built into it. If you have a 4th gen or newer Apple TV, you can use the Samsung TV Remote to control it using HDMI CEC",
            "A:2990",
            "A:Yes, it has built in Chromecast. All apps that cast work",
            "A:yes it does",
            "A:Its good. The colours won't wash out at 50 degrees. It looks fine for someone who sits right next to it at an extreme angle as well.",
            "A:Yes",
            "A:Yes",
            "A:It has Samsung own Tizen OS store that have some basic apps you will need. It does not have all the apps that google play store have but enough to get most of Frame TV.",
            "A:Yes",
            "A:It does but when TV is switched off. TV panel is bright enough so you won't see it while watching TV",
            "A:nope",
            "A:It's black by default.",
            "A:Yes, but Dolby Atmos only works over e-ARC.",
            "A:infrared",
            "A:Frames are not yet available in India, you can order it on some international sites, but that would be too expensive.",
            "A:yes, its has earc hdmi port throught which it can support",
            "A:Around 500gm",
            "A:yes, one port",
            "A:5 meter",
            "A:updated one",
            "A:customized frames not available",
            "A:Yes, it have inbuilt alexa too",
            "A:145 w",
            "A:yes",
            "A:samsung frame",
            "A:Peek brightness is around 4000 nits",
            "A:bottom. Sound quality is awesome",
            "A:The OLED vs. QLED battle goes beyond Samsung and LG. TCL calls its best TVs \"QLED\" and other companies beyond LG sell OLED TVs, namely Sony and Vizio at the moment. And adding to the confusion, Samsun",
            "A:YES",
            "A:It comes with box, no need to buy separately",
            "A:28",
            "A:Yes, It has",
            "A:yes you can but only from its own appstore",
            "A:2.5inches length 13.5inches width 5.5inches",
            "A:Yes, you can use any picture as the image inside the frame",
            "A:there is no such gap seen in my tv",
            "A:around 10*4*4 inches. but heavy..",
            "A:I don't face any connection issue. It capture 5ghz bandwidth which am currently using in my broadband & router.",
            "A:Yes it has screen mirroring",
            "A:4 ft",
            "A:I think other hdr tech are equally good, dolby vision has dynamic range data across frames which is absent in hdr10+ , but all are able to show dark and ultra bright content in same scenes",
            "A:Table mount stand available with the package",
            "A:Yes, Just switch off intelligent mode from the settings.",
            "A:It supports sound bar with Dolby Atmos",
            "A:NO. The wall mount is not movable. They call it the Frame because it fits snugly into the wall like photo frame.",
            "A:60hz",
            "A:I'm using Sony HT-IV300 and connected to eARC. The performance of is great. May be HT-RT3 has to support eARC as it is the latest technology not all the Home Theaters supports!. So try in normal HDMI.",
            "A:you can change your screen mode to dynamic or standard for better hdr performance",
            "A:Yes",
            "A:No",
            "A:No RCA out. Only AV/Component in with RCA jack available",
            "A:No need for stabilizer",
            "A:no",
            "A:Should be long.. Just like any premium tv",
            "A:not likely.. it's store has very less software",
            "A:No",
            "A:Yes",
            "A:hotstar , Amazon prime , sony liv",
            "A:yes",
            "A:We are not using it, if you’re going to use stabilizer it would be added extra safety",
            "A:No, Go for 43 inches.",
            "A:No way",
            "A:5gh wifi? Yes",
            "A:The frame TV is unbeatable",
            "A:Its one box has audio video sockets..so should be plug and play",
            "A:No",
            "A:No",
            "A:No",
            "A:Depends on your electricity supply & fluctuations. overall very well balanced TV.",
            "A:You can’t store it on internal memory, you can watch with any external usb storage drive",
            "A:not required; you can connect DTH set top box with normal HDMI. 2.1 required for latest gaming consoles (PS5 & xbox).",
            "A:Yes",
            "A:No, this is not happened but it's not perfectly mounted with wall as a frame and having space between tv and wall with an angle.",
            "A:Yes. Lag is very minimal while playing games.",
            "A:Yes, it's also support Sony Liv, YouTube, Zee5, Prime Video etc.",
            "A:Refresh rate is main difference. 50\" native 60hz and 55/65 native 120hz Also, for 55/65 Game mode supports 4k@120hz (HDMI 4). In 50\" 1080@120hz is possible in a PC.",
            "A:Yes, it does",
            "A:I tested with 4tb hard drive..working with no issues, I believe 5tb works perfectly",
            "A:1.5 inch....good tv.....take it",
            "A:It should support all home theaters, I use a Bose and it works well",
            "A:no need to use stabilizer",
            "A:2:1",
            "A:It's very heavy. Around 24 kg",
            "A:No",
            "A:4 or above I guess",
            "A:No,it has tizen OS almost all ott platforms are there but MX player is not available, alt Balaji is there, you can use Tata sky binge plus, I'm also using tata sky for android experience it works fine",
            "A:3 mm. But the connectors are big",
            "A:can clean with any cloth",
            "A:No",
            "A:the remote of the tv is programmable and can be used with the tata sky box",
            "A:Yes",
            "A:No, flipkart/samsung provide free installations.",
            "A:all videos support",
            "A:Art Mode is around a half to a 3rd of what it takes when it's on. Complete standby would be much less",
            "A:Yes 120hz is achieved using HDMI 2.1 port. PS5 supports only HDMI 2.1 port to show its fluid 120hz and this TV has it.",
            "A:Yes you can",
            "A:I'm using xbox kinect, 120 refresh rate, works like a charm",
            "A:No. Everything comes along with the TV. Just order and relax. Samsung person will do all the fittings.",
            "A:no",
            "A:No separate cable it powers through one connect box.",
            "A:Yes",
            "A:They covers everything which is needed for the installation.",
            "A:yes",
            "A:It has a PC mode and you can even use DEX ( of you have a high end Samsung phone), remote PC and Microsoft office 360 using a login",
            "A:No you can not.",
            "A:no",
            "A:no",
            "A:Standby mode.. It's a black screen when unplugged",
            "A:You get a converter in the box for converted AV/RCA into a single cable which can be plugged in to the One connect box",
            "A:dled",
            "A:Tests claim 25 degree but this is not relevant ,if TV is installed in smaller room like 10x12.",
            "A:Netflix prime and Zee5",
            "A:Shashank its long around 2.5 meter and power cable around 1 mtr",
            "A:Yes",
            "A:Power cord is 1.5 meter.",
            "A:NO",
            "A:good",
            "A:2 gb ram and 8 gb internal storage",
            "A:Yes",
            "A:yes.",
            "A:Yes",
            "A:Its NOT an Android tV it runs on Samsung owned Tizen OS",
            "A:Yes",
            "A:Works with any Android or iOS device",
            "A:No it has Samsung owned play store",
            "A:Yes",
            "A:It has a wall mount, it's called no gap wall Mount.",
            "A:yes",
            "A:Yes, only one HDMI port supports 4k@120hz out of 4.",
            "A:Yes there is one Hdmi 2.1 port",
            "A:its native refresh rate is 120hz",
            "A:Software version. Display technology (dual LED tech in 2020 model) HDR performance is much better. Sound Quality has improved allot. Ambient mode added. HDMI 2.1 (4K@120HZ) SUPPORT.",
            "A:40 watt sound output.",
            "A:No ,only you can download from sumsung tizen os playstore when ch already in TV itself ..",
            "A:It can do 4k at 120 Hz  with a response time of 5.4 ms",
            "A:HDR10 and HDR 10+",
            "A:yes it has 1 port with HDMI 2.1",
            "A:55 inch variant",
            "A:Yes, It has a Universal Remote. If the devices are connected via HDMI, such as a set top box, even the set top box can be hidden since it controls the DTH box via the TV itself.",
            "A:switches cannot go behind the frame",
            "A:Yes",
            "A:yes 4 ports",
            "A:NO, Samsung has its own app store for this TV which includes most of Android apps like Hotstar Netflix Zee5 sonyliv YouTube Spotify. Etc",
            "A:No, it has Samsung owned Tizen OS but it's flawless and better than Android OS. You can Android OS in Cheap Chinese TV for very less cost. The Frame tV is elegant.",
            "A:you cannot. PS4 pro doesn't support 4k at 120hz. You need a ps5 for that. You would be lucky if you got 4k at 60hz on PS4 pro.",
            "A:Yes, named as Tune Station",
            "A:Works well and even works on a Tata Sky Set top box to return to the previously watched channel",
            "A:EDGE dual LED VA panel, black levels are really great.",
            "A:LENGTH: 12INCH BREADTH: 6 INCH HEIGHT: 2 INCH",
            "A:good",
            "A:no u cn add ur own gallery"
        ],
        "likes": [
            "80",
            "63",
            "36",
            "39",
            "40",
            "90",
            "17",
            "6",
            "13",
            "41",
            "60",
            "13",
            "4",
            "5",
            "4",
            "4",
            "5",
            "9",
            "3",
            "4",
            "4",
            "4",
            "6",
            "18",
            "11",
            "7",
            "9",
            "5",
            "7",
            "1",
            "3",
            "2",
            "2",
            "2",
            "3",
            "3",
            "3",
            "3",
            "5",
            "3",
            "1",
            "1",
            "0",
            "2",
            "2",
            "1",
            "2",
            "1",
            "1",
            "2",
            "1",
            "1",
            "2",
            "1",
            "5",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "44",
            "24",
            "6",
            "14",
            "15",
            "5",
            "5",
            "9",
            "13",
            "9",
            "5",
            "4",
            "9",
            "6",
            "6",
            "17",
            "46",
            "3",
            "4",
            "3",
            "6",
            "17",
            "5",
            "2"
        ],
        "dislikes": [
            "5",
            "5",
            "5",
            "8",
            "9",
            "32",
            "3",
            "0",
            "3",
            "20",
            "33",
            "3",
            "0",
            "0",
            "0",
            "1",
            "0",
            "3",
            "0",
            "0",
            "0",
            "1",
            "1",
            "12",
            "5",
            "2",
            "3",
            "1",
            "5",
            "1",
            "0",
            "1",
            "1",
            "0",
            "0",
            "2",
            "1",
            "3",
            "2",
            "1",
            "0",
            "0",
            "3",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "2",
            "4",
            "45",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "7",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "1",
            "0",
            "0",
            "0",
            "3",
            "1",
            "2",
            "11",
            "2",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "6",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "20",
            "6",
            "0",
            "2",
            "4",
            "1",
            "1",
            "1",
            "3",
            "2",
            "0",
            "1",
            "2",
            "1",
            "1",
            "8",
            "37",
            "0",
            "0",
            "0",
            "1",
            "10",
            "0",
            "0"
        ]
    }
}