{
    "title": "KODAK CA PRO 108 cm (43 inch) Ultra HD (4K) LED Smart Android TV with Dolby MS12 & Dolby Digital Plus  (43CAPRO5022)",
    "product_specification": {
        "In The Box": "1 TV Unit, Remote, Wall Mount, User Manual, 2 AAA Batteries",
        "Model Name": "43CAPRO5022",
        "Color": "Black with Alloy Stand",
        "Display Size": "108 cm (43 inch)",
        "Screen Type": "LED",
        "HD Technology & Resolution": "Ultra HD (4K), 3840 x 2160",
        "Series": "CA PRO",
        "Smart Tv": "Yes",
        "Motion Sensor": "Yes",
        "HDMI": "3 Side",
        "USB": "2 Side",
        "Wi-Fi Type": "2.4 GHz",
        "Built In Wi-Fi": "Yes",
        "Launch Year": "2021",
        "Wall Mount Included": "Yes",
        "Brightness": "450 nits",
        "Contrast Ratio": "5000:1 (Dynamic)",
        "Picture Engine": "HDR10+",
        "Picture in Picture (PIP)": "No",
        "Picture And Picture (PAP)": "No",
        "Digital TV Reception": "DVB-T2",
        "View Angle": "178 Degree",
        "Panel Type": "IPS+",
        "Digital Noise Filter": "Yes",
        "LED Display Type": "Direct LED",
        "Aspect Ratio": "16:9",
        "Refresh Rate": "60 Hz",
        "Supported Video Formats": "MP4, MPEG, MPG, MKV, AVI, FLV, ASF",
        "Other Video Features": "4K HDR 10, MEMC 60 Hz, 10 Bit Display, HLG, Cast, Stream 4K",
        "Number of Speakers": "2",
        "Speaker Type": "Box Speaker",
        "Sound Technology": "Dolby MS 12 and DTS Trusurround",
        "Surround Sound": "Yes",
        "Speaker Output RMS": "40 W",
        "Supported Audio Formats": "MP3, MPEG1/2/2.5, AAC, HEAAC, ASF, WMA",
        "Other Audio Features": "6 Sound Mode (Standard, Music, News, Movie, Game, User), Sound Output Device (TV Speaker, ARC, S/PDIF)",
        "Processor": "A53 x 4-1.5 GHz",
        "Ram Capacity": "2 GB",
        "Storage Memory": "8 GB",
        "Clocking Speed": "60 Hz",
        "Supported App - Netflix": "Yes",
        "Supported App - Youtube": "Yes",
        "Supported App - Disney+Hotstar": "Yes",
        "Supported App - Prime Video": "Yes",
        "Supported App - Others": "More Than 6000 Apps and Games like Netflix, Amazon Prime, Disney+Hotstar, Zee5, Sony Liv, EROS Now, MX Player, AirPlay",
        "Supported Mobile Operating System": "Android, iOS, Windows, Blackberry",
        "Operating System Present": "Yes",
        "Operating System": "Android",
        "Screen Mirroring": "Yes",
        "App Store Type": "Google",
        "Supported Devices for Casting": "Laptop, Mobile",
        "Bluetooth": "Yes",
        "Mobile High-Definition Link": "No",
        "Ethernet (RJ45)": "1",
        "Other Internet Features": "Android 10, Google Play Store with 6000+ Apps and Games, Chromecast Built-in, Google Assistant, LIVE TV Channels, 20+ Content Partners",
        "Component In (RGB Cable)": "1",
        "Headphone Jack": "Yes",
        "RF Connectivity Input": "Yes",
        "RF Connectivity Output": "Yes",
        "Other Connectivity Features": "Network PM44-11BP 100M Ethernet Support (10/100M, DHCP), Browser, Support HDMI-ARC",
        "Touch Remote": "No",
        "Smart Remote": "Yes",
        "RF Capable": "No",
        "Internet Access": "Yes",
        "LED Backlit Buttons": "Yes",
        "DVR Control": "No",
        "Battery Type": "2 AAA Batteries",
        "Remote Charger": "No",
        "Other Remote Control Features": "Google Assistant Enabled Remote, Hot Keys of Netflix, Prime Video, YouTube, Google Play, Sleek, Stylish and Smart Remote",
        "Power Requirement": "AC 100 - 240 V, 50/60 Hz",
        "Power Consumption": "0.5 W (Standby)",
        "Clock": "Yes",
        "Auto Power Off": "Yes",
        "Sleep Timer": "Yes",
        "On/Off Timer": "Yes",
        "Other Convenience Features": "More Than 6000 Plus Apps and Games, Airplay, Chromecast, Google Play Store with 500,000 Plus TV Shows and Games, Google Assistant, Unlimited Content",
        "Width x Height x Depth (without stand)": "970 mm x 550 mm x 100 mm",
        "Width x Height x Depth (with stand)": "970 mm x 620 mm x 230 mm",
        "Weight (with stand)": "6.5 kg",
        "Stand Type": "Tabletop",
        "Warranty Summary": "1 Year Warranty on Product and 6 Months on Accessories",
        "Covered in Warranty": "All Manufacturing Defects",
        "Not Covered in Warranty": "Warranty Does Not Cover Any External Accessories (Such as Battery, Cable, Carrying Bag), Damage Caused to the Product Due to Improper Installation by Customer, Normal Wear and Tear and Damages Caused to the Product by Accident, Lightening, Ingress of Water, Fire, Dropping or Excessive Shock, Any Damage Caused Due to Tampering of the Product by an Unauthorized Agent.",
        "Warranty Service Type": "Technician Visit",
        "Installation & Demo Details": "We'll facilitate the installation and demo through authorized service engineer at your convenience The installation will be done within 48 hours of delivery of the TV.The service engineer will install your new TV, either on wall mount or on table top. Installation and demo are provided free of cost.The engineer will also help you understand your new TV's features.The process generally covers:Wall-mounted or table-top installation, as requested.Physical check of all ports, including power and USB ports. Accessories also checked.Demonstration of features and settingsQuick run-through on how to operate the TV"
    },
    "product_description": {
        "User-friendly Interface": "Featuring Android 10.0’s intuitive interface, the Kodak CA PRO Series Smart Android TV provides a convenient smartphone-like user experience.",
        "4K UHD Resolution": "Thanks to its 4K UHD resolution, which renders images with improved depth, natural colours, and detailed textures, this TV ensures an enhanced viewing experience. Also, this TV supports various HDR formats, such as HDR10 and Hybrid log-gamma.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "1",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5"
        ],
        "review": [
            "I purchased Kodak CAPro 43 inch Android TV from Flipkart. After receiving the product i watched two 4k HDR movies and found the screen quality and Sound quality is excellent .The HDR brightness of 450Nits is absolutely awesome for watching horror movies. the product quality is excellent. Iam totally satisfied with the product. the only downside is the wall mount: The wall mount provided along with the TV is good but very thin metallic frame, but after installation i found that it is equally good for holding TV with wall. As of now no complains. I would strongly recommend it for buyer.",
            "I was quite hesitate while purchasing. However gave a it a shot and got this budget king TV.\nThe manufacture date is October 2021 , its a new tv on the market.\nThe TV was delivered 3 days. The picture and sound quality is great for this price. Soon as I turned on the tv I got a update which was nice to see. Android 10 is the version currently in this TV.\nThe wall mount provided looks small but does its job.\nGo for it 👍❤️🎉",
            "Good product by kodak.. Its value for money product.. if you can increase your budget then you should find dolby vision also which is not there in this tv.. but still picture quality is good enough..sound quality is also good 40W speakers does the job well. This product is better than vu and mi that are in major competition.. so its overall good enough these are all the pros still now i have not used kodak tv for enough time on base of 4 days usage i gave 4 stars after 1 month i will update my review..\nMajor pros:-\nPrice is good enough\n40W speakers in this price range\nPicture quality is good enough\nAndroid software good enough no lag at all\nStorage is not too much but you can add more storage by attaching pendrive or some external device\n\nCons:- (only used for 4-5 days yet) (after 1 month i will add more)\nDolby vision not there\nDolby atmos sound system also not at par\nBut sound quality is good enough\n\nConclusion:- in this price range this kodak tv is superb Go for it👍👍👍",
            "Kodak TV's best serve the purpose. I really love the quality of the product, sound, and the display. The delivery was prompt and even the installation service met the expectation. Very happy with the product...definitely value for money.",
            "Using since one month and just one word to say excellent. Picture quality is superb when the content is hd Or 4k.play store is there to install favourite apps and voice control remote is a bonus for kids to watch their things by just saying. Sound quality is good. My kids are now super happy, as well as us as the purpose of bringing this smart TV was to keep away the kids from mobile, as TV is less harmful for eyes in comparison of mobiles. Totally value for money. Go for it without any doubt.",
            "Very good tv of this price ... Super Clarity ... Design is very attractive... Internet access is very easy ... Android phone connection is very easy ... Iphone to tv connection little heavier....",
            "Fairly good tv for the price. Picture and sound quality are excellent. The remote works well and the software is smooth and lag free.",
            "I got the kodak tv installed. The ultra hd clarity is amazing with mind-blowing Dolby surround sound. It's an amazing buy worth money",
            "Very good product picture quality excellent digital surrounding sound is very good worth for money",
            "One of the best purchase in Big billion day sale, got this for 30750 for 50 inches tv which is an excellent deal..\n\nThe quality is superb, screen top class, sound top class, features are amazing with the price given on time delivery and installation.\n\nI have moved from 32 inch led to 50 inch Kodak Tv amd it has been an amazing experience till now.\n\nWill update after a momths usage aswell...",
            "Awesome Must buy, Sound and video clarity superb after 10 days observe and give the feedback, remote friendly use",
            "NICE PRODUCT IN THIS RANGE YOU CAN GO FOR IT.",
            "Hardware issues.. didn't meet expectations...",
            "Value for money 💰 product",
            "Budgeted TV. Don't purchase based on rating because company/seller is asking for 5 star rating by giving greed of 3 months extended warranty. So overall rating may not be accurate.",
            "Excellent TV at reasonable price.",
            "Good",
            "Overall product is good value for money",
            "Overall Good Tv.",
            "Product is not good sounds not good",
            "Good Product and value for money.",
            "This is not good product",
            "TV is very good.. you need watch hd or 4 k video to see the qwality. Tried with air plan but couldn't connect..I will check and update my review again.Need to check if remote app available.",
            "great quality at affordable price!",
            "Good",
            "very good picture quality",
            "Very nice tv.. picture quality is awesome 😎..",
            "a very nice product.",
            "Value for money. Very good installation service by Jeeves",
            "Excellent TV.",
            "Good and hassle free service",
            "Very good 4k tv",
            "Happy",
            "Nice picture quality\nSound is good",
            "For this price range, this TV is really good. The sound and picture quality is amazing. The 40 Watt speaker really do live up to their name.😄",
            "Excellent product. Clarity at its best. Smooth delivery . Hassle free installation.",
            "Good t.v excellent t.v best tv five star",
            "Best 4k tv in budget love it",
            "Overall a good product,",
            "Excellent picture quality & decent sound quality.",
            "Awesome product.\nValue for money.",
            "Nice one",
            "Excellent tv ..",
            "Very nice TV and good picture quality",
            "Overall good...",
            "Excellent work",
            "I have purchased this product on 17 April 2022\nPicture quality is too good",
            "Awesome Tv",
            "Good product",
            "As per product price its good.",
            "Actually the product is very good. The picture quality is good.",
            "Good product. Sound and picture clarity is good. Worthable product",
            "Product met the expectation and love the features...Delivery from Flipkart and installation service were good.. Thought bought with hesitation , completely satisfied now and enjoying the screen time",
            "Good",
            "Good",
            "Amazing product value for money 😅",
            "Good pic quality",
            "Picture and sound quality is very good. Good experience while watching 4k videos.",
            "Sounds is not good",
            "Futures more than good and quality Best👍",
            "Nice TV....very good product at the price point.",
            "Good product...value for money.",
            "Nice product definitely recommend to buy this tv great product in this price..",
            "Great product.",
            "Nice Tv for an affordable price with good quality picture and sound. Bazel less tv with good viewing angle. Delivered on time and Installation also very good with demonstration. Awesome 👏👏👏👏👏👏",
            "Nice buy at this price..",
            "Very happy to have it..Superb TV in this fantastic price..",
            "i,m using this tv from 1 month no issue till now. picture quality also very good & sound also good happy with kodak 4k tv",
            "Just go for it.",
            "Very nice I am very happy",
            "Nice TV by kodak with good picture quality and sound. Connectivity is very good. Good experience as of now.\nRecommended",
            "Loved this product.",
            "Very good products",
            "Best TV.",
            "Super",
            "Need to improve sound quality reast all features are goods.",
            "Awesome product value for money",
            "excellent performe voice and picture",
            "It's so good",
            "Value for money.",
            "Excellent product!",
            "Great product... Superb smart TV at this price.... I love this TV..... Thanks a lot kodak... Thanks flipkart...",
            "Excellent product",
            "Good 👍👍👍👍👍👍👍",
            "Good",
            "Very good purchase for its features",
            "Value for Money.. Quality and Original Products..",
            "Fantabulous,\nBudget friendly\nGo for it\nGood picture, Superb sound & connectivity also good.",
            "Good one for Budgeted TV",
            "Awesome purchase",
            "good one with nyc convectivity and sound",
            "Great",
            "Overall it meets the expectations!",
            "Very nice product.",
            "Very nice tv",
            "Good can go for it with out doubt",
            "In Flipkart specifications, it is provided that headphone jack as Yes, but after installation,on connecting aux cable it is not functioning. Therefore, can't connect earphones and speakers. Please confirm about this headphone connectivity. Bluetooth connectivity is good.",
            "Hope for long last without any issues.",
            "Awesome sound and picture, value for money deal. Satisfied with the product.",
            "Good product",
            "Excellent Product",
            "Good product",
            "gud product..go for it",
            "Good product... Picture and Sound quality is great...",
            "Its nice one",
            "Didn't realise that this relatively new TV is real value for money. Absolutely satisfactory experience. Love 😍 it.",
            "Velue for Money, Very very Wonderful Feeling",
            "Good quality",
            "Excluding product and excellent service from Jeeves.",
            "Nice than expected",
            "Nice",
            "Good quality products",
            "Awesome TV.",
            "Good tv in this range",
            "Best choice in mid range"
        ],
        "likes": [
            "68",
            "63",
            "4",
            "17",
            "2",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "7",
            "6",
            "5",
            "5",
            "5",
            "1",
            "4",
            "4",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "43",
            "22",
            "1",
            "16",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:What is the RAM & ROM available?",
            "Q:Do I need extra speakers to enjoy sound system?",
            "Q:Can I stream YouTube in 4k?",
            "Q:Can we watch YouTube in HDR ?",
            "Q:What is the referesh rate of TV Panel?",
            "Q:The TV can be use as a monitor ?",
            "Q:Can we connect it with setup box to watch channels",
            "Q:Can we adjust contrast brightness colour separately ?",
            "Q:Does it have 40W speaker?",
            "Q:Does this supporting wifi 5Ghz banding!?",
            "Q:Can i download apps jio tv app's this tv",
            "Q:Does this have Dolby Vision? And Dual band wifi? Also Which version of Android?",
            "Q:Can we play games",
            "Q:how to connect screen mirroring",
            "Q:What is the panel made of ?",
            "Q:This TV comes with DLED or ELED?",
            "Q:Can I download apps in this TV?",
            "Q:How to connect HDMI ARC to hometheatre.",
            "Q:From the 3 HDMI port which one supports the ARC port.",
            "Q:This TV's AV can connect DD free dish?",
            "Q:Can i extend its RAM and storage externally for gaming?",
            "Q:Is it in-built WiFi or we have to use our WiFi?",
            "Q:We can download extra apps like zoom cloud meeting or microsoft teams?",
            "Q:Does this TV comes with gaming controller?",
            "Q:Can we connect CPU?",
            "Q:Is there a lag on playing 4k content online",
            "Q:The PS4 wireless controller working?",
            "Q:TV requires voltage stabilizer?",
            "Q:Do we get Netflix, Amazon prime Video or Hotstar subcription with this TV?",
            "Q:Does this TV support 4K and HDR 10?",
            "Q:Is it lightweight ?",
            "Q:Is sound system provided by DOLBY?",
            "Q:Is this TV bezel less?",
            "Q:Does this TV have Rj45 connectivity option for LAN internet access?",
            "Q:is HDMI ARC availble?",
            "Q:Is it true we can't adjust display settings, like different modes(games,movies,etc) and contrast, brightness,etc independently?",
            "Q:Is it certified Android TV?",
            "Q:It connects directly with blutooth speaker.",
            "Q:Is chromecast built-in ?",
            "Q:Can we connect Google Home?",
            "Q:Can we get Android update?",
            "Q:Can we play 4k videos?",
            "Q:Can we Hear TV Audio and Video Thru Ear Buds?",
            "Q:Can we connect DVD player?",
            "Q:Does this TV has upscale like converting lower resolution like HD, Full HD video to 4K video?",
            "Q:Can we mount this in a small wall corner?",
            "Q:Does it support all android TV application?",
            "Q:Can we connect sony home theater through ARC ?",
            "Q:Can we do screen mirroring.?",
            "Q:Does Remote have Hotkeys?",
            "Q:Does it support MEMC?",
            "Q:Can we install Sony Liv app?",
            "Q:Can we install Hotstar?",
            "Q:Does this TV have DTS Trusurround?",
            "Q:Can I connect PS4 or any other gaming console?",
            "Q:Can we play Full HD content in this Ultra 4K TV?",
            "Q:Can I play Ludo King on TV?",
            "Q:We can play free fire on the TV?",
            "Q:Can I update my software?",
            "Q:Is it wall mount is available with box",
            "Q:Does the remote has built-in Bluetooth?",
            "Q:Does remote have voice search",
            "Q:Does this tv has in built dolbi vision & dolbi atoms",
            "Q:Does this support Jio TV app?",
            "Q:It's support 128 gb usb pendrive",
            "Q:Does this device extended warrenty.....",
            "Q:Is there inbuilt voltage stabilizer, is playing ps 4 safe with this tv.",
            "Q:Have remote voice search potion"
        ],
        "answers": [
            "A:2GB Ram and 8 GB ROM",
            "A:DTS Trussound and Digital Dolby",
            "A:Yes",
            "A:Yes.",
            "A:60 Hz",
            "A:Yes",
            "A:yes",
            "A:Yes",
            "A:yes, it has 40 w Speaker. Amazing Sound Quality.",
            "A:No. One of the main drawbacks of this TV.one it does not support 5Ghz band and its ROM is less(only 8 gb).",
            "A:Yes",
            "A:Single band wifi",
            "A:yes, its an excellent option",
            "A:Download google home in your smartphone and then connect your mobile hotspot to your thomson tv.then open Google home .you can notice there as other cast devices and your tv name.tap on that & connect",
            "A:IPS Panel",
            "A:DLED",
            "A:6000+ apps can be accessed on your TV.",
            "A:HDMI port is there on the TV Arc port not available on TV",
            "A:All the ports supports.",
            "A:Yes",
            "A:No",
            "A:Its in-built",
            "A:No",
            "A:No",
            "A:Only with HDMI port. No VGA port is available",
            "A:No",
            "A:Yes",
            "A:Can be used if power fluctuation is their in your area",
            "A:No, this TV doesn't provide any sort of paid subscription on any of the platform.",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:Yes, 4 Hotkeys (Netflix, YouTube, Amazon Prime Video, Google play store)",
            "A:Yes, lag free visuals with MEMC and 60 Hz display",
            "A:Yes, can be downloaded from play store",
            "A:Yes, can be downloaded from play store",
            "A:Yes with Dolby Digital Plus",
            "A:Yes",
            "A:Yes and 4k as well if internet speed is good",
            "A:Yes",
            "A:Yes, by sharing the phone screen on the TV.",
            "A:Yes, you will receive software updates",
            "A:Yes, technician will fix the wall mount during installation process.",
            "A:Yes, remote works on bluetooth",
            "A:yes",
            "A:no",
            "A:Yes",
            "A:yes HDD also support",
            "A:Yes you do get 3 months, the company will contact you",
            "A:Yes, You can connect with high end play station console and play.",
            "A:Yes"
        ],
        "likes": [
            "14",
            "7",
            "2",
            "1",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "2",
            "2",
            "0",
            "0",
            "0",
            "1"
        ],
        "dislikes": [
            "3",
            "3",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "2",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "1",
            "0"
        ]
    }
}