{
    "title": "realme SLED 139 cm (55 inch) Ultra HD (4K) LED Smart Android TV  (RMV2001 SLED TV 55)",
    "product_specification": {
        "In The Box": "1U Contains: LED TV 1N,Remote control 1N,Batteires 2N,Manual 1N,QSG 1N,Stands 2N,Stand Installation Instructions 1N",
        "Model Name": "RMV2001 SLED TV 55",
        "Display Size": "139 cm (55 inch)",
        "Screen Type": "LED",
        "HD Technology & Resolution": "Ultra HD (4K), 3840 x 2160",
        "Series": "SLED",
        "Smart Tv": "Yes",
        "Motion Sensor": "No",
        "HDMI": "3 Rear",
        "USB": "2 Side",
        "Wi-Fi Type": "2.4 GHz and 5 GHz",
        "Built In Wi-Fi": "Yes",
        "Launch Year": "2020",
        "Wall Mount Included": "No",
        "Brightness": "400 nits",
        "Contrast Ratio": "4000:1 (Static)",
        "Picture in Picture (PIP)": "No",
        "Picture And Picture (PAP)": "No",
        "Analog TV Reception": "Yes",
        "View Angle": "178 Degree",
        "Panel Type": "SLED LED",
        "LED Display Type": "Direct LED",
        "Aspect Ratio": "16:9",
        "Refresh Rate": "60 Hz",
        "Supported Video Formats": "MPG, MPEG, MPEG2 -PS, MP4, MKV, AVI, ASF, FLV",
        "Other Video Features": "HDR10+, HLG, HDR10",
        "Number of Speakers": "4",
        "Speaker Type": "Box",
        "Surround Sound": "Dolby Audio",
        "Speaker Output RMS": "24 W",
        "Supported Audio Formats": "MP3, ASF, Dolby",
        "Other Audio Features": "Dolby Audio",
        "Number of Cores": "4",
        "Processor": "1.2 GHz Quad-Core Mediatek CPU",
        "Graphic Processor": "Mali 470MP3 470 MHz",
        "Ram Capacity": "1.5 GB",
        "Storage Memory": "16 GB",
        "Clocking Speed": "1.2 GHz",
        "Supported App - Netflix": "Yes",
        "Supported App - Youtube": "Yes",
        "Supported App - Disney+Hotstar": "Yes",
        "Supported App - Prime Video": "Yes",
        "Supported Mobile Operating System": "Android, iOS",
        "Operating System Present": "Yes",
        "Operating System": "Android",
        "Screen Mirroring": "Yes",
        "App Store Type": "Google Play Store",
        "Pre Installed Browser": "Yes",
        "Content Languages": "English",
        "System Languages": "English",
        "Wireless LAN Adapter": "Yes",
        "Bluetooth": "Yes",
        "3G Dongle Plug and Play": "No",
        "NFC Support": "No",
        "Headphone Jack": "Yes",
        "Audio Out": "Yes",
        "RF Connectivity Input": "Yes",
        "Touch Remote": "Yes",
        "Smart Remote": "Yes",
        "Color Screen": "Yes",
        "RF Capable": "Yes",
        "IR Capable": "Yes",
        "Internet Access": "Yes",
        "Battery Type": "2 AAA Batteries",
        "Remote Charger": "No",
        "Power Requirement": "AC 100 - 240 V",
        "Power Consumption": "170 W, 0.5 W (Standby)",
        "Clock": "Yes",
        "Width x Height x Depth (without stand)": "1229.7 mm x 713.5 mm x 65.9 mm",
        "Weight (without stand)": "12.6 kg",
        "Width x Height x Depth (with stand)": "1299 mm x 770 mm x 223 mm",
        "Weight (with stand)": "12.8 kg",
        "Warranty Summary": "1 Year Domestic Warranty and 2 Years on Panel",
        "Covered in Warranty": "Warranty of the Product is Limited to Manufacturing Defects Only",
        "Not Covered in Warranty": "Warranty Does Not Cover Any External Accessories (Such as Battery, Cable, Carrying Bag), Damage Caused to the Product Due to Improper Installation by Customer, Normal Wear and Tear to Magnetic Heads, Audio, Video, Laser Pick-ups and TV Picture Tubes, Panel, Damages Caused to the Product by Accident, Lightening, Ingress of Water, Fire, Dropping or Excessive Shock, Any Damage Caused Due to Tampering of the Product by an Unauthorized Agent, Liability for Loss of Data, Recorded Images or Business Opportunity Loss.",
        "Warranty Service Type": "Technician Visit",
        "Installation & Demo Details": "1. Covered under Standard Installation - Table mounting using standard stand supplied as accessory with TV Extra charges are applicable for wall mounts as, Rs. 399 for 32\" display size and Rs. 499 for >32\" display size, except 55\" display size which is free of cost - Connecting with available power source (within 1 meter) - Connecting / Setting up various available input source for Audio Video based on model - Connecting with available wifi (for smart TV) - Checking TV for proper functioning - Demonstration of the TV and its features"
    },
    "product_description": {
        "SLED 4K Display": "Featuring the SLED technology, this TV has an ultra-wide colour gamut and an incredibly high NTSC colour space. All this only makes for a stunning picture quality that is loaded with vivid and life-like colours and fine detail.",
        "TUV Rheinland Low Blue Light": "This TV is also quite easy on your eyes as it has very low blue light emission. It’s TUV Rheinland Low Blue Light certified, so you know that your eyes are safe from the harmful effects of blue light.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "3",
            "1",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "1",
            "1",
            "5",
            "4",
            "3",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "4",
            "1",
            "5",
            "3",
            "5",
            "1",
            "5",
            "5",
            "1",
            "3",
            "2",
            "5",
            "3",
            "1",
            "2",
            "1",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "3",
            "4",
            "5",
            "5",
            "1",
            "1",
            "2",
            "2",
            "3",
            "2",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "3",
            "3",
            "5",
            "5",
            "2",
            "5",
            "3",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "4",
            "4",
            "1",
            "1",
            "5",
            "4",
            "5",
            "3",
            "1",
            "1",
            "1",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "3",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review": [
            "Here is the detailed review of realme SLED\nEarlier I have use normal LED and QLED TV. So the review we will be according to that.\nDisplay- if we compared to normal LED it is far far ahead of that. In comparison to QLED, this TV is directly giving the competition to it. Hence it can go against Q LED TV at lower price range.\n\nAudio- for a normal living room 24 watt sound output it is perfectly balanced since it comes along with Dolby audio and quad speakers, it's a good choice rather than 50 Wa...\nREAD MORE",
            "Pros:\n1) Very Slim bezels.\n2) Amazing picture quality.\n3) Blacks and whites have been seperated well.\n4) Sound quality is more than good and loud for normal usage.\n5) Stock Android ui and easy to use remote.\n6) Good wifi, bluetooth connectivity standards and sufficient ports.\n\nCons:\n1) Lacks Dolby vision but has chroma boost inbuilt so compensates somewhat.\n2) Lacks Dolby Atmos but has Dolby Audio but soundbar is required for completely cinematic experience like realme also advertises.\n3) By default the whites are too bright that dynamic range suffers in some areas but can be easily fixed in settings.\n4) Ports position could have been more accessible.\n5) Newer version of Android TV should have been there as already 11th version is out and it has 9.\n6) Or atleast 2 Gb ram should have been provided as memory management of Android TV 9 version isn't as good as newer versions. But not a huge noticeable difference due to good processor. Hopefully it would be updated to newer versions soon.\n\nOverall modern looking TV with awesome display quality and audio is decent, as well as accompanied by stock Android and Chromecast.",
            "Am 20 days used NO1 TV Best realme SLED amazing 4k picture quality best sound amazing connectivity super value money my life best choice realme SLED thanks for filpkart and realme. Love you",
            "Beautiful 🥰 I loved it my family loved it....my son is so happy this is the first smart TV in our house.... picture quality fabulous... sounds good thanks 😊 to Flipkart and Jeeves... the installation and delivery was also done timely..",
            "Over all it is a nice tv, good picture quality, sound was good and enough for 12*15 feet room. Design was nice .",
            "World no1 budjet smart sled tv, picture quality very nice and connectivity also good overall it's amazing tv,I fully satisfied and loved it,don't think about tv,blindly go for it this is the best price of 55 inch tv,38000",
            "Every is brilliant with this product but as per installation is concerned, it was said that wall mount is free with 55' inch however they charged me 2400 for wall mount which was not acceptable. And on top of that when I checked the price in wall mount in flipkart the amount was 500, 600 like that.",
            "The Waste Tv I seen in my life , recommended to all pls don’t buy , you will waste your money and time in your life .\nThe story is, I brought the Tv on last week and real me agent came fixed up happy first day I enjoyed the big screen experience wow. next.... RIP💐 “dead” still running behind 🤦‍♂️🏃‍♂️ filpkart and real me. You never get good service from them they will wast your time sure , buy and enjoy the service of fipkart and real me and build your Bp high thank you filkart and real me",
            "Initial impressions of this tv are awesome. 24W speakers are more than enough. But still if u need more sound then go for realme 100W sound bar which will definitely boost the sound. The bass of realme sound bar is crisp, clear and loud. U can enjoy each and every beat of the music. The color, brightness backlight of tv is good and as they say SLED helps in reduced blue reflection which protects your eyes.",
            "Great tv , clarity is good but lags sometimes. It's the best tv you can get on this price range",
            "Very Nice TV , Value for money , Good picture quality and Sound System is also Amazing . Nice product",
            "One of the best tv. The new sled technology seems to rock and flawless. I think it's far better than other big brands . Realme has made an awesome product at a affordable price. the colors displays are excellent.",
            "Good quality pictures and sound. Excellent value for money. Good interface and easy to install apps",
            "My actual choice was Oneplus q1 tv..but I have compared in flipkart which is very little difference interms of Sound output ..Apart from that everything is same so I prefer to go this Realme and it is excellent which I have tested in all things like Sound, connectivity, picture quality etc.. Especially cost also very great compared to one plus..Go with this tv guys..I simply loved it..",
            "Not worthy...within a year it stopped working...",
            "Led pana is damage dot's in it and no replacement after 10 days",
            "Good picture quality",
            "Value for money",
            "Hello\nI bought real mi 55 inch tv from flipkart in january it is spoiled by the end of March. Complainant said that repairer will come to your house and repair the TV but no one has come to repair the TV again. Calling back in flipkart from where it was said that we have no responsibility. You call in realme store. Wrote our complaint and said that the engineer will repair such TV in your house in five days. After five days the engineer came to repair the TV and the TV did not work again. The same problem again. But so far no one came to our house and the TV in our house has been off for the last three months. There is no solution to the problem. Even after complaining frequently, our problem has not been solved and now we do not see such repaired TV. Can you refund the full amount of TV or give us a new TV because you have sent me a damaged TV because three The current TV has been off for the last three months today. This has caused a lot of questions in my house as well. We have no means of entertainment as we have to go out of the house during Corona's time and we had only one TV which is also broken and the company is nothing. I am now going to file a consumer protection complaint a",
            "Fantastic tv very nice clarity",
            "Awesome picture Quality...",
            "Good realme best tv",
            "Good",
            "Good quality",
            "Good to have it in this price range, value for money product. No issues in picture quality as well as connectivity . Ok with sound quality it's better to have a sound bar. 100% satisfy and don't confuse if you want buy and go a head you never be disappointed",
            "Very poor quality. Unfortunately I see some lines on my screen.for that I followed up 2months with customer care.but no use. Now screen completely filled up with lines. Technician came to home for checking Tv and confirmed that its physical damag and asked to replace tv panel with our own charges. But it's allmost equal to new tv cost.i don't understand how it happened without known me and don't see even single scratch on my screen. Realme customer care people also believe technician words only. I have ever never seen this kind of support . They don't maintain proper track for complaint tickets. Because, I have to explain complete details everytime whenever I call to them. Still no resolution. Worst service. Don't buy this sled tv.",
            "Super picture quality.\nJust go for it.\nBut delivery was too late by flipkart.",
            "Great product\nValue for money\nQuality is best\nBrightness level is too high\nBest User Interface\nEase in navigation\nPerformance is best\nFine deal",
            "Delivery is very late almost after 50 days of order but installation is very fast almost the next day of delivery. TV picture quality and sound is the best but some connectivity isse for mirroring of screen because it's require two 📱 at the same time.",
            "Very Good TV in Low budget",
            "Nice one ☺️",
            "Most fantastic TV with picture quality and sound",
            "Super and excellent product",
            "Nice tv at this price range",
            "Worst product I have ever buy from Flipkart pls guys don't buy it by seeing only good product it's worst first problem I have experience is its ui it's very laggy and even tv takes too much time to on and most worst problem of this tv is it started getting yellow screen with time I mean I buy it in 17 Oct and it's 1 Nov and now this tv started showing its real negative side very disappointed from realme.😡😡😡",
            "Fabulous",
            "Very very nice 😉😉😉😉😉😊😊😊👍👍👍👍",
            "Within one month The tv screen not working",
            "Osm Picture Quality",
            "Amazing picture quality sound is ok but\n\nif atach the sound bar feel like a theater atmosphere",
            "Am very happy with product and their service\nIt’s really superb picture quality and sound quality\nAm very happy with this tv",
            "After 20 days display not working. Still waiting for service...",
            "Worst tv after 1 month tv display one side dark spots is coming and picture quality and sound quality is very low...don't buy..goto another brand tv...",
            "Nice",
            "I purchased 55\" realme sled on Diwali 2020.For delivery 5 stars.Very guick delivery. 5 stars for installation.It was advance as scheduled.Photo quality super.Net reception super.working perfactly.No complaint one month passed.\nThe only thing mensionable is SOUND.It is just sufficient not best.Not bad also.\nI recommend to purchase it without worrying.",
            "Wi-Fi connectivity very less\nVideo play & back function very poor\nSound is normal & enough\nPower consumption 170 watts is high\nCost is normal rate in this segment models\nSoftware upgrade is more required",
            "Awesome TV.Best picture quality & Sound.",
            "Nice product",
            "Good TV, We bought it for our Dr Sheela Homeopathic Healthcare Clinic, picture quality and sound quality is very good, advising to use VGuard Crystal plus stabilizer to protect the TV from fluctuation as Redundant safety measure.",
            "Waste of.money. and seller. Not provide. The. Services. Poor. Quality. Pictures. And. White. Show of panel.",
            "perfect tv",
            "It's been 10 days, viewed different channels. So far no issues.\nAmazing pictures quality\nGood sound quality\nGreat connectivity\nMust buy TV in this price range. Go for it!",
            "Value for money and picture quality excellent",
            "Penal is wrost, I bought 55 Inch tv 20 or 25 days ago, Tv Penal is bad not good picture quality and no feedback of Flipkart or Realme brand also. My suggestion don't buy Realme TV. I am very disappointed.",
            "Best sound and picture quality.",
            "Supper quality sound and picture quality is very bright",
            "It’s was an tremendous buy , the picture is good brightness is perfect the only problem is its connectivity it oftens disconnets",
            "Performance of this tv is very poor\n\n4K video on YouTube is not playing property even after 16 MBps internet speed\n\nDisplay quality is average\n\nBrightness is very poor\n\nAfter using 17 days it starts hanging,\n\nCan't play 4K videos from external storage device properly.\n\nGraphics processor is of very poor quality.\n\nThe only good thing is that thin edges and big size 55 inch display.",
            "Over all awesome tv, but connection woth chromecast is not smooth",
            "Nice products",
            "Showing wall mount is free with 55 inch TV but installation person extra charge for wall mount. Alought I said with screen shot of product details in flip kart site but he is denied.\nVery discounting...",
            "I don't know why my ports produces some voltage which gives minure annoying shock while touching them.\nWhether it's in all TVs or only for my TV I had a technician visit for that and they said it's not at all a problem so just ignore and enjoy the product.\nPlease reply if anyone faces the same issue with the Realme Sled Tv BTW it's a nice product only problem I have faced with the TV is that minure shock.\nBetter to give 3 pin plug in place of that 2 pin to avoid these type of problems.",
            "Quality is not as mentioned in the details",
            "Nice SLED tv",
            "installation man is very bad bad and cereals are very bad and totally they will be not satisfied I will win not complete installation they will be not to be to any satisfaction",
            "Quality not as expected",
            "Slow\nUsb Ports not handy",
            "After one year picture quality in tv becomes worst",
            "Vaste product no quality do not perchase the tv any one",
            "Great",
            "The tv is awesome dont worry about anything if you want to buy this tv just go for it, picture and sound quality is superb but if you want to do it wall mount please buy usb hub because we cant able to use usb ports if tv is fixed to wall mount. Other than that everything is fine no issues.",
            "Very nice sir",
            "I bought this TV more than a month ago..\nAs far as the TV performance is good.. Simply awesome.. My family loved it ... I was bit confused while buying it because this was my first time purchase through online and the Real me Brand also... However it perform good so far..\nI recommend...",
            "Installation was very nice.\nThe guy explained the features very well",
            "Product is very good 👍",
            "Awasome picture quality and sound.",
            "Fast delivery fast installation,,,,,,, Flipkart is best...\nValue for money, quality is super ,fast connectivity..",
            "Nice tv but speakers need improvement",
            "Great TV value for money!!",
            "Good",
            "In picture , it's difficult to adjust the exact required settings. Sound is gd...\n\nOne major drawback is not about TV it's about jeevas ( came for installation). They set the wall mounted TV tilted. I told them. But as per Jeeva member wall is not ok ... highly unprofessional.\n\nDelivery of TV is before time. Hats off to flipkart for delivery. They are always good in this area.",
            "It's bang on product with great features, 4K picture quality is superb\nDolby digital sound is worthy too, SLED quality is major ice breaking technology in Indian Market\nI would like to give 4 rating cause it worth it.\n\nGo for it guys.\nOnly negative feature is connectivity.",
            "So Far So Good... Hoping that the faith shown by us on a newly launched TV does repay by its performance... Picture quality is amazing ... Sound is not bad either..But for best experience..go for realme soundbar... One drawback is the positioning of HDMI and other ports.. However, the same can be taken care of at the time of installation... At this price range, simply the best ever.. Picture quality is equivalent to expensive sony and LG Tvs.. So without any doubt, go for it...!",
            "Best product under this price range. The picture and sound quality is amazing. This is a value for money product.",
            "I see issue with applications loading on realme TV.\n\nHotstar and aha applications are loading very slowly and not working as expected.\n\nI am unable to connect Seagate portable hard disk to TV through USB, throwing error.\n\nDisappointed with realme TV.",
            "Worst product ...go for the Nokia TV. Picture quality worst ...sometimes you feel the color is leaking. Build quality is ordinary like you have bought this product.",
            "Picture quality is poor. Contrast very low. HD picture looks like sd picture.",
            "This product is not good. Within one month display problem started. I inform Realme people they told they will replace but till now it didn't happen.",
            "Ok ok",
            "Don’t connect with Amazon Alexa",
            "All over is good\nBut few days bluetooth no response",
            "Too good",
            "Picture clarity worst compare to VU. Also price very high. Don't buy this tv",
            "Perfect",
            "Very good tv ... awesome design... display is awesome ..very good connectivity... awesome sound ...totaly awesome product superb",
            "Quality of of tv was best and picture quality is best",
            "Overall is okk",
            "Amezing realme",
            "Superb..",
            "Product is good...I like this product.",
            "Good tv",
            "Product is good but Very Poor installation",
            "Worth it...",
            "I write this review after week of use, my installation get bad experience.but after complaints it’s fixed, based on this cause I’m disappointed with Flipkart customer support (they really not supported us). Overall all the tv was working well with issues, I recommend to buy the tv, but via Flipkart you need thinking yourself.",
            "It’s good",
            "Review after 15 days use...\nGood\nBack light is better,clarity is awesome,looks is classy like popular brands,sound gud but anyway u ned sound system...\nBad\nBluetooth is supporting only one device,if remote is connected thn u won't be able to connect speakers.\nTht to connection process is not user friendly and not informative,takes long..",
            "Just speechless",
            "Good television",
            "I didn't expected like this. I'm using 43inches 4K tv I thought this tv also like that TV picture quality. But 55inch very disappointed me. 43 inches TV is better.",
            "Nice releme led quality",
            "Good and Nice",
            "Not clarity",
            "Best TV i have seen till this date",
            "TV is fine and nice picture quality but the person who came for installation had no manners to talk to customer so giving it only 3 star..coz of installation process",
            "Good Picture Quality👍🏻……Average Sound Quality👎🏿……delivery tooooooooooooooooooooooo late…not fast delivery….installation not good…very poor…otherwise its a good tv…",
            "Good osm tv so byte full ❤️❤️",
            "Colour are not good",
            "Awesome performance from the tv\nDisplay is pretty awesome.\nEverything works seamless.",
            "Super nice\nI like it",
            "Superb tv..",
            "Nice",
            "Good",
            "Picture quality is very bad. Creating lot of eye strain and discomfort.",
            "Worst picture quality... Go for VU Or Hisense Or Motoralola zx pro..",
            "Please send to installation and Demo person\nVery good",
            "Good Quality product",
            "Only 5 ⭐✨",
            "Great one",
            "Nice one",
            "I got the product broken",
            "Video quality bad\nNot even comparable to qled\nJust a simple led",
            "Nice",
            "Nice picture than other branded TV",
            "Wonderful product",
            "Screen get defect some pink cot shown when see white background on right side",
            "Good",
            "Good ..",
            "Valu for money",
            "Nice",
            "Picture quality is very good but its hang more like samsung",
            "Internet is not working",
            "overall one word to say ..Best in segment..best in class",
            "Absolutely loved the product.",
            "This is awesome tv and sound quality is beyond imagination",
            "Nice",
            "Value for money.",
            "It's just awesome value for money",
            "Good",
            "Cool dude",
            "Good",
            "Excellent value of money",
            "Good",
            "I am not getting conformed about USB i/p pin",
            "Remote was not working perfect",
            "Good tv",
            "I loved it so much 🤗🤗🤗thanku flipkart 😘😘😘😘",
            "TV is. Awesome it is very clear screen is also very nice worth of money 👍",
            "The tv is good only the sound should have been a little louder",
            "Very good but colour not prominent",
            "Good product",
            "Good product",
            "Very good experience",
            "I am Giving 5* for the product , Good sound and picture Quality ,",
            "Excellent",
            "Number 1 tv 😍",
            "Picture Quality performance And All Super",
            "Nicely",
            "II have been using this TV for more than 3 months .\nBest picture quality .\nSuperb sound .",
            "Very good",
            "At this price this is awesome",
            "Just Awesome TV ... Go for it ❤️",
            "After using it for few days, I found it's pretty good product. Considering the price it's good.",
            "Bright Picture\nSufficient Sound quality\nNot a Pure 4k Panel\n4 out of 5",
            "Seriously.....Value for money.....👌",
            "TV very nice and it is worth for money.",
            "Nice",
            "Realme excellent product ultimate picture Quality compare to sony go ahead",
            "Awesome 55 inch TV from real me in this price range. Good picture quality and connectivity, some more improvement required in sound. However overall performance is very satisfactory. I am writing this review after One week of installation. Overall best product. I was using before Samsung brand but after using this product i feel it is at par with branded product who always charge more money for the sake of brand.",
            "Very good picture quality compare to other products in this price, I m sooo happy for this product purchased , but product delivery delay issues , otherwise product was awesome",
            "Probably The Best One Available In The Market....A Must Buy Item.....",
            "very nice nice Led TV",
            "Awsome experience ...nice tv",
            "I am satisfied with the product. Superb picture quality, sound and everything is just perfect",
            "Nice TV AND SOUND SYSTEM",
            "Great 👍",
            "Low price,good quality, value for money.",
            "Good",
            "Realme 55 inch tv is nice. Picture quality is very good, but sound is not upto the mark. Sound is ok, but if connected to home theater system, output audio is really nice.",
            "This Tv is value for money\n\n\nBut I am disappointed with flipkart because delivery of tv is after 2 month.",
            "Awesome",
            "Its good product",
            "Superb quality",
            "Very nice",
            "Best budget smart T.V",
            "Value for money, it's OK for me,",
            "Best picture quality 👍 & best sound quality..",
            "Osm picture Quality\nGood Sound Quality\nAll Good\nRealme 👌",
            "It's amazing product with a brilliant picture quality and also it's sound is so much clear but I shortly dissatisfied with its connectivity,realme work with this and thx realme for a mind blowing product",
            "Overall good product. Viewing angles arent too great. Bright pictures tend to feel washed out when viewed from the sides. The ui can feel sluggish at times, hoping updates will fix this. Other than that no issues. From normal angles picture quality is really good, specially for hdr enabled content. SD content upscaling could have been better. On the whole, for what you're paying it's more than worth it!\n\nUpdate (after 5months): the UI can become sluggish at times. TV hangs every now and then as well. I believe this has got to do with Android TV in general though. Other than that, love it.",
            "Picture quality is superb\nflipkart service is so bad i order 16 oct and i get 5 dec no one flipkart is not helpenig for fast delivery but tv is good",
            "It's amazing I have not opened but I hope it must be nice and amazing thank you Flipkart",
            "Very nice tv amazing picture quality",
            "The product is great. Sound and picture quality is great. If your budget is under 45k, best TV to buy.",
            "Excellent",
            "Best Quality Product at this price!!\n\nAnd thanks to Flipkart for taking up my concern about delivery and responding quickly!!",
            "This is the best TV in this price range",
            "Good",
            "Product is nice, picture quality is too good",
            "Nice TV price to performance good under 40k",
            "Value for money.So far good experience. Sound quality is good",
            "Good quality this price",
            "After some struggle installation done, Good picture quality but sound is average.Happy with the product.",
            "Very good tv with bright colours.\nYou just need to adjust the picture settings According to your preference.",
            "good product in this price range",
            "GOOD TV TO BUY IN LOW BUDGET ,SO HAPPY",
            "Compare to others this is better than all brands in this price range I like it\nColour is superb\nSound is also good",
            "It is more than our expectations. A perfect smart tv",
            "Picture & sound quality in this range superb",
            "Amazing Product from Realme. I am amazed by the picture quality under this price range. It even supports the 5Ghz Wifi Network which most of the TVs dont. Amazing sound and picture!"
        ],
        "likes": [
            "310",
            "136",
            "133",
            "38",
            "83",
            "4",
            "5",
            "14",
            "4",
            "1",
            "3",
            "2",
            "1",
            "0",
            "0",
            "1",
            "92",
            "29",
            "89",
            "48",
            "42",
            "65",
            "51",
            "20",
            "35",
            "12",
            "17",
            "11",
            "21",
            "15",
            "10",
            "5",
            "22",
            "10",
            "4",
            "5",
            "10",
            "8",
            "9",
            "13",
            "6",
            "2",
            "2",
            "3",
            "3",
            "4",
            "5",
            "5",
            "5",
            "43",
            "6",
            "8",
            "8",
            "45",
            "14",
            "1",
            "5",
            "1",
            "2",
            "2",
            "6",
            "7",
            "8",
            "8",
            "4",
            "4",
            "2",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "5",
            "3",
            "1",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "74",
            "35",
            "35",
            "9",
            "10",
            "0",
            "0",
            "8",
            "2",
            "0",
            "3",
            "2",
            "1",
            "2",
            "0",
            "2",
            "8",
            "1",
            "9",
            "4",
            "4",
            "11",
            "10",
            "3",
            "8",
            "1",
            "3",
            "1",
            "5",
            "3",
            "1",
            "0",
            "7",
            "2",
            "0",
            "0",
            "2",
            "2",
            "2",
            "5",
            "2",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "40",
            "2",
            "4",
            "4",
            "51",
            "11",
            "1",
            "2",
            "0",
            "0",
            "0",
            "5",
            "7",
            "9",
            "9",
            "2",
            "5",
            "2",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "10",
            "6",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Android version Which is currently available while booting",
            "Q:Is Optical Audio output available or not ...?",
            "Q:Is support HDR10 and HDR10 plus ?",
            "Q:Is this Tv has single or dual band wifi?",
            "Q:It's connectivity is good or bad",
            "Q:Which TV is best Mi or realme plz tell",
            "Q:This tv screen is ips ?",
            "Q:can i connect with i phone",
            "Q:Is Digital Audio output available ?",
            "Q:Can we connect bluetooth",
            "Q:Does it have amoled display",
            "Q:Can we fix the tv on the wall?",
            "Q:Is Bluetooth connectivity available or not ¿",
            "Q:Can I connect iPhone for charm cast",
            "Q:Can we use Facebook app in this tv",
            "Q:Do I have to pay for the wall mount?",
            "Q:Does Realme Make 43 Inch 4K Smart TV",
            "Q:This product is equal to which of the named brand?",
            "Q:Can i play ps5",
            "Q:Internal storage capacity",
            "Q:Can we play pubg on this shirt tv",
            "Q:Can it play pubg in realme TV for mobile connect",
            "Q:Wall Mount provided in the Box?",
            "Q:Ethernet Wifi Cable Port Support?",
            "Q:Sled 43 inches tv is there",
            "Q:Qled is best (or) s led is best",
            "Q:I can install any app from this TV",
            "Q:It's with out android available",
            "Q:Is it comparatively better then QLED TV?",
            "Q:I can paly free fire in this tv are not reply me soon as well sir we need to buy this tv ok",
            "Q:Does it has play store?",
            "Q:Can it connected to set upbox cable?",
            "Q:What is the manufacturing year and which country",
            "Q:How to activated chroma boost",
            "Q:Is there is handfree voice available?",
            "Q:I have already booked this tv as prepaid .. But i need to know 1 thing that is, can we connect wired speakers?",
            "Q:Which is best oneplus u1 or realme sled",
            "Q:Is stabilizer needed",
            "Q:We can connect bluetooth heardphone ?? And bluetooth Version update?",
            "Q:Is the tv update to 10",
            "Q:Can we connect key board and mouse to this tv",
            "Q:this tv have stand to put tables?",
            "Q:How can i cast tv",
            "Q:Is dis tv need stablizer?",
            "Q:Will Realme SLED TV get update for Android 11 ?",
            "Q:Does it have a bluetooth built in.?",
            "Q:How can i cast??",
            "Q:Can we connect wireless mouse and keyboard to tv",
            "Q:Where do we connect pendrive can't see USB ports to connect",
            "Q:It is light in weight",
            "Q:Can we play any console in this tv?",
            "Q:Different between LED And SLED",
            "Q:I want to use this pc as a external screen for my laptop is responding time is slow?",
            "Q:How much peices",
            "Q:Can i connect to mobile with led tv via Bluetooth?",
            "Q:Does it support earc",
            "Q:It has inbuilt Wi Fi",
            "Q:Can I cast Mobile in this TV",
            "Q:It will get damage we use it more hours in a day",
            "Q:Does it have MEMC (motion smoothening)?",
            "Q:Is stabilizer neded",
            "Q:does it support mkv video format?",
            "Q:Alexa can be connected ?",
            "Q:Is netflix free.?",
            "Q:Can we connect mobile phone?",
            "Q:This tv need a stablizar or not",
            "Q:Can we connect PS4 to tv",
            "Q:Did we get real me sound speakers with led.",
            "Q:Dolby Vision available ?",
            "Q:Is it better than oled",
            "Q:Led tv is waterproof",
            "Q:It's better than Qled . which is the best OnePlus r realme",
            "Q:realme soundbar can come with the tv",
            "Q:Is this tv includes realme 100W soundbar?",
            "Q:Is Screen mirroring option there in this tv",
            "Q:Is chrome cast available?",
            "Q:Do I get wall mount free of cost or I have to pay for it?",
            "Q:Is this tv has dual band wifi both 2.4 and 5ghz ??",
            "Q:Can it be mounted on revolving/rotating wall mount?",
            "Q:Can we attactch rotatable wall stand",
            "Q:Can I connect through WiFi to Mobile",
            "Q:How the picture quality and sound quality. How is the overall performance of tv",
            "Q:Jio tv app work or not",
            "Q:I can connect phone and play games",
            "Q:What are the dimensions of realms SLED 4k 55 inch TV ?",
            "Q:If I buy 55 tv, is it wall mount free?",
            "Q:Can wall expect wallmount? Where we can buy that",
            "Q:Handsfree technology available?",
            "Q:Is this glass gorila protection??",
            "Q:Does this tv contains wallmount stand",
            "Q:Can I use whatsapp in this realme tv",
            "Q:voice search in this tv??",
            "Q:can i connect wireless headphones with the tv ?",
            "Q:this tv is screen touch?",
            "Q:Whether SD channels are clear or bulury",
            "Q:Does it support other company soundbars with sub woofers?",
            "Q:Their is any sound box come with this tv",
            "Q:Does realme soundbar provide good experience like 5.1 home theatre?",
            "Q:Can we connect blue ray player?",
            "Q:Can we adjust screen size while watching ott content",
            "Q:Can we install thop tv on this tv?",
            "Q:Can I connect earbuds?",
            "Q:It is IPS or VA panels",
            "Q:What is the RAM capacity?",
            "Q:Can we connect home theatre to this tv as sound output?",
            "Q:Can I connect lg 300 w wireless soundbar",
            "Q:Connect to dish tv",
            "Q:Can I connect desktop on this TV",
            "Q:It has airflow obstruction",
            "Q:Does it have PC Mode in picture setting/picture preset to be used as a PC monitor?",
            "Q:Does it have a woofer for bass",
            "Q:Hey there, can anyone is realme SLED user here since time who can tell me how that tv is working good or bad, cons or pro , worth it or not",
            "Q:Is there mirror cast available",
            "Q:Can we play pubg directly in this with mirroring",
            "Q:Is Remote IR based or Bluetooth based ?",
            "Q:Does it support hdmi 2.1",
            "Q:Does it support apple AirPlay?",
            "Q:How is the build quality of the TV"
        ],
        "answers": [
            "A:Android 9",
            "A:no",
            "A:It supports HDR 10+",
            "A:dual",
            "A:Good connectivity using from 6 months no issues faced. Till now",
            "A:realme",
            "A:yes but it picture quality is batter then mi qled tv",
            "A:yes sure",
            "A:yes",
            "A:yes",
            "A:amoled display technology is limited to only mobiles right now this TV has SLED display",
            "A:yes",
            "A:Based on my testing so far, it is available for audio control only. Other file transfer and useful Bluetooth operations don’t work.",
            "A:it's 'Chromecast', I think this is what you mean, yes you can do it through a replica app or using Google home. The details are mentioned in 'How to' section of Chromecast for iOS.",
            "A:No I think as I have not tried yet.",
            "A:No",
            "A:No",
            "A:sony",
            "A:Yes",
            "A:16gb",
            "A:Yes",
            "A:no",
            "A:NO",
            "A:Yes LAN port is available",
            "A:Yes SLED 43 inches TV is available.",
            "A:Qled is better then sled",
            "A:Sure you can install any app on this TV",
            "A:no I guess",
            "A:yes",
            "A:Yes you can play but you can only control the picture presets from an external source like a Fire TV stick or a gaming console. ... The one place where the TV performs well is with gaming.",
            "A:yes",
            "A:Yes",
            "A:2020-2021",
            "A:It's already active.",
            "A:No sir",
            "A:Yes Wired speakers can be connected through HDMI(ARC) or earphone port",
            "A:realme sled",
            "A:No not needed...",
            "A:no",
            "A:no",
            "A:no",
            "A:Yes",
            "A:Using google home app",
            "A:No need (it depends on voltage fluctuations)",
            "A:NO",
            "A:yes",
            "A:you can use Google home app available on play store for casting",
            "A:no",
            "A:back of the tv",
            "A:NOT MUCJ WEIGHT IT IS SLIM",
            "A:yes",
            "A:Superluminescent diode. It is the best of both worlds High Brightness of Laser Diodes and light-emitting diodes (LED).  SLED doesn't use blue light but uses RGB diodes as the backlight",
            "A:NO, IT'S QUITE OKAY",
            "A:1",
            "A:yes",
            "A:No",
            "A:Yes",
            "A:yea...but tv must be on",
            "A:No",
            "A:No",
            "A:no",
            "A:yes",
            "A:yes",
            "A:no",
            "A:yes. we can connect",
            "A:I think yes. because we are already facing power fluctuations.",
            "A:Absolutely yes",
            "A:You will only get the inbuilt 24 watts speakers with tv and you have to buy the soundbar seperately.",
            "A:No",
            "A:No",
            "A:NO",
            "A:Realme",
            "A:No...and the inbuilt speaker is an absolutely nonsense",
            "A:no",
            "A:Screen mirroring is not available and this tv is absolutely rubish.",
            "A:Yes",
            "A:we have to pay for it very bad company should give in Box for free",
            "A:no only 2.4 ghz connected",
            "A:wall mount",
            "A:yes",
            "A:you can connect this tv to 2.5 and 5 wifi also can connect to hotspot of mobile",
            "A:Yeri good",
            "A:No",
            "A:yes",
            "A:Width x Height x Depth (without stand) 1229.7 mm x 713.5 mm x 65.9 mm",
            "A:Yes",
            "A:Yes",
            "A:Not available",
            "A:No sir",
            "A:No .need to purchase sapterly",
            "A:By screen casting you can do",
            "A:yes",
            "A:you can connect bluetooth option is there.",
            "A:no",
            "A:SD Channels visualisation is also good. I would definitely recommend this TV",
            "A:Yes ofcourse",
            "A:no",
            "A:Sound effects may not be comparable to dedicated home theatres.. but definitely good enough for a small hall..",
            "A:Yes",
            "A:no",
            "A:no",
            "A:Yes I connect Bose sound sports",
            "A:VA PANEL",
            "A:1.5 GB",
            "A:yes",
            "A:Yes u can add any bluetooth device",
            "A:Yes",
            "A:Yes of course",
            "A:no",
            "A:Can connect a PC in HDMI port so can use as a monitor",
            "A:yes and it has very loud sound",
            "A:Completely worth it. Go for it",
            "A:Yes, it is available",
            "A:Yes",
            "A:Bluetooth",
            "A:yes",
            "A:NO",
            "A:Good quality but not stabilizer and wall stand include"
        ],
        "likes": [
            "37",
            "30",
            "44",
            "5",
            "4",
            "5",
            "6",
            "7",
            "11",
            "3",
            "3",
            "3",
            "4",
            "3",
            "1",
            "0",
            "0",
            "6",
            "3",
            "2",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "24",
            "46",
            "44",
            "5",
            "3",
            "12",
            "6",
            "22",
            "3",
            "4",
            "13",
            "1",
            "1",
            "2",
            "2",
            "7",
            "3",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0"
        ],
        "dislikes": [
            "8",
            "13",
            "22",
            "0",
            "0",
            "1",
            "1",
            "3",
            "9",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "1",
            "6",
            "15",
            "2",
            "1",
            "2",
            "4",
            "5",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "4",
            "19",
            "20",
            "0",
            "0",
            "8",
            "2",
            "24",
            "1",
            "1",
            "18",
            "1",
            "0",
            "0",
            "1",
            "9",
            "3",
            "3",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    }
}