{
    "title": "Hisense A73F 164 cm (65 inch) Ultra HD (4K) LED Smart Android TV with 102W JBL 6 Speakers, Dolby Vision and Atmos  (65A73F)",
    "product_specification": {
        "In The Box": "Remote -1U, Manual - 2U, Table Stand - 1U, wall Mount - 1U, Batteries - 2U, Warranty Card - 1U",
        "Model Name": "65A73F",
        "Color": "Black",
        "Display Size": "164 cm (65 inch)",
        "Screen Type": "LED",
        "HD Technology & Resolution": "Ultra HD (4K), 3840 x 2160",
        "Series": "A73F",
        "Smart Tv": "Yes",
        "HDMI": "3 Side",
        "USB": "2 Side",
        "Wi-Fi Type": "Dual Band WiFi 2.4G, 5G",
        "Built In Wi-Fi": "Yes",
        "Launch Year": "2021",
        "Wall Mount Included": "Yes",
        "Brightness": "400 cd/m??????",
        "Analog TV Reception": "Yes",
        "View Angle": "178 Degree",
        "Digital Noise Filter": "Yes",
        "LED Display Type": "DLED",
        "Aspect Ratio": "16:09",
        "Refresh Rate": "60 Hz",
        "Supported Video Formats": "Dolby Vision, HDR, MEMC, AVI, MKV, TS, Blu_Ray, DVD_Video, MPEG, WAV, WMA",
        "Other Video Features": "Dolby Vision HDR, MEMC, Ultra Vivid High Contrast Panel, HDR10, HLG, Ultra Dimming, UHD AI Upscaler, Game Mode, Precision Colour, Noise Reduction",
        "Number of Speakers": "6",
        "Speaker Type": "Full Range",
        "Sound Technology": "Dolby Audio, Dolby Atmos",
        "Surround Sound": "Yes",
        "Speaker Output RMS": "102 W",
        "Sound Mode": "Standard, Theater, Sports, Music, Speech, Late Night",
        "Supported Audio Formats": "Dolby Atmos, MP3, WMA",
        "Other Audio Features": "102 W JBL Speakers Powerful Sound",
        "Number of Cores": "4",
        "Processor": "Quad Core Cortex-A53 64 bit",
        "Graphic Processor": "Mali-470MP",
        "Ram Capacity": "2 GB",
        "Storage Memory": "16 GB",
        "Supported App - Netflix": "Yes",
        "Supported App - Youtube": "Yes",
        "Supported App - Disney+Hotstar": "Yes",
        "Supported App - Prime Video": "Yes",
        "Supported App - Others": "Prime Video, Zee5, Sony Liv, Eros Now, Jio Cinema, Voot, Sun NXT, Yupp Tv, MX Player TV, Hungama, Alt Balaji, ShemarooMe",
        "Supported Mobile Operating System": "Android",
        "Operating System Present": "Yes",
        "Operating System": "Android",
        "Screen Mirroring": "Yes",
        "App Store Type": "Google Play Store",
        "Pre Installed Browser": "Yes",
        "Content Providers": "Netflix, YouTube, Google Play Movies and TV, Google Play Store, Prime Video, Disney+ Hotstar",
        "Supported Devices for Casting": "Laptop, Mobile, PC",
        "Wireless LAN Adapter": "Yes",
        "Bluetooth": "Yes",
        "Teletext": "Yes",
        "Ethernet (RJ45)": "1",
        "Other Internet Features": "More Than 5000 Plus Apps and Games, Chromecast, Built-in Google Assistant",
        "Headphone Jack": "1",
        "Digital Audio Output": "Yes",
        "RF Connectivity Input": "Yes",
        "Other Connectivity Features": "Dual Band Wi-Fi, Ethernet LAN In, Bluetooth 5.0, AV In, Browser",
        "Smart Remote": "Yes",
        "Color Screen": "Yes",
        "RF Capable": "Yes",
        "Internet Access": "Yes",
        "Operating Distance": "9 m",
        "Battery Type": "2 AAA Batteries",
        "Other Remote Control Features": "Voice Control",
        "Power Requirement": "AC 100 - 240 V, 50/60 Hz",
        "Power Consumption": "190 W, 0.5 W (Standby)",
        "Clock": "Yes",
        "Auto Power Off": "Yes",
        "Sleep Timer": "Yes",
        "Other Convenience Features": "Direct App Access Hotkeys, MEMC, Bluetooth Voice Remote, Dolby Vision, Dolby Atmos",
        "Width x Height x Depth (without stand)": "1.45 m x 86.4 cm x 8.4 cm",
        "Weight (without stand)": "17.4 kg",
        "Width x Height x Depth (with stand)": "1.45 m x 92.5 cm x 29 cm",
        "Weight (with stand)": "17.7 kg",
        "Stand Type": "Stylish 2 Pole Stand",
        "Warranty Summary": "1 Year Comprehensive",
        "Covered in Warranty": "All Manufacturing Defects",
        "Not Covered in Warranty": "Warranty Does Not Cover Any External Accessories (Such as Battery, Cable, Carrying Bag), Damage Caused to the Product Due to Improper Installation by Customer, Normal Wear and Tear and Damages Caused to the Product by Accident, Lightening, Ingress of Water, Fire, Dropping or Excessive Shock, Any Damage Caused Due to Tampering of the Product by an Unauthorized Agent.",
        "Warranty Service Type": "Technician Visit",
        "Installation & Demo Details": "Brand will contact for free installation. We'll facilitate the installation and demo through authorized service engineer at your convenience. The service engineer will unpack & install your new TV, either on wall mount or on table top. Installation and demo are provided free of cost. The engineer will also help you understand your new TV's features. The process generally covers: Wall-mounted or table-top installation, as requested.Physical check of all ports, including power and USB ports. Accessories also checked.Demonstration of features and settings Quick run-through on how to operate the TV. For Repair Services, authorized service engineer will do the following: Repair / change the defective part. Provide replacement to the customer in case part / product not repairable (only after replacement request approved). Warranty on replacement product will be applicable upto the warranty date of the replaced/original product."
    },
    "product_description": {
        "Super Clarity Audio": "Be it for watching movies and sports or listening to music, this Hisense TV comes with powerful 102 W speakers that deliver rich and high-fidelity audio, making every dialog, commentary, and beat feel realistic.",
        "JBL Speakers": "This TV comes with JBL speakers which take your listening experience to the next level. Every sound feels natural, making it a delight to listen to movie dialogs and songs.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "3",
            "5",
            "4",
            "3",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "2",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "5",
            "1",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "4",
            "4",
            "3",
            "1",
            "5",
            "3",
            "1",
            "5",
            "5",
            "5",
            "4",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "1",
            "3",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "1",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review": [
            "Best picture quality , best sound quality, easy use , easy remote use , fast refresh , tv not hanging, fast moving, easy connected all device , google assistant work properly, bluetooth and wifi work properly. This is Best tv in 55 inch. In this price this is best picture and sound quality. 5 star👍",
            "Best product in the price range below 50k.\nBought it after a 2 month long survey and not at all disappointed! Sound is awesomely loud and clear vocals. Decent Bass and beats along! The soundbar feel is proper. Picture Quality won't disappoint you. For those who are making negative comments, I advise them to make proper video and audio settings and then re-consider. For my case, the picture setting is DYNAMIC, audio is MUSIC and SHARPNESS settings to ZERO for all apps except Youtube whiere it is set to FIFTEEN. There is an option under Picture settings to improve viewing angles which should be turned ON as the first thing. Motion Enhancement to be set to STANDARD for watching movies. Having a VA Panel with Excellent Blacks, this display is very good if viewing from sides too, with that option ON. Go for it if your Room does not have direct Sunlight all day and if you prefer to watch TV mostly at night!",
            "Wonderful smart TV in the price range. This can compete with the other smart TVs of top brands which costs around 70k+. Sound and picture quality is awesome. Worth the buy.\n\nUpdate after 3 months of usage\nReally wonderful, top quality. Even image and sound both are great. Go for it blind folded in this range one of the best option.",
            "I have been using this product since Jan 2021.\n- It has good sound and picture quality.\n- If you are watching HD, Full HD and 4k Videos then it is a good choice.\n- We can not expect SD videos clarity on any 4k tvs.\n- Andriod version 9 is working fine. No lagging or delay while watching the TV.\n- OTT platform contents are good. HotStar, Prime has lots of 4k contents.\n- Youtube also has lots of 4k contents to enjoy in this tv.\n\nOverall this product is worth for the money spend. I recommended for anyone looking for 4k TV in this price range.",
            "I searched for a month than I preferred to purchase Hisense 55 inch with inbuilt JBL speaker. After one month of usage I can proudly say that it is really best and with all features I cannot get a better led than it.\nQuality of picture is awasome.\nJBL speaker Rock and supurb.\nConnectivity 5 star. Within two to three second you can switch over to any app.i.e.prime video to youtube.\nPrice..Most economical with all its features, some one can go ahead with rate of approx forty five thousand.\nFor company... 4 and half star ⭐⭐⭐⭐✨\n.. Half star I have given less because of one month usage. Else everything is fine...",
            "Product is great .\nbut again flipkart cleared its reputation.\ninstallation date was 20 October and installation done on 24 October. Totally unsatisfied from Flipkart service. Delivery boy behaviour was great and installation boy was also great behaviour and had good skills. but Flipkart is now changing their name to LateKart.",
            "Have been a Sony/ Samsung user for decades now,.\nGot this TV as a replacement for my dad's 49 inch Samsung and it has been a good decision to say the least.\nAll aspects of the TV are good and absolute value for money . The price doesn't hurt and the features are better than expected.\nAll in all I can say is that Hisense is doing a fantastic job in its products",
            "Amazing excellent quality sound wise picture wise only one drawback wallotop stand and LED distance approx 5 inch ..approx 6 inch it out from wall .....",
            "I purchased 55\" Tv last month.... Tv remote not given by the seller but from hisense Mr. Prem Saxena spoke to me and arranged Tv remote. Thank u sir.\nTv picture quality is Good.\nI like very much the Audio quality with 6 JBL Speakers. Value for money.\nI will give 5* for Hisense...can purchase without any hesitation..... Very Good Quality Tv...",
            "Quality of Picture is awesome..Value for Money..\nYou dont need any extra sound bar 102wt JBL sounds is too good. You can feel movie exp at your home..\nAll you need is unlimited High speed data pack to enjoy hd exp...\nVery nice product..",
            "Bought in dilemma but the user experience is awesome. It’s made us stunned with connectivity and smoothness. Overall product is really good and recommend to buy looking for power packed features package.\n102W doesn’t feel really good, it’s average but still better than other TVs.",
            "Excellent\n\nPro's:\n\nExcellent picture Quality ( very Bright Panel )\nSuperb Buid quality\nSound is very good, it's very clean and clear even at 100% vol\nFlipkart and the seller (Omni tech retail) support is very good\n\nCon's:\nIt's not a con, it's a bug -\n\nEvery time we have to select the input while switching on, it's not taking the inputs automatically.\n\nI hope in future updates it may resolve.\n\nThank you Flipkart/Hisense team for bringing this monster to the market",
            "Make sure to have atleast HD set top box. SD channels are barely watchable. UHD upscaler doesn't help to upscale SD channels that much. The remote controller is made of ordinary plastics. Spacing of the buttons are poor. More often than not you end up hitting home button while scrolling the down button. Sound is clear & crisp. Bass is just okay. You cannot say it's 103 wattage output. I went for this TV for jbl speakers & it didn't meet my expectations. Unfortunately they are not as good as my 120 wattage boat sooundbar with a subwoofer. I would have gone for 30 wattage hisense A71F instead of this. I shelled out 10k more just for 102 watt jbl sound which is not justified. Both the tv's have almost similar features except for enhanced wattage in tornado. But I regret opting for tornado just for the sound which is not upto mark. I have 43 inch sony bravia 4k tv. I compared the 4k content of both side by side & iam surprised\nby the display of hisense tornado. Watching 4k content is a delight in this one. It's really very good. The triluminus display of sony is tad better than hisense because of their extra colors & hisense tornado is not far behind. There is a huge price difference between the two. Android 9.0 is doing the job very well in hisense. It's blazing fast. I have tested all sort of USB pen drives & 1 TB WD hard disk. It works seamlessly. Much much faster than my sony tv which runs on outdated Android oreo. Jeeves did the job well in the installation department.",
            "I was not sure before buying this TV but after watching and reading multiple reviews i decided to go for it and right now I'm totally satisfied with the picture and sound quality. This one of the best tv in this budget with 105 wat speakers. Just go for it!",
            "The only thing that isn’t great about this TV is its SD to HD upscaling. There is a bit of lag, which may not be noticed if you are watching from a good distance. Otherwise, its the best device one can have at this price.",
            "Excellent product, Worth for money,\n1.Sound perfect even my hall is too big (20ft x 10ft) very very good\n2.Picture Quality also very very good\nHisence product impressed me lot then why am giving 4 stare because installation and demo is bad...\nMy experience installation person was to bad..\n\nI bought 2 product Hisence Tv 55\" (A73F) & boAt Aavante Bar 3100D 260 W\nBoth installer came only one person.",
            "Hisense, TV was amazing product, good clarity, sound was amazing to me, i really like that product but dont trust setup team is useless workers,",
            "Best tv in this range... Connectivity is superb fast.. size is awesome... Up scaling is not so good.. all the apps won't be available on play store... Sound is thick but manageable... A perfect tv for a family",
            "Amazing TV🔥 Worth the money\nThe picture quality is really good and the 102 W sound system is just amazing.\nSetup and installation was really quick.\nMust buy.\nDelivery and installation by Flipkart needs a special mention. Well packed and delivered on time.",
            "Picture quality in Dynamic Mode is so clear that you can feel every picture and read text very clearly.\n\nSound is like home theatre.\n\nConnectivity work is so easy every child can do very easily.\n\nSound and Picture quality in Internet provided content is so awesome.\n\nI feel a lack in this tv is SD channel provided by Set top are not seen very clearly . But TV can change HD channels content in near to 4K but not 4K.\n\nOver All Best product in this price range.\n\nI wants to provide 5 Star for this product and also flipkart to deliver on before committed time.\n\nInstallation process also do before committed time and using Corona Precautions.\n\nThanks You to Everyone.",
            "Value for money. Really good picture quality. 4k experience is brilliant. 102W sound bar is like a thunder, you would not need any additional sound bar. Both bluetooth & WiFi connectivity is superb. Upscaling of SD channels is also above mark. Delivery and installation was done on same day for me. Overall good experience.",
            "Considering this a budget TV, it offers a great value for money. Build quality is good and looks are premium.\nNo issue with connectivity or operations after 15 days of usage. Panel quality is good.\n4k UHD picture quality is excellent. I have not used Dish or Cable but HD and SD content on OTT looks good. May need some tuning with Picture modes to best suite your likes.\nAndroid UI is smooth.\n\nSound by JBL. Its very loud no doubt. But you wont find that signature quality of sound you expect from an Audio brand. Its good for general viewing and classical music. Don't expect it to give you extreme soundbar experience. Dolby Digital was disabled out of the box.\n\nHisense called to check for installation and feedback.\n\nOverall pretty good TV experience for the budget.",
            "It's really great experience I really tell you all tht instead of sony tv this is best option it's full pakage and great experience....",
            "Thank you for the wonderful tv.. I believe i purchased valuable tv in quality&design wise sound wise, connectivity wise, especially i love the picture&sound quality is so amazing its gives theater feel at home... Hisense Tornado is the best option in 4k tv...",
            "A brilliant LED that couldn't live upto my expectations in the sound department (maybe I was expecting more because I knew that it comes with a JBL soundbar). Don't get me wrong, the TV produces enough loud and rich sound to have a good experience, but if we talk about real immersive experience, it does leave you desiring more. Let me explain the narrative.\n\nI bought this LED after some extensive research for 2-3 day and I'm thrilled with the final outcome. In the end, I was left with the two options:\n1. Buy this LED with soundbar attached.\n2. Buy Hisense A71F and pair it with a good home theater speaker setup.\n\nSure, there are some differences in both models but are very manageable except soundbar. I went with option 1 but I think I would have been better with option 2. Now sure it would have been 4-7k more expensive but I think it would have been worth it.\n\nAt the end, I don't want to take away anything from this TV as it is a delight to watch 4K content on. I'm not sure on the regular updates but I'm happy with my purchase.",
            "At the time of purchaseing, Flipkart showed a warranty of 4 years. When I purchased the TV, in warranty card it was only for 1 year. Now Flipkart as well as Hisense also not giving us any written documentation about the warranty.\n\nThe sound of TV is not as much as I expected by 102 w speakers. I have to raise the volume up to 85 to feel the theatre effect.",
            "Excellent Display with rich blacks. 5* for it.\n\nSound powered by JBL is not upto to the mark and the in built speakers doesn't support Atmos as checked with Netflix app. 3* for it.\n\nConnectivity is good and without any hassle you can view with wifi. 5* for it.\n\nWhen it comes to value for money, I feel a bit over priced to its own 55 inch series. 4* for it.\n\nHuge problem I faced was installation which took 4 days for them to come do the installation.",
            "ITS A WEEK OF PURCHASE...MY FEEDBACK IS\n\n1. is PICTURE QUALITY GOOD? - YES AND NO, The conversion from HD to 4k is tiring to eyes... 4K content plays well without stutters... But fast moving images creates a difficulty to eyes\n\n2. Sound quality - I dont know.. Sound is clear but i dont get that good sound feel... Its very mild... Iam not impressed since that is the Key selling point of TV,it did not meet expectations.... Better go for normal hisense and good sound bar...i willl. Need a Hisense expert probably to. Come and tune...\n\n3.5Mhz and 2 Mhz - Wifi connectivity is good\n4.Software is seamless so far as i use OTT apps and i dont have DTH\n5.Installtion took 5 days and multiple social media escalations and follow up\n6.The finish of product is premium\n7.They have a pretty good call centre.. Where calls ar attended\n\nOverall... I feel.. Should have gone for normal 4k hisense TV... Ans should have bought a Good sound bar... Probably would have bought their 58inch TV...",
            "Product is of good quality but sound of tv is not clear & picture fast motion are not appropriate",
            "The sound is very good as a sound expert.\nThe picture is pure 4k quality as it is SONY TV.\nAPPS ARE working too good.\nOverall is fabulous",
            "Bought the TV during republic day sale.\nTV does not disappoint.\nSW is fast and snappy, eventhough it is Android 9.\nStrangely, some of the apps post installation does not show up, have to check out if it does to incompatibly or age restriction.\nPicture quality is good especially 4k version or even 1080i from stb.\nSound is super awesome.\nHopefully longitivity of TV is good, since it is unknown brand.\nRemote quality could be better, bundling of gamepad if given would be really nice.\nViewing angles being VA panel has its downsides.",
            "I am sharing my experience after the usage of 2 weeks. Firstly Cons:\n\n1. Hisense claiming that it has JBL sound bar. But sound quality is not as expected. But u can enhance by connecting additional sound system.\n\n2. Motion control is not that promising while playing hd and hd ready content. U may feel picture lagging in normal scenes also. It is Ok with 4k content.\n\n3. Pixel bleeding is there around the corners of the TV. however it is visible while watching tv in dark room. During lighting conditions it may not visible.\n\nComing to Pros:\n\n1. Gives premium look and feel. It changed the look of my Hall\n\n2. Os is not lagging at all and smooth too.\n\n3. Picture quality is awesome while watching 4k content. All tv features in terms of picture quality are doing good with 4k content only.\n\n4. Back light brightness is fair int this price segment. No other brand is providing 400 nits of brightness in this segment. It enhances picture quality.\n\n5. There are more customisations are provided to enhance picture quality based on ur requirement.\n\n6. Best value for money.",
            "Best thing in this led is Price..\nAnd sound quality is best.. at this price ..\nSuper vedio quality..\n\nAndroid system is also very smooth work as mobile.. smoothly",
            "The biggest challenge will come after delivery, no one from installation team is allocated for next 2 days from Flipkart team.\nHats off to HiSense OPS team, as they understand customer problem and try to resolve it. They have great customer prompt service.\n\nTV is just great. After using 6 days I can say that it value for money. Picture quality is amazing, sound with JBL will give you great effects. Only if you want to see the picture from more than 130 degree angle than it can be bit low in colours. So not preferable for corners view. Otherwise best TV in this range.",
            "Very good purchase at this rate.. super cool instalation got installed in the next day itself..\n\nPros\n\n1. Very good picture quality\n2. Super sound\n3. Very good connectivity\n4. Good viewing angle\n\nCons\n\nBass is low..\n\nI was having super confusion which one too chose i have compared with all possible matches, iffalcon, thoshiba, vu, Kodak, hisense a71, one plus ..but i got very good reviews for this one and it's a world wide brand",
            "Installation done & will share the feedback as early as possible. Overall happy with the product and excited as well to use the Smart Tv.",
            "After using 2 + month I must say it's good deal under 40k. Right 55\" under 40K 🙃🙃🙃.\nPicture quality, sound and tv overall performance is more then good enough. Model is nice and attractive one.\n\nAs usual all other brands installation part suffer from third party installation. They are always seems to be in hurry. They just comes to unboxing the product not providing demo.\nIt's a must buy product even u have to pay 45-48k for 55'.",
            "A Good product specially if you also use set top box and watch HD channels.Picture quality after upscaling is really good specially set top box point of view.It shines here were as others struggle when you play hd content through set top box on a 4k tv.\nSound is good when compared to other TV's but not as good as advertised for the premium paid here for the sound one can get a sound bar which would give better results and also be more flexible to use.\n\nBut as a single product it's still a good one.Extra warranty during some sales makes it a good reason to neglect the fact that it still runs Android 9.\n\nIn short a decent product.\nHisense 55A71F With a seperate sound bar would be a good option too",
            "I searched one month multiple tv under 50k.but this tv served my purpose . I am writing this review after 5 month. Nice display performance and sound. Only thing I see is if you switch off tv and next day if u try to switch on , bluetooth remote pairing takes time .else tv is pakka and responding and streaming content well .go for it .",
            "This review is after 1 week of usage:\n1. Sound is awesome....I can easily hear audio from net content in 20-25 volume level....plus the sound modes let you choose a base heavy to clear vocals as per need\n2. Picture quality is very good...contrast levels are excellant considering it's a VA panel\n3. Installation guy always try to push their own wall mount but there is wall mount in the package...in my case installation was done promptly\n4. I have really enjoyed you tube content, prime, hotstar content because of excellant picture and sound quality\n5. No connectivity issues so far....wifi connection stays solid\n6. Very good value for money considering I got my 55 inch tornado for 44k approx. With the sound bar\n7. SD upscaling is decent\n8. Memc is gud\n\nReally loving this...may it could be just that I had 8 year old 32 inch tv (samsung) before.may be if you are coming of a newer tv to this one ...you may not notice such a difference\nKudos to flipkart for prompt service....",
            "First of all design and Look is really premium and superb with almost no bezels and a sleek soundbar at the bottom with a ring LED\n\nPicture quality is good and sound quality is very good, I felt if bass can be enhanced little more then it would have been excellent\n\nAndroid is smooth like butter\n\nConnectivity and remote is very good\nOverall happy with the product, waiting for demo.",
            "Value for money",
            "Delivery boy was good he delivered led tv in good condition installation was done in time and man demonstrated all things with out most modesty .picture quality for SD channel is not good and view angle is also not good .picture quality for 4k videos is awesome and sound is enough and does not require any extra speaker.",
            "Writing this after 1 week of Installation and use.. smooth as butter.. video quality is just awesome.. 4k content consuming is a bliss.. sound is great.. bass and treble are awesome.. 4k upscaling capability oft his tv is just mind blowing.. 720p content is running buttery smooth..\n\nBeing a va panel it doesn't have bleeding properties and while watching from angle its not fading the colours at all..\n\nNote: picture is taken in bright sunny day.. may see some reflection for that..\n\nLoved it totally...",
            "Tv is good nice Clearite is good gorgeous ❤️",
            "Over all good tv at this price range.. upscaling and smooth motion feature enhance the clear picture quality and blur free performance ..\nTv sound is better when compared other tv.",
            "1)The picture quality is decent when you see the price range.\n2)The audio quality is much better than any other TV in this range or perhaps in this category itself.\n3) Connection is decent enough\n4)The TV boots very quickly and the interface is also real smooth.\n5)The remote is very very useful especially for the elders, and the Google assistant is quite responsive.",
            "Amazing Tv with great pictures quality. Darker black and amazing colour. Sound is average. Bought this Tv specially for my PS5 Console and it’s work perfectly. No input lag awesome 4K gaming experience.\n\nOverall good product :)",
            "The tv is amazing. Atleast by the look. The wall mount protrudes a little from the wall. I feel this is one of the best buy in this range for the size. The other option would be philips 8125 along with motorola zx pro(ips) . I had not heard about this brand till the time I was researching on TV.\nQuality of the remote and the UI is smooth, picture quality is good. I bought ir since it was offered with a sweet deal of 4 years warranty.\n\nThe installation on the other hand was a tedious task . Only 1 guy came and he was inexperienced.\nIt was a hassle convincing him and getting the wall mount on. I think he was trying to sell the extended wallmount which would cost 1.6k extra.\nI actually dint need so went with in the box wall mount.\n\nNeed to wait for a few months and see how the tv fairs. As of now we are enjoying the tv",
            "I am happy to hisense tv good picture good connect dual wifi and sound with JBL assom I love it",
            "Tv is very good with superb picture , build and sound quality. However my review is based on 5 days usage.\nOverall a good budget tv for those who don't have sound bar. If u have sound bar then go with a71 model no need to spend xtra on tornado",
            "The tv delivers on all parameters as advertised. Connectivity is fast . JBL sound gives wholesome experience. Flipkart service is prompt. A great addition to any home!!",
            "I given 4 star for sound Quality because Bass is zero in this tv vocals mids highs are excelent......But sound quality is far better than other TVs .....\nBut refresh rate is 60 if it is 120 this is the best tv in all aspects.......\nBut at this price range no tv have this properties.......",
            "The best part is the picture quality which is bright, crystal clear and soothing. To get the exact effect, play 4K or 8K videos from YouTube. There is no difference comparing to other much popular TV models with huge price tag. Remember Hisesnse is also a TV panel maker and parts maker. VU is one of the client.",
            "Great tv available in the market, display seems to be better than LG or Samsung Crystal series.\nFlawless navigation and smooth, super fast boot time and great sound quality. Though bass could have been better, but overall nice product.",
            "Positive - An ips panel would have been great but still, this tv delivers amazing picture quality with great sound.\n\nDelivery & installation - received the item in good condition with fast installation time.\n\nCons - Remote app is no different than the android tv app and definitely needs a feature packed update",
            "Pros: TV is the best in its segment in 55 inch TVs with all 4k Video (Dolby Vision, HDR 10, HDR 10+, HLG) and sound formats ( Dolby Digital, Dolby Atoms )supported. Best 4K panel (VA) available for the price.\n\nCons: Only issue with this one is attached sound bar has good sound reproduction but with a little or no bass quality. I will highly recommend to get a good Soundbar or Home Theatre speakers ( If you can afford it ). Can't get the lower model and soundbar since you will lose better speakers and mmc chip (which helps with better blacks and motion and subtitle blooming ). I will recommend Yamaha YAS 209 (The best ) or any Sony 5.1 or 2.1 soundbar if you are on a budget.",
            "Outstanding Picture Quality\n102 watt soundbar Superb Clearity\nConnectivity is quickly not required Android 10 or 11.\nSmooth motion And Ultra Dimming works Great\nBest Package in this price range\nColour like A QLed Panel\nI Think No body Can Feel Guilty after Buying this.\nClose your Eyes And Go For It.\nPorts are easily usable.\nTv Looks amazing with Slimest Bazzle i ever seen.\nJbl Hisense And Dolby atmos logo looks very premium.\nI got this tv with Discount 35393 RS. ON Credit card Emi.\nThanks Flipkart And Hisense.",
            "Despite assurance to provide new remote for my Hisense Tarnado TV, Top ORM team just replaced remote and taken back the old remote. Provided remote is of poor quality and worse in operation. There is heavy lag in operation of remote buttons. Disappointed 😞 from the ORM team.",
            "Excellent product. I got five warranty also. So it is really value for money",
            "Overall it is worth, just do not expect much from the JBL speakers l, they are ok for me. Picture quality, connectivity and support application are all good 4/5.",
            "I have purchased it 41499.\nLooking premium in hall,\nchanges the total view in the hall.\nSound bar dont have enough bass, also surround sound option is not there.\nPicture quality at this price range definitely good.\nSpecially blacks are perfect.\nConnectivity is awesome.\nSound clarity is good.",
            "Amazing tv picture quality is awesome sound is too good",
            "Excellent TV.. Response from the hisense Team is awesome..",
            "Picture clarity good\nSound excellent\nAndroid tv\nConnectivity good",
            "I booked 55 Inch Hisensre TV on 8th June and received on 9th June based on reviews shared by earlier buyers and are accurate as the TV meets the expectations and is good in picture, sound and connectivity quality. Thanks Flipkart and Installation Team.",
            "Very sharp picture quality but sound not good & promise for continuous update time to time, I am sorry to say but there is no software update after 4 months & now there is no response by the team over watsapp or telephone.",
            "Nice",
            "Speaker is the main highlight of the TV. However, the audio is not clear to listen to dialogues. It amplifies background score and compromises on dialogue audio. Motion blur handling software is a gimmick. Watching cricket match isn't a good experience as the video gets distorted and tracking ball is difficult.",
            "It met the expectation, happy with picture and sound quality. Inbuilt JBL is really awesome!!...Hardware quality is also good. It's first day feedback, hope TV runs for longer duration without any issues. Thank you.",
            "Faced some issue with sound quality but after engineer visit , everything is ok. And the best thing about Hisense is the customer service. They called me and did the needful in very sort time. They read all the reviews from customers and provide them the solutions. Awesome customer service. Hats off 🙏🏻",
            "It should have Android 10",
            "Worth 1000% superb TV . I Recommend to all this TV,,❤️❤️❤️❤️❤️❤️👌👌👌👌👌👌",
            "Excellent tv with all the features 👌 👏 👍 🙌",
            "Good",
            "Awesome",
            "Nice product",
            "Best ever led smart TV.. Just loved it!.",
            "value for money,best quality",
            "Perfect 4k tv",
            "Awesome experience..",
            "Here is a brief review:\nThis TV looks exactly same as a good LCD phone display, if you're expecting AMOLED like screen then this is not for you, please go for OLED TV.",
            "Overall it's a good TV. Go for it.",
            "Everything is ok but sound is not up to its capacity as mentioned .",
            "Superb Product..Good connectivity options, awesome video quality and ya its loud...:)",
            "AWASOME PICTURE QUALITY AND JBL SOUNDS QUALITY",
            "Must buy budget product. Good picture quality, superb sound, premium look and build quality.",
            "Been using it for about a week now. Picture quality is good at this price point, but the sound out put is bad and doesn't seems to be a jbl speakers.\nRemote control is too small with minimal options and most of the times one gets confused with the buttons while operating as there is no gap between them and end up pressing home button and the quality is just ok.\nOtherwise the tv looks slim and almost bezel less.",
            "Fabulous",
            "Nice quality sound is very good",
            "Very good television. You wont get these features in such low price.",
            "The tv when firstly delivered was missing with remote and other accessories also the tv was faulty .the replacement was given\ndelivery of the tv was soo much time taking after the day i booked it took almost around 1 month to get the tv and installed.Not good.\nThe tv is good but not price worthy.its price should be below 35k",
            "Wohhh...nice picture quality,,,unbeatable sound quality.....\nHisense no.1",
            "Good one\nBut\nOld software version..",
            "Value for money go for it but go for normal version no for jbl speakers",
            "Excellent",
            "Pictures and sound quality are great but instalation service are bed",
            "Best in the market",
            "Tv is very good but sound quality not upto the mark",
            "Good",
            "Picture quality good, sound quality super, awesome TV, value for money",
            "Great picture and sound experience",
            "I got a really cool deal on BBD, and I must tell for this price it's more than worth, the picture quality is amazing, sound is also good if you have a small room definitely no need to attach any extra sound. Only turn down is the android 9 if it really matters",
            "Good Product... Look wise & picture quality amazing 👍",
            "I love this tv sound quality is amazing",
            "Base is less, auto mode voice is less",
            "Just awesome, Best Smart tv\nSound quality is just awesome\nand picture quality is also very good.\nRemote control very fast",
            "Great product & valuable product this is amazing",
            "I already used 43inch tv. 1year usages No problem for me. SO I ordered n BB days 45k 55inch JBL 🔥. Fabulous 🤗. So Google voice msg Little bit lag!! Android 9 upgrade i don't no!! Go it for HISENSE Brand thanks 👍",
            "Good product value for money. But delivered promptly. Installation bis delayed called no response finally installed. Pushing for insurance. Expecting Good service and support.",
            "TV is okay.. but the smart remote stopped working after 2 weeks of purchase. Very bad quality of TV remote and without proper remote there is no use of SMART TV",
            "Remote stopped working in the first 3 weeks of installation. Really disappointed.",
            "Top class sound n picture quality. JBL Speakers output is great. Only problem is viewing angle, the picture quality changes slightly if you view the tv from side angles. Hope HISENSE comes soon with an IPS Panel",
            "Picture quality is good but in terms of sound quality, hisense has provided JBL sound system which is not that much impressive in bass , though mid range vocals are good.",
            "Overall ok but not up to the mark as described",
            "So good 👍",
            "Aswm Tv in Budget. And Sound is like a Wedding Speaker.",
            "Value for money,great sound",
            "Decent",
            "Good 55 inch 4K TV.. Picture quality is good.. but there is leakage.. JBL speaker are good.. WiFi connectivity is good.",
            "Installation is done in approx 15 days (very bad)\nBut hisense TV is overall good\nBest picture quality\nGood sound\nGood connectivity",
            "Nice 🙂 tv awesome Dolby Atmos sounds",
            "Good 4k and connectivity\nSound Quality also good",
            "Sound: 5/5\nPicture: 4/5\nRemote layout: 1/5\nPrice: 5/5\nApplication UI: 5/5\nConnectivity: 4/5\nWarranty duration: 2/5\n\nOverall, its a must buy, as it offers much, when compare to others in this budget. I am using this product since couple of weeks, and i find it good, but not to compare with LG, Sony, Samsung, etc. Its better than MI.",
            "Good picture quality awesome tv",
            "Good product.",
            "Awesome product...value for money..👍",
            "Good picture quality but sound not up to the mark",
            "Picture quality is good but sound is not what i was looking for doesn't have bass and doesn't satisfied with Dolby.",
            "Amazing tv at this price. Fully auto upscaling to 4k. Online content is picture pefect. Delivery and assembling is fast. Sound is loud n clear. Just plug n play, not much to do settings for.",
            "Tv is working good, I mainly bought for dual band WiFi and audio/video quality, both are satisfying.",
            "Great Picture quality and sound.\nValue for money.\nVery thin bezels with aesthetic looks adds beauty to your living room.\nYou will enjoy more, with 4K content with dolby audio.\nLoved this product...",
            "Excellent product...Happy & Satisfied with product",
            "Just terrific product *buy 2-3 more for my relatives\n# picture quality is awesome as Dolby Vision support\n# sound is terrific due to JBL sound system and Dolby Atmos\nTill Now no complaint ....\n# just go ahead with this product you don't waste single penny with this product",
            "102 wats, tornado 🌪️🙏🙆🙆🙆🙆🤦🤦🤦....the only drawback is sound.....no tornado no tsunami....if u you're buying by seeing JBL or 102wats then surely you regret like anything....it's not at all 20wats sound..... instead buy normal 4k tv along with sound bar vth this same price.....or go for nokia tv with 60wats....it has decent sound.... however u can not expect bass in these TV's for sure....",
            "Awesome tv just go for it.",
            "Quality is good but zero customer service. Please don't purchase this brand by spending some money go for other model\nOverall experience was very bad",
            "Nice product in economy range👌",
            "Exalent picture quality.blacks are deep black.colurs are vibrent.jbl sound superb no need external sound system .blindly go for it .......",
            "Very much impressed by the efforts of Hisense team specially customer satisfaction department who take care to solved my some problems regarding video quality. Never expect such a great efforts for their customers . Now always a big fan of HISENSE product. Thanks a lot",
            "Picture quality is awesome just for it..Sound not much expect..Overall superb",
            "Worst , vu is better than this, dont waste money in buying this product",
            "Picture was ok but sound don't expect like 102, u have to buy sub woofer for music lovers.",
            "Best one",
            "Amazing packing\nAmazing TV",
            "Its very worst experience of buying this television.... quality check was not happened properly before delivery..don't go for it...\n\nPathetic delivery and worst experience...",
            "Fantastic",
            "Must buy if u want TV under 50k, superb pictures quality, jbl front fire sound quality",
            "Great experience. Only gripe I feel is the dialogues in movies feels a bit muffled by the bass. But overall very good tv.",
            "Good quality and super",
            "Good sound quality",
            "The sound quality is not like a JBL speaker and not as like 102 Watt. The Picture quality is average.",
            "Worst response",
            "Good 👍",
            "Awesome product and mainly thanks to Flipkart for fast installation. Really I’m satisfied with product",
            "It's a wonderful TV, full Paisa wasool, i love this",
            "Iam really happy picture clarity equal to sony beautiful model ilove it",
            "Sound quality and picture quality is amazing , Very nice product",
            "Good product in a budget range .... Sound was just awesome as it already mention ... Picture quality is also good as per price segment ...\nPS - please don't compare with top notch brands 😀",
            "The TV is quite well. However the pannel quality should be slight poor than the other brand like Sony, Samsung and LG. Company to take care it and use good quality pannel.",
            "Very nice",
            "Really very nice, picture quality is awesome, can compare to top brands like Sony, LG and Samsung and finally value for money.",
            "Nice tv",
            "Sound Quality is mind-blowing",
            "Very nice product sound quality is awesome buy this product 👍",
            "Good no issues",
            "Super tv at low cost.",
            "Best tv by hisense\nGreat sound quality",
            "Good product, worth of money.",
            "Overall Good",
            "It is awesome.\nAmazing",
            "Good",
            "Super & nice TV",
            "👌 All things are good but sound was not clearly audible but in music it is good",
            "Very good product. After sales service is up to mark. Prompt in solving query",
            "Good item",
            "Excellent tv in this price segment picture and JBL sound quality was superb thanks to hisense",
            "Worth for money and best experience, Love it",
            "Sound and picture is not good at all...",
            "Overall good",
            "Very nice value for money product",
            "Best Tv in this price range. I have no regrets after taking this TV. i love to watch movies and web series on this tv. And after taking this TV, I did not watch movies in mobile at all. sound quality is also good no need of soundbar",
            "Amazing to in this price range.\nPicture quality is superb\nSound quality is amazing for one master bed room. If you are looking for a better sound then you can go for an extra sound bar would help.\nOther than that connectivity is very good. Feedback written after 2 weeks of usage.",
            "Very good tv in all aspects",
            "Awsome and very nice",
            "Good product, really I like it",
            "Good 👍",
            "Must buy must buy awesome television clearity",
            "It's awsome",
            "Sound quality excellent\nPicture quality good\nOverall excellent",
            "Must buy led tv with this price range.",
            "Good Tv. But little bit expensive.",
            "Very best 4k TV",
            "Looking premium in hall,\nchanges the total view in the hall.\nSound bar dont have enough bass, also surround sound option is not there.\nPicture quality at this price range definitely good.\nSpecially blacks are perfect.\nConnectivity is awesome.\nSound clarity is good.",
            "So amazing TV & Sounds. Wel & good. Osm!!. 👌",
            "Good tv",
            "Good",
            "Very nice tv",
            "Liked it so far",
            "Good",
            "Super quality TV comparing to any other TV brands👌👌👌👌👌🇮🇳",
            "Picture quality and sound is awesome I like this TV",
            "This tv is working absolutely fine",
            "Best inbuilt speaker",
            "Best TV",
            "Its amazing pictures quality and Atmos sound quality\nValue of this cost really amazing 100% sure compare to Sony picture quality, sound only not good very low other wise excellent\nPicture quality 10/9\nConnevity 10/10\nDesign 10/10\nPerformance 10/9\nSound quality 10/1 waste of sound bar effect less very very low",
            "Excellent product in this price segment. Amazing picture quality, Dolby sound seems to be sensible.",
            "Wonderful",
            "Very good product easy access for connectivity with other devices screen is also awesome and thanks to flipkart and hisense for wonderfull product",
            "I'm very much satisfied with the tv. The speaker is really outstanding and unbelievable sound effect.",
            "Worth for money...hope no problem with the quality..",
            "sueprbbbbbbbb tv amazing i am happy thanks to flipcart👌👌👌👌👌👌👌👌👌👌\n\n1.superb picture quality,⭐⭐⭐⭐⭐\n2.superb sound⭐⭐⭐⭐⭐\n3.amazing connectivity⭐⭐⭐⭐⭐\nin this price hisence tornado 4k ulta hd amazing.....",
            "It was good in initially days",
            "Awesome products pic quality good",
            "Good sound, quality value for money",
            "Best TV under this budget.",
            "Great product",
            "It's very good 👍",
            "Good quality picture and sound.Value for money.",
            "Excellent TV",
            "Awesome TV.",
            "I like it I enjoy this TV",
            "Very good must buy thanks Flipkart",
            "Good tv for the price.",
            "1. Good picture quality. 2. Awesome sound quality 3. Low cost with inbuilt 6 JBL speakers 4. Worth for money",
            "I bought this product after lots of research & reviews. Product is justifying its price till date.",
            "Just waiting for an upgrade of android OS...Everything is perfect. Blindly we can buy...",
            "Good tv",
            "best",
            "Best TV in budget range tv.\nAwesome connectivity.",
            "It’s nice",
            "Nice quality and service. Thanks.",
            "Very nice paisa vadul product basd is much better if possible as comparrision of Jbl speaker",
            "Display is good, but sound quality is not as expected",
            "Just awesome...purchased it 7 months back...",
            "Nice Product 👍",
            "Very good tv with 4 years warranty....no laggs ...no issues till now from July...JBL soundbar also fantastic. .. colour saturation is great......superb purchase!!!",
            "Excellent performance",
            "It is worth of money..",
            "Good",
            "Awesome picture quality with fantastic sound",
            "Best in market..",
            "Just Awesome.\n\nYou can find little bit back light bleeding.\n\nGo for it, best tv",
            "The speaker's max sound is like a 50W one. Also bass should have been deeper. Treble is fine. Other than that all good in the TV.",
            "Its not up to the mark as 4K\nEven TCL clarity is much more\nSound is awesome",
            "Super tv",
            "Worth for money",
            "It's good product, to see Olympic in this tv is a amazing experience. Thanks",
            "Very good product...",
            "The led has vibrant colours and equally good sound. Loved my purchase. The delivery and installation was also very quick . Worth a purchase .",
            "Best 4k tv and jbl sounds best\n\nI satisfied with tornado",
            "Still not installed. The installation number they gave when calling it always connects to the person who says he is on leave. They will assign someone else.\nStill not opened the package even after 10 days of purchase.\n\nUnderstandably this is covid times. But these kind of services where open for more than 2 weeks in TN.\n\nAt least they could have connect me to a person who can say when can they install the tv\n\nUpdate.\nInstalled the TV the next day the review was posted.\nIt could have done earlier but I appreciate it. 3 star for service. For now. Will update the product rating later\n\nUpdate 2/7/2021\nThe TV seems fine except some frame drops. Which is solved by disabling some video smoothness settings. Though not ideal but it works a little.\nI am not sure about the audio yet. The house is not set properly and due to echo issue using very low sound. But sometimes the audio is not loud enough to hear. Will update about it later",
            "Good cheque after two month after tell you",
            "Amazing smart tv... For best sound sound quality & picture quality that's amazing...! Connectivity power is so good..! i suggest you should buy??",
            "Very good at this price range Sound, Picture Quality Super",
            "Awesome pictures quality with dolby vision with 101 watt jbl inbuild soundbar really Awesome",
            "Overall nice product. Must recommended",
            "Awesome TV, value for money. JBL sound bar is frosting over cake.",
            "Best buy ?",
            "Great TV with great picture quality.",
            "Good product..",
            "The satisfied with tv performance and sound quality. Instalation done on time",
            "Sound and picture awesome.. I impressed it",
            "The installation of this TV has been done after 5 days and now the TV is working fine. We are satisfied.",
            "Video and audio quality (JBL speakers) is awesome but the best thing is it's connectivity dual band wifi, which u won't get in any tv in this price range",
            "I love this tv 55inch big screen sounds quality super ❤️❤️❤️❤️❤️",
            "Superb tv",
            "Happy to use this product ,I review this product after 7days .... such a mind-blowing products thank you hisense 🤘🔥👍",
            "excellent 👌",
            "Sounds quality is very good. Pictures quality is good. In some channel picture blur. But I ask to technician he says it depends on input of channel. It requires hd input or 4k input. I think he is right.connectivity no problem. Look is very good. Price is affordable. Overall Good tv. I recommend it to purchase it for budget segment. If your budget is high then you have to go for samsung,LG or Sony.",
            "Fine product, But Audio quality is ok but not expect 102 watt blast.",
            "Best purchase",
            "Excellent sound 👌",
            "One of the best purchase.. Full value for money.. Awesome picture quality and sound",
            "No option for open pendrive at anytime\n\nOption only at Power-on time\n\nMobile Casting is speedy and perfect\n\nAttached JBL Speakers are excellent\n\nAged people cannot operate easily as Cable TV option is not easily accessable\n\nPhysical buttons are missing expect Power button",
            "Great value for money.Cant match the Image and sound in this price range.",
            "Grab it 💥\nAmazing 🌈",
            "It’s a fantastic buy and a real value for money .",
            "Good display and sound!",
            "Best for the budget. Size of the remote control is small 🥴🥴",
            "Ok",
            "Good product",
            "nice tv",
            "Good tv in value for money",
            "Very nice product... Very satisfied but can't able to adjust bass effect as it's not manual... Some time it's difficult to hear diaulauges",
            "I'm really excited and Thanks Flipkart",
            "Awesome product must buy!!!!",
            "Good",
            "super\npicture quality is awesome\nvalue for money",
            "Very nice",
            "Exalent tv",
            "Good product",
            "Awesome tv in this price range ....picture quality is superb....and JBL speaker adds 5 stars ...great sound\n..VALUE FOR MONEY ....",
            "Best value for money TV..just go for it.",
            "I am very satisfied this product.",
            "Super",
            "Excellent Picture and sound quality for this price",
            "Nice product with good picture and sound quality.",
            "Super sound",
            "Good",
            "Amazing buy... worth every penny",
            "Sound effect doesn't fulfill my expectations .....other features are good.",
            "Great features at reasonable prices. Don't worry about the brand .Hisense is a international company.",
            "Good sound& pitcher quality compared to high budjet tvs,",
            "Only problem I found is that when we see sports there is some blur in cricket, when ball is moving so fast. I personally used LG and Samsung also but this one is mind-blowing and justifying it's price.",
            "For me and with my product the experience is really awesome. Picture quality is best in the class, sound is really good, connectivity overall worth the money",
            "Good",
            "Excellent TV",
            "Picture quality is excellent and sound is amazing...value for money product...",
            "Excellent tv in budget price... very happy with JBL speakers...",
            "Good picture quality with very good sound quality. I bought @44999. Really enjoying it.",
            "King of segment must buy",
            "Nice",
            "Nice tv",
            "Awesome product... Value for money.",
            "Awesome picture clarity, Amazing bass, Value for money",
            "Excellent product",
            "Just wow\nValue for money\nBest connectivity\nPrasadarao Nellore",
            "Good, nice one",
            "Excellent purchase",
            "Super tv with JBL speaker",
            "fantabulous 🤘👌🏿👌🏿\nHi Guys I am writing this review after 5 month of purchase .of My Hisense 55 Inc tornado Tv . 1st it's worth every penny..\n2nd Awesome tv for this price .. i am very happy that i purchased this brand\n3 if u looking for budget 55 Inc tv just don't think go for it..it's worth it.\n4th thank you Hisense..and Flipkart.\nFor on time delivery.. And installation.\n😜🤪🙏",
            "Excellent.",
            "Value for money. Very smooth working connectivity is awesome even in 20mbps speed. Just go for it",
            "Nice tv",
            "Nice ... Best product\n\nPicture-very very good\nSound - good\nValue of money : super",
            "Very nice product.... Super picture quality... Sound was fabulous..😍 value for money and great product",
            "Was delivered in time. Installation was completed very fast. Good experience.",
            "Amazing product. Must buy.\nExcellent after sales service.",
            "All set....I find one very good tv at this price.\nEverything good\nGo for it"
        ],
        "likes": [
            "348",
            "43",
            "56",
            "53",
            "21",
            "19",
            "75",
            "36",
            "24",
            "51",
            "70",
            "78",
            "6",
            "6",
            "15",
            "8",
            "10",
            "9",
            "11",
            "19",
            "3",
            "3",
            "3",
            "9",
            "9",
            "3",
            "4",
            "5",
            "5",
            "5",
            "2",
            "3",
            "3",
            "4",
            "2",
            "2",
            "0",
            "0",
            "0",
            "3",
            "3",
            "2",
            "6",
            "3",
            "2",
            "2",
            "2",
            "2",
            "3",
            "1",
            "1",
            "1",
            "1",
            "6",
            "0",
            "0",
            "0",
            "3",
            "4",
            "1",
            "2",
            "3",
            "3",
            "3",
            "3",
            "5",
            "15",
            "6",
            "8",
            "8",
            "4",
            "4",
            "8",
            "1",
            "2",
            "2",
            "2",
            "2",
            "1",
            "2",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "10",
            "1",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "4",
            "5",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "110",
            "12",
            "9",
            "12",
            "3",
            "2",
            "34",
            "13",
            "10",
            "35",
            "11",
            "9",
            "0",
            "0",
            "4",
            "1",
            "2",
            "2",
            "4",
            "10",
            "0",
            "0",
            "0",
            "4",
            "4",
            "1",
            "1",
            "2",
            "2",
            "3",
            "0",
            "1",
            "0",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "3",
            "3",
            "0",
            "10",
            "4",
            "2",
            "2",
            "5",
            "3",
            "7",
            "1",
            "1",
            "1",
            "2",
            "4",
            "2",
            "1",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "9",
            "2",
            "4",
            "4",
            "1",
            "1",
            "5",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "9",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "2",
            "2",
            "1",
            "1",
            "2",
            "9",
            "16",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Is it better than Nokia Tv? Looks are not so prominent hence which one to choose is quite confusing",
            "Q:It's picture quality better than motorola zx pro?",
            "Q:Can we Install thop tv",
            "Q:Can we install MX player in this TV?",
            "Q:How to turn off the motion smoothing? In fast moving scenes, like running or fighting scenes, there's a weird motion surrounding the subject probably because of converting 30hz to 60hz.",
            "Q:What is the peak brightness of this TV",
            "Q:How sd channels works on it??",
            "Q:It's 350nits only",
            "Q:Does it has humidity 2.1 connectivity and what is refresh rate of the TV?",
            "Q:Why Tv Protection plan not available for this tv? please reply i want to buy",
            "Q:What is the distance between stand legs? My tv unit base width is 114 cm, will it be ok for 55 inch tv?",
            "Q:We can connect with home theatre speaker. In this TV.?",
            "Q:After connecting home theater, can both the home theater speakers & its JBL speakers can work together or one set of speaker will work at one time (either JBL or Home Theater)?",
            "Q:Is it OLED? Can it be connected to PC for gaming? Response time and Refresh Rate?",
            "Q:How many cm is it??",
            "Q:Can we use ps5",
            "Q:Can we expand the storage",
            "Q:Which type of panal in this 55 inch tv IPS panal or VA panal?",
            "Q:Does it have 3.5 mm jack?",
            "Q:What is the usable rom ?",
            "Q:In this tv picture off feature available",
            "Q:What is manufacturing month & year of this product?",
            "Q:Is there power button present in this Tv or other functions button in this TV",
            "Q:Is this tv will update to Android 11 or will it be upto only android 9",
            "Q:Does it support Miracast screen sharing?",
            "Q:What is the Android version of this tv?",
            "Q:Does the inbuilt speaker support Atmos?",
            "Q:Does tv remote has motion sensor? Does this tv show cursor while we move remote?",
            "Q:This tv is included table mounting and wall mounting?",
            "Q:Tv doesn't show dolby vision symbol or option even if I play dolby vision videos in YouTube. How can I know dolby vision is active or not",
            "Q:FLAC and WAV format support or not",
            "Q:Is the TV has MEMC technology",
            "Q:Can we use both TV speakers and soundbar at the same time with hisense tornado TV",
            "Q:This TV support analog TV reception and Digital TV reception?",
            "Q:We can download jio tv in this tv",
            "Q:This tv Support e-ARC...?",
            "Q:Is Bluetooth inbuilt in this TV ?",
            "Q:Is it better than Motorola Revou TV",
            "Q:Android side regularly updated coming",
            "Q:Can we play pubg??",
            "Q:Does this support dts hd master audio ?",
            "Q:Which get beter picture quality ( only picture quality )hisens A71 f vs A73 f #omni TechRetail",
            "Q:Is there chromcast feature available in this tv?",
            "Q:This tv have va panel or ips panel or ads panel",
            "Q:How is the bass quality of the tv",
            "Q:What is the meaning of 4k ?",
            "Q:Can we connect 64 GB micro sd memory card to the TV?",
            "Q:what is the difference between ultra hd tv or 4 k tv ?",
            "Q:What is Dolby Vision?",
            "Q:vu ultra is better or hisense tornado is better",
            "Q:Will this TV supports dolby digital+ sound from sun direct dth set top box?",
            "Q:Is this a smart TV or an android TV?",
            "Q:Is this QLED ?",
            "Q:Will this tv get auto update to android 10?",
            "Q:Does this TV come with Dolby Vision & Dolby ATMOS?",
            "Q:Is this support Hevc(H.264 H.246 video format?",
            "Q:Which is the best tv hisense tornado or vu action cinema series",
            "Q:Does this TV come with JBL Speakers?",
            "Q:Does this TV come with Dolby Vision?",
            "Q:Does this TV come with Dolby ATMOS?",
            "Q:How many speakers are there in this TV?",
            "Q:In this tv software update or security update is coming or not????",
            "Q:What is the ram and rom configuration?",
            "Q:Do we need to buy a stabiliser for this ? Does it have inbuilt to tolerate power fluctuations.",
            "Q:Does it come with Prime Video?",
            "Q:Does it support optical output ?",
            "Q:What is the Processor Type?",
            "Q:Does it support Audio return channel ?",
            "Q:How to perform a Firmware / Software update in this TV?",
            "Q:Does it have front facing speakers or bottom firing speakers?",
            "Q:Which tv is good hisense tornado or Toshiba 55 inches",
            "Q:How does this TV set the picture mode?",
            "Q:Does it have earc port which supports Dolby Atmos",
            "Q:can we install jio tv or jio cinema",
            "Q:Can we access Google assistant without remote?",
            "Q:Will this tv gets android 10 update or not?",
            "Q:3 questions, plz elaborate 1. Is tornado comes in 50 inch screen size? 2. Can I install app frok .apk file? 3. Does it hv eqvilizer?",
            "Q:Does it support 4k @30hz or 4k @60hz and does it have variable refresh rate feature?",
            "Q:Are we able to download apps which are not in the tv?",
            "Q:Speakers are inbuilt or not??",
            "Q:can i connect iphone with this? or can i play pubg pc in this..?",
            "Q:Is is 8bit Or 10bit panel",
            "Q:Does it support dual band wifi and upscaling technology?",
            "Q:Does it supports 5G connectivity (I mean does it having any sim card slot)?",
            "Q:Is this TV a certified Android OS TV?, If not how do we get Android OS updated in future?",
            "Q:Any backlight bleeding?",
            "Q:Is it worth buying or not",
            "Q:stabilizer want or not",
            "Q:Can we do mirroring with an android phone and play video?",
            "Q:Does it have play store or not?",
            "Q:What is the Maximum Operating Distance of the remote ?",
            "Q:What is the sound output?",
            "Q:Can i connect my Dolby Atmos enabled soundbar to the Hisense Tornado 55 inch via HDMI ARC port to enjoy dolby Atmos audio content on Netflix or other apps.",
            "Q:HDMI eARC AVAILABLE..?",
            "Q:Sony LIV and other Sony applications are supported?",
            "Q:Does it have patchwall feature ?",
            "Q:Is No Cost EMI available on this product ?",
            "Q:What is the internal memory of this product ?",
            "Q:Does it have front facing speakers or bottom one?",
            "Q:What is the actual watt consumption when tv is on?",
            "Q:What is contrast ratio? and how much brightness in Nits? for this tornado model",
            "Q:Does it support airplay",
            "Q:What is the Parent company for this Brand..?",
            "Q:Can i play games in this tv",
            "Q:I was going through the settings on my friends Hisense Tornado. This TV has option to activate both Dolby Atmos and Dolby Digital Plus at the same time. Is that possible?",
            "Q:Does it support HDR10",
            "Q:Can I connect my fire tv stick 4k ?",
            "Q:can i clean the tv with colin",
            "Q:This is penal type",
            "Q:is hdmi supports 2.1 Version?",
            "Q:it's hdmi supports 2.1 version?",
            "Q:I am not able to use voice option in remote. Any suggestions?",
            "Q:Can we connect Dolby Atmos soundbar to it?",
            "Q:Can i connect mobile phone with bluetooth ?",
            "Q:what is the contrast ratio? how is black level and motion blur?",
            "Q:JIO TV supported as App?",
            "Q:Which is the best sound software Dolby atmos or dts virtual x",
            "Q:Which is the best tv hisense a71f or hisense a73f",
            "Q:does this tv supports dolby digital plus audio?",
            "Q:How to open the USB? Input option not available USB?",
            "Q:Dolby Atmos needs speakers arranged in specific positions like towards right and left of the viewer and at the ceiling. Since all speakers are in front, how is this a true Dolby Atmos setup ?",
            "Q:Is tv work as a digital frame",
            "Q:Can I connect HD webcam to this TV for zoom or Google Meet app.",
            "Q:What is Dolby Atmos?",
            "Q:Which app should i use for remote control of TV?",
            "Q:Does it has vga port?",
            "Q:Can I run this tv on household inverter?",
            "Q:What items are included in the package, in addition to the TV and remote?",
            "Q:Does this tv has tune in station app?",
            "Q:Does it support 2.4Gh and 5 Gh both?",
            "Q:Does it support mkv video format ?",
            "Q:Do I need to buy dongle separately to use AI feature ?",
            "Q:Is there a LAN port ?",
            "Q:Can we ugrade to future operating system?",
            "Q:Does it support screen mirroring from Windows 10 laptop?",
            "Q:Will it support 4k content on Netflix ?",
            "Q:Do we have voice remote with this TV ?",
            "Q:Does it have a built-in stabilizer?",
            "Q:Can I use it as a screen for power point presentations?",
            "Q:Does it have upscaling technology?",
            "Q:Does this TV have optical out port which supplies dolby digital signal?",
            "Q:Does it support wifi ?",
            "Q:Do we have Built in Alexa in this ?",
            "Q:Do we have google play store or just limited apps?",
            "Q:Can I mount it on wall ?",
            "Q:Can we play offline videos in this TV ?",
            "Q:Is this made in india?",
            "Q:Does it support google?",
            "Q:Does this TV have blutooth support?",
            "Q:Is it suitable for ps4?",
            "Q:Does this TV has Dolby sound ?",
            "Q:Does it support all streaming apps like amazon prime, hotstar, jio cinema?",
            "Q:Do we need to pre-order the stand and material to wall mount ?",
            "Q:Can we buy that TV on EMI ?",
            "Q:Do we have wall mounting at the same time of delivery ?",
            "Q:Is this an android TV & full HD smart TV?",
            "Q:Does it have HDMI ARC output available?",
            "Q:Does this TV has Netflix?",
            "Q:Does it support 2TB external hard drive?",
            "Q:Does this TV require any home theater for enjoying Dolby audio?",
            "Q:What is the colour of the TV frame?",
            "Q:What should I do if TV is not detecting my USB?",
            "Q:Can we use it for video calling?",
            "Q:How Can I Share My Media File Directly to TV Wirelessly?",
            "Q:Does it also support Miracast ?",
            "Q:Does it have bluetooth remote or infrared remote?",
            "Q:Is sound system provided by DOLBY?",
            "Q:Does this support Voice Commands?",
            "Q:Does it require a voltage stabilizer?",
            "Q:Can I use keyboard and mouse with this TV?",
            "Q:Does wall mount come with the product?",
            "Q:Can I use for sundirect DTH?",
            "Q:Is there any NET Browser for Internet browsing?",
            "Q:Can I use it as computer monitor?",
            "Q:What is the type of display used in this product?",
            "Q:What is the viewing angle of the screen?",
            "Q:Does it support mobile app download?",
            "Q:What is the resolution of this TV?",
            "Q:Can we set the screen saver on this TV?",
            "Q:Will it work with dish tv setup box ?"
        ],
        "answers": [
            "A:i have bought both the TVs, and i think hisense would be a better choice than Nokia.",
            "A:Yes",
            "A:yes",
            "A:yes you can install MX player in this tv",
            "A:turn avarage",
            "A:390 too 400 you can say",
            "A:SD Channels works as expected, we do have upscaling and it works really good but we also need to understand resolution ratios and how it impacts the viewing angles. In short works fine.",
            "A:400 nits small budget best Smart tv",
            "A:or does not have HDMI 2.1 works on older 2.0",
            "A:company providing warranty for 3 years, so I think !",
            "A:Please don't buy,but flipkart always be with you for your support",
            "A:Yes you can for sure. But the TV speaker (JBL Sound Bar) attached below is good enough and tooo damn amazing. The sound is out of the world!",
            "A:No only one will work either home theater or JBL inbuilt. BTW the speakers are loud but the auto management of sound is not good like all of a sudden it becomes too loud while an AD comes.",
            "A:No",
            "A:139.7 cm (55 inch)",
            "A:never",
            "A:yes",
            "A:VA",
            "A:yes",
            "A:11GB",
            "A:yes",
            "A:November 2021",
            "A:There is no power button or any other functions button",
            "A:android 9",
            "A:Yes",
            "A:Android 9",
            "A:yes",
            "A:No ... its a normal Bluetooth remote, which keeps getting stuck",
            "A:Yes",
            "A:Active",
            "A:WAV is supported not sure about FLAC",
            "A:Yes..",
            "A:Yes, Exactly & Their Performance Is Pretty Nice.",
            "A:yes it does.",
            "A:NO",
            "A:No",
            "A:yea",
            "A:Can comment on comparison as I have not seen Motorola TV. But this Hisense TV is THE BEST in its segment and top notch!",
            "A:No",
            "A:no",
            "A:no sound quality not good...",
            "A:A73f",
            "A:yes. it's inbuilt",
            "A:VA",
            "A:A bit on the higher side but not too extreme. Better output than other TVs. A music lovers perfect choice and a bass heads price compromise.",
            "A:4K indicates no of horizontal pixels in the TV. The TV is 3840x2160p ie 3840 horizontal pixels and 2160 vertical pixels. 3840 when rounded off in 1000s is 4000. Hence commonly it is called as a 4K TV.",
            "A:There is no memory card slot. However you can use a SD card to USB converter to plug it in USB slot & play your content",
            "A:Ultra HD TV or UHD TV is terminology used for TV having 3840 or more horizontal pixels. Hence UHD TV can be 4K, 5K and even 8K TV are now available in market.",
            "A:Dolby Vision is an advanced form of HDR (high dynamic range) inspired by cinema techonology. It performs scene by scene processing to bring out spectacular color, brightness, contrast and details",
            "A:Hisense only Best.. Many Point view, Sound-picture Clarity- Remote- And important 4years Warranty..",
            "A:it's support' but .. motion blur issues..over all budget friendly tv ..good value more money..",
            "A:This is Smart TV with Android OS.",
            "A:No",
            "A:yes",
            "A:Yes. This TV comes with both Dolby Vision and Dolby ATMOS technologies, the latest and most advanced picture and sound technologies.",
            "A:Yes . All formats supported . It will instantly detects if video/audio is coded as Dolby Atmos+Dolby vision. All you need to open videos in native media player",
            "A:Hisense Tornado had very good picture quality especially the 4K cinemas watching is treat to the eyes and fantabulous sound effect with 6 speaker Dolby atmos effect. High end features, worth to buy!",
            "A:Yes. This TV comes with 6 JBL Speaker System.",
            "A:Yes. This TV is equipped with Dolby Vision.",
            "A:Yes. This TV is equipped with Dolby ATMOS.",
            "A:This TV comes with 4 Full range and 2 High frequency speakers. A total of 6 speakers.",
            "A:no",
            "A:2GB RAM, 16 GB Memory",
            "A:Nowadays all the tvs are with SMPS which can tolerate from 85~265V.But it's always better to use a small computer UPS instead of a stabilizer.",
            "A:Yes",
            "A:Yes",
            "A:Quad Core Cortex-A53*4 64bit, Mali470MP",
            "A:Yes, the TV comes with ARC in HDMI1",
            "A:The TV can be updated over internet by accessing update section in TV settings.",
            "A:This TV comes with Bottom firing speakers.",
            "A:I hav only using Hisense Tornado .. According to me its best . Soumd Quality Better, Pic Quality Awsome",
            "A:You can set picture mode in setting menu or press the key �P. Mode\" on the remote.",
            "A:yes",
            "A:Yes you can. You can also install all the apps available in playstore because it is an Android television.",
            "A:No",
            "A:No",
            "A:1. I guess comes in 3 sizes... 50,55 and 65.i bought 55. 2. I have installed few APK's which were not in playstore. 3. Didn't find any equilizers.",
            "A:it do support 4k @60hz,not sure about the vrr",
            "A:Yes. Without any hurdles",
            "A:yes built in",
            "A:Yes u can",
            "A:10 BIT",
            "A:dual band yes, Upscalling not chk",
            "A:no sim card slots",
            "A:Yes, this is a certified Android tv.",
            "A:not as yet. the TV is pretty good",
            "A:Yes, it's good n as v purchased it only last month so it's too early to say anything.",
            "A:Not",
            "A:Yes",
            "A:Yes. It has Google Play store",
            "A:The remote operates on bluetooth. Hence the voice functionality operates within Bluetooth range which is normally above 10 meters (vary if there is physical obstruction)",
            "A:This TV has powerful 102W speakers.",
            "A:yes",
            "A:yes",
            "A:No. TV stopped working after 50 days and its still not working even after 35 days",
            "A:yes",
            "A:EMI options vary from time to time. Please check offer section for details",
            "A:16GB",
            "A:Front Firing Speakers",
            "A:Power consumption varies by screen size and content which is running on TV. This TVs power cosumption is approx 150W",
            "A:present 400nits brightness increase minimum 500 nits best option for media budget",
            "A:Yes",
            "A:hisence",
            "A:definitely",
            "A:It just means that it supports both audio codecs. But they don't run at same time.",
            "A:Yes. Not only HDR10 it also support Dolby Vision",
            "A:yes",
            "A:Yes",
            "A:VA Panel",
            "A:Yes and with ARC",
            "A:yes",
            "A:pair remote with TV",
            "A:no need, 102 W is enough",
            "A:Yes",
            "A:4K",
            "A:no",
            "A:Dolby atmos",
            "A:no doubt hisense a73f",
            "A:Yes",
            "A:available",
            "A:No , it's inbuilt speakers, super sound",
            "A:yes you can",
            "A:Yes you can connect",
            "A:DOLBY ATMOS enabled TV brings breakthrough immersive audio experience to your home whether it is shows, games or live sports. The moving audio is a major advance from stereo, and even surround sound.",
            "A:Android TV Remote",
            "A:VGA is not there. However you can connect PC via HDMI",
            "A:Yes It can run provided the inverter supports load of TV",
            "A:Wall Mount Bracket, remote, batteries and printing materials like manual and warranty card.",
            "A:Yes. App is available in google play store",
            "A:Yes. It supports both 2.4Gh and 5Gh",
            "A:Yes",
            "A:The TV just needs active internet via WiFi or LAN Cable for AI functionality. No need for dongle.",
            "A:Yes",
            "A:The TV supports OTA (over the air) software updates.",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:The TV operates on SMPS supply and doesn�t need an external stabilizer",
            "A:Yes, by connecting with HDMI.",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:It has got built-in google assistant",
            "A:It has official google play store",
            "A:Yes. Free wall mount bracket comes inpacking with TV as well",
            "A:Yes. Can be done Via USB.",
            "A:Yes",
            "A:Yes. The TV comes with Android OS",
            "A:Yes the TV comes Bluetooth 5.0, we can connect multiple devices.",
            "A:YES,both PS4 and X-box support is there",
            "A:Yes. It is equipped with Dolby ATMOS",
            "A:Yes. Apart from this, many other streaming apps are available in google play store",
            "A:Standsand wall mount is included.",
            "A:Yes. EMI options are available for buying",
            "A:The Wall mouting bracket comes inpacking with TV.",
            "A:It is an Android and 4K TV.",
            "A:Yes, the TV comes with ARC in HDMI1.",
            "A:Yes, it comes with built-in netflix app.",
            "A:Yes",
            "A:No. The TV has built-in Dolby Audio decoder.",
            "A:Black",
            "A:Check if USB is faulty by connecting with a PC. Else try formating the USB drive and then connect again with the TV.",
            "A:There is no built-in camera in TV for video calling. However you can try apps in google play store which use phone camera for video call",
            "A:You may try file sharing apps available in Google play store.",
            "A:Yes. Only for Android Phone. Third-party App needs to be installed for Iphone/IOS.",
            "A:It has a bluetooth remote.",
            "A:Yes. It is equipped with Dolby ATMOS",
            "A:Yes, the TV supports voice command. TV comes with builtin google assistant.",
            "A:No",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:Yes, Browser can be downloaded from Google Play store.",
            "A:Yes ,you can connect with HDMI",
            "A:It uses an A+ grade LED panel.",
            "A:178�",
            "A:Apps can be downloaded via Google Play store.",
            "A:4K Resolution",
            "A:Yes",
            "A:Yes"
        ],
        "likes": [
            "8",
            "23",
            "22",
            "5",
            "3",
            "9",
            "7",
            "5",
            "4",
            "3",
            "5",
            "1",
            "2",
            "2",
            "3",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "1",
            "102",
            "47",
            "15",
            "66",
            "13",
            "6",
            "8",
            "5",
            "6",
            "10",
            "3",
            "4",
            "9",
            "9",
            "9",
            "9",
            "4",
            "6",
            "3",
            "2",
            "3",
            "3",
            "4",
            "3",
            "8",
            "2",
            "3",
            "1",
            "1",
            "1",
            "2",
            "1",
            "2",
            "1",
            "2",
            "2",
            "1",
            "1",
            "1",
            "2",
            "2",
            "1",
            "2",
            "2",
            "2",
            "4",
            "4",
            "3",
            "2",
            "2",
            "1",
            "2",
            "2",
            "3",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1"
        ],
        "dislikes": [
            "0",
            "15",
            "16",
            "2",
            "0",
            "6",
            "4",
            "2",
            "3",
            "3",
            "7",
            "0",
            "0",
            "0",
            "2",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "1",
            "3",
            "0",
            "0",
            "0",
            "1",
            "22",
            "13",
            "2",
            "28",
            "3",
            "0",
            "1",
            "0",
            "1",
            "4",
            "1",
            "0",
            "4",
            "5",
            "5",
            "5",
            "1",
            "3",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "9",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "3",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "7",
            "2",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "2",
            "1",
            "1",
            "2",
            "3",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    }
}