{
    "title": "NOKIA 165 cm (65 inch) Ultra HD 4K LED Smart Android TV with Sound by Onkyo and Dolby Atmos  (65UHDADNDT8P)",
    "product_specification": {
        "In The Box": "1 Television Set, Remote Control, User Manual, Mini AV Cable, 2 AAA Batteries, 2 TV Stand, 4 Stand Support Screws, Wallmount Stand, 4 Wallmount Stand Screws, Power Cord",
        "Model Name": "65UHDADNDT8P",
        "Color": "Black",
        "Display Size": "165 cm (65 inch)",
        "Screen Type": "LED",
        "HD Technology & Resolution": "Ultra HD (4K), 3840 x 2160",
        "Smart Tv": "Yes",
        "Motion Sensor": "No",
        "HDMI": "3 Side",
        "USB": "2 Side",
        "Wi-Fi Type": "2.4 GHz / 5 GHz",
        "Built In Wi-Fi": "Yes",
        "Launch Year": "2021",
        "Wall Mount Included": "Yes",
        "Brightness": "450 nits",
        "Contrast Ratio": "5000:1 (Static)",
        "Picture And Picture (PAP)": "No",
        "Digital TV Reception": "Yes",
        "View Angle": "178 Degree",
        "Panel Type": "VA Panel",
        "Digital Noise Filter": "Yes",
        "LED Display Type": "LED",
        "Aspect Ratio": "16:9",
        "Refresh Rate": "60 Hz",
        "Supported Video Formats": "MPG, AVI, TS, MOV, MKV, DAT, MP4, VOB",
        "Other Video Features": "Sports, Standard, Movie, Music, News",
        "Number of Speakers": "2",
        "Speaker Type": "QuatroX Speakers",
        "Sound Technology": "Sound by Onkyo, Dolby Atmos, 48 W Sound Power, Onkyo Surround Sound",
        "Surround Sound": "Dolby Atmos + Onkyo Surround Sound",
        "Speaker Output RMS": "48 W",
        "Supported Audio Formats": "MP3, WMA, M4A, AAC, MP2",
        "Other Audio Features": "Auto Volume Function, Volume Offset",
        "Number of Cores": "4",
        "Processor": "1.1 GHz Realtek Quad Core Processor",
        "Graphic Processor": "700 MHz G31 GPU",
        "Ram Capacity": "2 GB",
        "Storage Memory": "16 GB",
        "Supported App - Netflix": "Yes",
        "Supported App - Youtube": "Yes",
        "Supported App - Disney+Hotstar": "Yes",
        "Supported App - Prime Video": "Yes",
        "Supported App - Others": "Netflix, Prime, Disney+hotstar, Zee5, Voot, Spotify, SonyLiv, YouTube, Google Suite of Apps and Others Downloadable from Playstore etc.",
        "Operating System Present": "Yes",
        "Operating System": "Android",
        "Screen Mirroring": "Yes",
        "App Store Type": "Google App Store",
        "Content Providers": "Netflix, Prime Video, YouTube",
        "Supported Devices for Casting": "Laptop, Mobile",
        "System Languages": "English",
        "Bluetooth": "Yes",
        "Other Internet Features": "Latest Android 11, Google Assistant, Chromecast Built-in, Google Home, Compatible with Gamepad",
        "Headphone Jack": "Yes",
        "Analog Audio Input": "Yes",
        "Touch Remote": "No",
        "Smart Remote": "Yes",
        "Color Screen": "Yes",
        "RF Capable": "No",
        "Operating Distance": "5 m",
        "Battery Type": "2 AAA Batteries",
        "Other Remote Control Features": "Google Assistant with Netflix, Prime Video and YouTube Hotkeys, Minimalistic Design",
        "Power Requirement": "AC 110 - 240 V, 50/60 Hz",
        "Power Consumption": "190 W, 0.5 W (Standby)",
        "Auto Power Off": "Yes",
        "Sleep Timer": "Yes",
        "On/Off Timer": "Yes",
        "Width x Height x Depth (without stand)": "1450.3 mm x 858 mm x 80.3 mm",
        "Weight (without stand)": "19.6 kg",
        "Width x Height x Depth (with stand)": "1450.3 mm x 934.7 mm x 289 mm",
        "Weight (with stand)": "20.2 kg",
        "Warranty Summary": "1 Year Warranty on Product",
        "Covered in Warranty": "Defect Arising Out of Faulty or Defective Material or Workmanship. Parts and Labour Costs are Covered",
        "Not Covered in Warranty": "Warranty Does Not Cover Any External Accessories (Such as Battery, Cable, Carrying Bag, plastic parts), Damage Caused to the Product Due to Improper Installation by Customer, Normal Wear and Tear to Magnetic Heads, Audio, Video, Laser Pick-ups, Panel damages caused to the Product by Accident, Lightening, Ingress of Water, Fire, Dropping or Excessive Shock, Any Damage Caused Due to Tampering of the Product by an Unauthorized Agent, Liability for Loss of Data, Recorded Images or Business Opportunity Loss.",
        "Warranty Service Type": "Technician Visit",
        "Installation & Demo Details": "Please note that any unauthorized handling or self-installation of the product will lead to return & product warranty being void. We'll facilitate the installation and demo through authorized service engineer at your convenience. Flipkart will communicate the day and time slot of the scheduled Installation & Demo through a SMS and the same information will also be available in your order details page. The service engineer will install your new TV, either on wall mount or on table top. Installation and demo are provided free of cost. The engineer will also help you understand your new TV's features. The process generally covers: Wall-mounted or table-top installation, as requested. Physical check of all ports, including power and USB ports. Accessories also checked. Demonstration of features and settings. Quick run-through on how to operate the TV"
    },
    "product_description": {
        "Sound by Onkyo": "Elevate the joy of listening by experiencing it with all your senses. Indulge yourself to inspire moments of transcendent feelings. Experience best of the best with technologically advanced sound architect-designed and curated by Onkyo. Through Dynamic amplification technology, it captures the energy and dynamism contained in an audio signal, reproducing it without any quality loss. Experience crystal clear sound characteristics with zero feedback and minimal distortions along with >150% more sound clarity.",
        "Powered by Dolby Vision and Dolby Atmos": "Dolby Vision HDR transforms your TV experience with ultra-vivid picture that brings entertainment to life. Dolby Atmos creates powerful, moving audio that seems to flow all around you.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "1",
            "5",
            "4",
            "3",
            "2",
            "5",
            "3",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "2",
            "4",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "3",
            "5",
            "4",
            "5",
            "2",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "1",
            "4",
            "4",
            "5",
            "3",
            "4",
            "1",
            "5",
            "3",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "4",
            "5",
            "2",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review": [
            "HD and 4K videos are displayed excellent and good surround sound. Comes with Android 11 and Google assistant works well.\n\nOn-time delivery and Installation and demo by Flipkart team.\n\nHighly recommend other to purchase Nokia TV who are providing excellent hardware specs with latest software.",
            "Truly a real good tv after 10 days of usage. Sound quality nd picture quality are top notch. Much better experience compared to MI 5X, the nokia sound by onkyo version is real good (well you do have to configure the sound profile). Best thing you can change the audio settings while you are watch something and it won't go to settings page rather it will let you change settings in the overlay itself. Only samsung has such seamlessness other than nokia. Glad i purchased this. Watching through browser on websites is easy too.\n\nThe only con is that Rakuten Viki app doesn't support Nokia TV (if you are into korean series and movies you will know).",
            "Picture quality is good and clear,\nSound quality is good and bass is good, overall experience is good\nWorth buying value for money 💲.",
            "Its a a great tv at this price range..i will say it is just perfect..am completely satisfied with the performance in all aspects..fully recommended..u won't be disappointed..thank you nokia for this amazing product..and the installation was also stress free and quick..go for it",
            "This Nokia TV is more than our expectation and I m so happy with this 65inch Nokia Android TV.Thank you so much Flipkart for super products with awesome price!!!",
            "Searching all the brand finally decided to buy Nokia smart tv after 7 day's using TV my opinion is Picture and sound quality is super good 👌 thanks to Nokia brand 👍 delivery and installation is very nice from flipkart..",
            "A great product from Nokia. Both the picture quality and the sound are top notch. Just hope that after sales service is also of good quality.",
            "Features are good specially sound.\nIt has slow connectivity. It can't reach Wifi as fast as one plus or other TVs.\nOverall good experience and good picture and sound quality if you want to watch normal HD channels.",
            "Excellent TV by Nokia. Went ahead going through all reviews and hardly found any review that would want me to rethink purchasing the Nokia 50 inch. Simply an awesome product at a reasonable price.",
            "I have to say 'I am impressed'. With this price it is giving tough competition to brands like OnePlus, MI, LG, Samsung, etc. and almost beating them in one or the other aspect.\nPicture quality: Very bright, Good contrast, Sharp. Negetive: It's VA panel so color start to Detroit if viewing from a certain angle.\nSound quality: totally impressed, the bass it produces when Dolby Atmos is ON, it's awesome. No negetive\nConnectivity: no issues so far, just when I was setting it up for first time, I...\nREAD MORE",
            "Everything is good but while switching on tv it is taking time",
            "Sound is first class, I often think no other brand can able to match the sound quality of this TV except SONY. Surrounding sound is top class, belive me you may not seen such an amazing theatrical experience in any budget TV's except this one.",
            "Fantastic TV....I never expected that I can get these features in my budget.... But Nokia Tv meet my expectations...Nice picture quality ..Sound is awesome...Just loved this Tv...Go for it!!!👍👍👍👍👍",
            "Good deal",
            "I can say in this price segment 4k tv is good. Little lagy. 4k videos play smoothly. Picture quality should be more vibrant.",
            "Value for money",
            "Good features. Facing problem with connecting USB drive. Otherwise good display, great sound. Surround sound feature is cool.",
            "Extremely bad viewing angles and flipkart will not admit this and seller will tell you that this is not in the return policy as if you watch any thing from the centre of the tv then only you can enjoy the colors of the tv otherwise from left or right view your colors get fade away. And customer will get sick attending technicians",
            "Worth a buy\nHappy to relace Sony",
            "Very good super",
            "Love Every aspect of TV Sound and Picture quality\nNote that i have been using Sony W800 series 43 inches tv at my parents place ,And believe this 43 inchee nokia is Exact same tv at lesser cost with added soundbar..Go for it its worth buying:-)",
            "Best Smart TV",
            "Very good product",
            "Pros:\nValue for money.\nSound quality is good.\nDisplay quality is excellent.\nupscaling video is above average.\n\nCons:\nRemote gets disconnected frequently.\nSometimes message is displayed as network connectivity lost.\nTakes a little too long to boot up.",
            "This is a good product",
            "The picture is actually Great, loved wating movies, it provides the complete cinama experiance.",
            "Bluetooth remote connectivity issue …",
            "Remote power button problem, screen hang problem so many time",
            "Value for this product but small lag issues....sound quality awesome..... picture quality very Good.....",
            "Nokia should work on connectivity, some times remote don't respond, it takes long time to reflect after pressing the button.",
            "It's picture Quality is Blerry not clear Image Showing",
            "Very good budget smart TV. Picture and sound quality is awsome.",
            "For installation they charged Rs.400, not even they given challan also... They told they won't drill in wooden board.. I don't know what we do if we want tv stand... Other then this product delivery and tv picture quality and sound is good...",
            "It's been 10days of usage picture, sound, clarity is good Android features made easy to download best suits for big size hall.",
            "Good Picture Quality and Excellent Sound.\nI think it is better to choose, If the price is below 30k.",
            "Good tv Dolby Atmos is good",
            "Worst product work only just two months totally disappointed",
            "Awesome",
            "AWESOME LED",
            "Picture wise it is ok.... But software is very worst...... Response time is tooooooooo slow😡😡😡😡... U may sometimes get irritated for its performance.... Its been 6 months since I purchased this item... Now the remote has stopped working...",
            "Nice picture and audio quality",
            "Good considering the price point.",
            "Very good product",
            "Good, inbuilt memory is too less.",
            "Sometimes you ll feel a bit lag just like mobile phone,sound and picture quality satisfied",
            "Value for money to, it is best",
            "Value for money.",
            "Osm",
            "Excellent tv I’m a Nokia fan but these days I’m not happy with the Nokia mobiles but anyway I’ve chosen Nokia TV and very happy with the quality and product and this will hold the brand name back 🔥🔥🔥",
            "Value for money... Nice product",
            "Dear All,\n\nPLease dont by this product i had very very bad experience fist time net working issue and replaced the tv but this time when u see the continusily 1 hr sreen will be sheking please dont bye the this product",
            "good product",
            "Sound effect is less and remote sensitivity is limited range and angle..other all good like picture quality, build quality..etc",
            "It is really a good product. Value for money",
            "2 months after review it good 👍👍👍👍",
            "Delivery was awesome and the man was so humble. Thank you.",
            "The sound is very less. Quality is good but amount of sound is below average. Speakers are in bottom firing position.\nA sound bar is needed for good experience.\nTv is a bit lagging.\nCastscreen is not working smoothly.\nSometimes unable to connect with wifi then you have to factory reset , which takes almost 30mins",
            "just got delivered, the picture quality is amazing.",
            "Tv is good, delivery and installation from jeeves was on time, it takes time to start, Jeeves charged 1800 for movable tv stand and same available on Flipkart at 500\nOverall Nokia tv is great, sound good",
            "good",
            "Nice product",
            "Picture quality is good. Value for money.",
            "Amazing. Got both variants. JBL and Onkyo. JBL is top notch.",
            "Very nice",
            "Great deal for this price thank you Flipkart",
            "Pros\n4K\nGreat Audio. I personally don't feel need to purchase any extra soundbar.\nScreen is really crisp and saturated.\nRemote has many useful shortcuts\nAndroid TV OS, so latest features from Google\n\nCons\nSlow. One thing I noticed with budget TVs are that they use very cheap and entry level processors, which make the UX very slow. And this is something one has to live with. Sometimes apps will take ages to load. I don't use DTH, I mostly use multiple OTTs. So whenever I wanted to go watch TV, I first log into Netflix or Prime Video in my PC, browse what I would like to see, and then head over to the TV.",
            "Nice product thank you Flipkart",
            "Im searching from last 1 week for Non-chinees brand , luckily i got this product Super tv in this price segment , picture quality is so good as well as sound, .....Value for money",
            "Excellent product and good service",
            "A better product at low budget",
            "Awesome product",
            "Great",
            "Nice product for valuable price",
            "Its WIFI connectivity is really bad, i did complaint once and engineer advised that we should try Mobile hotspot to connect TV. Now WIFI is disconnecting again and again intermittently even on Mobile HOTSPOT..",
            "Prodict is Very Good ,\n1) SOUND & LOOK IS GREAT\n2)PICTURE IS GOOD BUT LITTLE BEAT IMPROVE",
            "Good",
            "No better deal than this in budget segment.\nPicture quality:A++\nSound quality:A++",
            "Overall good",
            "Picture quality and sound quality is appreciable although it's not justifying the price.",
            "Waste of money",
            "Perfect",
            "Nice product.",
            "Supper",
            "Best in class",
            "Good product 👍🏼",
            "Nice picture quality and sound",
            "One of the best product in Nokia",
            "Was using 1st gen Motorola 4K TV before and now this one.While the transition one key difference I had was with Sound. Its really good.Picture and connectivity seems decent as well.\n\nThings I don't are mainly the booting time which is a lot compared with my previous TV after switching the power on.Secondly when it does software update, it gives some kind of fully grains thing which I never seen in any device.Seriously i thought the updates made some kind of fault in my system earlier, but wasnt the case.Overall its good purchase",
            "Awesome",
            "Great tv nice picture quality",
            "Gud value for money product",
            "Very good product for this price.",
            "Value for money",
            "Very slow loading during startup",
            "Awesome tv with good picture quality..go for it blindly",
            "Overall GOOD TV .SOUND IS IMPRESSIVE",
            "Great tv",
            "Some sounds coming from tv,and remote is not working properly,overall not good",
            "Good television but connectivity very slow",
            "Simply Awesome....\nDevice n Installation",
            "One of the best TV in the market .\nDelivery and installation was good.\nNow I am using for the Last 25 days.\nPicture quality is very excellent.\nIt's a best option for Chinese brand tv.\nNokiya should improve in sound quality.",
            "everything was great... delivery and the product... thanks",
            "It's been a week I started using it. So far it's good.\nGood sound and better picture quality at that price point.",
            "Super sound quality ok",
            "Picture quality is not good as other TVs .I have decided to go with brand TVs if it costly also.",
            "Worth every penny. Don't go by its price and ever compare this with Realme or Xiaomi... Tough competition for Samsung, Sony, LGs... Thanks, Nokia!",
            "Beautiful pictures quality..! Fast installation process..! Thanks flipkart...!",
            "Very nice product",
            "Sound quality is too good...value for money.. I recommend this one",
            "Nice awesome",
            "I used this tv since 10days continue…. All Good sound,picture Qualit, delavery,installations…But when i try to add Google id but can’t add so i will rebot and restore system then it will be add No Bug Working well",
            "Worth to buy",
            "Great product\nPurchased during diwali sale\nGreat pic quality and sound quality awsome",
            "Worth the money. Got it at a good discounted price. I did a few comparisons before going for Nokia. This has all the features available which are available in other recent brands. The Picture quality is amazing. The good part is the sound system which is way much better compared to other brands as per reviews. Cons could be slow booting time and some bright spots only during loading but those are common as per google search. Friendly installation & Demo, Awesome experience so far. Thank you.",
            "Great TV for this price, I love the sound and picture quality . Excellent value for money.",
            "Tv is amazing, only startup time is a negative point of this TV, rest all features are valued for money, anyone can purchase this product without any worry and feel proud after being the owner of this great Nokia TV.",
            "Good",
            "Good product",
            "Good product specially sound quality.",
            "It's very good product, low price , I like nokiya TV."
        ],
        "likes": [
            "3",
            "12",
            "1",
            "2",
            "2",
            "5",
            "1",
            "1",
            "1",
            "1",
            "9",
            "3",
            "3",
            "5",
            "9",
            "10",
            "5",
            "12",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "0",
            "6",
            "0",
            "0",
            "0",
            "3",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "1",
            "7",
            "7",
            "1",
            "10",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Stabilizer is required for this tv",
            "Q:Does this tv have magic remote?",
            "Q:Does it have voice control of Google assistant",
            "Q:Does viewing angle from left or roght shows reflection how clear is it?",
            "Q:Bluetooth saport home theatre connect",
            "Q:Access to Google Play store?",
            "Q:Does it output to AUX? I want to connect to my Marhsall speaker via AUX cable.",
            "Q:Nokia 43\" 4k have Dolby vision?",
            "Q:Hisense 43 4k or nokia 43 4k. Which one good?",
            "Q:DOES IT WORK LIKE A PC",
            "Q:What is the Android version of this tv",
            "Q:What about cast",
            "Q:Can I use mobile remot",
            "Q:How can I make screen mirror by my phone to Nokia smart tv",
            "Q:It's support the screen mirroring with the mobile",
            "Q:How much is RAM",
            "Q:Can we connect home theatre with wire in this led",
            "Q:Which TV is best among these 43 inch models of Nokia TV?",
            "Q:How much power saving star?",
            "Q:I can't able to play hdr content on prime video",
            "Q:Support jio tv application?",
            "Q:Which USB port this TV has?",
            "Q:Is this qled?",
            "Q:Is this TV come with eARC?",
            "Q:Which ports are available in 43 inch model?",
            "Q:How do I login into Google App store?",
            "Q:Is this Nokia Tv able to connect with Bluetooth Earbuds and Wireless Headset",
            "Q:May I know the Android version please? Is it 10, 11 or legacy one?",
            "Q:Can I get remote picture",
            "Q:Does it have dolby vision?",
            "Q:How Google certified Android TV is different from a normal Smart TV?",
            "Q:Is there any app available on Google play store to recognize manufacturer and system specifications?",
            "Q:How many power saving stars",
            "Q:Jbl or onkyo?",
            "Q:Does this TV support HDMI 2.1?",
            "Q:My TV has become slow. What would be the reason?",
            "Q:Which version of bluetooth TV have?",
            "Q:Is Alexa compatible..?",
            "Q:Can I use it as monitor with my pc. If yes then what type of cable required to connect both",
            "Q:When adjusting Picture (Brightness / Contrast / Saturation) settings, does it open on top of the playing content or does it go back to android settings by stopping the currently playing content?",
            "Q:Does this Support HDMI 2.1 eArc? I need to use it for gaming pS5",
            "Q:This tv is use as a pc",
            "Q:Can we add a web camera? Can we install Whatsapp/Google Duo and do a Video Call?",
            "Q:Is 400 nits brightnes",
            "Q:Dolby Atmos available in",
            "Q:Does it support 5 gigahertz wifi?",
            "Q:Does it has vga port",
            "Q:What is the minimum viewing distance?",
            "Q:what do sd channels look like?",
            "Q:Which speaker is best jbl or onkyo?",
            "Q:Is it IPS panel?",
            "Q:What is ROM size?",
            "Q:Do I get a wall mount with the TV?",
            "Q:How much internet speed is sufficient for smooth performance?",
            "Q:Does Google cast work via WiFi-direct?",
            "Q:Does it support multi tasking?",
            "Q:What is the viewing angle for VA panel?",
            "Q:Does it have a VA panel?",
            "Q:Does TV have a combi remote?",
            "Q:Is the remote universal and does it work with a set top box?",
            "Q:Can we install Netflix from the play store ?",
            "Q:How to perform a Firmware / Software update on Android TVs ?",
            "Q:Are both technologies Miracast and Chromecast available on this TV?",
            "Q:What is the TV start up time?",
            "Q:Does it have a web browser?",
            "Q:Can I cast iPhone using Google Chromecast or any other cast option?",
            "Q:TV is not detecting my USB. What should I do?",
            "Q:Does this TV support HDR?",
            "Q:Does this TV support Netflix, prime video, Disney+hotstar, Zee5, Voot, AltBalaji, Sonyliv, Erosnow, Spotify?",
            "Q:Can I use my mobile hotspot to connect to Nokia Smart TV?",
            "Q:Can I play games on this TV? Does it have pre-loaded games?",
            "Q:Does this TV support ARC?",
            "Q:Does the TV have any pre-loaded Apps?",
            "Q:Is it having DLED or ELED?"
        ],
        "answers": [
            "A:not required.",
            "A:Yes 👍 and its very responsive bluetooth based remote",
            "A:Yes, it has Google assistant support via voice",
            "A:Its gives pretty clear view nothing to worry about that as per my experience.",
            "A:yes",
            "A:yes it works but most of the time that voice commands doesn't work and nokia nor the service center doesn't take care of that issue so I request to you don't go for it",
            "A:Yes. There is an audio out jack just like in a laptop.",
            "A:yes",
            "A:nokia 43 4k",
            "A:if you connect hdmi display port from your pc/laptop to this tv then it does! or you can cast your windows 10 pc to this TV also.",
            "A:Android 11",
            "A:Casting is Available.",
            "A:Yes",
            "A:Use chrome cast to mirror your phone screen. step 1. Download google home app from play store . step 2. Configurate google home app.After configuration of google home app you can mirror you mobile sc",
            "A:Yes",
            "A:2GB",
            "A:yes",
            "A:Apart from Sony and LG as of now nokia is the best 4k tv but choose Android 10 rather than 11 because of storage..",
            "A:0",
            "A:You can play it",
            "A:No",
            "A:USB 3.0 and 2.0",
            "A:4k uhd VA DLED",
            "A:Yes, this TV comes with eARC",
            "A:3 - hdmi , 1 - optical , 1 - av",
            "A:When you switch ON the TV for the first time, you need to follow the process of sign in with your Google account and after that you can access all Google apps.",
            "A:yes",
            "A:I think its 11 version Android.",
            "A:Yes. You can.",
            "A:Yes it supports dolby vision and its a fantastic Nokia Ultra HD 4K 65 inches is the best smart tv ever i was using LG 50 inches Smart tv before but I am in love with Nokia the best brand ever",
            "A:Official Google Android TV has Google TV Launcher, Google Search and Google Assistant, unrestricted access to Google Play store and many other features.",
            "A:No app can detect TV�s system specifications. No access is given to external app developers.",
            "A:2",
            "A:Onkyo",
            "A:Yes, it supports HDMI 2.1",
            "A:This TV works like any other Android device such as Android mobile phones. Please check the memory consumption and number of downloaded apps & clear cache memory timely to improve system performance.",
            "A:4.2",
            "A:i think yes",
            "A:Yes. You may use HDMI cable to connect both tv and pc. With seperate cables.",
            "A:Settings get open on top of the playing content",
            "A:it does",
            "A:no this tv don't VGA port",
            "A:Yes u can, it's fully supported",
            "A:no it's 370 nits",
            "A:Yes available, Dolby ATMOS surround sound technology creates wonderful experience for Movie and music lovers.",
            "A:yes",
            "A:yes",
            "A:2 to 4 meters",
            "A:no clarity of sd channel's",
            "A:jbl",
            "A:NO BRO. NATURAL COLOUR DEKHNE KO MILENGE.SOUND IS NOT THAT BOOM. GO FOR 55 INCH VARIENT FOR XTRA BOOM SOUND. I FOUND THE O.S BIT LAGGY.THORA SA ,APPROX 15 DEGREE BHI PER BHI COLOURS FADED DIKHTE H!",
            "A:ROM size is 16GB, but around 11GB is available to install the apps, as the rest of the ROM used for Operating System usage.",
            "A:Yes, wall mount comes free with Nokia Smart TV. Apart from the wall mount, the stylish metal stand will also come for free.",
            "A:Minimum 40 MBPS Speed is sufficient for smooth performance.",
            "A:No, It works only when TV and phone are connected to the same Wi-Fi router",
            "A:No, it doesn�t support multi tasking.",
            "A:VA panel has 178 degree viewing angle.",
            "A:Yes, It has a VA panel.",
            "A:Yes, the TV remote is IR+Bluetooth",
            "A:No, it is not a universal remote and unfortunately it won't work with a set top box. You need to use a separate remote for a set top box.",
            "A:Netflix is already pre-installed on the TV",
            "A:Whenever a new version is available, a notification will pop-up on your TV screen or you can also check in settings for system updates for available OTA updates.",
            "A:Only Chromecast is available on this TV. TV won't support Miracast.",
            "A:First boot up time takes around 1-2 mins. If it is not switched off from main power then it will just take 30s to start.",
            "A:It doesn�t come with any pre installed web browser but you can download via Google play store.",
            "A:Yes, this TV comes with an in-built app called Fastcast through which you can cast iphone/ipad",
            "A:Please download ES file explorer/other file manager and explore your USB files through mentioned application.",
            "A:Yes, it supports HDR10",
            "A:Yes, it supports all of the aforementioned applications.",
            "A:Yes, you can use your mobile hotspot to connect to Nokia Smart TV but it should have a good network speed to function smoothly.",
            "A:No, it doesn�t have any preloaded games. Although, you can download games from �Google Play Games� and then you can play them.",
            "A:Yes, this TV supports ARC.",
            "A:Nokia Smart TV comes with preloaded official apps like Netflix, Prime Video, Youtube, Google Playstore, Google Movie, Google Music, Google Game etc.",
            "A:Yes, this TV has DLED."
        ],
        "likes": [
            "8",
            "8",
            "7",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "20",
            "12",
            "13",
            "2",
            "0",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "4",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "2",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "2",
            "0",
            "1",
            "2",
            "1",
            "1",
            "0",
            "0",
            "0",
            "3",
            "1",
            "1",
            "0",
            "0",
            "2",
            "2"
        ],
        "dislikes": [
            "1",
            "3",
            "2",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "1",
            "2",
            "0",
            "2",
            "0",
            "0",
            "0",
            "4",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "3",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "4",
            "0",
            "1",
            "0",
            "1",
            "3",
            "2",
            "4",
            "0",
            "0",
            "3",
            "1",
            "0",
            "4",
            "2",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    }
}