{
    "title": "iFFALCON 163.82 cm (65 inch) Ultra HD (4K) LED Smart Android TV with Micro Dimming and Google Assistant  (65K2A)",
    "product_specification": {
        "In The Box": "1 TV Unit\nWall Mount\nUser Manual\nBasic Remote\nAC Power Cord\nWarranty Card\nBase Stand\nSmart Remote",
        "Model Name": "65K2A",
        "Display Size": "163.82 cm (65 inch)",
        "Screen Type": "LED",
        "HD Technology & Resolution": "Ultra HD (4K), 3840 x 2160",
        "Smart Tv": "Yes",
        "Motion Sensor": "No",
        "HDMI": "2 Rear, 2 Side",
        "USB": "2 x Side",
        "Built In Wi-Fi": "Yes",
        "Launch Year": "2018",
        "Brightness": "320 nits",
        "Contrast Ratio": "4000:01:00 (Static)",
        "Picture Engine": "Yes",
        "Picture in Picture (PIP)": "Yes",
        "Digital TV Reception": "Yes",
        "View Angle": "178 Degree",
        "Panel Type": "A+ Grade Panel",
        "Digital Noise Filter": "Yes",
        "LED Display Type": "Direct LED",
        "Refresh Rate": "60 Hz",
        "Supported Video Formats": "H.265/H.264, MPG1/2/4, WMV, VC1, VP8, VP9",
        "Other Video Features": "Dynamic Contrast\nMicro Dimming Pro\nSports Mode\nNoise Reduction",
        "Number of Speakers": "2",
        "Speaker Type": "Box",
        "Sound Technology": "Dolby, DTS",
        "Surround Sound": "Yes",
        "Speaker Output RMS": "16 W",
        "Supported Audio Formats": "MP3, WMA, AC3",
        "Other Audio Features": "Integrated Speakers",
        "Number of Cores": "4",
        "Processor": "CA53 64 bit 1.1 GHz",
        "Graphic Processor": "Mali T860 MP2 480 MHz",
        "Ram Capacity": "2.5 GB",
        "Storage Memory": "16 GB",
        "Clocking Speed": "1.1 GHz",
        "Supported App - Netflix": "Yes",
        "Supported App - Youtube": "Yes",
        "Supported App - Disney+Hotstar": "Yes",
        "Supported App - Prime Video": "No",
        "Supported App - Others": "Voot, ZEE5, Alt Balaji, Sun NXT, Hungama Play, Eros Now, Jio Cinema, Sony Liv",
        "Supported Mobile Operating System": "IOS\nAndroid",
        "Operating System Present": "Yes",
        "Operating System": "Android",
        "Screen Mirroring": "Yes",
        "App Store Type": "Google App Store",
        "Pre Installed Browser": "T-browser",
        "Content Providers": "Netflix, YouTube, T-cast",
        "Supported Devices for Casting": "Mobile",
        "Bluetooth": "Yes",
        "3G Dongle Plug and Play": "No",
        "Ethernet (RJ45)": "1",
        "Other Internet Features": "Wifi Type: 2.4 GHz and 5 GHz",
        "Headphone Jack": "Yes",
        "Touch Remote": "No",
        "Smart Remote": "Yes",
        "RF Capable": "Yes",
        "Internet Access": "Yes",
        "Battery Type": "2 AAA Batteries",
        "Other Remote Control Features": "Voice, Bluetooth",
        "Power Requirement": "AC 110 - 240 V, 50/60 Hz",
        "Power Consumption": "240 W, 0.5 W (Standby)",
        "Other Power Features": "Instant Power On",
        "Clock": "Yes",
        "Auto Power Off": "Yes",
        "Sleep Timer": "Yes",
        "On/Off Timer": "Yes",
        "Width x Height x Depth (without stand)": "1246.4 mm x 842.7 mm x 64.8 mm",
        "Weight (without stand)": "20.3 kg",
        "Width x Height x Depth (with stand)": "1464.5 mm x 906.5 mm x 247 mm",
        "Weight (with stand)": "20.6 kg",
        "Stand Features": "Wall Mount Included",
        "Warranty Summary": "1 Year Domestic Warranty",
        "Covered in Warranty": "Defect Arising Out of Faulty or Defective Material or Workmanship. Parts and Labour Costs are Covered",
        "Not Covered in Warranty": "Damages Resulting from Un-authorised Adaptations or Adjustment. External Accessories (Such as Battery, Cable Etc). Damages Caused to the Product by Accident, Lightening, Ingress of Water, Fire, Dropping or Excessive Shock. If Product Serial No has been Altered, Removed or Defaced. Damages Caused by Improper Installation/ 3rd Party Equipment or Software/Media Used. If Product is Used in Commercial, Business, Industrial, Educational and Rental Applications",
        "Warranty Service Type": "On-site",
        "Installation & Demo Details": "We'll facilitate the installation and demo through authorized service engineer at your convenience The installation will be done within 48 hours of delivery of the TV. The service engineer will install your new TV, either on wall mount or on table top. The wall mount is not included in the box and will be chargeable. The engineer will also help you understand your new TV's features. The process generally covers: Wall-mounted or table-top installation, as requested. Physical check of all ports, including power and USB ports. Accessories also checked. Demonstration of features and settings Quick run-through on how to operate the TV."
    },
    "product_description": {
        "Dolby Audio": "The Dolby Decoder lets you enjoy a rich and immersive surround sound experience with optimised sound quality, turning your room into an entertainment hub.",
        "Stereo Surround Sound Box Speaker": "The built-in stereo box speaker improves the overall entertainment experience by delivering powerful bass and high-impact sound, making your feet groove automatically to the beat.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "1",
            "5",
            "4",
            "2",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "3",
            "4",
            "3",
            "1",
            "5",
            "5",
            "1",
            "5",
            "2",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "1",
            "1",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "1",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "3",
            "1",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "2",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "1"
        ],
        "review": [
            "first I worried about picture clarity when I booked....... but I don't have other option with this price........ after watching the 4k content mind blowing... superb picture quality and sound and smart features..... superb product..... I recamond to everyone......",
            "Date of Purchase: 10.10.18\nDate of Delivery: 12.10.18\nDate of Scheduled Installation: 14.10.18\nNo of Days Used & Experienced: 19 Days\n\n1. Sound Quality is brilliant. Good clarity in the Mid Range Frequencies (i.e. Voice Range)\n2. Video Quality is astounding. Handles the Depths amazingly well.\n3. Screen Quality to be happy about. Absolutely, feel happy the way the Backlight is positioned. Evenly distributed brightness. The screen is cool to the eyes..!!!\n4. Connectivity: ✓✓✓✓✓ Redefining flawless and smooth connectivity and transitions. Google Home, Chromecast works brilliantly well.\n5. Body Frame: The premium touch.. Will not complaint. It looks stunning for the Price.\n\nOverall sheer pleasure, Value for every Dime Spent.",
            "Couldn't have asked for more..!!\nTV is sleek n beautiful..\nPicture quality is top notch at this price..\nSound quality is Good Enough for Living Space..\nConnectivity plus User Interface is Smooth..\nNo Lags till now..\nUsing TV through Mobile Hotspot n Works Completely Smooth n No Loading n Buffering Issues..\n\nInstallation by Jeeves was Good n on Time..!!\n\nOverall Super Happy for Now..!!\nWill definitely alter the review after using it for a Month.. :)\n\nIf you have double mind for buying this product don't hesitate and just Go For It..!!",
            "65inch is Just fantastic upgrade from 51 inch looks cool very premium steel frame finish . first sound kept so low after adjusting on set off box hdchannel is awesome . please everyone make changes on set up box first. rest all fine worth every single penny colourfull and bright. tech wise much needed apps only that's ok. it's a very very good tv to buy go for it . do not care on negative review . it's according to ur purpose u use it wisely. ILOVEIT 😍🤟😎",
            "Update\nreducing 1 star\nAttractive discount, 4K picture quality, non lagging, attractive remote controls, HDR10, DTS, Dolby audio, supporting my 4tb external HD, supporting X265 HEVC videos, settings, Bluetooth, Optical fiber connection, honest & fair sale - no artificial demand - created by restricting sale to limited numbers by other similar tv manufacturers - all are ok\nGo for it. you will not regret.\nupdate\n1.After software update TV is not reading my 4 tb external hd . reading my 1 and 2 tb hd only. 4 tb hds are in excellent condition but TV says hds as corrupted\n2.TV will not turn on from standby mode if any external hds attached to tv - will turn on only after removing external hds and after turning off/On the switch",
            "This is an excellent TV. Never expected this kind of picture quality at this price for a 65\" LED. Fully satisfied after using it for more than 10 days. Much better than the 55\" Mi LED that I also own.",
            "super good TV excellent super picture quality best budget TV remote is excellent super",
            "Edited REVIEW, after a usage of ONE WEEK(Old review can be found after this edited review)\nIts just an excellent TV, doubtlessly in all aspects, except one thing, that is, the mismatching of VIDEO (Lip movement of characters) with sound in the SPEAKERS, in other words we can say that there is no SYNC between SOUND and VIDEO. I didn't observe it in the beginning, but it is clearly noticeable, 2 of my frnds and relatives also noticed this issue, when they visited my home to see the new TV. I'm using airtel DTH HD Plus Set Top Box, I don't know, if this is happening with me or everybody else, the technician who came after making a complaint said that it is due to the fault of Set Top Box, but my old Weston Android 48\" TV used to work fine with the same box, when I connect the audio output from Set Top Box and feed it directly to my SONY home theatre, the Audio is in synchrony with VIDEO on TV, but not in TV speakers. When I turn on Sound in both home theatre and also TV speakers, the time gap between TV's sound and the sound on Home theatre can be easily sensed, which clearly says that, it's the FAULT of TV, I tried several settings for time delay SPDIF section, but nothing worked for me.. Requested a replacement, let me see if that will be a good one...\n\nthank u...\n\n(Old review below)\n\ns a person who has been using SONY 55' 4K UHD TV, which I bought at 2.4 lakhs, 3 years back, I can say that, this TV is no less than any other so called TOP brands.\n\nLet me try to give a detailed opinion on this TV to the extent possible to me:\n\nThe product was delivered by FLIPKART in just 1 and half a day, but it took 1 day more for the JEEVES Engineer to visit my residence for installation.\nThe JEEVES ENGINEER was so untrained that he was handling the TV after opening package, as if a courier person was handling with outer package. I was worried that the TV might be broken as he was holding the TV to lift on the thinner part of the screen. However, I cautioned him again and again to handle it carefully, or leave it so that I get it fixed by some other engineer.\n\nComplaints apart, now let's come to TV.\n\nMy TV is wallmounted, and the TV is an awesome one, it took almost more than a half of my wall's area.\n\nLet me seggregate the PROs and CONs\n\nPROs:\n~Picture quality excellent\n~ound, is more and crispier than my old SONY 55\"4K UHD TV\n~The build quality is so good that it has ALUMINIUM sheets as frame on all 4 sides of the screen\n~Bluetooth connectivity is available (it was not mentioned in the product page and any other YouTube unboxing reviews, hence I thought had no Bluetooth connectivity)\n~UI of software is superb\n~Smart remote is a boon\n~All apps are working just fine\n\nCONs:\n× T-cast (Screen mirroring needs an active internet connection with TV and PHONE connected on same network, I didn't understand why this is so, even a basic smart TV nowadays, directly pairs with phone and mirrors the mobile screen\n× The buttons of SMART REMOTE are so close to each other that sometimes another button being pressed when trying to press some other button\n× No FILE MANAGER app (on default) for browsing the PEN DRIVE DATA, after watching a movie or a video, if you press back, it springs back to HOME SCREEN, and as FILE MANAGER is not available, we need to REMOVE and RE-INSERT for the TV to prompt that \"an EXTERNAL DRIVE is detected, do you want to OPEN it now...?.\"\n\nOn an overall basis, it is just an awesome TV, which needs small amendments, which I hope, will be solved in upcoming updates....\n\nThank you all,\nSrinivas Dhondi, HYD",
            "very good deal and AWESOME purchase..I got it on big billion sale .\n\nMy friends are stunned by seeing this big TV. installation was good and on time. Using stabilizer for safety .\n\nTatasky Setup Box: the SD channels are not good.. HD Channels are good.\n4k content is awesome internet or External drive\nSound:\ncoming to sound , this TV has 3.5 mm port which I connected my 2.1 F&D speakers.. the output is very very good..\ninstalled jiotv app to view Channels with jio gigafiber..\n\none star less for picture quality.. it could be better , but this is price range it is a great quality.\n\nmy rating is 4.5 for this purchase\n\nyou can go for it.",
            "The panel in this TV is absolutely brilliant for the price that you pay...! Playing 10 bit 4k videos are amazing. The processing inside is doing okay,pairing with any 4k device with hdmi gives goosebumps on playback. Loved the product, received in a day. Worth buying for the price...!",
            "first I worried about picture clarity when I booked....... but I don't have other option with this price........ after watching the 4k content mind blowing... superb picture quality and sound and smart features..... superb product..... I recamond to everyone......",
            "Date of Purchase: 10.10.18\nDate of Delivery: 12.10.18\nDate of Scheduled Installation: 14.10.18\nNo of Days Used & Experienced: 19 Days\n\n1. Sound Quality is brilliant. Good clarity in the Mid Range Frequencies (i.e. Voice Range)\n2. Video Quality is astounding. Handles the Depths amazingly well.\n3. Screen Quality to be happy about. Absolutely, feel happy the way the Backlight is positioned. Evenly distributed brightness. The screen is cool to the eyes..!!!\n4. Connectivity: ✓✓✓✓✓ Redefining flawless and smooth connectivity and transitions. Google Home, Chromecast works brilliantly well.\n5. Body Frame: The premium touch.. Will not complaint. It looks stunning for the Price.\n\nOverall sheer pleasure, Value for every Dime Spent.",
            "Couldn't have asked for more..!!\nTV is sleek n beautiful..\nPicture quality is top notch at this price..\nSound quality is Good Enough for Living Space..\nConnectivity plus User Interface is Smooth..\nNo Lags till now..\nUsing TV through Mobile Hotspot n Works Completely Smooth n No Loading n Buffering Issues..\n\nInstallation by Jeeves was Good n on Time..!!\n\nOverall Super Happy for Now..!!\nWill definitely alter the review after using it for a Month.. :)\n\nIf you have double mind for buying this product don't hesitate and just Go For It..!!",
            "65inch is Just fantastic upgrade from 51 inch looks cool very premium steel frame finish . first sound kept so low after adjusting on set off box hdchannel is awesome . please everyone make changes on set up box first. rest all fine worth every single penny colourfull and bright. tech wise much needed apps only that's ok. it's a very very good tv to buy go for it . do not care on negative review . it's according to ur purpose u use it wisely. ILOVEIT 😍🤟😎",
            "Update\nreducing 1 star\nAttractive discount, 4K picture quality, non lagging, attractive remote controls, HDR10, DTS, Dolby audio, supporting my 4tb external HD, supporting X265 HEVC videos, settings, Bluetooth, Optical fiber connection, honest & fair sale - no artificial demand - created by restricting sale to limited numbers by other similar tv manufacturers - all are ok\nGo for it. you will not regret.\nupdate\n1.After software update TV is not reading my 4 tb external hd . reading my 1 and 2 tb hd only. 4 tb hds are in excellent condition but TV says hds as corrupted\n2.TV will not turn on from standby mode if any external hds attached to tv - will turn on only after removing external hds and after turning off/On the switch",
            "This is an excellent TV. Never expected this kind of picture quality at this price for a 65\" LED. Fully satisfied after using it for more than 10 days. Much better than the 55\" Mi LED that I also own.",
            "super good TV excellent super picture quality best budget TV remote is excellent super",
            "Edited REVIEW, after a usage of ONE WEEK(Old review can be found after this edited review)\nIts just an excellent TV, doubtlessly in all aspects, except one thing, that is, the mismatching of VIDEO (Lip movement of characters) with sound in the SPEAKERS, in other words we can say that there is no SYNC between SOUND and VIDEO. I didn't observe it in the beginning, but it is clearly noticeable, 2 of my frnds and relatives also noticed this issue, when they visited my home to see the new TV. I'm using airtel DTH HD Plus Set Top Box, I don't know, if this is happening with me or everybody else, the technician who came after making a complaint said that it is due to the fault of Set Top Box, but my old Weston Android 48\" TV used to work fine with the same box, when I connect the audio output from Set Top Box and feed it directly to my SONY home theatre, the Audio is in synchrony with VIDEO on TV, but not in TV speakers. When I turn on Sound in both home theatre and also TV speakers, the time gap between TV's sound and the sound on Home theatre can be easily sensed, which clearly says that, it's the FAULT of TV, I tried several settings for time delay SPDIF section, but nothing worked for me.. Requested a replacement, let me see if that will be a good one...\n\nthank u...\n\n(Old review below)\n\ns a person who has been using SONY 55' 4K UHD TV, which I bought at 2.4 lakhs, 3 years back, I can say that, this TV is no less than any other so called TOP brands.\n\nLet me try to give a detailed opinion on this TV to the extent possible to me:\n\nThe product was delivered by FLIPKART in just 1 and half a day, but it took 1 day more for the JEEVES Engineer to visit my residence for installation.\nThe JEEVES ENGINEER was so untrained that he was handling the TV after opening package, as if a courier person was handling with outer package. I was worried that the TV might be broken as he was holding the TV to lift on the thinner part of the screen. However, I cautioned him again and again to handle it carefully, or leave it so that I get it fixed by some other engineer.\n\nComplaints apart, now let's come to TV.\n\nMy TV is wallmounted, and the TV is an awesome one, it took almost more than a half of my wall's area.\n\nLet me seggregate the PROs and CONs\n\nPROs:\n~Picture quality excellent\n~ound, is more and crispier than my old SONY 55\"4K UHD TV\n~The build quality is so good that it has ALUMINIUM sheets as frame on all 4 sides of the screen\n~Bluetooth connectivity is available (it was not mentioned in the product page and any other YouTube unboxing reviews, hence I thought had no Bluetooth connectivity)\n~UI of software is superb\n~Smart remote is a boon\n~All apps are working just fine\n\nCONs:\n× T-cast (Screen mirroring needs an active internet connection with TV and PHONE connected on same network, I didn't understand why this is so, even a basic smart TV nowadays, directly pairs with phone and mirrors the mobile screen\n× The buttons of SMART REMOTE are so close to each other that sometimes another button being pressed when trying to press some other button\n× No FILE MANAGER app (on default) for browsing the PEN DRIVE DATA, after watching a movie or a video, if you press back, it springs back to HOME SCREEN, and as FILE MANAGER is not available, we need to REMOVE and RE-INSERT for the TV to prompt that \"an EXTERNAL DRIVE is detected, do you want to OPEN it now...?.\"\n\nOn an overall basis, it is just an awesome TV, which needs small amendments, which I hope, will be solved in upcoming updates....\n\nThank you all,\nSrinivas Dhondi, HYD",
            "very good deal and AWESOME purchase..I got it on big billion sale .\n\nMy friends are stunned by seeing this big TV. installation was good and on time. Using stabilizer for safety .\n\nTatasky Setup Box: the SD channels are not good.. HD Channels are good.\n4k content is awesome internet or External drive\nSound:\ncoming to sound , this TV has 3.5 mm port which I connected my 2.1 F&D speakers.. the output is very very good..\ninstalled jiotv app to view Channels with jio gigafiber..\n\none star less for picture quality.. it could be better , but this is price range it is a great quality.\n\nmy rating is 4.5 for this purchase\n\nyou can go for it.",
            "The panel in this TV is absolutely brilliant for the price that you pay...! Playing 10 bit 4k videos are amazing. The processing inside is doing okay,pairing with any 4k device with hdmi gives goosebumps on playback. Loved the product, received in a day. Worth buying for the price...!",
            "Booting time too long, settings and menu buttons resound very delayed if more than one applications are opened otherwise each and every 1-2 hours you have to close all opened apps, software hangs, default media player does not have bsic codecs for the audio and video, popular MKV video could not be played in it, you can.t play 4k HDR 60FPS video via any of the USB ports. I asked for the refund but they said only replacement is possible. Sound quality is poor. there is no noticeable difference between pre defind sound modes, no graphic equalizer is present to personalize it.\nIn total to my experience pl do not buy it. go for MI brand or MarQ by Flipkart brand or VU brand for the almost same price.",
            "Initially, I was little scared while ordering as the brand is not very popular. But now I m writing this review very confidently. it is a great product. I got 65 inch tv. Picture quality is very good. sound quality is not that great but I have connected my Bose soundbar & now I m getting a feel seating in auditorium. Tata sky HD channels are looking good. non HD channels are not that good picture quality but that is acceptable. 4K is really amazing. Value for money.....Go ahead with it.",
            "Dear All,\n\nI have recently purchased this TV 65\". The looks and feature of the TV is very good. Delivery and installation was on time as mentioned in the message.\n\nWhile installation of my TV, I sensed the problem with sound and HD channels clarity while playing from Tata Sky. I thought this TV is really bad, but later after doing the changes in Tata Sky Set up box settings from Dolby + to Dolby, sound became very clear and the HD channels settings too changed from 1080/60hz to 1080/50 Hz. Then the quality of HD became awesome.\n\nThis is the best TV for this price in the market as per my analysis. I would strongly recommend this TV .\n\nAll I have to wait and watch is to see how long the TV lasts?",
            "Very good product and value for money, 4k visual amazing Dolby sound is fabulous. This product not for SD set top box, minimum HD channels must be provided for this system.",
            "one the best tv i have ever seen\nmy brother also has a 65 inch but this tv is 10 times better than that\nsuperb picture quality\nloved it excellent service by flipkart",
            "it's been now 10 days , this TV is exceptionally good, picture quality , sound and connectivity is awesome.\nI connected Marantz AVR which upscales full HD to 4k and the color rendering, brightness, contrast along with HDR is just superb.\ndelivery, installation was smooth .\nDefinitely very good buy .....\n4k content is just perfect....a perfect deal if you have a home theatre setup at home.",
            "It's really worth the money.... Though I don't know much about tcl servicing... But the tv is damn worth it... It runs smooth... And the good news is that it has native 4k which is true 4k and not upscailed 4k which is really good imo. I suggest you go for this... You will really enjoy.. Happy shopping.... Ty Flipkart",
            "Don't even hesitate to buy this TV such a fabulous TV just wow....!!!!!! words aren't sufficient to praise it...!!!!! And guys let off those LG ,Sony etc.... just buy it....!!!!!!\n🥰😗😗😗😍😍😍😍",
            "I was in the market for a new large screen TV\n\nMy requirements were large screen 65 and above\nNetflix native support\nGoogle assistant\nDolby sound\ngood connectivity options\n\nAfter much deliberation zeroed in on the iffalcon 65k2a it fulfills all of the above\n\nso far experience has been great and no complaints with the delivery installation and the TV itself is great\n\nviewing angles , color reproduction science , sound , interface all are comparable to the tier 1 brands\n\nhappy with the purchase till now\n\njust a word or advise to potential buyers ..reset the TV when you get it once gets rid of any bugs and in my case Google search upgraded itself to Google assistant\n\ncheers to iffalcon and happy buying!",
            "A near perfect 65 inch TV at such low price. Display quality is exceptional. As this is a 65 inch uhd TV the viewing distance should be around 8 feet for actual picture quality. Sound system is quite good but for movie like experience you need to have a external speaker system. HDR video wherever available (search YouTube or Netflix you will get some=, is quite good. Blacks are actually black and not grey an color reproduction is exceptional.",
            "Outstanding clarity in picture and voice...super value for money...I have Samsung 55 inch UHD , LG 55 inch UHD TV's and the clarity on iffalcon TV is equally good and if not better than the other two..True Android TV with which are rich in features which is superior than samsung and LG TV's.\n\nOne simple word..Truly outstanding..highly recommended..\n\nThe installation and demo from flipkart was also done on the same day with good professionalism..",
            "A very nice budget tv, installation was done in 2-3 days, installation guys were also nice they even recommended us to have a stabilizer and extended warranty for longer protection. Hopefully u'll forget normal cable connection after getting used to streaming HD content on it.",
            "I bought THOMSON TV in the month of July 2019 but that TV was WORSE TV I have ever seen in mine whole life. It has No sound at the time of installation in any format i.e TV , Pen Drive or You Tube from Nett.So it got replaced in the next 2 days .Now the next THOMSON TV I received has manufacturing Defect on the screen ,a blue light like small LED is continuously glowing on screen in Blue color. Again this TV has to be replaced. THIS TIME I OPTED FOR IFFALCON TV AND I AM VERY HAPPY TO BUY THIS TV AS PICTURE QUALITY, SOUND ,CONNECTIVITY EVERYTHING IS EXCELLENT. I AM VERY VERY HAPPY TO BUY IFFALCON.",
            "Good sound quality and the service provided by flipkart through Jeevas was very co-operative Mr. Praveen service engineer has good knowledge about his work thanks for making my TV a remarkable TV",
            "Picture quality is superb sound is also good but whem we play any movie then voice is not clear so nor satisfy with voice quality sometimes lagging in connectivity auto disconnect but still value of money worth to have simply amazing deal i got it in 49k with no cost emi i got on mentioned date and on the same day got installed by flipcart so superb service guys despite some issues you can go a head to purchase it",
            "i bought this 65 inch tv on 23 may installed on 24 may , good priduct value for money big screen with android working very good sound very good with HD settop box it is good to see normal local cable connection very bad clearance voice remote v.good over all value for money",
            "IN THIS PRICE ITS GREAT SIZE OF 4K TV.\nITS LIKE A ONE MOBILES PRICE BUT U WILL SEE 65 INCH SCREEN .\n\nTAKE IT AND ENJOY IF U LOVE TO WATCH MOVIES.",
            "looking excellent picture quality excellent HD excellent 4K excellent sound excellent",
            "I always wanted to buy 65'' Android TV, so thank you TCL/iFFALCON from bringing this great TV to India at such affordable price. Watching 4K and HDR 10 Content from Netflix feels like a grand cinematic experience. The Dolby Audio is mind-blowing and I don't feel the need to use my 320W LG SoundBar anymore with this TV. Voice enabled remote is a very cool feature and works smooth as butter!\n\nApps which I use regularly on this TV - Jio Cinema, Hotstar, Sony Liv, Gaana, Spotify etc.\n\nHope Prime Video comes to Android TVs in India soon, then this TV will become a complete entertainment package. Guys, just go for this TV, you will never regret one bit!",
            "I just love this TV. Worth every buck spent on it. Using it for more than a month. On the downside, sometimes there is a lag when you go from one app to another hastily, but everything can be overlooked when considering how little we are paying compared to the so-called top brands. If the big brand TVs score a 100 in performance, this TV would definitely score a 95. I haven't seen the MI TV and don't know about its performance, but I'm willing to bet that this Iffalcon TV is much better.",
            "the display unit is excellent, you have got all types of modern connectivity available. the initial set up was quite fast and all the settings are ready to navigate. though I find this unit not having split screen facility. it would have been a great advantage if this feature was available!\n\nthe Wi-Fi connectivity is really fast and during even gaming programs the response is great. only thing i don't like is the time taking process for the initial start up. but once started it doesn't stop.\nI think this TV is not at all a bad choice when you compare overall with other reputed companies. the sound is good though I can't tell is great!!!!! the sound enthusiastic can go for any good quality sound bar to feel the experience of theatre.",
            "Really this tv is very gud and i brought 65 inches tv i had 1 week of experience, over all i can rate 5 because ....\n\n1) Screen Size worth for money compare to other tv's\n2) Sound Quality is excellent\n3) Picture Quality 4K ultimate but we should have quality of network.\n4) Overall worth for each rupeee.....\n\nif any body interested to buy plse without second thought you can buy this product...",
            "Boot time is very slow, takes almost 20min can't save colors set as it goes to default settings Everytime. Anyway can't expect top quality for the price. Advantage is Google certified and can connect TV thru your phone via chrome cast and hot-spot. Though mobile videos are not so clear",
            "ultimate product by tcl.i conect ps4 pro 4k hdr its fully support but mi tv 55 ps4 pro 4k hdr leging issu.i connect pc( windows 10 ) and play 4k vedio its fully support.i connect sony htrt3 home theater its fully support . iconnect 4 tb segtec hard disk 3.0 its fully support no connectivity issu .ameging picture qwality and sound qwality its 100 times batter mi tvs and other top reted brands. its tv ameging.must buy gys its definetly winner",
            "I bought it after reviewing all possible oled, qeld, and other uhd TVs in this size. But being a price conscious customer, I took a bet with this TV for al the reviews I saw on YouTube and Flipkart. And I’m extremely happy with the service, and the product itself. Imagine clarity and colours are reproduced very well. The blacks appear perfectly balanced. And I don’t even need an additional sound system",
            "the TV is working good the 4k quality is just awesome but the smart remote is not working I have inform to manager of iffalcon and they will send a incharge on tomorrow that's only I give a 4 star",
            "i am using this TV for a month and it is good at low prices. Picture quality is not good simply very low quality, don't go for the reviews it will manipulate you. HD quality looks SD and this is not 60hz refresh rate dont go for the description, TV sound quality is low respective of size, y'all should add a good speaker. Go for vu or for some branded tv as tv is known for good picture quality.",
            "Review after 3 months of typical use at home without and STB but only internet streaming content. I stream varied content with quality ranging from Low Res to UHD HDR10. The TV delivers what it promises. Nice colors, sharpness, and contrast. Blacks are deep and optimal for enjoying the HDR content. Not too dark if you ensure your settings are optimal and not overdone. Onboard sound is decent. Sounds big enough for the 65\" image. But A large home theater set-up is recommended for enjoying Sound from movies with this TV.\n\nThe only thing I would call a downside is that the overall brightness seems a little inadequate, but only if you are watching a room with too many windows and bright sunlight crossing the path between you and the TV. If you have direct sunlight reflecting off the TV screen then you may not be able to watch anything. But this I believe is a clever trade-off for the price. If you need work with bright rooms then you may want to consider TVs with higher nits of brightness, like the OLEDs from LG, Samsung or Sony. If you can control the room light then I would recommend definitely go for this TV. It's worth every penny.\n\nDolby Vision compatibility would have been a plus on this TV but the premium licensing fees to have one for the brand and also the uncertainty surrounding the future of Dolby vision can be considered as a viable excuse for this feature not being offered on this model. HDR10 with good color gamut will look and appeal well enough for typical 4K and HDR enthusiasts with this TV.",
            "Using 65 inch led by iffalcon from one month , very good picture clarity . And good wifi connectivity. Delivery time and installation was very good.",
            "Excellent TV. Excellent panel. Tons of options to modify picture settings. Chromecast works just fine. I am satisfied so far.",
            "Wonderful product my money is no waste it's worth and 4k ultra very beautiful I'm happy with in this purchase....",
            "such a wonderful 65inch TV got in 49k value for money wonderful 4K hdr image connectivity is good all apps are working very nicely installation and demo was done in due time I am really impressed thank you Flipkart",
            "Great android TV at great price.\nfor those worried about brightness, let me tell you that this is a 65 inch TV and same brightness is going to emit 4 times more light as compared to a 32 inch TV.\nSound is very clear and rich...",
            "Amazed by beauty of this TV in such light budget. Microphone support is useful for search options. Many Ppl complain abt sound.. But I found this perfectly alright. 4k quality is superb. Remotes are good. Kudos to Team Iffalcon and flipkart for proving great services in affordable price.",
            "all things good..its direct led tv..thats reason in very bright scene like white colours red colour green colour..show the white led spot on screen..only visible in bright scene..",
            "All I can say in one word is it's a value for money product.I got it at a very good price.Display quality is upto the standard and it serves good 4K videos.Connectivity is not bad either. Drawback i found was the audio quality which is below average to be honest.65inch tv suited for a big living room must have had a better audio quality;16W is not at all sufficient.Better go for a soundbar.Overall a great product.",
            "excellent tv.... good quality ,sound is not good we want to but home theatre ,picture quality is very good cinema hall experience...little bit problem to connect with remote ,overall good product ..............thanks",
            "This is second iffalcon TV in my home. I am already using their 55inch TV since last 8-9 months... TV is really awesome in this price range... I have one Sony 55 inch also at home, and was hesitating before buying iffalcon ..... but seriously iffalcon TVs are really good as per their price range ...real value for money..",
            "wow just superb great experience ....worth for money ....picture quality is awesome ....ultimate product must buy go for it",
            "let me be very specific so that future buyers can use this review. upgraded from a 49\" Samsung led TV and the refresh rate and the colours of this TV is better than that of my old Samsung, believe it or not. Audio of my Samsung TV was marginally better. connectivity is way better in this TV. I used a fire TV stick but post this purchase I hardly do. and all this at rs 63000/-. unbelievably pleased.",
            "\"Value for Money\"\npicture quality is amazing, using it for gaming. PS4 games looks amazing, 4K looks stunning! Internet connectivity is smooth, YouTube and Netflix runs well.\nFlipkart delivery and installation was good and on time\n\nCons\n1) Sound as compared to MarQ is really at lower end (I have one MarQ TV at Home town)\n2) Android version is old & you don't get any updates. whereas in MarQ Android 8.1 is running and you get patchs.\n\n\nRest all is really good enjoying my new TV",
            "This is non Baised Review after having this TV for almost 2-3 months.\n\nPros:\nExcellent 4k and Full HD picture quality.\nAudio is clear.\nBig 4k files play just fine without any lag.\nCan be updated to Oreo and Prime Video works just fine after updating to oreo, though you have to sideload it.\nBoth remote works fine, Google assistance is helpful mostly for videos search as it does not support web search.\n\nCons:\nIf your viewing distance is short go for smaller size. Closer you'll sit to tv poorer the viewing angles are so picture gets faded from sides.\n\nHDR10 is worst, normal 4k and FHD video (SDR) plays way brighter and with vibrant colors than HDR videos regardless of online or offline. The picture is just way too dark and dull basically lifeless.\n\nYou'll have to update to Oreo manually since there is no OTA available. Without the update, UI is bit laggy and slow and Prime video does not work on Android 7 either.\nAfter Oreo update there is bit complicated process to make NTFS external drive detected but once that's done TV is great to use.\n\nA lit bit of screen uniformity issue and light bleeding issue, it is only visible in grey screens but usually easy to avoid when watching something in full screen.\n\nFor this price point, this is the best TV you can get period. No other TV provides 10bit panel. If you want Big TV for general day to day use, its no brainer go for it.",
            "Best television for the price !!!!!\n\nFlipkart delivery was awesome and so was Jeeves installation and demo.\n\nAs far as TV is concerned It is worth every penny..65inch TV gives you mini theatre experience with awesome picture and sound quality..\n\nGo for it best in the price.",
            "too good a tv at this price. just wow pic quality n so many top notch features. m loving it.",
            "Very nice TV. Value for money. Good display colours. I happy to have this TV at good price.",
            "picture quality is excellent and sound quality so good",
            "simply just go...(kallu musukoni tesukovachu.)",
            "Excellent TV. Good picture clarity. Excellent sound output. All the features shown are working fine.Value for money. Just go it.",
            "Pros:\nGreat tv w.r.t value for money.\nDelivery and installation was on time.\nNetflix and YouTube are good.\nGood for gaming too!!\nVolume is good and easy to use .\n\nCons:\nWish warranty was for 3 years without any charge.\nObserved some lag in Non HD channels (voice wasn’t in sync with video for non hd channels)\nAmazon Prime video cudnt be installed using google play store as TV is an android TV!! Posted a query for the same",
            "value for money",
            "Superb quality ... I got my dream TV !!! TCL is a famous brand",
            "Excellent TV with good quality 4k resolution of movie content.\nPlayed 3d games with Bluetooth Gamepad Console also. WiFi mirror quality is good.\n\nlatest features. Must buy.",
            "super tv",
            "awesome 4k Tv Ever go for it\nsd channel Good\nhd channel very very good\n4k awesome",
            "I don't know much about technical issues of the TV. It is working. I am happy with the Flipkart because it delivered the 65 inch TV to my house where other online platforms say not deliverable.It is working well.",
            "The import month of the tv is August 2018 which is almost 6 months old... Picture quality is good but the brightness of the tv is low.. My samsung 43 inch \"PLASMA\" TV is brighter than this tv... Played HDR content from netflix they looked washed out... also the HDMI Arc does not work... tried to connect with Blaupunkt soundbar... raised the issue but they suggested me to buy new hdmi v1.4 cable where i already had connected with hdmi v2.0 cable and closed the issue without solving it..",
            "BUYER'S REVIEW AFTER 15 DAYS OF USAGE\nI bought the TV during the big billion day sale and have been using it since. Overall the hardware is good for the price, It's the software that needs to be improved.\n- CONS\n* There are a lot of software bugs in the OS, needs an update urgently. I'll mention some of those below\n*The Bluetooth pairing is shoddy doesn't connect to my Blaupunkt soundbar whereas my other tv has no issues\n*The TV doesn't switch on if there's a usb/hd connected to the tv\n*The inbuilt speakers don't turn off when you connect the home theater with the optical audio cable. Sometimes there's no output from the audio jack and needs a restart\n*The buttons on the Bluetooth remote are placed too close to eachother, I end up pressing the netflix button most of the time while going back\n* The sound from the TV's speakers lack depth, can't expect much at this price\n\n- PRO'S\n*VALUE-FOR-MONEY product\n*Good picture quality for the price although the brightness is not that high\n*Decent looks and build quality\n*Plenty of I/O ports hdmi, usb, optical etc\n*Good quality remotes and comes with a wall mount\n\nI HOPE IFFALCON TAKES THIS REVIEW AS A FEEDBACK AND DOES THE NEEDFUL. THANKS.",
            "Good TV. unfortunately Amazon Prime app wont work which is an issue with Android and Amazon. otherwise wprth for money.",
            "Excellent at this price.",
            "dnt buy this product waste tv i ever seen ,,i bought tv but in 3 days the mother was gone...service person said we didn't hav stock of board..still my tv dead condition ...no response frm service center",
            "After 7 months of usage, I can definitely say this is a killer product from a vfm perspective! everything else in this size is exorbitantly and prohibitively priced. my usage is average 2-3 hours a day and for a naked eye the screen quality is highly subjective, but it does the job and does it very well. this review is bit limited as I have switched from DTH to internet content only so Netflix, hotstar and other apps are my primary usage. again a lot depends on your internet Speed and at a good speed this TV is fantastic! hd content looks fabulous and overall no major complaints as such. the air mouse got spoilt but replaced after a bit of followup. I would definitely recommend buying this TV but also wish it remains in top shape for atleast next 4-5 yrs of my ownership!",
            "Working great thus far but its only been a few days. It's definitely a good package at 60K except OLED but who cares, just look at the price difference.\nNot faced any issues mentioned by the others.. brightness is very much there, please study the remote and options. WiFi lagging is because of your poor WiFi connection.\n\nKudos to Flipkart & TCL. The only downside is the extra amount being charged for extended warranty.. now that you have a winning product, why not stand behind it.",
            "Sometime many white spot appear on TV\n\nAudio out from OPTICAL & RCA cable not working .\n\nTV wall mount depth is very less & it is no way easy to plug /unplug cables on back side of TV . No place for fingers movement .\n\nNo details of customer support . wrote few mails from mail ids collected on internet but No one contacted me as on date . Very bad .\n\nEdit 27th Sept 2020 : DO NOT BUY THIS PRODUCT . Its scam by Flipkart .",
            "lowest price and excellent quality.",
            "I am not satisfied with the product although picture quality is good but is not long lasting i bought this tv in 2019 but lots of problems I am facing with this tv. I dont know what to do now in my city the service is also poor.",
            "Amazing TV. Stellar deal. Only issue is understanding the complexity of TV picture settings as there is no set information on manual and you have to learn it all by hit and trial method.",
            "Appearance is very cheap with silver frame.\nAudio digital sound is good but not the speakers so result is poor audio quality.Ambience sensor wold have improved the performance of brightness.I mean Auto brightness is required.",
            "Value for money",
            "I love diz product with diz range price its really awesome go for it",
            "Value for money, I recommend to all buyers, amazing connectivity, picture quality. I AM JUST ENJOYING IT!!!",
            "better then lg, Samsung,Sony...",
            "after 15 days writting review and undoubtedly value for money. Got the android oreo update and yes after update it's more smoother then nougat.\npicture quality and other features are much better then other budget segment tv brands.",
            "best in market.worth for every penny.",
            "the tv looks good and value for money.about picture,sound and connectivity i have experience for few days to give you the best review about this tv.but all round the tv is value for money.",
            "Picture quality is nearly as good as OLED television.",
            "Value for money",
            "Pathetic quality\nVery slow response\nBad Bluetooth connectivity\nVery short power cable\nTakes more than 2 min just to start and set up\nDisplay quality is poor\n2 HDMI ports are not accessible if TV is wall mounted",
            "After 2 year of purchase. Iffalcon has sent an update and after that when we switch on tv it automatically switch off and switch on for 5 times and start TV after 6 min. So do not buy this Chinese brand.. they keep happy for sometime show their real fave within 2 year",
            "worst product ever. Restarts itself every 5 minutes. Horrible experience.",
            "awsm TV! must buy!",
            "everything good but I got tv with Android 7.0 not 8.0. Is it same with everyone and will get update in few days?or oreo not yet relaeased for this one?",
            "Awesome",
            "I am writing this review after using 1 and half year..\nPicture clarity is good, but sound and connectivity issues i am facing offen. Overall fine",
            "Been using this TV for the past 10 months and not a single issue. the picture is amazing, sound quality good, true value for money and the smart remote is super useful. highly recommended.",
            "It has a Glare Screen, its a a main drawback. Got repaired twice, technical person replaced the motherboard twice..... now it working good. Almost plays all the video formats. Price wise ok. I got it for 48500",
            "very good product ,good gameing experience value of money nice 4k display .........",
            "Excellent tv really amazing clarity I am impressed",
            "good quality best price good Product......",
            "value for money",
            "Broughtt this for my sister and they are immensely satisfied with this product. Doing well",
            "superb",
            "It is excellent product how ever istalation coordination is not convenient",
            "amazing product",
            "Good product loved to use it",
            "Value for money product",
            "Delivery was done within 24 hours of order and installation within another 24 hours. Quality is good. Took extended warranty.",
            "Excellent TV and excellent support by flipcart team",
            "picture quality excellent for this price wise in hd channels but sd channels you can feel some video noise",
            "A.product so amazing that I went on to buy a 55 inches of the same model for my bedroom and got my close friend to buy a 65 in too. Highly recommemded.",
            "good tv",
            "Gr8 TV in this price... Worth every penny..Go for it guys.",
            "superb",
            "excellent",
            "I bought this TV after searching many equivalent brands available online.I found this worth spending money for this 65\" TV.There were two things in my mind,one was its aluminium frame for strength and other was Samsung panel which has more brightness then 55\" iffalcon.Picture quality and colors are Ok.Only lag is about sound.Sound should have been higher then this for big panel TV's and moreover sound lags in BASS.But sound can be enhanced by external home theatre or sound bar.Due to panels slimness it might be difficult to incorporate high bass speakers.I bought it for Rs.54000/-.For installation I just received a SMS.I was not contacted by installation agency ZEES,so that one can plan accordingly.",
            "nice tv and picture quality is just awesome must buy",
            "awesome TV. 100% value for money.",
            "Excellent product. value for money.",
            "GOOD...",
            "I have a 100MBPS internet connection & I used to watch most Netflix Shows in 4K HDR which I really liked about the TV. But after the Oreo update I am not able to watch 4k or HDR contents on Netflix.\nThis is pathetic.",
            "Good product at this price. Picture quality and sound very nice. Looks equal to premium product. Just only concern, the side edges of sceen showing black spots..",
            "awesome",
            "Amazing picture quality and sound especially on HD channels. The interface is amazing.\n\nEnjoying it daily. bought after extensive online research and reading reviews. Very happy.",
            "After more than 6 months, this works good.\nBetter than MI, since we can watch Netflix and prime, and the panel quality is better accordingly to me.\nRecently received oreo update which makes it even more smooth.",
            "it's been a week, no issues till now. Great picture quality. Got for good price, value for money.",
            "awesome tv never expected. only con is how to use prime video it is not clear.",
            "at the price it is great product.",
            "good",
            "this tv had great picture quality for the money we pay.overall a great product and totally worth it.",
            "Really Nice Video Quality But Amezon Prime Video Not shown at App Store also No Update Os",
            "I am happy to have iFALCON TV.",
            "Flipkart Delivery was prompt. Jeeves installation was good compared to all the negative review one gets online. It's to early to write about the performance cause just today only I had received the unit and installation done. Overall the first impression has been positive.",
            "Awesome product .,value for money and the installation process was smooth ..go for the extended warranty for peace of mind",
            "Product so far working fine. No complaint.Thank you",
            "Excellent TV, Value for money, Superb quality picture and sound. Thanks to Flipkart for excellent product, service and demo.",
            "ok",
            "there are dead pixels when the tv arrived, the tv is too slow and the remote to tv response time is very slow and laggy",
            "Everything is amazing for the price point...\nPros:\nPicture quality\nSound\nAndroid\nPrice\n\nCons : After using for 2 weeks,\nSometimes Lags while using apps\nWhile playing Netflix , video stutters sometimes.\nSound gets cut automatically and have to restart TV\n\nAll the above look like software bugs...Anyone else who have purchased the TV are facing this issues ?",
            "4K TV shud play 4K contents...isnt it obvious...but my TV stutters and judders and what not ...it just kills it...your entire money gone down the drain.\n1440 p contents are played just fine...but not the true 4K.\nWi-Fi is laggy...so load time varies..\nAnd the software is bad as well. It lags as hell. My bad.",
            "Really good in first look I put extended warranty. they gave assurance to replacement. of tv if any problems arise in three years we will see.",
            "awsm led. got it only in 41000. value for money. like it very much.",
            "for this cost, it's the best option. I use a normal 2.1 woofer for sound. so with this picture + 2.1 woofer (via aux) movie experience is simply superb. I can share my laptop folder by windows media player sharing service and see every movie in laptop in this with out any wire. so no more hard disk connections too. actually you can do a lot with it than just using Android apps. go for it.",
            "Feels great.Movie watching experience is at another level with this 65 inch TV.",
            "wow !!! Great product and very worth for the money :)",
            "Picture OK sound quality very simple.. Above poor... Installation and demo never expect they come and do... Do it your self... Because of my experience... Horrible after complaining so many time.. Nobody has come for installation",
            "Value for money",
            "Best Buy!! For the price it is packed with so many features but could make more user friendly. Can’t expect the blacks to be perfect, but yeah worth a buy!! Writing it after using close to two years!!",
            "Best TV with best price tag! Used for 1.5years very satisfied😊",
            "Awesome product amazing picture quality",
            "Great products",
            "supper",
            "Superb we had mini theatre watching experience",
            "good quality in all respects. I recommend to go for this product.",
            "very good and",
            "Amazing product.... Picture quality & sound quality is awesome..valuable price.",
            "Nice tv",
            "great tv in best price under 50k.....value for money......",
            "great tv. only con is it doesn't support HDR10 videos, though it plays them but screen turns pink.",
            "Smart remote stopped working in 12 days\nVery bad",
            "super",
            "Good product in this price. Instead of aluminium frame it should be black coloured. But i m enjoying with screen mirroring.",
            "Nice Tv",
            "sound fuctions not proper for example pendrive videos when playing no audio of video saying not support audio format",
            "Worth it. Go for it!",
            "superb go for it . value for money",
            "after 1week usage I am very happy with the TV",
            "Awesome nice I am so full happy",
            "This is a gem at this price point. Additional discount and exchange was a cherry on the cake. absolutely marvelous product. Must have",
            "Picture quality for hd channel is better than Samsung, Lg, Vu.\nsound quality awesome.\nconnectivity nice.\nBest product to buy.",
            "My overall rating would be about 3.5/5.",
            "Product delivered on time.\niFFALCON tv wow...\nBest picture and best sound.",
            "best",
            "installation and demo is very good",
            "Simply awesome",
            "superb Tv value for Money strong connectivity .Great Service By Flipkart... i book my TV on saturday on 11 pm at night, Monday morning I reacive my Tv After few Hours a person came to Installation woww... Special Thanks to FLIPKART.",
            "simply superb",
            "Awesome TV at grt price.fully satisfied",
            "Very Good Product. But Have Backlight Issue...",
            "average average",
            "black colour is not that gud looking , it's looking like grey .\nnot satisfied",
            "Very good product\nValue for money",
            "bast option ... best deals ... value for money",
            "Good",
            "Don’t think .. value for money ??",
            "fast delivery & fast installation\ngreat work",
            "It's been a week, TV is working great, but not recieved Android Oreo update. Go for it if you get a good deal.",
            "I bought this TV during offer. it is extremely good at this price point",
            "I am writing this review after 100 days of usage. It is mentioned as 65 inch TV but, it is only 63 inch. Picture is good. Audio is sufficient. Built, fit and finish is good. My personal opinion is that the border lining ought to have been a thin strip of aluminium instead of slightly thicker one. Everything else is as described. Good value for money.",
            "Best TV for 50k.. delivery and installation on time and good experience so far",
            "Just go for it.\nPicture quality is awesome.\nSound is also good. Screen is really huge.\nGot it for 43k in exchange of old 32 inch LG LED. Great deal.",
            "Everything if superhit except sound quality sound is low as compare to 65\" tv (should be 30 watt minimum) connectivity via phone is frustrating not good ( in VU smart tv very simple and easy) so if u want to buy then clearly go for VU",
            "Worth the money , but not good voice control.\n\nInstallation is very bad.",
            "In first glance, HD cable channels are not as sharp as I expected.",
            "If you compare the picture quality with some other brands, you feel the difference but for this price it's fine.",
            "value for money",
            "Detailed review will be posted after sometime.",
            "Awesome Purchase but Hd must for better quality",
            "Very much satisified with the performance of the Tv after having used it for 2 months now.",
            "I have bought faulted product",
            "Fantastic and absolute worth the buy",
            "Amazing quality and response time",
            "Value for money but need actual 4k contents to enjoy",
            ".it's bind blowing",
            "value for money...superb tv",
            "quality of the product is good,timely installed picture quality is good,being a new product guaranty should be extend another 2years.",
            "I feel after usage of 15days the TV lags when run for long time. has to clear the ram frequently so that there is no lag.\notherwise the picture and sound quality is very good",
            "Excellent, good picture quality, value for money...",
            "Review after using 7 days-\n\nprons:\npicture quality in 4k is awesome..\nsound is clear and loud..\nTV frame is simple and shinny..\n\ncons:\nsettings change to default every time you start TV or change mode..\nno direct settings to change WiFi or connect it.need to dive in multiple menus to connect to WiFi..\ninstallation postponed by Jeeves for 3 days continuously after first intimation, although information is passed..\n\nFlipkart:\npurchasing from flipkart is my biggest mistake as their service, support is of no use..they charged discounted price and have no answer how it happened.",
            "So much restarted problem i changed 3 times but in everytime restart problem",
            "really happy with the product..value for money..",
            "Product worth the money.",
            "With all the latest options with this budget this is the best TV I have ever seen.",
            "super value for money",
            "Value for money",
            "awesome product...\nperfect view picture quality\nbest budget tv for all.. it stasified my need....",
            "mind blowing product no problem picture quality is also good and sound is very good",
            "Not a great beauty but gets the job done",
            "picture quality is good",
            "Superb picture quality and sound",
            "Super Duper",
            "very good tv on this price tag",
            "Excellent TV. Just that after long use the tv shuts off even if TV is playing. Also with first disconnect at times. Else it's a best 4k tv",
            "super",
            "Value for money great product at very competitive prices",
            "Excellent Just go for it*************",
            "worth the cost,",
            "awesome product...good value for money.",
            "great picture quality with great sound\ncons..\ntook more time to boot\nnought operating system should be updated to Oreo\nlagging issue with Chromecast\nprons..\ngreat picture\neasy connectivity with wi fi",
            "5 star to the product.\n1 star to Flipkart for the way this was delivered. Only one person came to deliver this hugh tv, dragging the package all along all the way.",
            "FINE product but, experience with the IFFALCON support was really bad."
        ],
        "likes": [
            "118",
            "43",
            "28",
            "24",
            "28",
            "21",
            "15",
            "17",
            "5",
            "10",
            "118",
            "43",
            "28",
            "24",
            "28",
            "21",
            "15",
            "17",
            "5",
            "10",
            "8",
            "2",
            "2",
            "2",
            "2",
            "1",
            "2",
            "3",
            "3",
            "4",
            "5",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "4",
            "15",
            "2",
            "2",
            "3",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "15",
            "161",
            "71",
            "12",
            "22",
            "7",
            "7",
            "9",
            "4",
            "11",
            "18",
            "30",
            "9",
            "10",
            "23",
            "4",
            "4",
            "5",
            "6",
            "2",
            "2",
            "2",
            "2",
            "2",
            "3",
            "2",
            "2",
            "2",
            "5",
            "3",
            "3",
            "4",
            "4",
            "2",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "3",
            "3",
            "10",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "33",
            "15",
            "7",
            "10",
            "9",
            "5",
            "2",
            "6",
            "1",
            "6",
            "33",
            "15",
            "7",
            "10",
            "9",
            "5",
            "2",
            "6",
            "1",
            "6",
            "5",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "2",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "7",
            "39",
            "2",
            "2",
            "6",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "47",
            "21",
            "1",
            "4",
            "1",
            "1",
            "2",
            "0",
            "4",
            "9",
            "23",
            "4",
            "5",
            "21",
            "1",
            "1",
            "2",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "1",
            "1",
            "2",
            "4",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "4",
            "34",
            "2",
            "1",
            "1",
            "1",
            "2",
            "4",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "3",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Wy should I buy iFFALCON? Is it worth the money?",
            "Q:What is the difference between smart TV and normal TV?",
            "Q:TV is not detecting my USB?",
            "Q:Do we need to pre-order the stand and material to wall mount or can we just pay a little extra and get it mounted by them at the time of installation?",
            "Q:What are the recommended gaming apps to try out on this TV?",
            "Q:Can I set wirelees mouse and keyboard?",
            "Q:Can we play game without any cable",
            "Q:What is the maximum brightness nits available?",
            "Q:Is Skype video calling available?",
            "Q:How can we do T-cast?",
            "Q:Can we play games like PubG temple run NFS",
            "Q:Does the remote has google voice recognition?",
            "Q:My Google assistant doesn't work anymore, what can I do to fix it?",
            "Q:How to do Mirrorcasting?",
            "Q:How can I get product manual?",
            "Q:Is sound system provided by DOLBY?",
            "Q:How many HDMI ports and arc are available?",
            "Q:What is the Pendrive capacity?",
            "Q:Can I use bluetooth home theatre?",
            "Q:Can I exchange my old TV?",
            "Q:Does it have any graphic card like laptop?",
            "Q:Can I open the TV box myself?",
            "Q:What android apps are supported?",
            "Q:Will this TV support 2K videos?",
            "Q:What internet speed is required to use all the features of TV?",
            "Q:When is Prime Video getting upated?",
            "Q:What is Google Assistant?",
            "Q:What is the Bluetooth version? Is it in-built?"
        ],
        "answers": [
            "A:Yes it is, as it has most of the best features assembled for the best price comparitively. It is Google certified android, easy to access, endless entertainment. So, it is definetely worth buying.",
            "A:Wifi, apps, screen mirroring is available on smart TV but not in normal TV",
            "A:Once you connect your pendrive, you can find media center application in your TV home page, start using USB contents through this app.",
            "A:Wall mount bracket(kit) is available with the TV box itself, for the free installation please contact Flipkart.",
            "A:We have lot of games in our TV. Please login to TV playstore to experience more",
            "A:Yes, wireless mouse and keyboard can be connected",
            "A:Yes, in-built games can be played",
            "A:320nits",
            "A:No, Skype is not available",
            "A:Download T-cast app in mobile->connect it with same wifi network->select the device and cast the contents",
            "A:No",
            "A:Yes, voice feature is available in the remote",
            "A:Check internet connection, remote bluetooth pairing, mail login and try again",
            "A:Download Google Home app from playstore in your mobile-> connect it to the same wifi network->select the TV model and start casting.",
            "A:Product manual is avialable in the TV box. For softcopy, contact iFFALCON customer support",
            "A:Yes, it is Dolby sound system",
            "A:2HDMI + 1ARC is available",
            "A:Pendrive capacity is 32gb USB with 1TB hard drive",
            "A:Yes, bluetooth home theatre can be used.",
            "A:Kindly contact Flipkart and check for the exchange",
            "A:No, graphic card is not provided",
            "A:No, we recommend you to wait untill the tchnician comes for installation",
            "A:Youtube, Netflix, Jio Cinema, Sony Live, Hotstar and etc. It can be added from Google Store",
            "A:Yes it supports both 2K and 4K",
            "A:5-6mbps is the minimum internet speed required. But depends on the application being used.",
            "A:Prime Video is not avialable in this model",
            "A:Google Assistant is a feature that helps you to give voice commands to control your device.",
            "A:Bluetooth version is 5.0 and yes, it is built-in"
        ],
        "likes": [
            "3",
            "1",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    }
}