{
    "title": "KODAK 7XPro 108 cm (43 inch) Ultra HD (4K) LED Smart Android TV with 40W Sound Output & Bezel-Less Design  (43UHDX7XPROBL)",
    "product_specification": {
        "In The Box": "1N LED TV, 1N REMOTE, 1N MANUAL, 2N BATTERY, 1N WALLMOUNTING",
        "Model Name": "43UHDX7XPROBL",
        "Color": "Black",
        "Display Size": "108 cm (43 inch)",
        "Screen Type": "LED",
        "HD Technology & Resolution": "Ultra HD (4K), 3840 x 2160",
        "Series": "7XPro",
        "Smart Tv": "Yes",
        "Motion Sensor": "Yes",
        "HDMI": "3 Side",
        "USB": "2 Side",
        "Wi-Fi Type": "2.4 GHz, 5 GHz",
        "Built In Wi-Fi": "Yes",
        "Launch Year": "2021",
        "Wall Mount Included": "Yes",
        "Brightness": "500 nits",
        "Contrast Ratio": "5000:1 (Dynamic)",
        "Picture Engine": "HDR10 Plus",
        "Picture in Picture (PIP)": "No",
        "Picture And Picture (PAP)": "No",
        "Analog TV Reception": "PAL (B/G)",
        "View Angle": "178 Degree",
        "Panel Type": "IPS",
        "Digital Noise Filter": "Yes",
        "LED Display Type": "DLED",
        "Aspect Ratio": "16:09",
        "Refresh Rate": "60 Hz",
        "Supported Video Formats": "MP4, MPEG, MPG, MKV, AVI, FLV, ASF",
        "Other Video Features": "4K HDR 10 Plus, Chromecast, Stream 4K",
        "Number of Speakers": "2",
        "Speaker Type": "Box Speaker",
        "Surround Sound": "Yes",
        "Speaker Output RMS": "40 W",
        "Supported Audio Formats": "MP3, MPEG1/2/2.5, AAC, HEAAC, ASF, WMA",
        "Other Audio Features": "6 Sound Mode (Standard, Music, News, Movie, Game, User), Sound Output Device (TV Speaker, ARC, S/PDIF)",
        "Processor": "ARM Cortex A53",
        "Ram Capacity": "2 GB",
        "Storage Memory": "8 GB",
        "Clocking Speed": "1.4 GHz",
        "Supported App - Netflix": "No",
        "Supported App - Youtube": "Yes",
        "Supported App - Disney+Hotstar": "Yes",
        "Supported App - Prime Video": "Yes",
        "Supported App - Others": "Zee5, Sony Liv, Eros Now, MX Player, AirPlay",
        "Supported Mobile Operating System": "Android, iOS, Windows, Blackberry",
        "Operating System Present": "Yes",
        "Operating System": "Android",
        "Screen Mirroring": "Yes",
        "App Store Type": "Google Play Store",
        "Supported Devices for Casting": "Laptop, Mobile, PC",
        "Content Languages": "Bengali, Bhojpuri, English, Gujarati, Hindi, Kannada, Malayalam, Marathi, Oriya, Punjabi, Rajasthani, Sinhala, Tamil, Telugu, Urdu",
        "System Languages": "Assamese, Bengali, English, Gujarati, Hindi, Kannada, Malayalam, Marathi, Oriya, Punjabi, Tamil, Telugu, Urdu",
        "Bluetooth": "Yes",
        "Mobile High-Definition Link": "No",
        "Ethernet (RJ45)": "1",
        "Other Internet Features": "Live TV Channels, 20 Plus Content Partners",
        "Component In (RGB Cable)": "1",
        "Headphone Jack": "Yes",
        "RF Connectivity Input": "Yes",
        "RF Connectivity Output": "Yes",
        "Other Connectivity Features": "Network PM44-11BP 100M Ethernet Support (10/100M, DHCP), Browser, Support HDMI-ARC",
        "Touch Remote": "No",
        "Smart Remote": "Yes",
        "RF Capable": "Yes",
        "Internet Access": "Yes",
        "LED Backlit Buttons": "Yes",
        "DVR Control": "No",
        "Battery Type": "2 AAA Batteries",
        "Remote Charger": "No",
        "Other Remote Control Features": "Google Assistant Enabled Remote, Hot Keys of Sony Liv, Prime Video, and YouTube",
        "Power Requirement": "AC 100 - 240 V, 50/60 Hz",
        "Power Consumption": "0.5 W (Standby)",
        "Clock": "Yes",
        "Auto Power Off": "Yes",
        "Sleep Timer": "Yes",
        "On/Off Timer": "Yes",
        "Other Convenience Features": "More than 6000 Plus Apps and Games, Airplay, Chromecast, Google Play Store with 500,000 Plus TV Shows and Games, Google Assistant, Unlimited Content",
        "Width x Height x Depth (without stand)": "975 mm x 570 mm x 120 mm",
        "Width x Height x Depth (with stand)": "975 mm x 620 mm x 230 mm",
        "Weight (with stand)": "9.8 kg",
        "Stand Type": "Table Top",
        "Warranty Summary": "1 Year Warranty on Product and 6 Months on Accessories",
        "Covered in Warranty": "Defect Arising Out of Faulty, Defective Material or Workmanship are Covered in Warranty.",
        "Not Covered in Warranty": "The Product is Not Used According to Instructions given in the Instruction Manual. Defects Caused by Improper Use as Determined by the Company Personnel. Modification or Alteration of Any Nature is Made in the Electrical Circuitry or Physical Construction of the Set. Installation or Repair Work is Carried Out by Persons or Agency Other than Authorized by the Company. Site (Premises Where the Product is Kept) Conditions that do not Confirm to the Recommended Operating Conditions of the Machine. Original Serial Number is Removed, Obliterated or Altered from the Machine or Cabinet. Defects due to Cause Beyond Control Like Lightning, Abnormal Voltage, Acts of God or While in Transit to Service Centre or Purchaser's Residence. The Warranty does not Cover Any External Accessories (Such as Battery, Cable, Carrying Bag Etc). Dust Appearing on Television Panel after 10 Days of Usage, mentioned in the Operating Instruction Manual Supplied with this Product or Any Cosmetic Parts.",
        "Warranty Service Type": "Technician Visit",
        "Installation & Demo Details": "We'll facilitate the installation and demo through authorized service engineer at your convenience The installation will be done within 48 hours of delivery of the TV.The service engineer will install your new TV, either on wall mount or on table top. Installation and demo are provided free of cost.The engineer will also help you understand your new TV's features.The process generally covers:Wall-mounted or table-top installation, as requested.Physical check of all ports, including power and USB ports. Accessories also checked.Demonstration of features and settingsQuick run-through on how to operate the TV"
    },
    "product_description": {
        "Brilliant Visuals": "Offering Ultra HD resolution with added depth, true colours and textures, the Kodak 7XPROBL TV renders an engaging viewing experience. And, you can enjoy crystal clear and realistic images, as it is compatible with 4K HD resolution, too. So, whether you're watching a TV series, a live sporting event, or playing a game, this TV is sure to keep you immersed and entertained.",
        "Custom Interface": "Integrated with an Android Operating System, this TV provides content from anywhere in the world. And, it employs artificial intelligence to design a personalised interface according to your content preferences. Moreover, with a memory optimisation feature, a rapid boost improves the processing speed and precision of this TV.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "2",
            "1",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "1",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "1",
            "1",
            "5",
            "5",
            "1",
            "3",
            "4",
            "5",
            "4",
            "4",
            "3",
            "5",
            "5",
            "2",
            "5",
            "5",
            "4",
            "5",
            "5",
            "1",
            "2",
            "3",
            "5",
            "1",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5"
        ],
        "review": [
            "Got it on 21st Dec and Installation was done on 22nd. Thnak you for quick and good service. Sharing my views after two days of usage.\nTv works great, loved it display is very sharp. Sound is crystal clear. Sound is on bit treble side missing bass punch but good for inbuilt speakers.\nWiFi network capture range is good.\n*Can not do next using usb keyboard always have to press ok from tv remote, I tried all keys may be it need some software support.\nApart form this everything is great. Absolutely loved it😍.\n\n\nPros.\nLoud & clear sound\nGood brightness\nClarity is sharp\nDual band WiFi support\n\nCons.\nNo netflix support\nNo miracast",
            "Its the 5th day of purchase, dolby sound is awsome. At this price range, its very good with audio and picture clarity. The connectivity options are good that it has AV connector, hdmi, usb, 3.5 mm, optical etc.\n\nFixed wall mount that comes along with tv will not help, we need to buy flexible moving wall mount to easily connect the wired behind tv",
            "Uhd capable, smart remote, very good strong display, natural colours, easy access to settings, the tv gives the message of good reliable quality and value for money...",
            "Wow Amazing picture clarity and sound effect and connectivity worth value for money..I love kodak",
            "I got the delivery on time and installation experience was awsome.\nIt is really a good TV with amazing Picture quality and Audio clarity. Connectivity options are perfect and plays UHD videos flawlessly. It has google chrome cast inbuilt which helps to cast our phone easily.\n\nOverall i am very much satisfied and would highly recommend this TV",
            "The picture quality is too good and sound is amazing. Great work keep it up.... must buy this product",
            "Tv excellent this is my third kodak tv in the house with h in a span of 15 days ....excellent tv value for money good picture n excellent Dolby sound and all.app support s easy operation of remote ....65 inch and 55inch and 43 inch ...all all utlra 4k uhd tv purchases recommend people to opt for these instead of other televisons",
            "This is the good smart TV in this segment and most important it's a value for money smart TV. Sometimes you may face some connectivity issues like remote control does not work properly, work perfectly with close distance and today I have faced some problems with dish connectivity.",
            "Best in the budget segment all new features supporting comfortable in the tv happy for it😃",
            "Excellent picture quality...value for money...",
            "Got it on 21st Dec and Installation was done on 22nd. Thnak you for quick and good service. Sharing my views after two days of usage.\nTv works great, loved it display is very sharp. Sound is crystal clear. Sound is on bit treble side missing bass punch but good for inbuilt speakers.\nWiFi network capture range is good.\n*Can not do next using usb keyboard always have to press ok from tv remote, I tried all keys may be it need some software support.\nApart form this everything is great. Absolutely loved it😍.\n\n\nPros.\nLoud & clear sound\nGood brightness\nClarity is sharp\nDual band WiFi support\n\nCons.\nNo netflix support\nNo miracast",
            "Its the 5th day of purchase, dolby sound is awsome. At this price range, its very good with audio and picture clarity. The connectivity options are good that it has AV connector, hdmi, usb, 3.5 mm, optical etc.\n\nFixed wall mount that comes along with tv will not help, we need to buy flexible moving wall mount to easily connect the wired behind tv",
            "Uhd capable, smart remote, very good strong display, natural colours, easy access to settings, the tv gives the message of good reliable quality and value for money...",
            "Wow Amazing picture clarity and sound effect and connectivity worth value for money..I love kodak",
            "I got the delivery on time and installation experience was awsome.\nIt is really a good TV with amazing Picture quality and Audio clarity. Connectivity options are perfect and plays UHD videos flawlessly. It has google chrome cast inbuilt which helps to cast our phone easily.\n\nOverall i am very much satisfied and would highly recommend this TV",
            "The picture quality is too good and sound is amazing. Great work keep it up.... must buy this product",
            "Tv excellent this is my third kodak tv in the house with h in a span of 15 days ....excellent tv value for money good picture n excellent Dolby sound and all.app support s easy operation of remote ....65 inch and 55inch and 43 inch ...all all utlra 4k uhd tv purchases recommend people to opt for these instead of other televisons",
            "This is the good smart TV in this segment and most important it's a value for money smart TV. Sometimes you may face some connectivity issues like remote control does not work properly, work perfectly with close distance and today I have faced some problems with dish connectivity.",
            "Best in the budget segment all new features supporting comfortable in the tv happy for it😃",
            "Excellent picture quality...value for money...",
            "Good quality...value of money",
            "Awsome Product. It is totally a value for money. I recommend peoples to buy KODAK and don't waste your hard-earned money on LG, SAMSUNG,SONY etc.. KODAK is our own Make in India Product. Let's buy be Indian and buy Indian products.",
            "Overall quality is good. Picture and sound quality is also good. But total protection plan is not available which is a bit disappointing.",
            "Dolby audio system not working, UI Very slowly, sound quality okay, customer service very very very very bad, 3 times replacement request but not response in company or flipkart side,do not buy pls...",
            "Picture quality is good and tv sound is alright for using internal speakers,\nComes with Android 9 pie\nbiggest letdown is the storage capacity it says that it has 8gb storage while the storage that shows up in Android is 4.6gb and that to change the backlight brightness or picture mode you have to go into tv mode and then change it, ie you need to exit out of any ott app switch to tv mode and then change the backlight brightness or picture settings.",
            "Reviewing after using it for 2 months. Tv is working great. Has good picture quality with clear sound. Other ports are working as expected.",
            "Best value for money. Bezel less looks great. Netflix is not supported out of the box. Recommended budget TV.",
            "Unable to install Netflix on my TV.\nWhy Netflix is not compatible with this device ?",
            "Never buy this product dose not support netfix and pendrive my two pendrives got cracked Stop working. There is no option to use pendrive without formatting",
            "Everything is best except built in chromecast. This TV doesn't cast any mobile (or android device) on it. I've tried MI, Infinix, One Plus and Samsung as well but no luck. So if you are puchasing this TV for your Office, School or any such place, where you can use it as projector then go for any other brand.",
            "Nice product",
            "Awesome product value for your single rupee 👌👌👌👌👍👍👍",
            "I would recommend this tv to others to buy, as it's full paisa vasool deal at the price , where Kodak has given 4k with 40w speakers",
            "Value for money",
            "Excellent Product,",
            "Very good",
            "Wi fi range is not more than 2meter.",
            "Nice product 👍👍😊😊 i love it, i want recommend",
            "Nice quality",
            "Very good TV at the very cheap price. Value for money. Bought it at 22k.",
            "Great product and good installation at Great price must buy product",
            "Value for money. But Jeeves provides one of the worst installation experience. Crisp image quality. Having a bit of trouble with Netflix.",
            "realy nice quality picture",
            "Wonder ful product",
            "Awesome video and voice quality",
            "Wonderful Purchase,\nPicture quality awesome.\nSpeed delivery and installation.\nOverall satisfied.",
            "Good product overall",
            "good product",
            "Good",
            "Good",
            "Best TV for home use",
            "Very good TV",
            "It Is a amazing TV",
            "Super good",
            "Fast delivery and installation service, awesome display and sound no issue with connectivity. Easy to use remote control.",
            "Not bad",
            "Good picture quality and bezel less display\nColors are brighter than normal hd tv\nUltra hd picture quality support",
            "Instanet demo too good 👍",
            "Superb",
            "Very good picture quality",
            "Good product",
            "I purchased kodak tv 7X pro 139 cm.but its performance very band it gets frequently hang up so pl take back this tv and change other company product\n\nRegards\nK.kesavakkannan",
            "WROST TV NETFLIX NOT SUPPORTED AND SOME OTHER APP'S NOT SUPPORTED",
            "Excellent",
            "Netflix is not supported.",
            "So happy",
            "Awesome product, this is writing after a month experiencing. So good and no lag in connectivity. In this price segment as per my analysis it is best and awesome.",
            "Best tv for this price range",
            "Good product",
            "I love the product at this price range but I would love to suggest that please provide a Netflix accessibility rest of the thing are pretty impressive the specially the picture quality.",
            "Delivered on time and in good condition. Screen is good and Android features as expected. Good with included wall-hanger so we did not need the extra purchase. Satisfied with the product.",
            "The tv works really great and the support from Kodak is good as well. It’s truly value for money.",
            "Awesome experience with a decent pricing.",
            "Its the 1month of purchase, dolby sound is awesome. At this price range, its very good with audio and picture clarity.\n\nFixed wall mount that comes along with tv will not help, we need to buy flexible moving wall mount to easily connect the wired behind tv.\n\nNo Netflix, Chromecast will not work directly, need to download google home from Play Store in mobile and then Chromecast will work after pairing.",
            "Ok",
            "Satisfied",
            "Nice",
            "average quality. some programmes not coming properly. Complaint was also not rectified. Reset problem.",
            "Even though it is a smart TV but it does not support NETFLIX.It is not mentioned in their product description. Do not go ahead with this if you watch online content .",
            "Worth for price",
            "Good tv at this price range",
            "Not working properly",
            "Okay",
            "We can't install Netflix app in this TV. Major disadvantage... Audio is not so top notch",
            "Writing my review after 2 weeks of use\nbest 4k TV I got at 21k that to 43inch\nJust one down side is that even after 40w speaker doesn't sound like it. And software should be more fast",
            "This is very good TV and I feel It’s far better than reputed TV brands like LG Sony and SAMSUNG ..,",
            "Picture quality awesome and sound good but need to improve bass",
            "Sound not good",
            "I m very happy of Kodak tv",
            "Ok",
            "Netflix not there. and the remote given is very pathetic. I had changed the batteries twice in 10 days, still its not working.",
            "Unbeatable Product from Kodak, very nice TV, really loved it",
            "Surely a value for product. Quick suggestion to enhance the sound bass use personalized equilizer settings",
            "ok good",
            "🆒😎 cool",
            "Very good experience with installation, engineers are really well trained and experienced, appreciated 👍",
            "Worst tv ever",
            "Picture & Sound Quality is very bad.",
            "Sound and picture quality is not good",
            "Excellent product.",
            "chromecast not working.",
            "It is average",
            "Nice product,value for money",
            "Great great great TV in this budget. Just go for it",
            "Amazing tv iam very happy to buy this product.. In affordable price",
            "Nice product",
            "Worth for money",
            "Osam",
            "All is good best",
            "*Fabulous*\nThis is my first kodak tv purachase.Excellentproduct.Delivery and installation process is superb.4K picture clarity of this tv is awesome.connectivity features also super.. etc.wifi dual band support.I like so much.I will recomend every one to buy this kodak Tv",
            "Very good tv. Under your budget",
            "It's good",
            "Best TV at affordable price",
            "Wonderful experience with Kodak TV",
            "Awesome TV at a very reasonable price.",
            "Perfect Kodak TV",
            "Good",
            "Excellent",
            "Nice products sound is also good",
            "Looking good and working fine",
            "Nice tv in this price range",
            "Product is too good and economical price...it's worth of money",
            "Nice",
            "It is good than micromax. Happy",
            "SUPER EXCELLENT",
            "its awsome",
            "Overall good",
            "Nice",
            "Very good",
            "Good",
            "It's picture and sound quality is really good.....It's a value for money......",
            "Good TV",
            "A very good product at this price range. Moreover, the main thing is, Indian product.\n\nOnly one con I have faced, the casting problem. You can't cast the mobile or laptop screen to this tv as it will not connect after trying 100 of times.\n\nIf this is not a issue for u, u can definitely go for this.",
            "Good product......",
            "Affordable price.",
            "Picture quality for the price us awesome.\nSound quality is also amazing.\nValue for money product.",
            "Tv is awesome in this price range\nOlder version Bluetooth is not supported in this tv",
            "Very nice 👍",
            "Unable to connect devices through Bluetooth\nPurchased with lots of hope but it's devatating device",
            "Worst",
            "Frameless as expected and Brightest screen ever. Loved it",
            "Excellent choice and Clarity.",
            "Tv is great , only downside no Netflix support , please support netflix via update",
            "It is a good choice and worth the money paid",
            "Complete Value for Money. Very much satisfied",
            "Except Sound quality the product is worth.",
            "Seems good but picture has less quality to c ...",
            "A decent TV for the value, picture quality is good, sound is great and didn't face connectivity issues so far. Have to wait and see.. only draw back is there is no pre-installed Netflix app.",
            "Good picture quality and good sound",
            "I am fully satisfied with Kotak Smart TV",
            "Picture / sound quality very good",
            "Verry good",
            "Picture quality is Good.Value fo money",
            "Superb & Excellent Tv in this Budget...",
            "Amazing TV, VALUE FOR MONEY.",
            "Very Good Product",
            "Product was too good but build quality little lower side...\nRemote quality was ok not too good.... Voice control was ok... No Anti glare support...\n\nPicture quality and Sound output was too good 98%...\nProduct delivered by Flipkart 98%...\nFor Installation comes next day of delivery 98%...\nBuild Quality of TV and Remote 70%....\nConnectivity WiFi and Bluetooth connectivity was good and chrome cast was a bad experience... 70%\nYet to test HDMI and Pendrive...",
            "Nice 👍",
            "It's very tv with latest functions..",
            "Really a great product at this price range..."
        ],
        "likes": [
            "18",
            "47",
            "15",
            "1",
            "3",
            "0",
            "1",
            "7",
            "0",
            "9",
            "18",
            "47",
            "15",
            "1",
            "3",
            "0",
            "1",
            "7",
            "0",
            "9",
            "7",
            "5",
            "12",
            "4",
            "7",
            "3",
            "10",
            "6",
            "13",
            "6",
            "2",
            "2",
            "5",
            "2",
            "3",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "6",
            "23",
            "5",
            "0",
            "0",
            "0",
            "0",
            "17",
            "0",
            "0",
            "6",
            "23",
            "5",
            "0",
            "0",
            "0",
            "0",
            "17",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0",
            "2",
            "0",
            "5",
            "2",
            "9",
            "3",
            "0",
            "0",
            "3",
            "1",
            "2",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "2",
            "2",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Netflix is informed as not working for this TV so why are you answering the question as YES? I have kept as screenshot. You better change this answer else I'll get you delisted from flipkart.",
            "Q:Dolby Atmos available?",
            "Q:Which brand speakers are fixed?",
            "Q:You mention it is support HDR10 Plus, where can I find HDR10 option in TV menu? and sound mode change option available or not?",
            "Q:is jio tv or jio cinema supported?",
            "Q:Can we connect macbook to this tv",
            "Q:Can we side load third party apps in this TV ?",
            "Q:Is nextfilx available ?",
            "Q:Can i use digital set top box of Videocon D2h??",
            "Q:Does it support dual band i.e 2.4ghz and 5ghz?",
            "Q:Can I download netflix from playstore and play on this TV?",
            "Q:Extended warranty is available on this product?",
            "Q:Can mx player work",
            "Q:Inbox stand available or only wallmount",
            "Q:How much free memory is available to download apps? ROM?",
            "Q:it is made by matalic body",
            "Q:Can I display my mobile screen into the TV?",
            "Q:Can I connect PS4 or any other gaming console?",
            "Q:Is it samsung panel or normal a+",
            "Q:Can I play Dolby Vision content on Netflix?",
            "Q:Can I use netflix by installing from play store?",
            "Q:Can we get Android update?",
            "Q:Does it have 40W speaker or its a marketing gimmick?",
            "Q:How much is ram and storage of tv",
            "Q:Netflix is not working in this tv, can we use Netflix using chrome?",
            "Q:Can we play 4k video from pendrive very smoothly?",
            "Q:Can i share my screen without wifi?",
            "Q:Does it supports ps5",
            "Q:Can we connect pendrive?",
            "Q:have it bluetooth in this tv ?",
            "Q:Does this tv support Dolby sound?",
            "Q:I want to buy but firstly i want to know that is the screen is touch or not",
            "Q:Can i use fire stick with this TV?",
            "Q:Is this TV bezel less?",
            "Q:Can I stream YouTube in 4k?",
            "Q:Do we get Netflix, Amazon prime Video or Hotstar subcription with this TV?",
            "Q:Can I download apps in this TV?",
            "Q:Does this TV comes with gaming controller?",
            "Q:Does this TV have bottom firing speakers?",
            "Q:Does this support HDR10?",
            "Q:Does this TV support 4K and HDR 10?",
            "Q:What is the referesh rate of TV Panel?",
            "Q:Does the remote has built-in Bluetooth?",
            "Q:Which version of bluetooth this TV have?",
            "Q:Does it support all android TV application?",
            "Q:Wall mount is provided with the TV?",
            "Q:Need Electrical stabilizer?",
            "Q:Can we connect Google Home?",
            "Q:Does HDMI support ARC?",
            "Q:Is it certified Android TV?",
            "Q:Can we install Hotstar?",
            "Q:Is chromecast built-in ?",
            "Q:Can cast my laptop and other devices on TV?",
            "Q:What is the sound output?",
            "Q:Can I play Ludo King on TV?",
            "Q:Does Remote have Hotkeys?",
            "Q:Can I update my software?",
            "Q:What is the operating system in the TV & which version?",
            "Q:Can I connect Bluetooth headset as Bluetooth devices in it?",
            "Q:Can we connect home theater?"
        ],
        "answers": [
            "A:No, Netflix not working.",
            "A:Yes",
            "A:JBL",
            "A:not",
            "A:No",
            "A:No",
            "A:Yes",
            "A:yes",
            "A:sure",
            "A:5ghz",
            "A:yes",
            "A:no",
            "A:yes",
            "A:Both",
            "A:4gb",
            "A:No",
            "A:Yes",
            "A:Yes",
            "A:normal",
            "A:No",
            "A:Yes",
            "A:Yes",
            "A:It has 30W speaker without any sound change mode like movies, sports etc. It sounds like phone speakers",
            "A:2gb",
            "A:Works fine with Fire TV stick. So I believe it should work with chrome as well.",
            "A:yes",
            "A:no",
            "A:no",
            "A:yes",
            "A:no",
            "A:no",
            "A:it's non touch",
            "A:no",
            "A:Yes",
            "A:Yes",
            "A:No, this TV doesn't provide any sort of paid subscription on any of the platform.",
            "A:Yes, more than 6000 apps and games available on Google play store",
            "A:No",
            "A:Yes",
            "A:No",
            "A:Yes",
            "A:60 Hz",
            "A:Yes, remote works on bluetooth",
            "A:Version 5.0",
            "A:Yes",
            "A:Yes",
            "A:Can be used if power fluctuation is their in your area",
            "A:Yes",
            "A:Yes, HDMI supports ARC",
            "A:Yes",
            "A:Yes, can be downloaded from play store",
            "A:Yes",
            "A:Yes",
            "A:40W",
            "A:Yes",
            "A:Yes, 3 Hotkeys (Youtube, Amazon Prime Video, Sony Liv)",
            "A:Yes, you will receive software updates",
            "A:Official Android, Android 9.0(Pie)",
            "A:Yes",
            "A:Yes"
        ],
        "likes": [
            "13",
            "11",
            "11",
            "1",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "3",
            "6",
            "2",
            "7",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0"
        ],
        "dislikes": [
            "3",
            "8",
            "13",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "6",
            "6",
            "2",
            "14",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "0",
            "2",
            "0",
            "1",
            "1",
            "0",
            "1",
            "0",
            "4",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    }
}