{
    "title": "MarQ by Flipkart 165 cm (65) Ultra HD (4K) LED Smart Android TV  (65SAUHD)",
    "product_specification": {
        "In The Box": "Wall Mount Stand\nQSG\nPower Cord\n2 AAA Batteries\nUser Manual\n2 Remote\n1 Desktop Stand\n4 Stand Support Crews\n1 Television",
        "Model Name": "65SAUHD",
        "Color": "Grey",
        "Display Size": "165 cm (65 inch)",
        "Screen Type": "LED",
        "HD Technology & Resolution": "Ultra HD (4K), 3840 x 2160",
        "Smart Tv": "Yes",
        "Motion Sensor": "No",
        "HDMI": "1 Side, 2 Back",
        "USB": "2 Side",
        "Wi-Fi Type": "2.4 GHz&5GHz | IEEE 802.11 a/b/g/n/ac",
        "Built In Wi-Fi": "Yes",
        "Launch Year": "2018",
        "Brightness": "550 nits",
        "Contrast Ratio": "1200:01:00 (Static)",
        "Picture in Picture (PIP)": "No",
        "Analog TV Reception": "Yes",
        "Digital TV Reception": "Yes",
        "View Angle": "176 Degree",
        "Panel Type": "IPS",
        "Digital Noise Filter": "Yes",
        "LED Display Type": "LED",
        "Aspect Ratio": "16:09",
        "Refresh Rate": "60 Hz",
        "Supported Video Formats": "MPG, AVI, TS, MOV, MKV, DAT, MP4, VOB, RM, RMVB",
        "Other Video Features": "5 Picture Mode: User, Cinema, Sport, Vivid, Hi-bright\nPicture Noise Reduction\n4K Upscaler",
        "Number of Speakers": "2",
        "Speaker Type": "Box Speaker",
        "Sound Technology": "Dolby Digital with Tru-Surround Sound",
        "Surround Sound": "Yes",
        "Speaker Output RMS": "20 W",
        "Sound Mode": "Rock, Pop, Live, Dance, Techno, Classic, Soft",
        "Supported Audio Formats": "MP3, WMA, M4A, AAC, MP2, PCM, MPEG",
        "Number of Cores": "4",
        "Processor": "Quad Core",
        "Ram Capacity": "2.5 GB",
        "Storage Memory": "16 GB",
        "Supported App - Netflix": "No",
        "Supported App - Youtube": "Yes",
        "Supported App - Disney+Hotstar": "Yes",
        "Supported App - Prime Video": "No",
        "Supported App - Others": "Google Movies, Google Audio, Google Games, E-manual",
        "Supported Mobile Operating System": "Android",
        "Operating System": "Android",
        "Screen Mirroring": "Yes",
        "App Store Type": "Google Playstore",
        "Pre Installed Browser": "No",
        "Content Providers": "YouTube, Hotstar",
        "Supported Devices for Casting": "Mobile",
        "Mobile High-Definition Link": "No",
        "3G Dongle Plug and Play": "No",
        "Ethernet (RJ45)": "1",
        "Other Internet Features": "Android 8.0",
        "Component In (RGB Cable)": "0",
        "Composite In (Audio Video Cable)": "0",
        "NFC Support": "No",
        "PC Audio In": "No",
        "PC D-sub": "No",
        "Digital Audio Output": "1",
        "RF Connectivity Input": "1",
        "Analog Audio Input": "Yes",
        "Other Connectivity Features": "1RF In, 1 AV In, 2USB(2.0&3.0), 3 HDMI Port, 1LAN, 1 Digital Audio Out",
        "Touch Remote": "No",
        "Smart Remote": "Yes",
        "RF Capable": "No",
        "Internet Access": "Yes",
        "DVR Control": "No",
        "Operating Distance": "8m",
        "Battery Type": "2 AAA Batteries",
        "Other Remote Control Features": "1 Standard and 1 Voice Controlled Bluetooth Enabled",
        "Power Requirement": "AC 100 - 240 V, 50/60 Hz",
        "Power Consumption": "230 W, 0.5 W (Standby)",
        "Other Power Features": "Power off/Shut down",
        "Clock": "Yes",
        "Auto Power Off": "Yes",
        "Sleep Timer": "Yes",
        "On/Off Timer": "Yes",
        "Other Convenience Features": "NA",
        "Width x Height x Depth (without stand)": "1454.7 mm x 837.1 mm x 104.4 mm",
        "Weight (without stand)": "21.5 kg",
        "Width x Height x Depth (with stand)": "1454.7 mm x 892.4 mm x 281.7 mm",
        "Weight (with stand)": "22 kg",
        "Stand Type": "Wall Mount and Desktop Stand",
        "Warranty Summary": "1 Year Limited Domestic Warranty",
        "Covered in Warranty": "Warranty is Non-transferrable, Valid Only in the Territory of India and Extended Only to the First End User Customer (Customer). Warranty will be Valid Only When the Original Purchase Invoice is Presented at the Time of Service. Warranty will Cover Only Functional Parts and Software Issues Having Manufacturing Defects and Does Not Cover Damages Resulting From Un-authorised Adaptations / Adjustments / Tampering of the Product, Improper Installation of the Product, Normal Wear and Tear Caused Due to Use of Product",
        "Not Covered in Warranty": "Warranty Does Not Cover Damage Caused to the Product Due to Improper Installation by Customer, Normal Wear and Tear Caused Due to Use of Product. Warranty Does Not Cover Any External Accessories to the Product (Such as Battery, Cable, Carrying Bag Etc). All Plastic, Rubber, Glass, or Aesthetic Parts and Consumable Replacements will be on a Chargeable Basis. All Transportation and Handling Expenses Incurred While Replacing or Repairing Will be Payable by the Customer. Warranty Shall be Voids If: a) The Type or Serial No. On the Product has been Altered, Removed or Defaced. The Product is not Operated as Per the Instructions Given in the User Guide, If Any",
        "Warranty Service Type": "Installation and demo",
        "Installation & Demo Details": "Please note that any unauthorized handling or self-installation of the product will lead to return & product warranty being void\nWe'll facilitate the installation and demo through authorized service engineer at your convenience. Flipkart will communicate the day and time slot of the scheduled Installation & Demo through a SMS and the same information will also be available in your order details page. The service engineer will install your new TV, either on wall mount or on table top. Installation and demo are provided free of cost. The engineer will also help you understand your new TV's features. The process generally covers: Wall-mounted or table-top installation, as requested. Physical check of all ports, including power and USB ports. Accessories also checked. Demonstration of features and settings. Quick run-through on how to operate the TV"
    },
    "product_description": {
        "Latest Google Certified Android 8.0 Oreo": "Stay connected to your Google account even when you're phone's away. This TV lets you access almost all apps from your Google Play Store.",
        "Voice Control": "Use your voice to type and control the remote. What's more, you can also check the weather and control AI household lights with this feature.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "4",
            "3",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "2",
            "5",
            "5",
            "4",
            "5",
            "4",
            "2",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "4",
            "3",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review": [
            "I am a visual effects artist and spent a lot of time to pick this brand over its competitors like I falcon, Thompson, Vu and MI\n\nONE SENTENCE VERDICT-with smart voice control and superior IPS panel this stands out better to closest rivals -I FALCON and VU.so Blindly go for this.\n\nHIGHLIGHTS\n1.BIGGER THAN YOU EXPECT. Go for this size only if you have a minimum viewing distance of 10 feet. Also keep back light to 50(in settings)to reduce eye strain\n2.RECOGNIZES WORDS EASILY THROUGH VOICE COMMANDS\n3. MX PLAYER,VLC PLAYER etc.-can be DOWNLOADED .though could download NETFLIX,need to check its compatibility .\n4.USB accessibility is excellent. Works fine even if you use any number of pen drives using multi usb hub. Can connect ONLY BRANDED external hard disk too .(EXTERNAL CASING with INTERNAL HARD DISK won’t work)\n5.IPS panel used here is designed by LG which is the best when it comes to screen technology(honestly all IPL panels are designed by LG only)\n6.Package /delivery-PERFECT\n\nFEW TIPS-(not issues since they have solutions)\n\n1.can't access ports after wall mounting with the fittings that came with the TV. SOLUTION 1-can buy an adjustable wall fitting that can be tilted. Costs around 4k +fitting charge. SOLUTION 2-go for table mounting\n2.has only digital optical audio out.so not easy to connect to a budget home theatre which normally has only AUX input. SOLUTION-there are few digital to aux converter(but not branded)\n3.EXTRA TEMPTING MANDATORY EXPENSE- Rs 19300 (almost for all 65 inch TVs you need to consider these) SPLIT UP -stabilizer (vguard digi 200)-Rs.3500,usb extension-100,hdmi 5 meter-300, Bluetooth mouse-500,audio out optic cable surround decoder-2500,2 years additional waranty-4000,tv stand-9000,dedicated harddisk-3400,\nIn addition if you go for a 5.1 home theatre with optical input-15000 to 25000\n4.controlling volume is not flexible at lower levels\n5.rarely voice command will lag .SOLUTION-reboot\n6.accessibility is not so easy initially\n7.true surround is nice ,but believe me, without a surround external speaker system you won’t get surround sound.by default whatever be the sound mode, your TV will only support stereo.\n8.(MIGHT LOOK LIKE A WORTHLESS POINT .BUT...)re packing/transportation will be a big issue.so need to find a place to keep such a huge packing box safely somewhere\n9.if you are looking for a best budget home theatre sound system that supports optical input ,go for Logitech Z906 Surround Sound Speaker System(did a lot research and found it's better than the only other rival SONY .but somehow I ended up buying a Sony system. Reasons explained below)\n\nAFTER 30 DAYS REVIEW\n4k playing flawless at 100 mbps.\nPairing Bluetooth remote - its involves simple steps\n1.long press the remotes home button and left arrow(left side of the navigation button).green light will blink in remote\n2.go to TV’s accessibility menu and could find ‘pair new Bluetooth device’\n3.new screen is popped showing the TV remote at top right. Just click it(probably with a mouse)\nVoice Controls possible through google smart speaker-the already available voice control option in the smart remote is so amazing .it clearly understands my Indian accent and now one I miss it when I have type things in my laptop and in my office pc. yet an another amazing upgrade is that ,if you own a google smart speaker and linked it to your smart TV, you case use your voice to play a video in YouTube directly, turn off TV etc. just by speaking to your smart speaker (no need of remote).however turning on TV is not working though voice command\n5.1 Home theatre sound support-since I didn’t had the optical out I decided to upgrade my surround system (only after some hectic experiment fails using some unbranded sound decoders in local market).after a thorough research on a budget home theatre which had an optical support ,only two home theatres stayed in my options .one is SONY (almost all models) and the other is Logitech.\nI bought Sony since it came with a blue ray player,smart hdmi(can use TV Bluetooth remote itself to control both home theatre and TV)and more importantly every time you switch on the TV, the sound system also smartly turns on and you feel like its clubbed as a single unit .\n\nBut honestly the other option Logitech Z906 is better in terms of sound quality ,custom control and also in price.\n\nUse mobile as a Remote Control- by installing app ‘Android Remote’\nREASON FOR ONE STAR LESS-\nhave to reduce one star for 2 main design issues that should have been easily fixed by MARQ.\n1.PORTS CANT BE ACCESSED ONCE WALL MOUNTED.\n2.NO AUX AUDIO OUT.\n3.interactive adjustment of sound/video is bit clumsy (very annoying)\n4.found only inbuilt media player is delivering 5.1 channel sound.(not supporting few formats).not happening with VLX or MX player\nPlease like my review if you found this review usefull",
            "I was looking for a decent quality big-sized TV with decent sound output and play the latest codecs in 4k and available at a decent rate.\n\nAfter losing half a lakh on a premium phone which worked exactly for 2 years, I was hesitant to buy a TV at premium rates (1k or more) and no guarantee of working post 3-5 years.\n\nAfter referring to Vu, Mi, TCL, Thomson, Blaupunkt, I felt this Marq offering was the best of all I want. It was advertised as a 65 inch 4k TV with Dolby surround sound. I also came to know that it had a quad core processor with 2.5GB RAM. That was something I was looking forward to. I had tried playing 4k HEVC encoded videos on Android boxes and phones and I found that only premium boxes or Snapdragon 845 phones can fluidly play 4k HEVC files. I assumed that if the player can play this file, other files will be a breeze with no lag.\n\nThe TV was huge compared to my existing 42 inch TV(of course) and no video or photo could justify the actual size.\n\nWhat I liked :\nIt plays the 4k HEVC files flawlessly. No issues at all. Really beautiful video output. YouTube videos too stream beautifully.\nThe speakers are front-facing and so, thankfully, are loud and in-your-face whether the TV is wall mounted or on stand. Output was loud as I couldn't watch movies more than 3-4 volume level (about one-tenth of 100% sound) without my mother yelling me to turn down the volume. And the TV is in a huge open drawing room!\n\nWhat I disliked :\nNo support to Netflix or Amazon Prime, my two primary media streams, in any way (direct or side loaded). I thought it might be an issue with DRM, but it is an L1 Widevine device!\nAlso, ineffective support for other apps, looks like Marq intentionally doesn't want us to load further or alternate apps. For eg, ES Explorer doesn't detect some pendrives on a multi-USB hub, and so does VLC. Chrome browser, Amazon music, Saavn cannot be found in store. How can this TV be called a Google-certified Android TV? Attempting side-loading these apps also seems futile.\nDefault and only available media player doesn't support skip-jumping to certain points in a video(like in PC's or as air mouse). It also doesn't have any options for customisation. I really needed the player to remember last played position in videos and am forced to play it from the beginning. The fancier remote can only fastforward to 32x. However, to it's favour, the less fancier remote has a blue button which could take you to an entered position (hh:mm:ss) in the file.\nI was told (and shown) by the Jeeves rep that I can connect Bluetooth mouse to the TV and move to required positions in video file, but I later found that it's a random occurance. Sometimes the mouse click is accepted, sometimes it's not! I even bought a wireless keyboard mouse specific for smart TVs, but not all buttons on that also were detected. It didn't skip-jump either. If anyone gets a 100% compatible wireless solution, please intimate me too or put up in your reviews.\nNo S/PDIF.\nI was not able to cast any of my phones onto the TV and after lot of experiment was able to cast using my phone's hotspot, even though both phone and TV were in full range to an external WiFi! Again, casting was jerky for some Netflix and Amazon prime content and I was not able to appreciate subHD content (my phone's unfortunately had L1 Widevine level) on a 4k 65 incher!\n\nI was not able to fully appreciate the HDR mode as I found normal 1080p video more colourful and deeper than 4K HDR of the same file and format! [Of course, I had enabled HDR in picture options]\nNeither was I able to appreciate content less than 1080p. Does this TV really have video upscaling or am I too discerning?\nI was also not able to appreciate the Dolby effect, even after downloading content from the Dolby site itself. Some surround effect was felt though, nothing unanticipated. All sounds was, as the speaker was, from the front direction only.\nThat's all for now, folks. Will keep you updated after few months of usage. As of now, I'm satisfied with the quality and more than satisfied with the performance at this price.\nBTW, I had a few queries regarding the functioning and limits of the TV, which I asked vice email to Marq. They just arranged for a service rep visit.\nThe queries were :\n1. Regarding a compatible keyboard/mouse for jumping to portions in a video. I was not able to do it with wired/wireless or even air mouse!\n2. Wireless streaming from phone is just buffering and hanging sometimes. it also exits this mode during hang.\n3. After the recent update, power off on remote actually shuts down the TV, instead of just offing the display, which was fast. this is now an actual shutdown and restart (talking huge time)\n4. I asked if Netflix & Amazon Prime support be ever extended to this TV, as it is Widevine L1.\n5. No other regular app works properly on the TV, other than the default installed ones. No Chrome, Google photos in the Play Store, VLC, Kodi, ESExplorer don't detect pendrives/video files on a Google certified Android 8 TV!\nNo reply received yet.\nAnother issue which cropped up recently... sometimes, when the display is off (remote OFF), the TV switches ON on its own! We generally don't switch off the power on the TV at night, and next morning the TV is ON. Is it updating...or... power fluctuations... or... possessed 🙄",
            "Pros:\n*MarQ by Flipkart....It's really an excellent 65inch TV at this price range and it stands ahead of its competitors from other brands.\n*The most realistic viewing experience with a vivid picture quality and immersive sound experience is guaranteed.\n*It works on a superior type of search engine with highly advanced processor and an updated android version.\n*Connection is hassle free as it has 3*HDMI for connecting your possibilities of external devices.\n*Higher contrast ratio enhance the depth of pictures and HDR works excellent for this 550nits of brightness provider.\n*Better Ram specification and an internal storage makes your work easier.\n*Best view can be obtained in a distance of 15 to 20 feet range.\n*Installation is provided at a faster rate after delivery.\n*Installation of voltage stabilizer must be done to extend the life of TV(V-Guard Digi 200) Recommended.\n\n\ncons:\n*Screencasting is possible only if u own a Chromecast device or an WiFi router.\n*Heating issues are observed even if the TV is working for an hour.\n*It's a little harder for connecting cables if the TV is wall mounted.\n*Universal remote is not provided as it makes too many remotes to be handled.\n*User interface seems to be outdated.\n\nFinally you can buy this product as it doesn't fail to make u happy at this price range.Its an excellent product at this range.",
            "looking Stylish, Picture quality Good, Sound system is Rocking,No need of Home theatre .. Stunning performance ..Every penny is worthy, paisa vasool product .I blindly beloved flipkart so I purchased, after receiving this product fully satisfied.. thank you so much flipkart",
            "wonderful quality sound quality is very good picture quality is wonderful the best",
            "I'm using this TV for about 10-12 days and I want to tell u guys some things\n:::::::::::pros::::::::::::\n1) amazing picture quality\n2) superb sound quality\n3)silky smooth interface with no lags\n:::::::::::cons::::::::::::\n1) corners of the screen has little light effects and it can be reduced by changing backlight from 100 to 50 it gives more punching colours\n2) in connectivity there is no AV out ,if I have RCA type home theatre like I have then it's a problem, u need to buy digital to analog audio converter (Amazon) or I have Bluetooth it works great\n3) talking about Bluetooth , flipkart says it has lip sync technology and it reduces audio delays when connected to Bluetooth and cabled devices and it work but only with YouTube, Amazon prime, Netflix (installed from HDD) and Zee5 ,like only streaming apps it works but when u play movies from hdd and it doesn't works at all's audio delays like about 2-3 sec and even with the Tata sky channels it delays like hell ,I have Bluetooth in my home theatres\n4) talking about accessibility u cant access media from hdd with other apps like VLC player ,MX player and Archos player (Access denied) and this apps can solve audio delays and it has all the codecs support because this TV don't have DTS audio support and most of the 4k movies have DTS audio, we have to play movies from inbuilt multi media player app only by converting movie from laptop\n\nFlipkart plzz solve this audio delays issues atleast give audio delays options for Bluetooth only s/pdif audio delays option is available\n\nThank you",
            "real value for money. excellent clarity. very happy with the product. good service and delivery.. please note that HDMI 3 is a special port to enhance audio and only HDMI version 1.3 world on that port...",
            "Aweaome tv supreb 4k clarity sound is awesome feel like pvr cinema hall yes u heard it right jeeves support is really good demo installation good tv 65 inch is damn large cons; not able to use pendrive for media play u can cast media but externally usb drive make it its own storage by tv cuz its android paystore apps really good youtube aweeeeeeeesome",
            "Marq by flipcart its a very big tv but low budget tv .sound is very good .4k clarity nice delivery and installation services ok valuefor money",
            "1 Years Review- So I've used this tv for an year now and my views on it have changed over time. I rated it 5 stars as soon as I got it because it felt like a great deal and screen was bright and nice.\n\nA year of usage, and I started to see the flaws over time. Things I should have considered more:\n\n1. Bad software- It is an android tv but not a good one at it. No Netflix or Prime. It reminds me of the early android phones that were in the market, glitchy and bad a UI. The Google voice commands hardly work. Apps don't perform well, requires restarts once in while\n\nI moved to an Prime stick couple of months ago and realised the difference in quality instantly. Just a better and cleaner dash board and UI, no glitches and a far better voice control. That is what I would recommend everyone to do.\n\n2 Sound- It is a powerful speaker, no arguments there. But the volume control sucks. It's either to quite at volume 5 or too loud at volume 6....very frustrating. And I definitely notice the lack of clarity in voice compared to better TV's.\n\n3. Screen- This is a positive. I like the screen quality, bright and sharp for its price point.\nIt says that it has HDR but I don't really see that it videos when compared to a samsung tv. The depth of colours are definitly not on par, but then it is unfair for me to compare it to a tv that costs twice as much.\n\n4. Value for money- It is value for money, if you want a 65 inch 4k tv and are not too particular with software, and use it for general dth viewing, it's a good choice. The other flaws can be overlooked.\n\nIf I had to go back in time, I would not get this tv. Im not the person that changes tv's every couple of years. I will definitely use them for 6-8 years. And for that reason I would spend more and get a better branded tv that will give me a better user experience.",
            "I am a visual effects artist and spent a lot of time to pick this brand over its competitors like I falcon, Thompson, Vu and MI\n\nONE SENTENCE VERDICT-with smart voice control and superior IPS panel this stands out better to closest rivals -I FALCON and VU.so Blindly go for this.\n\nHIGHLIGHTS\n1.BIGGER THAN YOU EXPECT. Go for this size only if you have a minimum viewing distance of 10 feet. Also keep back light to 50(in settings)to reduce eye strain\n2.RECOGNIZES WORDS EASILY THROUGH VOICE COMMANDS\n3. MX PLAYER,VLC PLAYER etc.-can be DOWNLOADED .though could download NETFLIX,need to check its compatibility .\n4.USB accessibility is excellent. Works fine even if you use any number of pen drives using multi usb hub. Can connect ONLY BRANDED external hard disk too .(EXTERNAL CASING with INTERNAL HARD DISK won’t work)\n5.IPS panel used here is designed by LG which is the best when it comes to screen technology(honestly all IPL panels are designed by LG only)\n6.Package /delivery-PERFECT\n\nFEW TIPS-(not issues since they have solutions)\n\n1.can't access ports after wall mounting with the fittings that came with the TV. SOLUTION 1-can buy an adjustable wall fitting that can be tilted. Costs around 4k +fitting charge. SOLUTION 2-go for table mounting\n2.has only digital optical audio out.so not easy to connect to a budget home theatre which normally has only AUX input. SOLUTION-there are few digital to aux converter(but not branded)\n3.EXTRA TEMPTING MANDATORY EXPENSE- Rs 19300 (almost for all 65 inch TVs you need to consider these) SPLIT UP -stabilizer (vguard digi 200)-Rs.3500,usb extension-100,hdmi 5 meter-300, Bluetooth mouse-500,audio out optic cable surround decoder-2500,2 years additional waranty-4000,tv stand-9000,dedicated harddisk-3400,\nIn addition if you go for a 5.1 home theatre with optical input-15000 to 25000\n4.controlling volume is not flexible at lower levels\n5.rarely voice command will lag .SOLUTION-reboot\n6.accessibility is not so easy initially\n7.true surround is nice ,but believe me, without a surround external speaker system you won’t get surround sound.by default whatever be the sound mode, your TV will only support stereo.\n8.(MIGHT LOOK LIKE A WORTHLESS POINT .BUT...)re packing/transportation will be a big issue.so need to find a place to keep such a huge packing box safely somewhere\n9.if you are looking for a best budget home theatre sound system that supports optical input ,go for Logitech Z906 Surround Sound Speaker System(did a lot research and found it's better than the only other rival SONY .but somehow I ended up buying a Sony system. Reasons explained below)\n\nAFTER 30 DAYS REVIEW\n4k playing flawless at 100 mbps.\nPairing Bluetooth remote - its involves simple steps\n1.long press the remotes home button and left arrow(left side of the navigation button).green light will blink in remote\n2.go to TV’s accessibility menu and could find ‘pair new Bluetooth device’\n3.new screen is popped showing the TV remote at top right. Just click it(probably with a mouse)\nVoice Controls possible through google smart speaker-the already available voice control option in the smart remote is so amazing .it clearly understands my Indian accent and now one I miss it when I have type things in my laptop and in my office pc. yet an another amazing upgrade is that ,if you own a google smart speaker and linked it to your smart TV, you case use your voice to play a video in YouTube directly, turn off TV etc. just by speaking to your smart speaker (no need of remote).however turning on TV is not working though voice command\n5.1 Home theatre sound support-since I didn’t had the optical out I decided to upgrade my surround system (only after some hectic experiment fails using some unbranded sound decoders in local market).after a thorough research on a budget home theatre which had an optical support ,only two home theatres stayed in my options .one is SONY (almost all models) and the other is Logitech.\nI bought Sony since it came with a blue ray player,smart hdmi(can use TV Bluetooth remote itself to control both home theatre and TV)and more importantly every time you switch on the TV, the sound system also smartly turns on and you feel like its clubbed as a single unit .\n\nBut honestly the other option Logitech Z906 is better in terms of sound quality ,custom control and also in price.\n\nUse mobile as a Remote Control- by installing app ‘Android Remote’\nREASON FOR ONE STAR LESS-\nhave to reduce one star for 2 main design issues that should have been easily fixed by MARQ.\n1.PORTS CANT BE ACCESSED ONCE WALL MOUNTED.\n2.NO AUX AUDIO OUT.\n3.interactive adjustment of sound/video is bit clumsy (very annoying)\n4.found only inbuilt media player is delivering 5.1 channel sound.(not supporting few formats).not happening with VLX or MX player\nPlease like my review if you found this review usefull",
            "I was looking for a decent quality big-sized TV with decent sound output and play the latest codecs in 4k and available at a decent rate.\n\nAfter losing half a lakh on a premium phone which worked exactly for 2 years, I was hesitant to buy a TV at premium rates (1k or more) and no guarantee of working post 3-5 years.\n\nAfter referring to Vu, Mi, TCL, Thomson, Blaupunkt, I felt this Marq offering was the best of all I want. It was advertised as a 65 inch 4k TV with Dolby surround sound. I also came to know that it had a quad core processor with 2.5GB RAM. That was something I was looking forward to. I had tried playing 4k HEVC encoded videos on Android boxes and phones and I found that only premium boxes or Snapdragon 845 phones can fluidly play 4k HEVC files. I assumed that if the player can play this file, other files will be a breeze with no lag.\n\nThe TV was huge compared to my existing 42 inch TV(of course) and no video or photo could justify the actual size.\n\nWhat I liked :\nIt plays the 4k HEVC files flawlessly. No issues at all. Really beautiful video output. YouTube videos too stream beautifully.\nThe speakers are front-facing and so, thankfully, are loud and in-your-face whether the TV is wall mounted or on stand. Output was loud as I couldn't watch movies more than 3-4 volume level (about one-tenth of 100% sound) without my mother yelling me to turn down the volume. And the TV is in a huge open drawing room!\n\nWhat I disliked :\nNo support to Netflix or Amazon Prime, my two primary media streams, in any way (direct or side loaded). I thought it might be an issue with DRM, but it is an L1 Widevine device!\nAlso, ineffective support for other apps, looks like Marq intentionally doesn't want us to load further or alternate apps. For eg, ES Explorer doesn't detect some pendrives on a multi-USB hub, and so does VLC. Chrome browser, Amazon music, Saavn cannot be found in store. How can this TV be called a Google-certified Android TV? Attempting side-loading these apps also seems futile.\nDefault and only available media player doesn't support skip-jumping to certain points in a video(like in PC's or as air mouse). It also doesn't have any options for customisation. I really needed the player to remember last played position in videos and am forced to play it from the beginning. The fancier remote can only fastforward to 32x. However, to it's favour, the less fancier remote has a blue button which could take you to an entered position (hh:mm:ss) in the file.\nI was told (and shown) by the Jeeves rep that I can connect Bluetooth mouse to the TV and move to required positions in video file, but I later found that it's a random occurance. Sometimes the mouse click is accepted, sometimes it's not! I even bought a wireless keyboard mouse specific for smart TVs, but not all buttons on that also were detected. It didn't skip-jump either. If anyone gets a 100% compatible wireless solution, please intimate me too or put up in your reviews.\nNo S/PDIF.\nI was not able to cast any of my phones onto the TV and after lot of experiment was able to cast using my phone's hotspot, even though both phone and TV were in full range to an external WiFi! Again, casting was jerky for some Netflix and Amazon prime content and I was not able to appreciate subHD content (my phone's unfortunately had L1 Widevine level) on a 4k 65 incher!\n\nI was not able to fully appreciate the HDR mode as I found normal 1080p video more colourful and deeper than 4K HDR of the same file and format! [Of course, I had enabled HDR in picture options]\nNeither was I able to appreciate content less than 1080p. Does this TV really have video upscaling or am I too discerning?\nI was also not able to appreciate the Dolby effect, even after downloading content from the Dolby site itself. Some surround effect was felt though, nothing unanticipated. All sounds was, as the speaker was, from the front direction only.\nThat's all for now, folks. Will keep you updated after few months of usage. As of now, I'm satisfied with the quality and more than satisfied with the performance at this price.\nBTW, I had a few queries regarding the functioning and limits of the TV, which I asked vice email to Marq. They just arranged for a service rep visit.\nThe queries were :\n1. Regarding a compatible keyboard/mouse for jumping to portions in a video. I was not able to do it with wired/wireless or even air mouse!\n2. Wireless streaming from phone is just buffering and hanging sometimes. it also exits this mode during hang.\n3. After the recent update, power off on remote actually shuts down the TV, instead of just offing the display, which was fast. this is now an actual shutdown and restart (talking huge time)\n4. I asked if Netflix & Amazon Prime support be ever extended to this TV, as it is Widevine L1.\n5. No other regular app works properly on the TV, other than the default installed ones. No Chrome, Google photos in the Play Store, VLC, Kodi, ESExplorer don't detect pendrives/video files on a Google certified Android 8 TV!\nNo reply received yet.\nAnother issue which cropped up recently... sometimes, when the display is off (remote OFF), the TV switches ON on its own! We generally don't switch off the power on the TV at night, and next morning the TV is ON. Is it updating...or... power fluctuations... or... possessed 🙄",
            "Pros:\n*MarQ by Flipkart....It's really an excellent 65inch TV at this price range and it stands ahead of its competitors from other brands.\n*The most realistic viewing experience with a vivid picture quality and immersive sound experience is guaranteed.\n*It works on a superior type of search engine with highly advanced processor and an updated android version.\n*Connection is hassle free as it has 3*HDMI for connecting your possibilities of external devices.\n*Higher contrast ratio enhance the depth of pictures and HDR works excellent for this 550nits of brightness provider.\n*Better Ram specification and an internal storage makes your work easier.\n*Best view can be obtained in a distance of 15 to 20 feet range.\n*Installation is provided at a faster rate after delivery.\n*Installation of voltage stabilizer must be done to extend the life of TV(V-Guard Digi 200) Recommended.\n\n\ncons:\n*Screencasting is possible only if u own a Chromecast device or an WiFi router.\n*Heating issues are observed even if the TV is working for an hour.\n*It's a little harder for connecting cables if the TV is wall mounted.\n*Universal remote is not provided as it makes too many remotes to be handled.\n*User interface seems to be outdated.\n\nFinally you can buy this product as it doesn't fail to make u happy at this price range.Its an excellent product at this range.",
            "looking Stylish, Picture quality Good, Sound system is Rocking,No need of Home theatre .. Stunning performance ..Every penny is worthy, paisa vasool product .I blindly beloved flipkart so I purchased, after receiving this product fully satisfied.. thank you so much flipkart",
            "wonderful quality sound quality is very good picture quality is wonderful the best",
            "I'm using this TV for about 10-12 days and I want to tell u guys some things\n:::::::::::pros::::::::::::\n1) amazing picture quality\n2) superb sound quality\n3)silky smooth interface with no lags\n:::::::::::cons::::::::::::\n1) corners of the screen has little light effects and it can be reduced by changing backlight from 100 to 50 it gives more punching colours\n2) in connectivity there is no AV out ,if I have RCA type home theatre like I have then it's a problem, u need to buy digital to analog audio converter (Amazon) or I have Bluetooth it works great\n3) talking about Bluetooth , flipkart says it has lip sync technology and it reduces audio delays when connected to Bluetooth and cabled devices and it work but only with YouTube, Amazon prime, Netflix (installed from HDD) and Zee5 ,like only streaming apps it works but when u play movies from hdd and it doesn't works at all's audio delays like about 2-3 sec and even with the Tata sky channels it delays like hell ,I have Bluetooth in my home theatres\n4) talking about accessibility u cant access media from hdd with other apps like VLC player ,MX player and Archos player (Access denied) and this apps can solve audio delays and it has all the codecs support because this TV don't have DTS audio support and most of the 4k movies have DTS audio, we have to play movies from inbuilt multi media player app only by converting movie from laptop\n\nFlipkart plzz solve this audio delays issues atleast give audio delays options for Bluetooth only s/pdif audio delays option is available\n\nThank you",
            "real value for money. excellent clarity. very happy with the product. good service and delivery.. please note that HDMI 3 is a special port to enhance audio and only HDMI version 1.3 world on that port...",
            "Aweaome tv supreb 4k clarity sound is awesome feel like pvr cinema hall yes u heard it right jeeves support is really good demo installation good tv 65 inch is damn large cons; not able to use pendrive for media play u can cast media but externally usb drive make it its own storage by tv cuz its android paystore apps really good youtube aweeeeeeeesome",
            "Marq by flipcart its a very big tv but low budget tv .sound is very good .4k clarity nice delivery and installation services ok valuefor money",
            "1 Years Review- So I've used this tv for an year now and my views on it have changed over time. I rated it 5 stars as soon as I got it because it felt like a great deal and screen was bright and nice.\n\nA year of usage, and I started to see the flaws over time. Things I should have considered more:\n\n1. Bad software- It is an android tv but not a good one at it. No Netflix or Prime. It reminds me of the early android phones that were in the market, glitchy and bad a UI. The Google voice comma...\nREAD MORE",
            "Blazing fast delivery and installation. All done within a day. Excellent packaging. Quality product. No complaints. Worth every penny. 10/10. Would recommend 100%!",
            "I have been using a 36 in HD TV by Croma for a couple of years before I switched to MarQ 65 in 4K. I am totally into buying branded stuff except for TVs which is one such electronic item I believe is overly hyped by brands and make it really expensive for just the logo some times. Ignore the brand logo on a TV, and there are for sure many TVs that are excellent and at a very good price point. Perhaps, there may be certain features in the branded TVs which as a normal consumer wouldn't notice or matter much.\n\nNow for the MarQ 65 in 4K TV itself. It is an amazing buy. I have seen & read many reviews for TVs by various channels and learned that Mi 55 TV Pro is a good buy",
            "Voot & Prime apps NOT available. Netflix does NOT work.\nThe popular apps are NOT available in this TV. Cannot download nor instal APK.\nThis TV is NOT fit to be called as a Smart TV. This TV is a JUNK.\nThere are only JUNK apps which is of no use to most of Indians.\nFlipkart is now NOT giving refund also even though within the 10 day return period.\nPathetic service. Technicians from Jeeves were also not aware that this TV does not support these popular apps.\nThe customer service guy Jatin questions me why did you buy this TV when I complained of the incapability of the apps. When they don't mention about the product in detail, how do they even call it a customer service. How can they question me?\nVery bad service. I have bought loads of products and had never felt cheated. This is cheating.",
            "WOW is not enough for this TV.\n\nFeeling like watching movies in theater.\n\nColors are punchy, very thin bazzels, Dolby Digital sound, don't need even external Woofers until unless you want to experience.",
            "Very early to review bcz installation done today only,\nBut product from the Marq stable is superb and up to mark.\nPros:\n1) Picture quality superb\n2) Audio quality also nice.\n3) Operation and remote quality good.\n4) Model is also very good with very less outer border so looks very good.\n5) Better than other competitors carrying hefty price tags.\nCons:\n1) As Marq is new company started selling big tv in 2018 only so dont know about long term experience and quality check.",
            "great value for money. same specifications in other companies like Samsung or sony it will cost more than 2 lakhs. it is insane to invest such a large amount in electronic devices,as prices will drop dramatically in a year and also these companies also giving the same one year warranty. blindly go for this product with extended three years warranty. I got this product under exchange for rs 45000. great sound,great picture quality and great connectivity. moreover greaaat size. thanks for flipkart for one day delivery and next day free wall mount installation.",
            "Superb product by Flipkart . Go for this guys it’s the bestest one at this economic range only harassment u can face in installing this product by third party agency hired by flipkart i.e. Jeeves .in my case they people had taken a weeks time to send a engineer ,rest about product ,marvellous awesome very much happy .",
            "Excellent value for money. Sorround sound is really good especially if you are watching on the internet. Local TV depends upon the input\nprovided by your cable operator. If you have a 4 K Dish input am sure it would be a wonderful experience. However I have only the local cable TV input. After using 55 inch VU TV for last three years, I found this a big improvement",
            "Splendid purchase! Loved every bit of it. I hope it stays like this atleast for two year without any trouble. Sound quality is simply amazing !",
            "good LED TV",
            "Good One",
            "its sooo big... don't look at the photos and judge the size...it looks small in photos...only con is that its not supporting Netflix other than that its good.",
            "it's worth buying Marq 4k tv ... wonderful tv",
            "Tv is good. No doubt about it but has many improvement point which need to be addressed immediately.\n1. Tv sound is abnormal. Volume Control is pathetic.\n2. Lan or WiFi keeps disconnecting\n3. It does not support DTS decoder. No audio\n4. No ARC.\n5. Netflix and prime does not support.\n6. There is audio delay when external BT speaker is connected.\n7. Remote control feel cheap.",
            "Woth every penny spent. Go for it.",
            "Picture and sound quality’s is good. Netflix does not work on this tv. I called the customer care as well to find out when they are going to enable Netfix on this and they don’t have any idea about this. ARC is missing in this tv and as alternative i have to purchase optical cable for audio out to my receiver. I have tried plying movies from hard disk on media player but most of the time its say audio video format is not supported.",
            "PLEASE DONT BUY!! Can’t watch NETFLIX & AMAZON EVER!!!!!!!!!!!!!!!!!\nThis is not a smart Tv, it’s a DUMB TV. Full waste of money",
            "PERFECT QUALITY IN TV COMPETITION , MARQ IS FUTURE KING OF LED TV/UHD/DISPLAY",
            "looking good product.",
            "Great value for money, good product 👍",
            "Fantastic purchase. Very clear picture 4k. Very loud speaker no extra speaker needed. Surround sound, Wi-Fi, Bluetooth. I got 3 year extended warranty\n\nLight bleeding in the edges. But picture quality is OK.",
            "Excellent TV. Great value for money.\nTV was delivered within 2 days of ordering. Installation was done the next day.\nPicture quality and sound quality are both great. Youtube runs without any problems.\nGood brightness and contrast.\nSome problems in running 4K MKV files. Otherwise excellent.",
            "Airplay mouse is not there that is th con in the tv remaining all good. Real superb digital dolby effect, even in low volume levels also sound is very good. Overall tv performance is good",
            "It can make branded TVs run for money. Very good product at such a price point.",
            "It is big tv, really big tv very good quality picture and sound also excellent first day experience is good will give detail review after one month use",
            "best product",
            "This is third class product. Within one year my TV is dead. Even I have taken Complete TV Protection plan 3 years by paying additional cost of Rs.3000/- but there Partners Jeeves also not responding ...",
            "excellent",
            "Go for it",
            "Excellent product for the price paid. But voice recognition is not working. Shall advice service personnel to look in to it",
            "super sound ..display ...IPS panel for more longitivity of TV life makes this model the most value for money u can buy",
            "This product Is really a beast. Enough for a brand new company to leave a impression on customer. Earlier i was looking for mi TV but later i decided to go for marq tv 65 inch. This is really big....really really big. I am getting a feeling of home theater.\n\nI got it delivered within 2 days from the purchasing date, of course the benefit of plus membership. Delivery guys even checked it in front of me to see if there is any damage inside. Not to worry everything was fine.\n\nI have just got it 3-4 days back so i can not review it deeply but will do after 1 or 2 month for sure. But i will say that first impression was long lasting.\n\nI am attaching some photos just for reference.",
            "One of the worst TVs available in Market. I wish flipkart takes it back and gives me a TV of another company. Please don't buy this TV it is waste of money. No Netflix, Prime you TV is is unstable. Wifi aromatically disconnects. Sound is horrible",
            "superb",
            "It's a product that will challenge Sony Samsung and Lg in the TV market. Boss anyone looking for 4k TV definitely go for it without any hesitation.",
            "Best tv in this price i have already used lg tv but in terms of value for money this is the best 4k 65inch tv in the market",
            "Excellent display, outstanding voice and steady build..Worth every single penny of spend. Only drawback is netflix and prime video is not available, which is hoped to updated soon. Or else don't think, just go for it :)",
            "It’s one week now no one has come for installation",
            "Totally satisfied so far in 20 months of ownership.",
            "I AM WRITTING THIS REVIEW AFTER USINGTHE TV ALMOST 2.5 YEARS. TILL TODAY NO PROBLEM AT ALL. FULL WORTH FOR THE MONEY PAID",
            "A very nice product. Much better than expected.",
            "Good product 👍 no issue.",
            "Video Quality is good, more than expected for the price. Very impressed with the sound.\nOverall, value for money.",
            "amazing product in this price",
            "superb tv value for money I like❤👍",
            "Good built quality. Metal stand(best compared to other nearby priced).\n\nSound system is good but there is sudden increase at certain point.\n\nValue for money. Yet to know how service and maintenance will be.",
            "just go for it...value for money",
            "Best tv with stunning picture quality. Value for money. Android is perfectly working. I didn't find any issues.",
            "worst experience. it's Bluetooth voice is not working from last two months and it's Bluetooth remote is not functioning.",
            "TV is excellent even though initially i faced some installation issues but later same got resolved. Another important note here that buy tv alongwith 3 year insurance protection plan + stablizer.",
            "speechless",
            "Picture Clarity is very low. Checked with all channels and various programs. Highly disappointing",
            "Good picture quality , Superb sound and fast processing.. Value for money",
            "just awesome...I loved it..",
            "Delivery very good.\nInstallation service is good.\nHowever the product comes with some setbacks. Netflix is not supported not even prime.",
            "Good stuff on the price bracket only issue being some apps not working",
            "awesome",
            "Conc: all connectivity at the back of the TV which makes night mare to connect HDMI, USB, SPDIF\n\nthis is not true android, it doesn't have prime, netflix, sunnxt etc.... doesn't serve the purpose of android TV.\n\nPros: big screen, screen mirror, Price.",
            "Nice product , paisa vasul",
            "Excellent product at this price, Dolby sound gives feels like a theater.",
            "nice picture and sound good",
            "Sound quality superb .",
            "excellent picture quality, sound, clarity, & more satisfaction.",
            "Sound not so good",
            "Nice tv really under budget",
            "great product to have at this cost.",
            "Prompt delivery and same day installation - amazing customer focus.",
            "for the price it's absolutely superb.",
            "Awesome Product.... Value for Money.\nExcellent picture quality, Sound.",
            "good product very nice good quality",
            "good",
            "value for money",
            "fantastic",
            "better quality and price compare with other brand",
            "it's good value for money",
            "Tvs good.. No Netflix.. That should be fixed blah..",
            "I replace the tv for screen bleeding problem it takes 10 days to replace another this Is the only problem I faced .tv is very very good",
            "Only negative point is does not support Netflix 🙄",
            "Excellent, superb tv no words to say more,super picture,excellent audio output,. but the installation demo technician was not that much knowledgeable",
            "Excellent. Picture very bright and realistic.Dolby sound impressive. My only question is regarding the lack of controls for picture quality. Somehow still unable to access the controls for it.",
            "Sound quality super clear picture",
            "GOOD BUDGET TV LETS SEE HOW LONG IT WORKS..",
            "One of the best choice you can ever get. Full Value for Money.",
            "Best TV with lot of options..Complete home theatre experience Only HD is must",
            "Delivered as planned. Instalation done as scheduled. Very good product. Value for the money. Extended warranty copy not received",
            "Very good Product must buy...",
            "Excellent product at offered price.",
            "Yesterday received this TV with a very nice package. Delivery guys are excellent."
        ],
        "likes": [
            "413",
            "29",
            "58",
            "44",
            "67",
            "5",
            "5",
            "6",
            "3",
            "2",
            "413",
            "29",
            "58",
            "44",
            "67",
            "5",
            "5",
            "6",
            "3",
            "2",
            "2",
            "2",
            "6",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "33",
            "5",
            "5",
            "10",
            "7",
            "11",
            "6",
            "7",
            "7",
            "3",
            "3",
            "1",
            "1",
            "2",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "0",
            "4",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "42",
            "9",
            "24",
            "7",
            "10",
            "0",
            "0",
            "1",
            "0",
            "0",
            "42",
            "9",
            "24",
            "7",
            "10",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "4",
            "1",
            "0",
            "0",
            "1",
            "2",
            "0",
            "9",
            "0",
            "0",
            "2",
            "1",
            "3",
            "1",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "7",
            "2",
            "2",
            "2",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:How to change picture and sound settings?",
            "Q:How Google certified Android TV is different from normal Smart TV?",
            "Q:How to Pair the Bluetooth Remote with your TV?",
            "Q:What is in-built memory for apps",
            "Q:can we connect mobile and play games",
            "Q:How to perform a Firmware / Software update on Android TVs ?",
            "Q:I can't see the youtube, google movies on home page",
            "Q:Is this product LED or OLED?",
            "Q:Is it DLED or ELED?",
            "Q:Google cast works via WiFi-direct?",
            "Q:Can I use phone as remote?",
            "Q:How to install APK files through USB?",
            "Q:does this tv had blue tooth to connect to other devices like sound systems with Bluetooth",
            "Q:Does the TV have any pre-loaded Apps?",
            "Q:How to google cast?",
            "Q:Is the panel screen A+ graded ?",
            "Q:Bluetooth connection with Bluetooth headset?",
            "Q:Does it supports hotstar , prime video , voot , sony liv",
            "Q:All functions are available on android TV remote app?",
            "Q:hdr support or not support",
            "Q:Can we install netflix from play store?",
            "Q:How to use remote mic function(Google assistant)?",
            "Q:Does it have web browser?",
            "Q:How to play videos on external hard drive? It's not working for me.",
            "Q:can we extend the storage capacity? can we install the apps in to external USB drive and run from there?",
            "Q:Do I get wall mount with the TV?",
            "Q:How do I login into Google App store?",
            "Q:Can I use Skype or hangouts or Duo by connecting to web cam?",
            "Q:Does this TV support Netflix?",
            "Q:How to made settings to play sound in external speaker only with internal speaker should be on mute",
            "Q:is this tv was dolby atmos or not?",
            "Q:does this tv supports webcam for whatsapp video calling",
            "Q:is 65 inches tv picture quality nice or no are the pictures clear",
            "Q:can play ac3 sound",
            "Q:Does it support 3.5 mm jack to connect home theater ?",
            "Q:does it have 3.5 mm output for external audio ?",
            "Q:can anyone recommend keyboard/mouse fully compatible to this TV? i had bought wired, wireless combos & even air mouse, but not able to scroll through video.",
            "Q:Does this tv Support apps Like Sony Liv, Voot, Alt Balaji other than hotstar",
            "Q:can I use WhatsApp",
            "Q:Ram value and Android version",
            "Q:Recommend a suitable stabilizer for this",
            "Q:found only inbuilt media player is delivering 5.1 channel sound.(but not supporting few formats).not happening with VLX or MX player whatsoever.anyone have solution ,plz share",
            "Q:How can i install primevideo or popcorn movie apps in this tv as my playstore not showing it",
            "Q:Does this TV HDMI ports have HDMI 2.0? Can i connect my XBOX ONE X to this tv without issue?",
            "Q:should i buy this tv or iffalcon k2a 65 inch , really very confused , any help much appreciated !",
            "Q:i bought this TV a month back.trying link google home app in my mobile to tv.seems like my tv is already linked to many accounts which are unknown and i cant change most of the settings.need help?",
            "Q:how to connect my phone in marq tv?",
            "Q:how to pendrive opperte ?",
            "Q:it will be very usefull if someone says whats the best budget hometheatre that will suit this tv.or is there a budget hometheatre that receives optival audio or hdmi as input?",
            "Q:Does this have wifi 801.11/AC?",
            "Q:What is the standard of the HDMI ports? Does it support 4k HDR playback?",
            "Q:can we play games of x box or playstation in 4k",
            "Q:Does it have optical cable for speaker connections???¿¿¿",
            "Q:optic cable connection for 5.1 channel home theater?",
            "Q:What isTV start up time ?",
            "Q:Is the remote universal, and is it working with set top box",
            "Q:can i cast iphone using Google cast or cast option?",
            "Q:Is it supportsmulti tasking?",
            "Q:can I use my mobile hotspot to connect this smart tv?",
            "Q:Is it IPS panel?",
            "Q:how much internet speed is sufficient for smooth performance ?",
            "Q:does it support ARC?",
            "Q:Can I play games on this TV? Does it have pre-loaded games?",
            "Q:is this an android tv?",
            "Q:Does JIO Movies and Cinema works?",
            "Q:does this 65\" TV has HDMI ARC Port?",
            "Q:this tv does not allow netflix app to work. bt can i use the google chrome cast to stream netflix?",
            "Q:did this product give more picture quality than sony led tv?",
            "Q:How many remote do you provide?",
            "Q:can we play PUBG in ît",
            "Q:Any one of the HDMI input is compatible with HDCP 2.2?",
            "Q:Is it allowed to unbox the television ourselves?",
            "Q:what is HDR version for this TV ? HDR 10 or Dolby vision or HLG ? or any other ?",
            "Q:normal hd set top box supports 4k tvs",
            "Q:Is this a 8bit or 10Bit panel? What type of HDR it has?",
            "Q:Does it make sharp noises while changing channels??",
            "Q:Why Netflix is not supported ? It should support necause it has Google Play Store ?",
            "Q:in which smart TV. jio TV and jio cinema will support",
            "Q:3d hd pendrive vidio wacth 3d effect",
            "Q:How to connect tv with phone using screen mirroring?",
            "Q:can we connect a laptop with hdmi and use it as a secondary screen?",
            "Q:is it having a 10bit panel?",
            "Q:LED display type? how to know if DLED OR ELED.",
            "Q:Does we need Wi-Fi for this Led",
            "Q:optical output available",
            "Q:can we connect cpu with it threw vga cable",
            "Q:does it got optical or HDMI out??",
            "Q:How to use netflix and Prime on this TV ?",
            "Q:can screen mirroring be done in this?",
            "Q:If this tv have a Spdif because i want to connect it trough spdif??",
            "Q:It supports 3d?",
            "Q:How can I connect it with Tata sky setop box is it possible or not?",
            "Q:How to activate HDR?",
            "Q:Can I get Wall mounting bracket with adjustable height and forward backward",
            "Q:how to connect marq androind tv to 5.1 hone theatre speaker system",
            "Q:Unable to change color brightness etc on my 65 inch marq",
            "Q:does it work with google home???",
            "Q:Bluetooth having or not in this TV",
            "Q:Stabilizer is required for this TV?",
            "Q:What is the boot up time from Off to Live TV?"
        ],
        "answers": [
            "A:Go to live TV in home page. Press menu key on remote, You can see menu OSD on TV. Then, press OK key. You can see the picture and sound settings.",
            "A:MarQ Official Google Android TV has Google TV Launcher, Google Search & Assistant, Unrestricted access to Google Playstore. But normal smart TV don't have access to these Google apps",
            "A:Go to \"Add accessories\" in Home page. press and hold home+left navigation key on Bluetooth remote. Press OK key for address of the remote. Your blue-tooth remote will be successfully paired",
            "A:12 GB",
            "A:yes",
            "A:Whenever a new version is available a notification will pop-up on the screen or you can also check in settings for system updates.",
            "A:When you switch ON the TV first time you need to follow the process of sign in with your Google accounts. And after that you can access all Google apps.",
            "A:It is led with IPS panel. pl note oled or qled tvs are costly and not available below one lakh for 65 in tv",
            "A:It is DLED",
            "A:No, It works only when TV and phone are connected to same Wi-Fi router",
            "A:Yes. Install Android TV app to use phone as remote",
            "A:There is no way to install apk files through usb because it doesnot have an inbuilt file manager and file manager installed from playstore or outside cannot detect pendrive contents Waste of money",
            "A:Yes",
            "A:MarQ Android TV comes with pre-loaded official apps like Youtube, Google Playstore, Google movie, Google Music, Google Game, etc .",
            "A:After downloading \"Google home\" app on android phone, Connect to TV via \"Cast device\"(Phone and TV should be connected to same Wi-Fi router)",
            "A:Yes, its an amazing TV experience!!! IPS panel...",
            "A:yeah.. i am using galaxy buds+ . it connect with that fairly good. But for external big speaker like zebronics, it dones not connect well",
            "A:It supports Hotstar and SonyLiv (Through Google play store). Prime video and Netflix are NOT supported . In built apps are YouTube, Google play movies(and other google apps). Has inbuilt chrome cast.",
            "A:No, Mute, Volume up/down, Channel up/down, Power off/on are not available.",
            "A:It supports HDR",
            "A:unfortunately, both Netflix and Amazon prime cannot be played, even if side loaded. you can open the app & login, but you won't be able to reach the point where it actually plays!",
            "A:Go to\"Add accessories\"in Home page press & hold home+left navigation key on Bluetooth remote Once addres of the remote is seen on the screen Press OK key on remote ur bluetooth remote will be paired",
            "A:it doesnt come preinstalled but you can easily side-load it or download via Google play store. Puff-in is familiar web browser.",
            "A:U cant Internal media player is not supporting certain audio and video format. If you install external applications like vlc,mx player,file explorer from playstore it doesnot read usb.Software faulty",
            "A:NO but to do that you have to root your TV",
            "A:Yes wall mount comes free with all TVs",
            "A:When you switch ON the TV first time you need to follow the process of sign in with your Google accounts. And after that you can access all Google apps.",
            "A:No cam support.",
            "A:No it doesn't support Netflix.",
            "A:should mute",
            "A:yes",
            "A:no..not built in webcam",
            "A:Too Good.",
            "A:Yes, You can",
            "A:yes It does. a wonderful product to buy",
            "A:no it does not have",
            "A:yes. conected wireless mouse and keybord",
            "A:yup it does. but it doesn't support Amazon prime",
            "A:no",
            "A:2 GB",
            "A:This TV's operating voltage is 100-240v. So you don't have to have an stabilizer. If you want you can have simple surge protector.",
            "A:Your question is not making any sense. Kindly rephrase it properly. What exactly is your issue? 🤔",
            "A:Supported app - You Tube, Hotstar only. For other apps like Netflix, apple TV, Prime Video and pop corn app.. i am using amazon firestick for",
            "A:Surely u can without any problem. I had connected my PS4 with it and there is no glitch in it at all.",
            "A:Internal media player is not supporting certain audio and video format If you install externalapplication like vlc,mx player,file explorer from playstore it doesnot read usb.SoftwareFaulty buy ifalcon",
            "A:you can do a factory reset (like any android mobile) , and when you try to link it use your mobile and choose the right google account.",
            "A:go to home and then to settings and add accessory connect to your phone to tv and open a vedio to your phone a symbol appear on your phone click on that symbol your mobile played on the t",
            "A:Insert Pen drive in the UBP Port and Media will show on screen. Open any type of Media - Videp, Music or Photos.",
            "A:Soundbars from F&D, JBL or Philips, these range from 5K to 12K. These connect by Bluetooth so you can be wire free and no clutter. Try Bose SoundTouch in the range 20K to 60K for better output.",
            "A:yes",
            "A:yes",
            "A:if u have ps4 pro or xbox one s then you can",
            "A:No it does not have optical cable for speaker.. It has bluetooth which can be used to connect bluetooth enabled speakers",
            "A:yes, available.",
            "A:First boot time takes 3-5min. If not switched off from main power next turn on takes just 30s.",
            "A:No its not an universal remote. It won't work with set top box",
            "A:No. Only android",
            "A:No",
            "A:yes you can use your mobile hotspot to connect to tv but it should have good network speed",
            "A:Yes",
            "A:min. 10 MBPS Speed is sufficient",
            "A:It does well from HDMI 1.",
            "A:Yes, Many google games can be downloaded from google playstore.",
            "A:Yes. Google Certified V8.0 Oreo",
            "A:Apps installed from playstore donot work properly They are not able to detect pen drive or harddisk These people are not willing to update software Extremely poor customer service",
            "A:yes",
            "A:Better cast through mobile, if not wrong crome cast also need mobile",
            "A:Yes",
            "A:I got 2 remotes. One was a traditional remote and another was a new remote which has got less buttons.",
            "A:Via ps4 yes. Via smarrohone yes, xbox yes, oc yes laptop also yes i also played",
            "A:Yes",
            "A:At the time of delivery, delivery people will open it and show it to you for any defect and then the technician will come an install it. It will not take much time.",
            "A:It is HDR Version is (High Dynamic Range) a technology which enhances bright and dark areas of video with true colors, with 4k resolution the contrast ration boosted up, and with A+ IPS panel.",
            "A:4 k TV SUPPORTS ALL FORMAT SD, HD READY, FULL HD AND 4K. FROM THE SET UP BOX. ONLY PROBLEM IS DUE TO LACK OF UPSCALING TECHNOLOGY IN THIS TV YOUR VIDEOS ESPECIALLY FROM SD CHANNELS MAY NOT BE GOOD",
            "A:Nothing mentioned specifically. I'm able to play 10bit HDR without issue, although it's not as vibrant as I expected (maybe because of 550nits). But HDR works(it's not light & yellowy).",
            "A:yes. it makes they noise when changing some channels",
            "A:Yes Netflix should be supported.",
            "A:marq-flipkart-165-cm-65-ultra-hd-4k-led-smart-android-tv",
            "A:This is not a 3D Tv, hence 3D video doesn't run on it.",
            "A:your tv and your mobile should be connected in same wifi network then it will get connect.",
            "A:yes",
            "A:no it is 8 bit only",
            "A:led no dled eled only led with superthin nodes",
            "A:Yes we need to connect the TV with wifi to view certain channels online like Youtube etc",
            "A:yes",
            "A:yes",
            "A:It is having only optcal output to connect your external sound system. No HDMI support",
            "A:Even after software updates which came late the netflix and prime are not possible to stream infact Marq and flipcart is urgently work on it.",
            "A:yes !! nowadays it will be happening for all almost all TVs ..not a big deal",
            "A:No. It doesn't have a SPDIF",
            "A:No",
            "A:Just connect the HDMI and you will be able to.",
            "A:active by default but it depends on content",
            "A:Wall mounting bracket can be fixed at whatever height you want. No Forward or Backward adjustment for the bracket supplied as standard. You may purchase an aftermarket universal bracket for the same.",
            "A:via Spdif or DHMI port",
            "A:you should be able to by using menu button on remote... make sure you are on HDMI input to make",
            "A:Yes it does and you can cast your phone screen onto the TV.",
            "A:Yes",
            "A:better to use and avoid power card damage in case of power fluctuating",
            "A:Maximum 30 seconds"
        ],
        "likes": [
            "40",
            "50",
            "45",
            "4",
            "3",
            "10",
            "9",
            "2",
            "2",
            "2",
            "2",
            "0",
            "3",
            "11",
            "9",
            "1",
            "0",
            "2",
            "2",
            "2",
            "0",
            "4",
            "4",
            "0",
            "1",
            "1",
            "2",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "6",
            "1",
            "3",
            "3",
            "4",
            "1",
            "1",
            "3",
            "3",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "14",
            "22",
            "25",
            "0",
            "0",
            "7",
            "7",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "14",
            "11",
            "0",
            "0",
            "2",
            "2",
            "3",
            "0",
            "7",
            "12",
            "0",
            "1",
            "1",
            "5",
            "3",
            "18",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "3",
            "2",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "4",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "5",
            "8",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    }
}