{
    "title": "PHILIPS 6600 Series 126 cm (50 inch) Ultra HD (4K) LED Smart TV  (50PUT6604/94)",
    "product_specification": {
        "In The Box": "TV Unit-1N, TV Stand-2N, User Manual-1N, QSG-1N, Remote-1N, Battery-2N, Warranty Card-1N, Power Cord-1N",
        "Model Name": "50PUT6604/94",
        "Color": "Black",
        "Display Size": "126 cm (50 inch)",
        "Screen Type": "LED",
        "HD Technology & Resolution": "Ultra HD (4K), 3840 x 2160",
        "Series": "6600 Series",
        "Smart Tv": "Yes",
        "HDMI": "2 Rear, 1 Side",
        "USB": "1 Rear, 1 Side",
        "Built In Wi-Fi": "Yes",
        "Launch Year": "2019",
        "Picture in Picture (PIP)": "Yes",
        "Digital Noise Filter": "No",
        "LED Display Type": "Ultra Slim LED",
        "Aspect Ratio": "16:9",
        "Refresh Rate": "60 Hz",
        "Supported Video Formats": "AVI, MKV, H264/MPEG-4 AVC, MPEG-1, MPEG-2, MPEG-4, WMV9/VC1, HEVC (H.265), VP9",
        "Other Video Features": "Pixel Precise Ultra HD, Dolby Vision",
        "Number of Speakers": "2",
        "Sound Technology": "5 Band Equalizer, A.I. Sound, Clear Dialogue, Dolby Atmos, Dolby Volume Leveler, Night mode, Auto Volume Leveller, Bass Enhancement, DTS HD",
        "Surround Sound": "Dolby Atmos Surround",
        "Speaker Output RMS": "20 W",
        "Sound Mode": "Original, Movie, Music, Game, News, Personal",
        "Supported Audio Formats": "AAC, MP3, WAV, WMA (V2 up to V9.2), WMA-PRO (V9 and V10)",
        "Supported App - Netflix": "Yes",
        "Supported App - Youtube": "Yes",
        "Supported App - Disney+Hotstar": "No",
        "Operating System": "Linux based",
        "Screen Mirroring": "Yes",
        "Ethernet (RJ45)": "1",
        "Streaming Platform": "Miracast",
        "Headphone Jack": "1",
        "Touch Remote": "No",
        "Smart Remote": "No",
        "Battery Type": "2 AAA Batteries",
        "Power Requirement": "AC 110 - 240 V, 50/60 Hz",
        "Power Consumption": "0.31 W (Standby)",
        "Clock": "Yes",
        "Auto Power Off": "Yes",
        "On/Off Timer": "Yes",
        "Child Lock": "Yes",
        "Parental Control": "Yes",
        "Width x Height x Depth (without stand)": "650.6 mm x 650.6 mm x 87.2 mm",
        "Weight (without stand)": "10.9 kg",
        "Width x Height x Depth (with stand)": "1113 mm x 668.6 mm x 241.3 mm",
        "Weight (with stand)": "11.2 kg",
        "Stand Type": "Tabletop",
        "Warranty Summary": "2 Years Comprehensive Warranty from Date of Purchase",
        "Covered in Warranty": "Warranty of the Product is Limited to Manufacturing Defects Only",
        "Not Covered in Warranty": "Warranty Does Not Cover Any External Accessories (Such as Battery, Cable, Carrying Bag), Damage Caused to the Product Due to Improper Installation by Customer, Normal Wear and Tear to Magnetic Heads, Audio, Video, Laser Pick-ups and TV Picture Tubes, Panel, Damages Caused to the Product by Accident, Lightening, Ingress of Water, Fire, Dropping or Excessive Shock, Any Damage Caused Due to Tampering of the Product by an Unauthorized Agent, Liability for Loss of Data, Recorded Images or Business Opportunity Loss.",
        "Warranty Service Type": "Technician Visit",
        "Installation & Demo Details": "We'll facilitate the installation and demo through authorized service engineer at your convenience. The installation will be done within 48 hours of delivery of the TV. The service engineer will install your new TV, either on wall mount or on table top. Installation and demo are provided free of cost. The engineer will also help you understand your new TV's features. The process generally covers: Wall-mounted or table-top installation, as requested. Physical check of all ports, including power and USB ports. Accessories also checked. Demonstration of features and settings. Quick run-through on how to operate the TV"
    },
    "product_description": {
        "Dolby Vision": "With this TV, your standards for picture quality will be raised to great heights as it brings you a vast colour palette, sharp contrast, and brightness which will make it difficult for you to stop watching your favourite content on the TV screen.",
        "Dolby Atmos Surround Sound": "With this TV, you can not only enjoy stunning visuals but also powerful sound. The HDR content that you watch will be all the more immersive, thanks to the Dolby Atmos Surround Sound feature. The feature brings you greater clarity, detail, and depth which will make action-packed movies, TV shows, and more even more binge-worthy.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "4",
            "5",
            "3",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "3",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "1",
            "5",
            "4",
            "5",
            "1",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "3",
            "1",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "1",
            "5",
            "1",
            "1",
            "3",
            "5",
            "5",
            "5",
            "1",
            "5",
            "3",
            "5",
            "2",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "2",
            "5",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5"
        ],
        "review": [
            "Very good TV at low price. Picture and sound clarity is so nice. It has a high quality speakers and no sound bar or home theatre is required for medium size halls as the speakers are powered with Dolby Atmos. When come to picture quality the depth of the colors are very good and mainly it gives a very good viewing experience in dark room with the decent brightness.\nWatching 4K videos in YouTube and from other OTT platform, this tv is just Wow. Wow.. When i played high size videos (6GB and above) through hard disk, I observed some lagging.\nThis TV has come with pre installed apps such as YouTube, Netflix, Prime video etc. Only problem is that this smart tv doesn't have some important Indian apps which are available in Android TV.\nWall mount bracket was included in the package along with table top stand. The guy who had come for installation didn't charge any additional cost. Totally it was nice shopping experience with Philips and Flipkart.",
            "Brilliant picture experience and connectivity and Philips service was excellent and they providing wall mount which is very durable and strong Finally happy with the product...",
            "It is an OK product considering that it is an LED TV. No Complaints.\nFast Delivery, Fast Installation.\nGood Interface MENU and easy to operate.\nGood Crisp Quality.\n\nI was previously used to the Quality of a Panasonic Plasma which is actually much superior.",
            "1- Flipkart's Delivery Was Excellent, Nice And Polite Guys, Exchange Was Smooth!\n2-TV's Installation Is Easy If You Already Had A Mounting Bracket Cos' It's Only Have To Be Fitted!\n3-TV Colour, Sound Are Excellent But There Is Android TV, But Basic Do Work On It!\nOverall A Nice Value For Money Package 🙂!\n\nNice Product Go For It Without Any Hesitation!",
            "This is the best tv at this price point ( Not considering cheap chinese brands). Picture quality in HD and sound output is excellent. DTH SD quality is not very good.\nPhilips brand knownnfor it's durability and brand offers 2 years warranty. Interface is nice and simple and it is very fast. OS is light weight and TV swiches on in less than 2 sec.\nThere are only few apps which this TV supports. I would consider this TV as non smart tv.( I always wanted to buy non smart tv). I use fire stick which works like charm.\nI got installed with in 2 hrs post delivery. Thanks to excellent coordination between flipkart and Philips.\nGo with blind eyes and buy this tv. You will not regret the purchase. If you want smart features add fire tv or android Stick to this TV.",
            "Great picture. Hands down. Average sound. Biggest drawback is no bluetooth and basic remote. Installation guy will provide free wall mount.\nIf you are buying only for the picture quality ( on par if not better with all major brands ) and have external speakers for audio and dont care for OTT content ( Netflix and Prime only major platforms available) then go for it.\nAfter 2 weeks of use.. somehow sound takes 3 to 4 second to adjust to best quality. 4k videos are a treat.\nAudio for Some channels on tata sky HD box(DD supported) can be controlled directly from TV.\nOnly regret is the remote. It sucks.Cheap remote for a classy product.",
            "After the use of 5 days I found my philips led 58 inch smart quite user friendly.\n\nNice picture quality, beautiful body finish , nice connectivity , sound is good, value for money.",
            "Really, Really Good. Value for Money. Forgot about ROM,Apps because TV is to be TV! You fill the Brand Credibility. Also thanks to FLIPKART, for very competitive affordable price. Viewer are to be subscribed HD channels, for viewing Good Experience. Youtube,Amazon Prime n Netflix Awesome and Good viewing experience.Go for it 👌👍💐\nEdit: After using for a fortnight found no glitches. In this price you got AMOLED screen experience.Youtube,Amazon prime have nice UHD view. Not used NETFLIX . I recommended to buy blindly, it's value for money. It's PHILIPS which renowned name in Sound and also Good in TV. If you want android got it by Android TV box. For middle class people it is boon from flipkart n PHILIPS!",
            "This is one of the best TV one can get in this price range, even within 50 k range when it comes to Picture Quality.\nPQ is superb on this TV with sharp and dark colors coming out vibrantly and bright. PQ being the most important criteria for any TV, this model scores very high in this category.\nI have been using this TV for more than 3 months now. No issues in terms of software glitches/ wireless connectivity issues.\n\nComing to few issues: No Bluetooth, No Android, Single 2.4 Gh band, Low Sou...\nREAD MORE",
            "This Philips TV is Very Excellent I happy with this product nd this product is value for money other company selling there products at very high prices with same features I recommend this tv is good for other than that",
            "Very good TV at low price. Picture and sound clarity is so nice. It has a high quality speakers and no sound bar or home theatre is required for medium size halls as the speakers are powered with Dolby Atmos. When come to picture quality the depth of the colors are very good and mainly it gives a very good viewing experience in dark room with the decent brightness.\nWatching 4K videos in YouTube and from other OTT platform, this tv is just Wow. Wow.. When i played high size videos (6GB and above) through hard disk, I observed some lagging.\nThis TV has come with pre installed apps such as YouTube, Netflix, Prime video etc. Only problem is that this smart tv doesn't have some important Indian apps which are available in Android TV.\nWall mount bracket was included in the package along with table top stand. The guy who had come for installation didn't charge any additional cost. Totally it was nice shopping experience with Philips and Flipkart.",
            "Brilliant picture experience and connectivity and Philips service was excellent and they providing wall mount which is very durable and strong Finally happy with the product...",
            "It is an OK product considering that it is an LED TV. No Complaints.\nFast Delivery, Fast Installation.\nGood Interface MENU and easy to operate.\nGood Crisp Quality.\n\nI was previously used to the Quality of a Panasonic Plasma which is actually much superior.",
            "1- Flipkart's Delivery Was Excellent, Nice And Polite Guys, Exchange Was Smooth!\n2-TV's Installation Is Easy If You Already Had A Mounting Bracket Cos' It's Only Have To Be Fitted!\n3-TV Colour, Sound Are Excellent But There Is Android TV, But Basic Do Work On It!\nOverall A Nice Value For Money Package 🙂!\n\nNice Product Go For It Without Any Hesitation!",
            "This is the best tv at this price point ( Not considering cheap chinese brands). Picture quality in HD and sound output is excellent. DTH SD quality is not very good.\nPhilips brand knownnfor it's durability and brand offers 2 years warranty. Interface is nice and simple and it is very fast. OS is light weight and TV swiches on in less than 2 sec.\nThere are only few apps which this TV supports. I would consider this TV as non smart tv.( I always wanted to buy non smart tv). I use fire stick which works like charm.\nI got installed with in 2 hrs post delivery. Thanks to excellent coordination between flipkart and Philips.\nGo with blind eyes and buy this tv. You will not regret the purchase. If you want smart features add fire tv or android Stick to this TV.",
            "Great picture. Hands down. Average sound. Biggest drawback is no bluetooth and basic remote. Installation guy will provide free wall mount.\nIf you are buying only for the picture quality ( on par if not better with all major brands ) and have external speakers for audio and dont care for OTT content ( Netflix and Prime only major platforms available) then go for it.\nAfter 2 weeks of use.. somehow sound takes 3 to 4 second to adjust to best quality. 4k videos are a treat.\nAudio for Some channels on tata sky HD box(DD supported) can be controlled directly from TV.\nOnly regret is the remote. It sucks.Cheap remote for a classy product.",
            "After the use of 5 days I found my philips led 58 inch smart quite user friendly.\n\nNice picture quality, beautiful body finish , nice connectivity , sound is good, value for money.",
            "Really, Really Good. Value for Money. Forgot about ROM,Apps because TV is to be TV! You fill the Brand Credibility. Also thanks to FLIPKART, for very competitive affordable price. Viewer are to be subscribed HD channels, for viewing Good Experience. Youtube,Amazon Prime n Netflix Awesome and Good viewing experience.Go for it 👌👍💐\nEdit: After using for a fortnight found no glitches. In this price you got AMOLED screen experience.Youtube,Amazon prime have nice UHD view. Not used NETFLIX . I recommended to buy blindly, it's value for money. It's PHILIPS which renowned name in Sound and also Good in TV. If you want android got it by Android TV box. For middle class people it is boon from flipkart n PHILIPS!",
            "This is one of the best TV one can get in this price range, even within 50 k range when it comes to Picture Quality.\nPQ is superb on this TV with sharp and dark colors coming out vibrantly and bright. PQ being the most important criteria for any TV, this model scores very high in this category.\nI have been using this TV for more than 3 months now. No issues in terms of software glitches/ wireless connectivity issues.\n\nComing to few issues: No Bluetooth, No Android, Single 2.4 Gh band, Low Sound. Most of these issues (OS based are already known before buying TV and can be easily resolved with a firestick/ Android box)\n\nPhillips provides 2 year warranty against the current norm of only 1 year on TV which shows manufacturer's confidence in the product.\n\nI will highly recommend this TV.",
            "This Philips TV is Very Excellent I happy with this product nd this product is value for money other company selling there products at very high prices with same features I recommend this tv is good for other than that",
            "Pros and cons\n\nThe tv has no internal memory.\nOnly in built apps can be used.\nThere is no hot star zee 5\nIt has you tube and prime video\n\nVery good picture quality at this price this is the best tv which upscales sd channel in a decent viewable quality.\n\nHd channels are good to watch\nNo Bluetooth\nTotal bezeless design and light weight\nAs there is no apps and internal memory tv doesn't hang\n\nIf picture quality is the prime requirement then this is the best tv.\n\nIt has Eros now app but without paying nothing can be viewed in it\n\nSound quality is not good, definitely requires a sound bar\n\nIt has Miracast app for viewing Mobile content",
            "Front and side bezel design is far better than LG, Samsung and Sony. Picture quality is also at par with leading brands. Sound is okay neither good nor bad.\nWanted to go for 65\" android but that wasn't in my budget and I have Tata sky Binge+ so for me it didn't matters.\n\nBest in this price range, will recommend all to go for this.\n\nInstallation : was a bit delayed by 3-4 days but that may be due to local service centre. Philips India just have to have a quality service.\n\n5 stars for the product, 3 stars for installation👍🏼",
            "Good to go back for philips,, one draw back, no Bluetooth thus Been ordered for my parents as they won't access much. Apart from that pre-installed apps like YouTube, Netflix is der.. Good to go. Timely delivered and timely installed. Good sound6too",
            "Went for this a renowned brand as price was very competitive and extra 3 inches (58 vs 55).\nPicture quality is great. Upscaling is not an issue. Sound quality is average, we are using external speakers anyway.\n\nApps are very limited ..just 3 to be precise YT, Netflix and Prime. Bummer if you want sonyliv and Disney hotstar..you will have to buy chromecast,firestick etc.\n\nTv startup is fast",
            "Superb",
            "It was my nice pick. I was afraid before ordering it but later when i received it everyone was appreciating me.\nI got it at 29400rs only.",
            "For this value this price you get a 58\" TV, it's not OLED it's not qled , but it's value for money LED TV, so far the experience is good, though no Bluetooth and voice control, that I knew before buying, saphi os is Linux based, so limited apps, casting is problem for some smartphones. TV is amazing for d2h cable and mild gaming.",
            "Good quality picture and sound clarity",
            "The product is awesome.... awesome picture quality.... YouTube is very smooth and supported ultra hd....",
            "Installation is done after one month if the purchase such a horrible time spend in waiting for installation",
            "I like",
            "Slow vedio casting though mobile, bad packing while transportation, worth pursuing in low cost (app. 40 k),vedio quality of HD channels good, SD channel not much bad. Overall in this cost 58 \" tv value for money if u dont want smart tv.",
            "Awesome product if you look for picture and recommend to connect HD channels rather than sd channel because HD channel viewing experience is awesome",
            "Saphi operating system support no app.. Its like a garbage. Even the basic application are not available",
            "Very nice👍👏😊 incredible so good picture quality",
            "TV stopped working in a year",
            "Very good product. In price range.",
            "Very good picture quality and sound quality. Very very happy to purchase a big screen TV at this price. Only draw back is there is no Bluetooth connectivity. Still its ok. Thanks Philips.",
            "Nice tv",
            "Most of the TV functionality is very good, but the App Store is very limited. This is not an Android tv. It's a Linux based OS, which didn't get play store. You get Prime Video, YouTube and Netflix. Have to stream from your phone if you want to use any other streaming service.",
            "Everything is good except installation in a remote area if u want to get the tv installed urgently don't go with it. Also connectivity is very poor wifi takes a lot of time to connect. Only picture quality and sound is good",
            "Delivered soon, and installation was superb.\nValue for money. Nice TV.",
            "Tv's good. Value for money... sound quality is big let down. And its made in chin,a.",
            "Damage product don't by",
            "Nice TV with good offer",
            "EXCELLENT TV. PICTURE AND SOUND QUALITY IS VERY GOOD.",
            "Good, reasonable price.",
            "excellent tv value for money excellent pitcher output",
            "Good product....overall one would come out to be a satisfied customer",
            "Awesome TV , delivery and installation processes done by Flipkart members was on time . Value for money ,. Go for it .👍",
            "Awesome",
            "It is very nice.my relatives appreciate me for.buying this.",
            "Flipkart delivery was very good... but installation is very bad even after 10 days no one has come for installation and has no idea when they are going to come.",
            "PLAIN NONSMART, NON INTERNET TV -\nIf you need internet TV, THEN STAY AWAY FAR FROM THIS TV.\nInternet browser provided JUST DOES NOT WORK - You can not access Internet at all.\nGood picture - of no use - since you can not access the net at all.\nFrustrating !",
            "Economical",
            "Value for money",
            "Display issues",
            "Ya good👍",
            "No one came for installation & no support provided from Flipkart.",
            "Very good👍",
            "How I will get 2 year wartanty/GuRanter",
            "Best branded TV in this range.",
            "It's been Seven months of purchase, picture and sound quality is not upto the expectation.",
            "Good",
            "Nice product...",
            "Ok",
            "Writing this review after using it for more than a month … I want to rate this 4.5 stars… picture and sound is no doubt very good … I brought 50 inch model and i can view SD channels also perfectly from a distance of 11 feet and no doubt HD is excellent … Hotstar is missing and as it very essential this days as you can steam live cricket is very disappointing… Saphi is fast and simple … link YouTube with your iphone and stream flawlessly just like Apple TV … delivery and installation was very smooth… take a bit long to open files on pendrive … this is the best you can get in this budget ..",
            "Excellent product for price",
            "Excellent TV at this price no comparison",
            "Super delivery fast installation",
            "Good Quality product and Good Service from Philips for installation and Demo.",
            "Awesome product",
            "High value for money product, sound output can be improved.. Otherwise much better option than the new players in the market.",
            "Fast delivery and picture quality is good awesome sound and all apps running fine and worth of money too...",
            "Owesom",
            "Nice quality product with same day installation",
            "Very good product. Very happy with the product",
            "Best for smart users ...this is not android tv keep this on ur mind when u buying this",
            "Nice super🎵",
            "Best valuable TV best price in Philips TV",
            "Good tv at this price",
            "Very good product",
            "Don't buy",
            "Good",
            "In vivid mode picture is shacking and moving fast. Picture quality is good but movie is shacking and moving fast.please solve this bug.",
            "Good quality and best product",
            "Good picture quality",
            "Excellent amazingly good.",
            "HD channels are very clear but sd channels are little bit blur. Overall experience is very goog",
            ".telvision is good but .1 month complete my super coin not credited so its very bad ..froud about super coin",
            "Bud like dit",
            "Very good product at this price",
            "Best product in this price and comparison of available brand in market.",
            "very nice tv purchase blaind eye",
            "Just awesome",
            "Its not android tv,no Google play,sound is ok but bass is very less,picture clarity is good,couldn't connect my mobile and external hard drive through USB port...can't download any apps only default apps and some other apps which are not useful...overall 50/50 product...",
            "Fantastic picture clarity.\nRemote works pretty swiftly. Colours are pretty sharp. Sound is good. Although I have a home theater connected to it which always works with this.\nMirror screening works very well.\n\nOverall no negative points. I guess , I made a good decision in buying this product.",
            "Amazing quality at the pricepoint.",
            "Worth to buy this TV.\nGreat picture quality and bezel less screen\nThat makes your watching experience great, also the smart TV function are good.",
            "Superb TV in this price range, picture quality awesome.",
            "very nice product",
            "Superb product, value for money",
            "Nice TV with great video and good audio out,totally worthy product in under 40k price range,\nThank you Philips and Flipkart.",
            "Excellent product with good quality pictures, one thing is in website it has mentioned as two years warranty but in the invoice sent it has mentioned as 2 year warranty",
            "Must be sounds & picture vvery best",
            "Must buy. great customer service."
        ],
        "likes": [
            "77",
            "54",
            "53",
            "12",
            "5",
            "11",
            "11",
            "3",
            "9",
            "2",
            "77",
            "54",
            "53",
            "12",
            "5",
            "11",
            "11",
            "3",
            "9",
            "2",
            "1",
            "3",
            "1",
            "1",
            "98",
            "5",
            "9",
            "11",
            "3",
            "8",
            "7",
            "8",
            "3",
            "4",
            "4",
            "2",
            "2",
            "2",
            "2",
            "5",
            "5",
            "5",
            "3",
            "4",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "20",
            "8",
            "21",
            "2",
            "0",
            "3",
            "5",
            "0",
            "6",
            "0",
            "20",
            "8",
            "21",
            "2",
            "0",
            "3",
            "5",
            "0",
            "6",
            "0",
            "0",
            "3",
            "3",
            "1",
            "36",
            "0",
            "3",
            "5",
            "0",
            "3",
            "3",
            "4",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "3",
            "5",
            "5",
            "2",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "6",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:4k TV? Supports HD well?",
            "Q:Does it support all smart phone",
            "Q:is it wifi connected",
            "Q:Does it supports alexa?",
            "Q:is wall mount provided?",
            "Q:Does it have youtube",
            "Q:Can we install zee5 and other apps in it...",
            "Q:This tv blutooth support",
            "Q:Does it support prime video?",
            "Q:Does it support dual band wifi (2.4ghz and 5 ghz both)?",
            "Q:this is only table top or it will be on wall mount",
            "Q:Apple phone connect?",
            "Q:How many HDMI port avail",
            "Q:Google home application work or not?",
            "Q:Does it support wireless game pad?",
            "Q:Can this TV have internal storage and app store",
            "Q:Is there voice assistance available?",
            "Q:Can I connect ps4 and play",
            "Q:What is the display panel qled or led?",
            "Q:Audio out point (RF) for connecting TV to external sound system ?",
            "Q:does it have a app store?",
            "Q:Does it support apple airplay",
            "Q:Will it sopport screen mirrorong",
            "Q:Is this Need Stabilizer??",
            "Q:Is chormosast built in",
            "Q:Can we hang tv on wall",
            "Q:This tv support cromecast built in",
            "Q:Can we install Disney +Hotstar and other apps in this TV?",
            "Q:Is it Android",
            "Q:Is there any provision to fix this product fixed to wall ?",
            "Q:Is this 55 inch or 50 inch?",
            "Q:Can we play video games and prime",
            "Q:Bluetooth option have?",
            "Q:Ambient light is there",
            "Q:Can Wi-Fi be connected?",
            "Q:Panel is vu or ips",
            "Q:Is it work in android",
            "Q:It is Android tv?",
            "Q:Is there bloouth option to connect with soundbar",
            "Q:Mi stick can we use this tv",
            "Q:Can i connect smart view from phone",
            "Q:Is wall bracket included?",
            "Q:Tv have Bluetooth option"
        ],
        "answers": [
            "A:Yes , 4K means HD X 4.",
            "A:No",
            "A:Yes It is, but no Bluetooth.",
            "A:yes",
            "A:yes but not with tv.. installing agent comes with wall mount .. u dont have to pay anything to agent .. its free of cost..",
            "A:Yes",
            "A:No...not even hotstar ...it’s a big disappointment...but u can but a amazon prime stick for that also",
            "A:No",
            "A:yes",
            "A:Nope. Only 2.4GHz",
            "A:Wall mount",
            "A:yes",
            "A:Three",
            "A:No",
            "A:yes",
            "A:TV uses a philips propreitory software which isnt as rich as typical android TV. However , Prime Video , Netflix , Youtube is available out of the box and movies can be played over USB",
            "A:no",
            "A:Yes u can",
            "A:Hd",
            "A:Yes, there is a slot for extra audio connection",
            "A:yes it has but i am not exactly sure if it has other apps you wanted.",
            "A:No it doesn’t",
            "A:Yes it does support Screen Mirroring. But, you can't expect a seamless experience. You might see hiccups in between.",
            "A:no,only a power socket is needed.TV is not that smart.I am using firestick and it's Awesome.",
            "A:Yes it has 👍",
            "A:Yes",
            "A:Only with YouTube and Netflix. Normal Chromecast features not supported",
            "A:Netflix, Prime and YouTube is pre-installed but Hotstar can't be installed. You will have to purchase firestick for that",
            "A:no it's Linux",
            "A:yup philips team will contact you and install it on wall without any charge its cost free",
            "A:50inch",
            "A:yes",
            "A:YES",
            "A:No Ambient light",
            "A:yes",
            "A:ips",
            "A:no",
            "A:No it's not",
            "A:No Bluetooth",
            "A:yes you can use it",
            "A:yes",
            "A:No. We need to inform to the person who comes for installation.",
            "A:No..."
        ],
        "likes": [
            "34",
            "28",
            "20",
            "4",
            "1",
            "2",
            "2",
            "3",
            "2",
            "1",
            "3",
            "2",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "35",
            "15",
            "12",
            "11",
            "6",
            "17",
            "1",
            "2",
            "2",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0"
        ],
        "dislikes": [
            "6",
            "8",
            "6",
            "1",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "4",
            "2",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "3",
            "1",
            "0",
            "1",
            "0",
            "0",
            "2",
            "0",
            "0",
            "7",
            "4",
            "2",
            "5",
            "5",
            "19",
            "0",
            "0",
            "1",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "5"
        ]
    }
}