{
    "title": "Vu Iconium 140 cm (55 inch) Ultra HD (4K) LED Smart TV  (55UH7545)",
    "product_specification": {
        "In The Box": "Wall Mount Bracket\nIR Remote Controller\nTable Top Stand\nDetachable Power Cord\nTV Unit\n2 AAA Size Batteries",
        "Model Name": "55UH7545",
        "Color": "Front Bezel Color: Black, Rear Color: Black, Stand Color: Silver Grey",
        "Display Size": "140 cm (55 inch)",
        "Screen Type": "LED",
        "HD Technology & Resolution": "Ultra HD (4K), 3840 x 2160",
        "Series": "Iconium",
        "Smart Tv": "Yes",
        "Motion Sensor": "No",
        "HDMI": "1 Side, 2 Rear",
        "USB": "2 Side",
        "Wi-Fi Type": "IEEE 802.11 b, g, n /2.4 GHz",
        "Built In Wi-Fi": "Yes",
        "Launch Year": "2018",
        "Brightness": "450 nits",
        "Contrast Ratio": "100000:1 (Dynamic) (Static)",
        "Analog TV Reception": "Colour-Sound Systems in VHF Band - PAL-D/K, B/G, I, Subtitles, Stereo Sound Decoder: A2 / NICAM, Colour-Sound Systems in UHF Band: PAL-D/K, B/G, I",
        "View Angle": "178 degree",
        "Panel Type": "A+ Grade ADS and Ultra High Definition Panel",
        "LED Display Type": "DLED",
        "Refresh Rate": "60 Hz",
        "Supported Video Formats": "USB: AVI,WMV,TS, MPEG, MKV, FLV, MTS, WEBM",
        "Other Video Features": "1:1 Pixel Mapping\nDynamic Backlight\nDynamic Contrast Control\nWide Viewing Angle\nResponse Time: 6 ms\nHEVC/MPEG/H.264/H.265 Decoder",
        "Number of Speakers": "2",
        "Sound Technology": "Dolby Digital",
        "Speaker Output RMS": "20 W",
        "Supported Audio Formats": "USB: .wma, MP3, WAV, TS, FLAC",
        "Other Audio Features": "Automatic Volume Level (AVL)\nAudio Enhancement\nAudio Equalizer",
        "Storage Memory": "8 GB",
        "Supported App - Netflix": "Yes",
        "Supported App - Youtube": "Yes",
        "Supported App - Disney+Hotstar": "Yes",
        "Operating System": "Android Based",
        "Screen Mirroring": "Yes",
        "Bluetooth": "Yes",
        "3G Dongle Plug and Play": "No",
        "Ethernet (RJ45)": "1",
        "Other Internet Features": "Eshare (Screen Mirroring and Remote Control), Cloud Pictorial (Use TV as a Photo Frame), VP9 Codec, TV Master for Clean My TV, Web Browser: Smart Browser, Apps Store with Indian Content, Hot Apps: YouTube, Hotstar, YuppTV, Hungama, Spuul, Facebook, Skype, Netflix, Eshare Support - Android and iOS Mobile, HEVC Function H.265 and H.264",
        "Component In (RGB Cable)": "Component or Y Pb (Cb) Pr (Cr): 1",
        "RF Connectivity Input": "RF Input: 1",
        "Other Connectivity Features": "Mini Line Output: 1\nTF Slot: 1\nEthernet Port (RJ45 Connector): 1\nAudio L/R for Component Input (Shared with AV Input): 1\nLAN Port: 1\nCEC- Consumer Electronics Control via HDMI\nARC -Audio Return Channel: HDMI 3\nAV Input: 1\nHDMI Type 4K at 60 Hz with HDCP Version 2.2: HDMI 1, HDMI 2, HDMI 3",
        "Touch Remote": "No",
        "Smart Remote": "Yes",
        "RF Capable": "Yes",
        "Internet Access": "Yes",
        "Other Remote Control Features": "Mobile Remote Control App",
        "Power Requirement": "AC 100 - 240 V, 50/60 Hz",
        "Power Consumption": "138 W, 0.5 W (Standby)",
        "Sleep Timer": "Yes",
        "Other Convenience Features": "Hot Keys on Remote Control: YouTube, Hotstar, TV Store, Media, Software Version OSD Indication, Favorite Channels List, Power Off if No Signal, Program Lock, Mouse Button for Navigation Keys",
        "Width x Height x Depth (without stand)": "1241.4 mm x 717.2 mm x 84.8 mm",
        "Weight (without stand)": "18.9 kg",
        "Width x Height x Depth (with stand)": "1241.4 mm x 785.7 mm x 255.6 mm",
        "Weight (with stand)": "14.1 kg",
        "Stand Type": "Tabletop",
        "Other Dimensions": "Wall Mount Screw Thread: M6, Wall Mount Dimensions (Horizontal x Vertical): 400 x 200 mm",
        "Warranty Summary": "1 Year Warranty",
        "Covered in Warranty": "Manufacturing Defects Covered in Warranty. Parts and Labor Costs are Covered",
        "Not Covered in Warranty": "The Product is Not Used According to Instructions Given in the Instruction Manual. Defects Caused by Improper Use as Determined by the Company Personnel. Modification or Alteration of Any Nature is Made in the Electrical Circuitry / or Physical Construction of the Set. Installation / Repair Work is Carried Out By Persons / Agency Other Than Authorized by the Company. Site (Premises Where The Product is Kept) Conditions that Do Not Confirm to the Recommended Operating Conditions of the Machine. The Original Serial Number is Removed, Obliterated or Altered from the Machine or Cabinet. Defects Due to Cause Beyond Control Like Lightning, Abnormal Voltage, Acts of God or While in Transit to Service Center or Purchasers Residence. The Warranty Does Not Cover Any External Accessories (Such as Battery, Cable, Carrying Bag Etc.) Mentioned in the Operating Instruction Manual Supplied with this Product or Any Cosmetic Parts",
        "Warranty Service Type": "On-site Service, Customer needs to call the nearby Authorized Service Center, service engineer will come to the site to get the product repair",
        "Installation & Demo Details": "1. Covered Under Standard Installation - Table Mounting Using Standard Stand Supplied as Accessory with TV - Extra Charges are Applicable for Wall Mounts as, Rs. 399 for 32 inch Display Size and Rs. 499 for >32 inch Display Size - Connecting with Available Power Source (within 1 Meter) - Connecting / Setting Up Various Available Input Source for Audio Video Based on Model - Connecting with Available WiFi (for Smart TV) - Checking TV for Proper Functioning - Demonstration of the TV and its Features"
    },
    "product_description": {
        "A+ Grade Panel": "By eliminating ambient light reflection, this VU TV gives you a deep and detailed picture, thanks to its A+ Grade pure prism panel.",
        "Piano Black Design": "To give this TV a classy look, it comes embodied in a Piano Black Design. The plastic gloss adds a touch of elegance to the whole look and feel of this TV.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "4",
            "5",
            "5",
            "5",
            "2",
            "4",
            "5",
            "1",
            "4",
            "1",
            "4",
            "5",
            "5",
            "5",
            "2",
            "4",
            "5",
            "1",
            "4",
            "1",
            "4",
            "5",
            "5",
            "5",
            "1",
            "3",
            "5",
            "5",
            "3",
            "5",
            "5",
            "3",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "4",
            "1",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "1",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "2",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "1",
            "4",
            "5",
            "4",
            "1",
            "4",
            "3",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "4",
            "1",
            "2",
            "4",
            "2",
            "5",
            "3",
            "5",
            "3",
            "5",
            "2",
            "2",
            "3",
            "1",
            "1",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "4",
            "4",
            "4",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "4",
            "3",
            "1",
            "1",
            "1",
            "5",
            "5",
            "1",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "1",
            "1",
            "4",
            "4",
            "5",
            "3",
            "5",
            "1",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "3",
            "3",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "3",
            "5",
            "1",
            "4",
            "5",
            "1",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "3",
            "3",
            "1",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "4",
            "5",
            "4",
            "5",
            "1",
            "4",
            "1",
            "4",
            "2",
            "1",
            "3",
            "2",
            "4",
            "3",
            "5",
            "4",
            "5",
            "5",
            "4",
            "1",
            "5",
            "4",
            "5",
            "5",
            "1",
            "2",
            "5",
            "1",
            "5",
            "3",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "3",
            "5",
            "5",
            "1",
            "5",
            "5",
            "1",
            "1",
            "1",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "2",
            "5",
            "1",
            "5",
            "5",
            "1",
            "4",
            "4",
            "5",
            "5",
            "1",
            "2",
            "5",
            "1",
            "5",
            "5",
            "4",
            "1",
            "3",
            "4",
            "5",
            "3",
            "1",
            "5",
            "2",
            "4",
            "5",
            "3",
            "5",
            "5",
            "4",
            "3",
            "4",
            "1",
            "1",
            "1",
            "5",
            "1",
            "5",
            "5",
            "1",
            "4",
            "5",
            "1",
            "3",
            "1",
            "1",
            "1",
            "4",
            "5",
            "3",
            "5",
            "1",
            "5",
            "4",
            "3",
            "4",
            "5",
            "1",
            "5",
            "4",
            "3",
            "3",
            "3",
            "1",
            "4",
            "5",
            "1",
            "2",
            "1",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "4",
            "4",
            "4",
            "4",
            "4",
            "2",
            "5",
            "3",
            "5",
            "5",
            "1",
            "3",
            "4",
            "4",
            "3",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "1",
            "5",
            "5",
            "3",
            "5",
            "4",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "2",
            "4",
            "5",
            "4",
            "2",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "4",
            "4",
            "4",
            "1",
            "1",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "1",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "1",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "2",
            "4",
            "2",
            "5",
            "4",
            "5",
            "5"
        ],
        "review": [
            "Background: I had a Leeco 55 inch 4K television which stopped working due to display fault within 6 months of purchase. Since Leeco went out of India, i was not able to get the warranty. Heartbroken, i waited for 1 year before i bought this TV. i was inclined to get Samsung/LG this time but price of 55 inch 4K TV from those companies was still out of reach. I planned to get VU, but then the problem started, In my budget i saw this TV as well as similar model (LTDN55XT780XWAU3D) which has almost same features. That model is older version and will be phased out soon. VU website showcases this TV and not the other model. So i decided to purchase this. Also the deciding factor was that this TV runs Android and not the old Opera OS of the previous model.\n\nSetup and Installation: It was quick and was done much earlier than stated. No issues in that\n\nHardware: The TV panel Looks good, but its much thicker than my 2 year old (dead) Leeco TV which was much more sleek looking. The stands are okay and the wall mount came free, although i used my existing wall mount.\nThe remote is cheap, and i mean really cheap. The older model had better remote than this.\n\nSoftware: Although this being an android TV, the OS has not been well thought out and faced multiple issues while navigating the interface. Just to give you an example, you cannot switch source (HDMI1 HDMI2 etc) while watching any video or using any apps (such as netflix). Why on earth its not possible is beyond me! you should be able to switch source from anywhere to anywhere. To switch source you have to come back to the home screen...navigate to the switch source picture and then click it (although there is a big button for switching source in the remote itself). Second example, you cannot change picture or audio settings while you are on the android interface. I am yet to comprehend why its so. To change the picture settings (contrast brightness etc.) you need to switch to HDMI 1 or HDMI 2 and do it and then return to android interface. till now i have not found how to do it. the \"menu button\" does not do anything in these scenarios (which is used to invoke settings dialogue in HDMI sources)\nThird, i have seen multiple hangs in my 1 week of usage in Netflix and Youtube and there are times the remote will not do anything however hard i might try. Fourth, compared to my old 55 inch 4k TV, the voutube videos and the netflix videos are not that crist, even 1080 feels like 720p. Since i can compare i notice these, regular users will not notice this issue.\n\nSaying that, my family uses this interface and for them its okay and they hardly notices these since all they watch is youtube and netflix from the smart apps. They do not complain.\n\nMy Setup: I have my PC hooked up with this TV via HDMI and my Sony HOme Theater via HDMI (ARC) as well.\n\nPicture Quality: When i use it to display my PC content the picture quality is good. I have no complains. The Black levels are pretty okay for a cheap 55inch TV and there is no major Light bleeding from the edge. But please remember this is not an OLED panel, so do not expect pure Black. In this regard it is better than my old Leeco 55 inch TV.\n4K content looks superb and you can adjust multiple parameters to suit your needs. Also note that this comes with HDR 10 and it works in Games (Far cry 5, Mass Effect Andromeda etc). I keep the TV at brightness and Backlight set at 50 and contrast at 80 and sharpness at 100.\nOverall, picture quality wise (in PC - HDMI mode) is very satisfactory and it serves my purpose right. Those who solely needs the smart features and fully dependant on it, i would suggest go for the Official android version TV from this company (although priced higher). For light to moderate usage of smart features and actual picture quality wise this TV is Satisfactory.",
            "Ordered 55 4k on 12th July for watching world cup final. Got the demo and installation done on 14th July. So thumbs up to Flipkart for quick service!\n\nTV is easy to use and quite intuitive, though demo by Jeeves could have been a little more detailed to understand more TV features.\n\nNetflix and Youtube work seamlessly on this. Liked the e-share app which lets you 'talk' to your TV - you can display pictures, cast your phone, transfer data etc. through the app. Overall a great buy at such an affordable price.",
            "Got it delivered last week. I got it it for 36999, at this price this the best product. Picture quality is very good, sound is also good. They should have given bluetooth, but not available. Everything is working fine, just a lil bit disappointed with connectivity of Wi-Fi. I was told by the installation guy that this tv supports 4k only via pendrive or external hard disk. I talked to customer service, they also told me the same. Really disappointing that the team of customer support is like this. Actually, I want to tell each nd every user of this tv, that u can add it account and access it in YouTube, after updating it. It can be updated by mirroring the tv to mobile. Just update it, interface will upgrade, u will be able to login YouTube, and in resolution option 4k will open. Customer support team didn't believe me first, on my 2nd call another executive heard and believed me and asked me the process to do so. This long conversation went on because YouTube hot key was not working after updation. And it will not work, that is not a issue, believe me guys, update YouTube, you will appreciate this LED more, as 4k option aur be there. Everything else is fine till now, and hope so would go fine in future. VU, u need to improve ur team, so that they can easily help out these kind of hidden features. Best package, can go for it, no second thought.",
            "I have purchased VU 55\" 4K TV on Rs.31979. I can say in this price you can not buy such a 4K smart TV. Picture quality is very good & I have connected to mobile via WiFi, Youtube is working good. Hotstar App is not working. Overall I would suggest to buy the VU TV. I appreciate Flipkart team for the fast delivery of product within 3 days.",
            "Hot star not open,esharing not open.facebook scroll not working only first page showing.esharing wifi need.mobile saved data like photos and documents only u have share.not for chrome cast futures.its not full android TV.only given few apps.first picture hot star maximum 1hr loading not open.above all issues I faced my vu 55inch led TV.",
            "good TV for the price as it bundles all required fetures with the big screen size. have been using it for 10 days till now no issue.\n\nthe installation was good but demo was poor. probably the installation guy from Jeeves was less smart compared to the TV.\n\nyou may take the extended warranty from Flipkart as it's cheaper compared to market rates. however I have not taken it.",
            "Using this TV from 10 days. It's the cheapest 55 inch 4k TV. For me the picture quality is tooo bright and decreasing the brightness don't really work well. So i prefer muted colors of Soft setting. Its Android 7.0 but there is no playstore. YouTube plays max 1080p resolution. But trust me as i tested many many files that are 4k and both in full hd. Both videos plays exactly same. So 4K upscaling is really good and 4k and 1080p video look almost same unless you are hell bent to find a difference. SD channels look OK and not odd. Full HD DISHTV looks good. But my only concern is tooo bright skin tones and we can't adjust colors when youtube is playing. Sound is just ok. Sometimes 50%sound looks tooo lame in regular size room. For the Price Sony Lg cost over 1 lakh minimum and at this price i got more then what i paid for.",
            "I bought this TV 3 months back. Since then picture quality is a big issue and I am following up with VU support to resolve the same.\nFlipkart has washed off their hands by saying that I need to follow up with VU support as they can return only within 10 days.\n\nVU support officially responded that this TV is 4k and full HD picture quality will be bad and recommend me to watch only 4k content.\n\nThis is a big let down from brand like VU and Flipkart who is a sole promoter of this brand.\nPathetic...\nREAD MORE",
            "Bought this Tv @ 37k on Big Billion Sale, Overall Tv was Good, as it's based on Android we can install any APK we want, but main drawback is it doesn't have a play store (its installed but hidden from main menu, but can be launched from another launchers).\n\nPicture Quality is Good It rendered 4k videos also smoothly.\n\nSound quality is Okay\n\nConnectivity: LAN,Wifi and hotspot is available but it doesn't have Bluetooth\n\nScreenMirroring, playing remote files is working great with EShare app, also Try BubbleUpNp for better experience.\n\n\nOverall I would suggest to buy this TV in this budget",
            "1) Getting reddish colour shade over some indoor scenes.\n2) No 4k video playback support in youtube app. You can get 4K support by updating the app to latest version through google play but with this the videos on home page and hot key on remote wont work.\n3) Hotstar will be crashed when you install from given store. You need to go to play store through browser, update the app then it will work. But it will stuck some times while playing videos in 1080p.\n4) No Amazon prime support and Netflix wont play even in 720p resolution.\n\nNOT A PROPER 4K TV",
            "Background: I had a Leeco 55 inch 4K television which stopped working due to display fault within 6 months of purchase. Since Leeco went out of India, i was not able to get the warranty. Heartbroken, i waited for 1 year before i bought this TV. i was inclined to get Samsung/LG this time but price of 55 inch 4K TV from those companies was still out of reach. I planned to get VU, but then the problem started, In my budget i saw this TV as well as similar model (LTDN55XT780XWAU3D) which has almost same features. That model is older version and will be phased out soon. VU website showcases this TV and not the other model. So i decided to purchase this. Also the deciding factor was that this TV runs Android and not the old Opera OS of the previous model.\n\nSetup and Installation: It was quick and was done much earlier than stated. No issues in that\n\nHardware: The TV panel Looks good, but its much thicker than my 2 year old (dead) Leeco TV which was much more sleek looking. The stands are okay and the wall mount came free, although i used my existing wall mount.\nThe remote is cheap, and i mean really cheap. The older model had better remote than this.\n\nSoftware: Although this being an android TV, the OS has not been well thought out and faced multiple issues while navigating the interface. Just to give you an example, you cannot switch source (HDMI1 HDMI2 etc) while watching any video or using any apps (such as netflix). Why on earth its not possible is beyond me! you should be able to switch source from anywhere to anywhere. To switch source you have to come back to the home screen...navigate to the switch source picture and then click it (although there is a big button for switching source in the remote itself). Second example, you cannot change picture or audio settings while you are on the android interface. I am yet to comprehend why its so. To change the picture settings (contrast brightness etc.) you need to switch to HDMI 1 or HDMI 2 and do it and then return to android interface. till now i have not found how to do it. the \"menu button\" does not do anything in these scenarios (which is used to invoke settings dialogue in HDMI sources)\nThird, i have seen multiple hangs in my 1 week of usage in Netflix and Youtube and there are times the remote will not do anything however hard i might try. Fourth, compared to my old 55 inch 4k TV, the voutube videos and the netflix videos are not that crist, even 1080 feels like 720p. Since i can compare i notice these, regular users will not notice this issue.\n\nSaying that, my family uses this interface and for them its okay and they hardly notices these since all they watch is youtube and netflix from the smart apps. They do not complain.\n\nMy Setup: I have my PC hooked up with this TV via HDMI and my Sony HOme Theater via HDMI (ARC) as well.\n\nPicture Quality: When i use it to display my PC content the picture quality is good. I have no complains. The Black levels are pretty okay for a cheap 55inch TV and there is no major Light bleeding from the edge. But please remember this is not an OLED panel, so do not expect pure Black. In this regard it is better than my old Leeco 55 inch TV.\n4K content looks superb and you can adjust multiple parameters to suit your needs. Also note that this comes with HDR 10 and it works in Games (Far cry 5, Mass Effect Andromeda etc). I keep the TV at brightness and Backlight set at 50 and contrast at 80 and sharpness at 100.\nOverall, picture quality wise (in PC - HDMI mode) is very satisfactory and it serves my purpose right. Those who solely needs the smart features and fully dependant on it, i would suggest go for the Official android version TV from this company (although priced higher). For light to moderate usage of smart features and actual picture quality wise this TV is Satisfactory.",
            "Ordered 55 4k on 12th July for watching world cup final. Got the demo and installation done on 14th July. So thumbs up to Flipkart for quick service!\n\nTV is easy to use and quite intuitive, though demo by Jeeves could have been a little more detailed to understand more TV features.\n\nNetflix and Youtube work seamlessly on this. Liked the e-share app which lets you 'talk' to your TV - you can display pictures, cast your phone, transfer data etc. through the app. Overall a great buy at such an affordable price.",
            "Got it delivered last week. I got it it for 36999, at this price this the best product. Picture quality is very good, sound is also good. They should have given bluetooth, but not available. Everything is working fine, just a lil bit disappointed with connectivity of Wi-Fi. I was told by the installation guy that this tv supports 4k only via pendrive or external hard disk. I talked to customer service, they also told me the same. Really disappointing that the team of customer support is like this. Actually, I want to tell each nd every user of this tv, that u can add it account and access it in YouTube, after updating it. It can be updated by mirroring the tv to mobile. Just update it, interface will upgrade, u will be able to login YouTube, and in resolution option 4k will open. Customer support team didn't believe me first, on my 2nd call another executive heard and believed me and asked me the process to do so. This long conversation went on because YouTube hot key was not working after updation. And it will not work, that is not a issue, believe me guys, update YouTube, you will appreciate this LED more, as 4k option aur be there. Everything else is fine till now, and hope so would go fine in future. VU, u need to improve ur team, so that they can easily help out these kind of hidden features. Best package, can go for it, no second thought.",
            "I have purchased VU 55\" 4K TV on Rs.31979. I can say in this price you can not buy such a 4K smart TV. Picture quality is very good & I have connected to mobile via WiFi, Youtube is working good. Hotstar App is not working. Overall I would suggest to buy the VU TV. I appreciate Flipkart team for the fast delivery of product within 3 days.",
            "Hot star not open,esharing not open.facebook scroll not working only first page showing.esharing wifi need.mobile saved data like photos and documents only u have share.not for chrome cast futures.its not full android TV.only given few apps.first picture hot star maximum 1hr loading not open.above all issues I faced my vu 55inch led TV.",
            "good TV for the price as it bundles all required fetures with the big screen size. have been using it for 10 days till now no issue.\n\nthe installation was good but demo was poor. probably the installation guy from Jeeves was less smart compared to the TV.\n\nyou may take the extended warranty from Flipkart as it's cheaper compared to market rates. however I have not taken it.",
            "Using this TV from 10 days. It's the cheapest 55 inch 4k TV. For me the picture quality is tooo bright and decreasing the brightness don't really work well. So i prefer muted colors of Soft setting. Its Android 7.0 but there is no playstore. YouTube plays max 1080p resolution. But trust me as i tested many many files that are 4k and both in full hd. Both videos plays exactly same. So 4K upscaling is really good and 4k and 1080p video look almost same unless you are hell bent to find a difference. SD channels look OK and not odd. Full HD DISHTV looks good. But my only concern is tooo bright skin tones and we can't adjust colors when youtube is playing. Sound is just ok. Sometimes 50%sound looks tooo lame in regular size room. For the Price Sony Lg cost over 1 lakh minimum and at this price i got more then what i paid for.",
            "I bought this TV 3 months back. Since then picture quality is a big issue and I am following up with VU support to resolve the same.\nFlipkart has washed off their hands by saying that I need to follow up with VU support as they can return only within 10 days.\n\nVU support officially responded that this TV is 4k and full HD picture quality will be bad and recommend me to watch only 4k content.\n\nThis is a big let down from brand like VU and Flipkart who is a sole promoter of this brand.\nPathetic...\nREAD MORE",
            "Bought this Tv @ 37k on Big Billion Sale, Overall Tv was Good, as it's based on Android we can install any APK we want, but main drawback is it doesn't have a play store (its installed but hidden from main menu, but can be launched from another launchers).\n\nPicture Quality is Good It rendered 4k videos also smoothly.\n\nSound quality is Okay\n\nConnectivity: LAN,Wifi and hotspot is available but it doesn't have Bluetooth\n\nScreenMirroring, playing remote files is working great with EShare app, also Try BubbleUpNp for better experience.\n\n\nOverall I would suggest to buy this TV in this budget",
            "1) Getting reddish colour shade over some indoor scenes.\n2) No 4k video playback support in youtube app. You can get 4K support by updating the app to latest version through google play but with this the videos on home page and hot key on remote wont work.\n3) Hotstar will be crashed when you install from given store. You need to go to play store through browser, update the app then it will work. But it will stuck some times while playing videos in 1080p.\n4) No Amazon prime support and Netflix wont play even in 720p resolution.\n\nNOT A PROPER 4K TV",
            "I got this TV during the big billion days sale for 37 grand and at this price point, I must say it is a solid choice even when compared to brands like Samsung and Lg which use the same Led technology and not the Oled ones.\nColour reproduction is good but since this is an led so blacks are not perfect.\nI live in a far-off town so delivery took time but I was satisfied with the overall delivery and installation experience.\nComing to the TV itself.\nIt has a behemoth panel and highly suitable for even a large room size since I myself sit and watch it at 15 feet distance and it feels perfect.\nThe ports on the rear bottom are accessible even after wall mounting but the ones on the side are inaccessible unless you have really thin hands.\nI would advice getting a USB m/f connecting wire which you can connect to the Tv while mounting and use it for connecting/disconnecting the Pen drive.\nPROS:\nHuge panel at this price and the quality is good too\nThe sound is ok for normal Tv viewing and is enhanced better when viewing an HD channel since most of them have Dolby Audio\nConnectivity ports are plenty. I have an Xbox one s, Dth and a soundbar connected to the 3 HDMI ports.\n4k content looks great\nThere is no Lag what so ever in the smart interface.\nCONS:\nNot really a smart Tv, limited to Youtube and hotstar.\nYou must download Vlc player from the TV store as the generic player does not support a lot of video formats including large 4k files.\nThere is no option to choose the display properties like colour brightness etc in the default smart home or during the Pen drive playback.\nEshare is ok but windows Pc has some issues connecting to eshare.\nAll that said I would highly recommend this Tv for anyone looking for a budget tv with decent features and a really large screen.\nIf you want all the smart features, I recommend you go for a chrome cast or a fire stick( it supports 4k now) or a console like I do.\nYou can also connect it to a soundbar if you want to further enhance the viewing experience but even without it, the speakers would suffice.\nP.S. I strongly suggest using a wired LAN connection as it tends to disconnect from the Wi-fi if the signal is not strong.\n\nHAPPY VIUING.",
            "I got my 55 inches tv delivered on Sunday yesterday 11th nov\nM waiting for installation guy\nBut I m very excited I will post review soon about tv 👍\nInstallation executive is excellent n he guide us so well & also finally my tv 📺 55inches VU looking so awesome I think it’s a best purchase if u wanna buy big screen at reasonable price\nValue for money\nI used YouTube hotstar\nI downloaded prime videos n wife connectivity is excellent video quality 5/5 it’s actually beyond expectations becoz it’s actually 4K more than HD\nGo for it guys superb\nThank you Flipkart",
            "This tv is a completely package as comparing to mi tv this tv has many option like you can easily mirroring you iPhones and android to this tv as is also have mi tv in that i face problem connection iPhones to tv but android phone connect and comes to the picture quality this VU tv has amazing quality and you can control the brightness colour and contrast as well and the only main drawback i found is tv is connectivity port some ports are below the screen that is good but like HDMI usb line out are place behind the tv so that us make me difficult to connect to those ports due to wall mount of tv rather then this is very good TV and upscaling is very good",
            "Before buying it I was worried. But genuinely the product is the best product I have bought it has a perfect picture quality perfect sound best finishing in style. I personally request to those people who want to buy you can buy it without any hesitation. fulfill your all requirement of entertainment.",
            "Dont buy this tv its use less just mentioned as smart tv by namesake. No blue tooth . No optical audio. No 5ghtz wifi i.e 802.11ac , doesnt support any other apps . Very slow ui . Remote is pathetic. And its not even looking like 4k quality its like 720P screen . Waste dont buy. VU makes good tvs but this is the worst one . Buy other models.",
            "Picture Quality Is Good But This Tv Is Not A Smart Tv Very Limited Apps No Play Store And U Can't Mirror Your Android Phone That is None of the Vu led Tv has Miracast which most of other smart led tv has so this tv is for watching content only there is no such thing as smart in this tv",
            "Absolute bang for the buck, at this price the deal was too good to pass on at 38k.\n\nI have paired this with an Apple TV 4K, connected with an HDMI as I prefer its interface over Android.\nWith JBL sound-bar connected through HDMI ARC, making it surreal experience through great sound and picture.\n\nWas using a VU 49” Smart Tv since last 3 years, so its a small upgrade for me, as I need this only for a year, and then I’m saving up to buy the gigantic 85” VU sometime next year which would cover an entire wall at that size. :D",
            "I got this tv in big billion day offer at 37k...Ultimate led smart tv...quick delivery from flipkart... Crystal clear display... Better sound quality... Screen mirroring options awesome thing... Overall extraordinary package at this price range... I honorly recommend this led product... Thank you flipkart...💕",
            "well everything looks good initially. but I am not able to connect my jbl soundbar via arc to it. I tried to complain several times to vu, but their support system is pathetic. you log on complaint daily and they will close it unilaterally with the message that happy to assist you where nobody calls up.. extremely bad support system. don't deserve to be in corporate world and no fun if one want to connect good music system to it",
            "Its a great product. I was having problem earlier as apps like hotstar and prime video were crashing. But then i called the customer care and they updated the software and everything got fixed. Works like a charm now :)",
            "TV has a decent picture quality specially for HD content and TV is worth every penny spent.\nWould definitely worth buying it. The installation was done next day tv was received. A great customer experience.",
            "For you to be able to watch any 4K video, the TV should have a good Aspect Ratio, in all TVs like Vu, OnePlus, Moto n Nokia it's only 60 htz, which is terrible. It should be 120 or more. It is 120 or more in Samsung, LG n Sony. If not the video will keep on pausing. For watching Full HD though all these Tvs are good but for 4K only some TVs are.",
            "1.I purchased it in 18th oct, 2018.\n2. I am writing this review on 21st oct, 2019, means I am using it for more than one year.\n3. Since then I am using it regularly.\n4. Excellant quality, Sound is sufficient,\n5. Very clear videos and channel view with HD set top box and HD channels.\n6.U can watch downloaded HD movies through pendrive. two USB ports are given.\n7.Value for money. Dont think too much, just go for it. 8.No complaints so far.\n9.Must use HDMI cable with HD set top box. Then only u can enjoy real 1080P HD videos.",
            "Good product best videos quality. sound quality good. screen design excellent full black. its theater for my family and to watch IPL on large screen is too much bind-blowing. 55 inch good buying with so many discounts given.\nIt could be more essay to share photos from mobile to TV always need to pair it from the E-SHARE application's. Sometime videos doesn't supports which are there in your mobile phone. over all connecting to WiFi always good. Good price Rs. 35,499/-. Installation team was too late to install it on wall mount but was very much professional in his work. Once installed on wall I am unable to ingest any USB wire/devise. over all after buying on 29 Oct 2018 after 6 months still its great no defects with no errors don't hang on using it on WiFi. Amazing TV, side viewing is also good and 1 could view screen on 3 hand distance also, no issue on eyes. Every one happy in my family, thanks to VU company with such amazing TV under low price + flipkart to have it online with such amazing discounts and offers with free installation. I anyone wants to by 4K Ultra HD & the big screen size 55`inchs. Its the best I recommend.",
            "It is a great value for money TV. Having said that if budget is not a constraint going for Samsung QLED or Sony OLED might give you better display particularly in bright environment. Overall display is very good for the TV and if you can ensure not too much lighting behind your seating, it will be a great viewing experience.\nI read reviews about low sound level, but I home setting I found the sound more than adequate.\nIn terms of connectivity I did find some minor issues but nothing major. I will recommend using a steaming device along to further improve your experience.\nOverall, for about 34K, this TV gives you 4K resolution 55' display of good quality, which is an awesome deal for some good viewing at home.",
            "Brilliant TV... Superb Picture clarity with Every Detail.. Terrific Sound Clarity. It's Just Value for Money. Thanks Flipkart.. Thanks VU",
            "Good packaging, On time Delivery .On time installation.Good Demo.\nPicture quality is excellent. Best HD Performance. Its not full smart TV But Essential app running good.\nWhat you expect more in this price.( Almost half than reputed Brand )\nValue for Money",
            "This vu UH7545 smart LED tv is,working nicely.picture quality is superb but sound output is not much expected.its wifi connectivity and searching websites is quite good Totally this tv is superb.\nBy\nGnanasambandam. G\nVillupuram.",
            "awsome tv...specially for ps4...but not for youtube etc...it can detect 2 tb hardrive also ....and smooth functioning...whole and sole its good...and best vu tvs in small price...i hav played god of war 2k18 wwe 2k18 uncharted lost legacy horizone zero dawn at 60 hrz with hdr it was superb ...and brightness is like u r watching it live...thanks...vu make such tvs in 65 inch but in low price...",
            "very good vu iconium 55 inch ultra HD 4ksmart led TV the best led jabrdast",
            "Price is under 40K is very good for this size of TV . Really value of money. Sound 20W speakers so good. WiFi connectivity so quick. Picture quality is average for SD channels but HD and 4K channels Soo good. Good packing and quickly delivery by seller and demo also done by the same day. Remote and wall mounted bush quality could be better. Remote looking like local tv remote not for smart TV. So VU please change remote design and quality. Overall 4.8 Star out of 5.",
            "the TV is brilliant, was expecting lesser for the price, was pleasantly surprised as how good the picture quality is. can hold its own against a Sony, Samsung, Sharp TV too. Value for money product. very happy with it.",
            "Default media player is not supporting audio format for any 4k videos. If we install VLC player from TV app there 4k video itself not supporting maximum you can enjoy 1080p Blu-ray videos. YouTube also not having 4k option.",
            "Writing after One week of use.\nAdded value to the living Room.\n\nNo need to have Extra speaker.\nMobile / Laptop can be shared with eshare app.\nSupports USB Optical Logitech Mouse\nHas inbuilt browser forInternet\nJioTV works fine\n\nNo voice search\nNo Bluetooth [Anyway outdated...No need to worry]\nOther connectivity works fine.\n\nVerdict-\n\nOne can Buy if u prefer 55 inch Smart TV without any second thought",
            "I was confused between MI and VU , Looks of the MI 55 is stunning , but when it comes to the picture clarity , i think VU is one step ahead. Luckily i could compare both as my 2 friends had each.\nGot the product during the sale period , together with 2 year additional protection got it for 36k.\nAt this price range we cannot complain much.\nAt first , the unit i got a slight panel dis-colour at the edge , but i got the item replaced within 10days. Customer support with Flipkart is really nice\n\n\nPros\nEconomical\nDoes its job quite well\n\nCons\nSound , 16w is ok , not good enough if u are a movie enthusiast .\nFor the same reason as above , i got a JBL 2.1 soundbar to counter the issue, then only i realized Iconium Model doesn't have a optical cable sound slot , only Aux and HDMI\nWhen i connect with HDMI ARC , the TV often confuses itself to give the sound output , couple of repeated ON/OFF only solves the problem. Aux works fine\n\nMy opinion for anyone who plans to buy a soundbar also, go with VU Pixelight model , it has Optical slot for sound.",
            "Satisfaction is not measured by how good you treat a happy customer, it's measured on how good you treat a worried customer.\nI have been using Vu TV, ordered another 55 inch 4K Tv as a gift to my friend. The product was faulty - I trusted Flipkart to give me a replacement for the same as it's a gift. I tried replacement through the site itself - the system returned an error. After a number of calls to customer service and a week later\n\nIf you get a good working product from here, it's ok but if you recieve a faulty product",
            "Good product. On time delivery. Awesome picture clarity with 4k videos. Nice sound quality. Overall very good product. Value for money",
            "Vu Iconium 55 inch Smart TV is value for money, but at some tradeoffs.\nThe smart interface of Vu is not upto the mark. I would suggest android certified TV’s, as they will be having stock android experience on TV.\nNetflix/YouTube/ Hotstar on the store in tv are very old versions and can’t get full experience out of it.\nPicture quality is wonderful, sometimes you would feel that the screen is over saturated. Other than that no issues on the panel.\nOverall it’s value for money. I paid 37k for 55” model. For that price, it is a wonderful option",
            "Excellent buy. Prompt delivery by Flipkart and same day installation/ demo by Jeeves. For the price, it’s definitely a terrific bargain. Picture quality and smart features are second to none. Only wish Amazon prime is available on a single button on the remote.",
            "If you have an experience of watching big screen of a good brand tv then I will not recommend this to buy as this will disappoint you so much. My panasonic 58 inch HD led non smart tv is far far better than this VU 55 inch UHD smart tv specially in terms of picture quality. Picture quality or panel of VU is not even 50% of my panasonic tv. Smart interface is also not gud and not even user friendly. Yes it's sound is far better than my panasonic tv but that is not a big issue as we buy a tv ...\nREAD MORE",
            "I was using Vu 40in for 3 years before upgrading to this TV. The experience has been largely disappointing. If you connect an external speaker, the sound comes from both TV and speaker. The TV remote can only control the TV speaker and not TV output. The solution suggested was to mute TV and use speaker output. Unless the speaker has a remote you need to keep manually adjust volume (or make speaker redundant)\nOn connectivity, the hotstar doesn't work by default, so you need to call Vu tech team (who respond after 2-3 weeks) who will give an update via pen drive. But this update made Netflix non functional. So again had to call tech team (who can't after a month) and now neither Netflix or Hotstar works\n\nyou can use it as a non smart TV maybe",
            "Usage : 2 months\nTime : 4-5 hours\nPicture: at this price point its awesome and better than MI Tv 55\nSound: sound is good for 300-400 sq ft room\nBuilt quality: okay okay type can be improved but considering the price point i think its ok\nConnectivity: with all applications (amazon prime installed but not working )",
            "The TV does not display 2160p frame rate.\n\nNot able to play the videos with 4K resolution I.e. 3848x2160\n\nYouTube 4K video-resolution does not support 2160p resolution\n\nI phone 4K video-resolution does not support 2160p resolution\n\nGoPro 6 4K video- does not support 2160p resolution\n\nSpecifications shows its a 4k tv but 3840x2160 resolution its not supported\n\nIf you are buying the tv for 4K resolution PLEASE DONT BUY.\n\nALSO FOUND WHITE PATCHES AT THE DISPLAY SCREEN WHILE IN BLACK MODE.",
            "It's really a awesome product by VU. Picture quality is very good as well as the sound is like box because of its 20W sound output. Connection is poor. The WiFi is disconnecting sometimes while playing hotstar.... Otherwise this tv is awesome.. Go for it blindly. Paysa wasool.. It's 49 inches wide and 31inces height withstand & without stand 28 inches.",
            "I have purchase LED TV 55” from Flipkart, the product is very good and installation of this product has also completed immediately. But courier service (i.e. Gati) was worst. M/s Flipkart book DKT No. 576901899 for Shimla, Himachal Pradesh. I received call from Gati courier, Shimla and informed proper address and location of my home address to the concerned person, who was calling from Gati Courier. I was surprised, when I saw the status of my LED TV on Gati website that “Undelivered due to MISMATCH IN ADDRESS & PINCODE”. My address/ location was just 5 kmts from the Gati Courier office at Shimla. I write a complaint at the same time, when saw the status, but no response received. After two days, I received a call from Gati courier Shimla that they deliver LED TV only on National Highway. If you would like to collect the same, confirm the NH location otherwise we will return the same. For not receiving the LED TV 55 inch, I was very upset in these three and four days. I have to pay extra payment for carrying the same from National Highway to my home location. Gati Courier service is worst. It is suggested, if the courier company is not able to deliver the material at the given location don’t give the material, so that the end customer never suffer.",
            "It's a pretty good choice for a 4k TV, a good value for money purchase. Decent sound & picture qualityI would put it as mid-range's best in this category.\n\nSome of the inbuilt apps are not working.",
            "A very good TV at this price installed yesterday only so features and all to be experienced in coming days as far as now working excellent\nNow after 3 months of use very much satisfied .Thank you flipcart for giving the platform for such good produts at this attactive price to your customers",
            "Got this TV for 30 grands and I could proudly say that I have sealed a pretty good deal buying this. Worth every penny. I have seen many videos on youtube which detailed about the pros n cons of having this TV. Trust me, buying 55 inch TV for dirt cheap price like this and giving an output which you expect from premium brands would satisfy you both mentally and economically. A big thums up to VU team 👍",
            "This review has been written 2 weeks after purchase. The installation was trouble free and the technician was accommodating of my schedule.\nPros:\nThe picture quality is outstanding. Worth well above what the TV costs, competing with TVs in the 80k+ range. Since this is what you buy a TV for, I would say it's a worthy purchase.\n\nCons:\nSound quality is average. You will need to invest in a sound system if you're planning to watch music/movies. Good enough for regular TV viewing, IMO.\nNot very \"smart\", for an Android TV. Sure you can download apps and watch YouTube, but you won't be able to sign in. So Netflix/Hotstar Premium etc are out of the window. You'll need to invest in a Chromecast and/or a Firestick if you're planning to stream content beyond regular YouTube.\n\nMy first impression is that if you're getting this TV for under 40k, go for it.",
            "I would not prefer this model if you are looking for a TV whose user interface is well organized and more options on picture settings, audio settings.\n\n1. Home page is so clumsy with all uninstalled apps.\n2. No sing-in option to YouTube because of which you have to always search the video. Help icon in youtube says to Add Account through Settings option in Home page. But no such option available in home page.\n3. Apps in user interface are not well organized. They are so haphazard.\n4. It is so...\nREAD MORE",
            "The best Tv i have used so far. Superb picture quality & sound. Speedy delivery and fast installation by Jeevees. Can buy blindly. Value for money. Good deal in this price. Thanks Flipkart. You have to connect all the wires on the rear side of TV before installing otherwise it will be very difficult. Vu might have given connecting ports on the side of the TV.",
            "very great picture quality ... nice sound. looks good when u fix it on wall. Worthy Tv in this segment.",
            "screen sharing is only good for sharing ur phone gallery sort.most of the apps doesnt work in screen sharing .hotstar voot des kinda apps not to be found in this tv.overall good product for clarity and a huge screen",
            "I would like to give 4 star on the basis of picture quality not that much bad and not that much gud but nice i can say and over all i found some lack witch i am going to describe\n1- vu assures that iconium series is based on android but it does not support google play store bit annoyed by this...\n2- remote is not that much good as much i was expecting but it will work nice but curser option is based on navigation keys .... It could be better\n3- u will have to be limited and dependent on app store given by vu as its os is opera os.\n4- miracast option is not as gud because while casting videos from mobile only picture is being cast but audio is not being played by tv..so u can say it only cast pictures, images...\n5- if u can compromise with all these given flaws so overall it is good product in market...\nSo on mid range go for it",
            "Simply the best premium Quantity at this price range, first time I purchased other brand except Sony, picture quality is awesome Crystal clear, Dolby digital audio output fantastic like a theatre feeling, other features everything OK, so don't hesitate to buy this TV, I got this TV 33k only.",
            "Tv got delivered on time on the date Flipkart given ... and the installation done post 48 hrs of delivery.., the installation guy done very good job.., he explained from scratch.. about tv ... the 55 inch Vu iconium tv is damn good looking in all ascepts... watched Telugu movie fida by connecting to wi-fi at home... sound is okay we can connect external sound bars to get more clarity... and picture clarity is superb we need to get HD set up box ( ex: Airtel) .... over all tv is good I can say..!",
            "Picture qualiy is good and sound is also loud and good. They say it's a smart TV but it doesn't work like smart TV. Apps are outdated and this tv hangs when playing 4K content from pendrive (never tested using hdmi). VU appstore doesn't contain many useful apps",
            "Excellent picture quality. Happy with this purchase as well as flipkart’s delivery and installation which was done on the same day. The one problem I faced is that this tv doesn’t seem to be compatible with a 5 GHz frequency for wifi.",
            "Awesome it is at this range and Big Billion Days made my deal all the more awesome. Superb quality and super fast meets all the expectations as suggested and is a delight to watch.. Installation from Jeeves was to the perfection and on time as per system, plus he suggested many new things and the demo was perfect. EShare is the share screen app if you require it.. Video quality is too perfect in this budget.. got it at 34499 due to the Big Billion Days Deal. thanks to Flipkart for the wonderful product.. Love it totally. Look forward to Big Billion Days every year..",
            "I am happy that the product reached on time , Inspite of festive season. service is good. but except YouTube all other app are not working.we can't say it as smart TV.",
            "worth spending...I was confused when buying 55 inch TV ..have seen TCL Heir in this range but found VU is much better than any of them .. 4 K quality is also great.. Flipkart delivery was perfect and installation happened on same day great service Flipkart..",
            "100 % satisfied, more worth. amazing picture clarity and sound. loved it. I can say I am proud that I upgraded my 50inch full hd vu tv to 55inch uhd vu tv.\nI recommend that you can buy this without any second thought",
            "Value for money at this price",
            "Good picture quality",
            "awesome.... 😊😊😊😊",
            "There is always a lot of confusion when going for a TV.But the best thing to do is fix a budget and never cross that.Next always go for a bigger screen in comparison to all other features since most of us are casual TV viewers who cant appreciate the marketing elements of the company and only the size of the TV counts.Considering that i bought this VU TV after a reference from 2 of my relatives.Now i give u all a reference to buy VU 55 inch Tv without fear as we can comfortably expect atleast 5 years of problem free TV.Go ahead",
            "Dont buy this.. it is not worth the money.. vu has other models which have high specification for the same money.. please dont buy this!!!",
            "TV performance is very good with excellent picture, sound and connectivity options. Setup was very simple and dint face any issues. Flipkart price, service and delivery was excellent. But the installation Experience provided was words apart and flipkart has to focus of increasing customer confidence. Starting with contact number which will not be received and had to rely on Flipkart custom care to do escalation.",
            "Great Build Quality\nCool Sound\nBest Under 45K 55 inch 4K ..",
            "Picture quality is good and sound quality is not bad but installation and demo service slow",
            "Got this tv on big billion sale and got delivered. on 17th oct and installed on same day itself. The backlight is not even there is patches all over the place and there are gaps in between display and bezel. They are clearing the damaged stocks through sale. Requested for replacement and waiting.",
            "Nice TV that comes for perfect budget..",
            "Sound quality is not upto the mark as sound is not clear\nNetflix doesn't work. Prime video keeps getting crashed\nNo option to sign in YouTube app.",
            "tv used after 15 days display problem .don't buy this product",
            "Its an android 4k tv. Nothing is available at this price range. No issues at all. Go for it if you get a good deal.",
            "Amazing led , pure value for money..👍👍",
            "worth it, given money fully satisfied",
            "Perfect picture quality and awesome 4K UHD support.\n\nOnly issue is with Amazon prime. The prime videos are getting aborted in middle due to app related bugs. Could be fixed in updates.\n\nAwesome casting connectivity with YouTube and other apps... Super value for money",
            "Excellent product and performance...value for money,package was delivered earlier than offering time. demo and installation was nicely done with flipkart engineer..taken extended warranty for 3 years worth 3070 INR from installation team.",
            "best TV in this price range...can't ask more..full Paisa vasule deal. great VU",
            "Best TV in 43000 , quality is good, using since 8 months.",
            "received TV on 12 Aug and on 13 Aug installed",
            "Product is changed",
            "Awesome Delivery !!",
            "Awesome product",
            "A nice TV value for money. The only problem is its wall hanging attachment which are such that even engineer/mechanic finds it difficult to hang the TV on the wall and once you succeed in hanging you will find it difficult to change the HDMI port or to insert the pen drive etc. as their sockets become unassesable. It's mounting and unmounting is terrible.TV is OK",
            "very nice product in decent price. almost having everything u need except bluetooth but it's not a big issue. there is some wireless connectivity problem sometimes while mirroring. it needs one idle device working as hotspot and then the tv & the device to be mirrored is to be connected to this idle device using their wifi. this is some kind of indirect connectivity. but we the user just want big screen experience so it not a issue.",
            "very very nice",
            "excellent picture quality...value for money...one drawback ,not compatible with amazon prime movies",
            "good picture clarity and viewing experience...got it for 34.5k after all discounts...value for money at this price e.\n\ncons\n\n1. USB and other ports are inaccessible after mounting the TV..better to have a USB extension cable at the tine of installation\n\n2. hotstar is crashing in my TV\n\n\nGo for extended warranty for safe side",
            "very good product and also perfect delivery and installation aproach",
            "only few apps are working youtube , netflix rest of them are crashing when open , no mirroring no bluetooth , only get big screen in less cost",
            "Picture Quality: 4. Crisp and Vivid colors. No Light bleeding detected yet.\nBuild Quality: 3. Could have been better for such a big and heavy TV.\nSoftware: 1. Utter Laggy Android. Most of the softwares force close. And no idea when any updates are going to come since its still running Android 7.0. I wont suggest installing many apps on this TV as it makes it lag heavily. You cannot use TV settings unless you are out of the home screen onto a different interface.\nInterface: 2. It has all the interfaces one may need but after you wall mount the TV you can't reach to the most important ones like USBs and HDMI (ARC). You will need to take the TV off of the wall and then put your USB devices in. Also, the wifi setup keeps switching back to ethernet. WHY?\nSound: The 2 speakers are OK for general viewing. But if there is noise nearby it may get difficult to hear. Like the dialogues will get missed if you are not paying too much attention towards the sound with just a fan running in your room or you'll have to turn up the volume to atleast 40 points.\n\nVu has cut corners in processor and ram hence the low price. But if you are going to install laggy processor then automatically the price will come down. Vu needs to understand the Indian market since the competition is getting bigger. Won't recommend if these little mistakes aren't fixed.\nThe CPU utilization is 100% with just one app running. Come-on Vu!\n\nTips: The stock media player can't run 4K(HEVC) x265 AC3-5.1/7.1 so install Kodi. It is a nice Media centre and can play almost anything on this TV. Though it still cannot play 4K (VP9) 60FPS HDR content properly.\n\nPlayStore: Goto Kodi>Android Apps> Playstore. when you click on it, it will launch Playstore. Though it is very slow on first runs but it works. :)\n\nVu get my issues fixed and i'll fix your product rating, because u should know how frustrating it is to know that your product doesnt work as intended from the first day.",
            "nice quality",
            "dnt buy from flipkart , horrible service of installation . rude people . shocking reasons of not installing the tv .really no customer service . geting really harassed . dont even think of buying this product even in your dreams , post deleivery installation people shows lot of attitude and give stupid reasons for not installing . dont buy just dont buy from flipkart",
            "I am not happy with this product used after 10 days display problem. I am very much disappointed",
            "this product is awesome for this price range and u will get big screen size\nbut there r some of thing that u need to know about this product before buying\nthey r ,it doesn't support Bluetooth,cast screen(with Internet u can't ),dont have many apps in app store ,u cant download and other apps, no voice control\nif u don't use these options u can buy it",
            "After using one day.\npros:\nonly you get a big screen in less cost.\ncons:\n1. build quality is not good, as I have used other model vu 50 inch.\n2. you did not get more features in this TV.\n3. only few apps are working (Netflix, YouTube), rest of them are crashing when you open .\n4. majore problem I feel is, you won't be able to adjust settings for picture and sound when you are in app. I have seen that you can only adjust them in HDMI , av.\n5. sound is not upto the mark.\n6. No mirroring, without software.\n7. No Bluetooth\n\nBetter not to buy this TV , go for other models in VU.",
            "Awesome. Mind blowing purchases. Picture quality is amazing. Sound clarity and quality not up to the mark.",
            "The hardware is fine....but the software is very poor....non of in built app works well....regular crash happen. only YouTube works fine....shortcut key for app on remote doesn't work. You can't download all app from its App store. No bluetooth facility. Mounting of TV on wall is such a pain as after that u can put any HDMI Post or USB port at back....I have never experienced such problems in any TV Set.",
            "Great picture quality, pictures are sharp contrast are good 1080P to 4k enhancer just working smooth\ngreat purchase at this price point\ngo for it\njust little cons mirror screen not sharing live audio while Playing you tube video",
            "Overall TV is good, not as hiped by other reviews, apps like hotstar Continually crashing and unable to restart... The LED panels is very sensable and louse fitted. Built quality is average. USB slot and AV outputs are not accessible if wall mounted.. You have to use additional extensions for same before mounting. Viewing angle is average.",
            "Product is very good if peoples have no craze of brand it's very good Tv and very good brand.",
            "Almost 2 months are completed and feeling like not worth the money. This Tv will remind you old age smartphones because it's really slow. Connectivity is really bad even though the router is not far but still only 2 bars. The Sound is okay and Panel is pretty good with the price. The worst thing is VU service, after few days only HotStar stopped working and after complaining they send one engineer with a PenDrive just to update HotStar or something else as even the engineer had no idea what he is doing But after that HotStar was fixed but YouTube is not updating again and the engineer had no idea what is the issue and how to fix so he left. After some time we again faced some issue with some App and again complained but it's been more than 1 week and no one came. This is not Smart TV just Semi Smart so if you are looking for Smart please go for Android TV, it's little costly but worth.",
            "Do NOT buy this TV if you: (a) Want to cast screen from your phone, (b) Want to watch movies from your hard disk with subtitles, (c) Want to access input ports at the back when mounted on wall\n\nVu TVs are value for money. But only if you are going to just watch DTH or local cable on it. This particular TV has lot of small issues that frustrates the user. The screen is good, sound is decent. Other than that, following are the many niggles faced:\n\n1. When wall mounted, you cannot access any of the ports at the back. You have to remove the TV from the mount to access.\n2. You cannot access settings when using youtube or playing videos from hard disk (settings like adjusting picture or sound). To do that, you need to stop your video, go to the TV home screen, chose AVI as input, there change the settings, go back to main screen, then shift to different input then play your video. VERY frustrating.\n3. When you play netflix, the subtitles are perfect. But when you play video from your hard disk with subtitles, you can barely read the text on screen. It is opaque white and is almost useless having subtitles.\n4. When playing videos, sometimes there is random jump to different video.\n5. There is no gradual fast forward /backward option. You cannot move the video few seconds. It just jumps minutes.\n6. One of the biggest disappointments is casting from mobile. You need to download some shady looking app first on your phone, then open it and connect to TV. Then the phone is cast on the screen. But if you play a video on your phone, it plays the audio only on phone and does not cast to the TV. so you end up watching video on TV screen but audio from phone. And there is a big lag between video and audio.\n\nHaving purchased over four different Vu TVs to the household before with happy results, I was looking forward to this purchase. But the software issues and basic design issues is a huge disappointment.",
            "unable to login in to youtube hotstar",
            "After just 2 months it just stopped working one day. Just a blank screen. The customer care sent a repair guy within 24 hrs, who after trying to repair it said it needs to be replaced. That was 10 days ago..no replacement has happened yet. The customer care guys say it will be done soon but doesn’t seem like anytime soon as Replacemnt isn’t probably a priority with them.. Avoid this!",
            "FAILED WITH IN A MONTH, NOT RECOMMENDED WORST AFTER SALES SERVICE, I MADE A MISTAKE OPTING VU.",
            "I can't understand all of the positive reviews for this TV. It's hands down the worst TV I've ever purchased.\n\nAll of this TV's specs look good on paper, but the picture quality is poor, the navigation is very awkward, the wifi takes a long time to connect, and the remote isn't compatible. I could go on and on.\n\nStay away from this TV.",
            "NYC in this amount gud work vu don't think that u get oled blacks levels . but in this price good job from vu",
            "Yeah good service",
            "it's been 1 mth quality is sooo good, for 34k it is worth.",
            "all are ok but using tha usb port is very difficult",
            "I had a Sony 32\" TV which got lines on it after 5 years,which is why I lost faith in big brands.so I bought vu and found that it has the same picture clarity as in Sony/Lg/Samsung and the price of VU is just the half of it.",
            "Product not matching with the introductory video. Its frame is not metallic and grey. It comes with totally black frame. The sound speakers also not matching. The delivered product is altogether altered one with cheap quality material.",
            "V o i c e response not provided. USB portrs and HDMI port s w e r e p r o v i d e d i n t h e r e a r , n o t a c e s s a b l e f o r w a l l m o u n t .",
            "nice",
            "Vu led TV Chaka bagunndi",
            "Ok good but",
            "Working well",
            "Excellent in terms of everything..but motion rate is low.\nFast moving picture might give you a head swing.\nThere is no voice command.",
            "Bought it for 35k on sale. It's totally worth for that price",
            "Delivery on time. Packing was sturdy. Product quality 9/10. Picture quality is vibrant, will' give 9/ 10. Plays 4k videos in VLC Player with no lag. Sound not upto the mark will give5/10.",
            "problem is Eshare App. when Play youtube in moble that time sound not play in TV. software problem.",
            "Excellent product & service.\nValue for money",
            "Valu for money",
            "Best TV",
            "Awesome value for money!!",
            "great ....value for money",
            "The picture quality is too good, very best TV with best price, liked it and satisfied.",
            "Actually TV is reasonable for its price. But Picture quality is substandard. Otherwise every feature is good.",
            "good product",
            "TV stopped working in 10 days eventhough it has worked well for 10 days and I am awaiting either replacement or service for the past one week. I hope that the issue would be resolved at the earliest. I may change my rating later depending on how the issue is resolved.",
            "nice product",
            "picture quality is ok... connectivity good .very poor picture quality in low light pictures...not even hd quality... but in good light conditions pic quality is very good.",
            "Pathetic customer service..Thank fully I came to know ,I recommend many friends for this TV but my self experience is so bad.\nThis is like dumping of electronic garbage in India.\nVU only takes liability of products for 2 years only after that they will not extend your warranty it seems and it will be dealt out of warranty.\nI didn't check their out warranty support for spares but seems doubtful.\nOther companies who extends your product for multiple years here is only 2 years so be careful when you buy any VU product as your money will be of no use after 2 years if it goes wrong . Generally you need their support after 2 to 3 years only so get ready with an answer as big NO..",
            "I bought this product with 1 year warranty and took 1 year additional warranty, but after 2 years this product shows problems and didn't work properly. Now it cannot use for anything",
            "Very bad connectivity. Very bad menu interface. Worst buy. VU must discontinue this product immediately.",
            "Excellent TV for such a low price. There was some minor problem, but service was given immediately. I am giving my opinion after using for 2 years.",
            "Very very very tv.love to use it",
            "Problem within 1 year",
            "Worth for money",
            "GOOD",
            "No issue, better clarity, Really very good product",
            "Most of the simple & free Apps are not supported...ofcourse premium apps as well...disappointment..",
            "Its a PERFECT product, i have finished 1 year without any problem.",
            "Amazing value for money",
            "very NYC",
            "The motherboard stopped working on 14th month from purchase. The sound aux port only gave right channel output. Looks like very cheap unreliable parts are used.",
            "this review is after the one year I am having a issue in tv the company takes a month to repair but till now it's not been sloved this the worst company lies a lot and not helpful",
            "The build in apps are not working\nThe service person is saying blah blah answers like the remote is not same for the tv, unexpected answers, unreasonable answers\nApps like hotstar which has button in remote is not working in tv\nEven after updating it’s not working\nKindly arrange for proper working of Hotstar\nSend proper support team\nI bought 2 Tvs and now both has same problems",
            "Hotstar App NOT Working.?❌\nMobile can connect via app but too LAG is there?❌\nCan connect external hard disk via usb.,?✔️\nCan connect Laptop via HDMI.?✔️\nI am satisfied with Picture & Sound Quality.?✔️",
            "sound quality is average.Picture quality is good.youtube and other aap is not working properly.",
            "excellent",
            "TV flicker when streaming 4K content",
            "Goid",
            "With in 3 months got picture panal problem.. Lot of black spots and colors are not gud",
            "Picture quality - above average but not excellent, Sound Quality - below average., connectivity-Poor, Android content - worse, only YouTube runs and all other apps stops, not even updates are provided.",
            "In 8 months I have repaired the TV four times and it is not working now.",
            "Product is good",
            "performance is justify the more than price....",
            "very nice",
            "Nice Product",
            "waste of money, don't go with this product. instead buy branded Sony or Samsung or LG products. with less than 8 months its not working and power and panel issues started.",
            "Good experience and exposure",
            "Excellent",
            "best offer and best Tv !\nhad some issues with fixing the setup.\nrest of thing all good...",
            "picture sharing, screen mirroring facility is not available in Vu. Moreover ada comes from mobile which is pathetic...",
            "picture quality and sound was awesome but applications are not running.. automatically it has stopped except YouTube nothing is working in tv..\n\nand more updates for this one..\n\n\nonly for TV purpose it was awesome..\nfor online browsing and streaming purpose it won't workout and...\n\nthere has only 1080 resolution you can't find 2k and 4k resolution on YouTube in this TV..\n\nplease recheck once",
            "Best TV as of now.",
            "Value for money , awseum clarity . its Android Ready Tv , you dont have playstore but you can install apps downloading them from Browser itself :)",
            "avg",
            "Hi Guys,\nI had purchased VU TV 55 inch in November 2018.\nInitially it was working fine and later which in March we started to get the black lines, and VU folks got yhe entire TV replaced to New one.\n\nThanks Team",
            "Plus : Good price. Excellent clarify. More options.\nMinus : Missing ARC, Google Play, IR/NFC, Most of the connection options are back side, unable to change if it is wall mounted.",
            "happy to be brought",
            "value for money but not a top buy purely on quality front",
            "very good TV",
            "hot star doesn't work I have changed for 2times ....",
            "Good",
            "Just go for this TV. Value for money in low budget",
            "worst android tv",
            "Nice",
            "Good one in this price range.value for money",
            "Kindly Dont buy this product.. My tv got damage during the transportation and now it is not covered..",
            "this tv is best if you dont feel nice picture quality or sound go to settings and set tge settings as your choice",
            "1. WI-FI mode (wire/wireless) is getting reset each time.. 2. I was misguided by Android version.. Later I found my expectation is found in \"certified android\" version... is there any option to get my product replaced?",
            "very good product.",
            "super quality",
            "Good product",
            "Good picture Quality\nValue for Money\nkeep it up😃\nThank you for Fast Delivery and installation on time",
            "Overall excellent!\n#No.1 in market!\nGo for it!",
            "very good and and value for money. Can go for it",
            "had a glitch with one of the app called the VU tech support no proper response..",
            "ok ok product",
            "TV design look good",
            "THirdgrade product never buy on flipkart no service given and product is also worst",
            "The TV is excellent. However, the remote does not work at a distance of more than 3 feet. I even changed the batteries but it has no effect.\nThis needs looking into.",
            "Worst product I never seen. I found so may problems in this TV\n1. Time and date changing automatically\n2. Youtube app working properlly\n3. netlix, prime not even opening\n\nbetter don`t buy this product and its good to avoid FLIPKART.",
            "Great picture quality, best in this price segment",
            "the best value for money TV on the internet . Black's are really deep and the sound output is totally awesome. got more that what I expected and paid for",
            "Excellent product...Used for last 4 months....only one issue during mirrorring observed. sound is not comming from TV during direct mirrorring. But there is one another option is to use the mirrorring through android app,that is working well. Recomended to watch 4K movies....its awsom..100%worth for the money",
            "must go for it ... thank you Flipkart for your wonderful service",
            "good product at affordable price...",
            "Internet not connecting and working, every time showing saved not connecting.Overall Not satisfied.",
            "good",
            "Very good for the price.Picture quality and voice quality are worth appreciating.\nWas nicely packed and flipcart delivery and installation was on time.",
            "wifi connectivity is not good. it stopped working after a couple of months and does not get connected at all now ... Rest is pretty ok",
            "Suggested to buy this product.",
            "Company response is very late. Motherboard is damage only in 3-4 months",
            "Very good product and value for money",
            "Worst worst product.. The TV fuse for blown 3times in 4 months.. DONT BUY THIS TV",
            "Value for money, a little slow on taking remote input, lot many features that only come in high end smart TV. Except the speed, I haven't faced any issue yet, been using it for 6 months now.",
            "the picture quality is average !",
            "Worst colour, picture quality looks like 1980s picture. Waste of buying this product",
            "Undoubtedly an excellent 4K TV which is available for affordable price. However, from Android's perspective, most of the apps are not available and hangs every time. Eshare is one more pathetic app where we can only listen audio from mobile and video from TV.",
            "Picture Quality (Rating 4): Crisp and Vivid color. The picture quality is good.\nBuilt Quality (Rating 3): Overall its fine. The wall mounting system is very bad. Its very difficult to on and off from wall.\n\nSoftware (Rating 1): Find below the cons:\ni. Utterly slow Android.\nii. Youtube and Netflix works fine but sometime it crashes too. Live streaming in Hotstar does not work. Other apps does not work, when opened it crashed immediately.\niii. No 4k video playback support in youtube app.\niv. The WiFi setup automatically switch back to Ethernet mode every time you switch on the TV. Why? Its very frustrating.\nv. Mirroring works through Eshare. Only the picture gets mirrored to TV not the sound. And the screen mirroring become very slow.\n\nInterface (Rating 2): The interface is not good.\ni. The HDMI and USB ports are placed in such a way that after wall mounting those are not accessible. You have to uninstall your TV from wall to use those ports.\nii. None of the videos in the homepage opens. Its getting crashed immediately.\niii. No Bluetooth and poor connectivity.\niv. The home screen content does not update based on the user accessibility.\n\nSound (Rating 4): The sound quality is good. I have home theater connected to my TV and hence I don't bothered about the sound quality of TV.\nCustomer Care (Rating 2): The so called technicians are not at all technically sounds. They don't know how to fix the problems. I am pretty worried about the service as I have extended warranty for 2 years.\n\nOverall (Rating 2): I got a big screen in low price with a good picture quality and sound.",
            "Sure to buy.... I love it....",
            "ok types for the price range.. not so good in picture quality for normal TV channels.. good only for HD and UHD content and box speakers seems blarey.. UI very slow and hangs often.. most of the apps not opening and Android cannot be upgraded.",
            "superb",
            "pros:\n*video quality in YouTube\n*slim design\ncons:\n* need Audio quality improvement\n* sometimes have connectivity issues\n* display is too bright which will washout some details\n* video quality upsacling is not at all good in this TV",
            "good LED TV",
            "Nice one",
            "good",
            "There is a sound sync lag and no matter what you do it will not fix",
            "Vu led tv 55\" good product no dout believe far money",
            "Execllent picture and sound quality. Screen mirroring is not handy, it will be done thru app only. Otherwise excelleng product and worth for money.",
            "Wonderful",
            "Over all a good product and value for money. but connectivity is very poor, Bluetooth facility not available...",
            "TV board repaired within 40days and very difficult to connect the customer care to get warranty",
            "not expected level and low sound and jumbo speakers is not available as described. pls show or sale full available products",
            "Good quality TV. but hanging most of the times. memory is low",
            "compare to mi TV it's waste, pic is not clear and more over its get blured all kind of hd videos also",
            "Very good",
            "55 inch 4k TV at 36999/- is unbeatable deal...thanks for Flipkart for such a great deal .\nPROS:\nVALUE FOR MONEY.\nGOOD 4K UPSCALE.\nGOOD SOUND\n\nCONS:\nPOOR BLACK LEVELS.\nCONNICTIVITY ISSUES AS INPUTS ARE LIMITED TO MINIMALS.\nFLIPKART NOT GIVEN ME A REPALCE CHANCE AS I GOT DEFECTIVE TV.( THEY REFUNDED MY MONEY).",
            "worst TV. sound problem in only two months",
            "nice sert with Flipkart",
            "Cheap and best product.. Looking one more TV. but, the price not reduced long time..!!",
            "Awesome",
            "Over all its a nice product...",
            "very good",
            "clearing all damaged and left out TV's don't buy",
            "OK not bad, worth of amount",
            "Very Nice Picture Quality & Sound Clearance",
            "Amazing superb performance and good quality 😄😄",
            "Dear all,\nI have read al reviews before I made a move to purchase this tv. There is no doubt tv is fine for the money. Installing this tv by their own technician, is pathetic. They spoiled my new showcase as the guy literally didn’t even know how to hold a driller.\nI lost my showcase to this tv. 40 k was my show case worth. Recommend not to opt for installation.\nTv: don’t expect too much as this is average in all accords. Poor connectivity\n\n\n\nRgds,\nDeepak",
            "Best product in less price",
            "Really nice product. Supported media files may be the only issue otherwise excellant.",
            "no apps are downloaded . Its very disappointing.",
            "I am buying this 55inch TV west of money .this TV automatically off, iam buying with in 3 month and also services are not available .iam suffering buying this 55inch TV don't waste your money and time friends.",
            "Bad product",
            "awosame picture quality. value of money. thankyu flipcart",
            "very good",
            "Amazing product from VU. On time delivery by Flipkart. Amazing service by Jeeves for installation and demo. Overall amazing experience. Keep it up",
            "Value for the money you pay. Though we could see some bright light on the sides of the screen which is negligible.",
            "Tv is good, but the guy came for installation, he not even know the basic features. VU should provide a right person for demo.",
            "Nice one when the TV delivered nice and same day installation done. Wonderful.... product Thanks to Flipkart service",
            "good",
            "Picture quality is pathetic you will not enjoy the viewing experience in a 55 inch TV",
            "Amazing, superb and very nice, good quality TV and very big TV for this money",
            "not opening hotstar and some apps. voice is not clarity. please tell me the solution for hotstar app works",
            "Nice product",
            "superior quality very nice @sony jaisa picture",
            "Picture quality is not good, Please dont buy this product",
            "It was a good choice to buy VU TV.",
            "usb connection uncomfortable problem.\nbut all future are ok....",
            "I am in love with vu tvs this is 5 th tv just go for it",
            "netflix doesnt work..most of the app are useless\ntv..picture quality..sound is good",
            "Poor smart TV... Not supporting Netflix Hotstar except yputube",
            "waste of money don't purchase",
            "it's nice product delivered by flipkart.the delivery boy taken extra money",
            "not soooo good but okay ....amozon prime and hotstar not working .....WiFi also some times disconnected, like there are some many issue in OS ....and finally okay......compare to my vote Mi 4A pro",
            "Good picture quality",
            "Can’t play Amazon Prime.",
            "very good",
            "Worst product, Only smart tv not connected with hot star n any app... When i called to Service station they told me that TV is not updated with latest software and then they told us our service man wl come to you and update it, but still no response from VU authrized service station. Really Worst experience.. Flipkart kindly kick out these type of product from your vendor list those doesn't have any values towards their customers 😈😈😈 I lost my money by purchasing this product... worst product worst experience",
            "tv gets hung up sometimes",
            "Super Quality",
            "good product",
            "The first TV was bad it kept restarting again and again the replacement Right now doesn't have a problem as of now.Guys Restarting happens because the TV automatically goes on Set Timer where the timer is set by the company by default.Stop Timer and the tv works fine..",
            "Who ever is planing to buy or has bought this tv please never update it by any engineer or online..it will block all of Google service. The original firmware with which the tv comes has the features to use TV based Google play store which is not full fledge playstore but still you have latest features and updates for apps like YouTube and Kodi. If u will update it u will be stuck with single version of all apps.",
            "Good product,it’s value for money........",
            "Waste of money",
            "ok need more fixture quality",
            "good product for that money range, using it for the past 4 months picture quality and al over performance is good. u can trust them.",
            "Picture quality soso hanging please exchange my led I want upgrade model please give me any solutions",
            "excellent tv at this price. bought it primarily for gaming on PS4 and Xbox. satisfied till now. only thing is sound is not that great. but that's manageable.",
            "Awesome it's very good product",
            "Produced is Vey Good\n\nI have struggled for the TV installation and followed 4days and finally done .",
            "best product very good picture quality but problem create in 4 month",
            "nice tv and good quality",
            "Not smart. Prime videos doesnt work. Netflix too slow. Cant download apps",
            "Product Installation not done properly.",
            "The smart TV feature is a joke. None of the apps work.. Keeps on crashing. Thank god I have a ps4",
            "awesome led..great product",
            "If you want to waste your time and money then please proceed with buying this TV from Flipkart. Initially, they promised the free installation within 7 days but for me, it is more than 2 weeks still the installation didn’t happen. They also asked us not to open the box until they come for installation. Now I am worrying whether I bought a TV or box with bricks  . One of the worst customer care I had come across. I called them multiple times and they always come up with some dates. But no one will contact you regarding that. Till now I had 3 false promises made up by them. After 10 days I can't return this TV so their ultimate goal is to extend days and make sure that you buy that TV/Bricks. We raised multiple complaints through email and calls but same response.\n\nIf anyone plans to gift this TV for a special occasion please avoid doing that, because I gifted that TV to my parents on their special day but till now they are unable to open it. I dont think it is worth the money I spent. I trusted flipkart but I am completely dissatisfied now.",
            "Best tv at 34499\nExcellent value for money\nFast delivery and installation",
            "Super deal, supplied on-time, installed on-time, totally hassle free purchase. Loving it.",
            "The picture and sound quality of tv is very bad. The service of Flipkart is very bad.",
            "review calls are very disturbing . Every 2nd day i m recieving these awkward calls. Otherwise value for money.",
            "Superb tv with good viewing angles and Android interface is slightly difficult to use and overall for this price it's a superb tv...",
            "Inferior product, very poor quality, software issues, got TV replaced also but TV went dead on the first day itself. Do not buy any VU tv, Daiwai and Kevin TV are much better..do not recomend VU to any one..",
            "connectivity issue from day one and it's not proper smart TV apps not working in it apart from YouTube.",
            "I am rewriting this rewiew after using product for almost a year. Initially the product performance was unbeatable but over the time apps starts crashing and now they crash everytime. I uninstall all the apps and try to use single app only, that also a useless idea. Now it's only a TV to me no smart TV function as all types of app crashed immediately. With Extremely Poor performance and it's not a reliable product.",
            "It's an worst tv. I ordered this tv on Nov 10 after received when I switch on and played YouTube and hotstar this tv hanging suddenly. Luckily I have 10days replacement policy with flipkart. So they replaced with other same model VU tv. After one week process I got another VU tv. This time display problem with the TV. Display Inner light(back light) is coming out from the four corners of the tv. So again I return this VU 55inch tv. Very very worst tv. And nice support from flipkart to return it.",
            "screen was defeated got it exchanged still the same issue finally took a refund.",
            "the tv picture quality is just ok\nalso the so called smart TV\nin which all the apps are there ,not even a single app works properly\nmost of the apps crashes as soon as it starts",
            "super👌👌👌",
            "nice to but build quality not good. if mounted on the wall then unable to insert any USB device or HDMI because there is no space.",
            "flipkart is d best online site.....i m satisfied with the product and quality. And delivery on time.",
            "usb port on back side, bad fitting startegy in wall mount, apt mount not given, resokution also not met expectation",
            "very nice",
            "There is no screen mirror option..",
            "TV remote is not good",
            "Wi-Fi based picture dull clearity",
            "Very good TV. should buy.",
            "apps are not working at all,bad service,need help",
            "good picture &sound Quality......",
            "more than best for the budget , great option for the middle class people with luxury experience",
            "Service engineer behaviour was no good\n\nHe was also alone and I had to support him though he admitt d that 2nd engineer was on leave\n\nWall mount panel is of poor quality - quality means there were 2 separate wall mount stand which takes lot of time for measurement and chances are higher that you have to make holes on wall multiple times",
            "Gud but some drawbacks is there",
            "Hotstar is not working.",
            "I am facing problem my tv get issue no one is there to solve my issue.",
            "no latest update screen mirroring is not working properly",
            "The TV is good in all sense.Has no complicated operations.The only drawback was that it is not compatible with many of the external hard discs even which is mentioned as compatible.You can't get for this price,any where.",
            "flipkart is the most stupid company online they cant even install a tv on time forget about the big promises they make they are not able to fix one issue in 7days",
            "light bleeds from left corner while watching dark background scenes..... And jeevs engineer technician was also rude..... Thanks to God I was able to return this led and got my refund.....",
            "picture quality n sound is not good",
            "Awesome product, value for money...",
            "Excellent experience",
            "Worth for this price",
            "Awesome product.Late WiFi connectivity.",
            "in picture quality a huge difference between Samsung n Sony",
            "worth for money",
            "super",
            "Best deal we get hear good TV I love it",
            "Great product in its price category, i got it in 38000.picture and sound quality is very good.",
            "looking good, after demo I had observed in Mirror screen means when I had tried to share videos in VU TV iam not able hear sound from TV, it is cmng from my mobile",
            "Worth for money ..only disadvantage is for screen sharing it needs an application",
            "Excellent TV in this price..",
            "It's not a smart TV, like a smart TV, Just connect to Wi-Fi that's it. No mirroring, not reading HARD DISC. There is not option for USB port in source very much disappointed",
            "got at 33300 best in price",
            "not bad",
            "fast delivery from flipkart",
            "excellnt",
            "Installation and Demo not done schedule time not respond.",
            "picture quality and sound quality is not as good as expectations.",
            "the TV is good and value for money. but the installation was bad. the Jeeves guys came and installed without performing complete checks. as a result there was an audio problem wherein there was a sound delay and an a/v sync problem. after a complaint the tech guy came and said it was a Tata sky setting problem which was then sorted out by the Tata sky tech guy. this could have easily been sorted out by the guys who had installed it first had they performed the initial checks properly. the whole thing took a week to sort out.",
            "Good tv, Value for money.",
            "Video/audio quality and features are good for the money you pay. But don't try to compare it with top brands.",
            "I was very much excited about the VU 55 inch 4k UTV as It was gift to my family on Diwali. But it was not even worked at the installation time.\n\nReplacement requested and it’s showing 1 month to get it.\nPoor services of their courier and digital partner. I tired of making calls and writing emails to speed up the process, but no out comes. Also I have to update the status every time to the Flipkart.",
            "exlant product with low price. good pitcher quality. good sound.",
            "super TV",
            "nice clearity and sound also",
            "nice tv and good sound.. Worth for the money",
            "Extremely satisfied.. Go for it.. Complete value for money",
            "it's a good one",
            "It's just a normal TV, except usual browsing. E share will mirror only screen not the audio",
            "Picture quality is not good.",
            "gud",
            "It’s mentioned as 4K, but it won’t support 4K videos. Amazon prime won’t work. Hard disk won’t be detected.",
            "good product",
            "Good",
            "it is good product. only one issue, it is supporting 2.4 Wi-Fi network and signal capture strength is very low, hence i am giving it 4 star.",
            "Excellent..Value for money compared to all brand😊Ts working good..Rather then buying branded one we can buy this..",
            "Very happy with this buy",
            "Flikart cheating customers , When product bought NO COST EMI is there, when we pay in the credit card again merchant charging interest.",
            "good",
            "best quality",
            "super ....all is well",
            "nice quality wow",
            "Great Picture and Sound Experience Really awesome features and 4k support is great.",
            "nice tv",
            "HDMI,USB cable position is not appropriate , I am trying to put fire TV stick ,due to space issue not able to installed",
            "value for money ...budget tv at big size....\nflipkart response suprb...",
            "The best tv in low cost.",
            "Value of money, good contrast, a little disappointed by the quality of panel",
            "starting it was sound issue, but solved . now TV is completely not working( no power supply). very bad experience. repair services also delay( 4 days gone still not got sorted) .",
            "4k videos are not playing always hangs while playing and prime and Netflix doesn’t supports",
            "corner wall mount brand name of royal -look led,lcd wall mount. installation person billed 3800rs for tv wall mount. it's worth only 1500rs only.",
            "It's good and no issue as of now...I am writing this review after usage of the TV\nfor 10days..",
            "TV is good. But service need to improve.",
            "Best Tv in this price range.... super picture & good sound.",
            "Overall a good product, just the connectivity options could have been better and also a Bluetooth remote should also be supplied with it. Got it for 34.2K..Thanks to Flipkart",
            "Awesome tv but sometimes do not support audio format of 4k videos",
            "best quality Vu products\nthanks flipkart",
            "worth it",
            "awesome...but Bluetooth connectivity is required",
            "Good Picture Clarity.\nWorthful Product.\nNice TV in that budget range",
            "Excellent product",
            "Connecting to Mini output like headphones gives sound both in TV and headphone. All these models have same defect. This makes sure that nobody can listen to a clear audio since TV audio destroys the sound coming from external speakers.",
            "I bought this 3 or 4 days back and now today just install and demo was superb but there is main problem its not supporting the videos volume from any of my cell phone so there is no meaning if I am sharing on my tv screen only mute videos so please return this and suggest me any of ur tv which wheres you tube videos and my cell phone videos will be played with video sound on tv thanks",
            "Good Product",
            "USB PORT not supported many files so money waste",
            "Good product, worth my money",
            "I got this TV in 37k and believe me it's totally worth for every penny",
            "screen freeze on all HD channels. please resolve this",
            "Value for money only WiFi connectivity issue but connects in some time..👍",
            "Good in quality value for money",
            "good performance",
            "good",
            "Picture Quality is Very Bad",
            "We bought the TV for the Smart TV apps, since we dont watch cable, but unfortunately we have come to realise that we cant access the settings Menu when your using the Apps, which becomes a problem because the picture settings are not to my liking. I find the saturation very high, and brightness low. When your using cable/ chrome cast i am able to correct the picture settings- On Picture settings , i go to HDMI Mode and put it on Graphic option, and it improves the picture colours considerably. VU please release an update correcting the picture settings for the Smart App, since currently it is really bad and i am not able to watch anything because i am really disappointed by the colours.\nSecond problem is that the smart apps keep having problems, in the beginning Hotstar wasnt working, then the technician installed an update which made it work, post which netflix stopped working, i had to call the technician again and he said he had to install an update, why this constant problem??\nThirdly- It takes time for the internet to get connected to the TV, why the delay?",
            "picture quality is average..If you are looking for good picture quality go for pixelight series from the red reviewes..I opted this bought for 34500 in big billion deal..what i red from review..its Ok picture quality..not excellent..use belkin high speed hdmi cable ..for bit improved picture quality and enable ARC functionality..If you are not specific on picture quality..then this is your option..for this price..",
            "awesome tv",
            "PICTURE QUALITY IS NOT GOOD",
            "excellent",
            "Great product at lowest price",
            "Excellent TV got it for 34500 in big billion sale. Only minus there is no built in chromecast so the cast feature does not work. Had to purchase a Google chromecast 2 seperately for the cast feature. This is my 5th vu TV",
            "worst wall mount. everything is super picture sound",
            "Black is too dark... Resolution is very good...",
            "I think the best product in this price range, durability to be endured.",
            "very gud in these price",
            "demo and setting not complete",
            "Best of best in low price value of money and pictures quality is awosme, 4k output in low price",
            "Value for money delivery was good and fast but installation was too late and delayed from the actual date.",
            "its just a beast.looking very cool.worth for the money.",
            "must buy from only Flipkart, best budget TV.\nonly few andriod app run which. support to this TV.",
            "Delivery and installation is on date and time.\n\nPerfect 4k with best offer.",
            "very good product, and Jeeves service is very good same day installation done.",
            "Very nice clarity with best price",
            "Nice product very good pricing from flipkart serves all your daily needs of TV.",
            "HDMI ARC not supported. not getting proper support from VU in chennai.",
            "Not worth it.",
            "Good product and value for money.only Bluetooth is not available and direct phone to TV casting is not possible we have to install Eshare app from this app only we can cast to TV. All features are very good.",
            "Worth the price it is charged..",
            "When we fix the wall mount no possible for connecting any external device it is the 1st and negative of the TV we need to buy two extended cables and need to fix permanently",
            "Hotstar doesn't open up... no 3.5mm jack and it is not even mentioned anywhere...",
            "Good picture quality very nice valve of money",
            "Nice product, Best buy",
            "Gr8 product. Value for money. No problems as on 8 days. Go for it. Screen quality is superb. Attached home theater for best sound.",
            "not supporting youtube HD purchased movies",
            "Its best at this price",
            "I have only one complain that of ur WiFi connection is lil far then it does Nt catch the connection properly..this could be corrected... Except this the product is awesome",
            "showing pixels. picture quality not as sharp as expect",
            "very excellent",
            "I purchased this product in Flipkart.. i am very satisfied with this VU television and worth for that cost.. thanks to Flipkart",
            "Good Timely delivered.and Today Installation is going on..will see how is the product performance....I will update later",
            "Its perfect for the price!\nBut be advised that the sound is not crisp so its hard to understand if some people are talking nearby.",
            "very good",
            "good",
            "This experience was the best from Flipkart... Its delivered the next day i ordered and within few hours installation too... The TV is good...if u have good HD+ content...This TV is Xlnt..I got it only fr 35k",
            "worth for money",
            "very poor",
            "good bye",
            "good and better tv",
            "good product, running well, functionality is also good,\nbut issue is no VGA Port....",
            "Awesome TV clarity, sound, quality, etc etc etc",
            "Good one.. Its better if they can reduce the weight and Width (Thickness).\n\nOverall performance is good",
            "nice picture quality in terms of money spent",
            "picture quality is above average connection of aux port missing",
            "Picture quality is really good and connectivity is really awesome. Sound is the best one more clear and loud.",
            "excellent...",
            "It's good, service is good too.... installed very quickly m satisfied fully..... good job done by Flipcart team...... thanks",
            "it's amazing for such a price",
            "very good value for money",
            "delivery and product is good, struggle for more than 10 days for installation",
            "Value for money product.totally worth the price",
            "good product",
            "so good product",
            "nice",
            "excellent TV.",
            "PURCHASED TV 10 DAYS AGO PROBLEM WITH TV IS PICTURE & SOUND WAS NOT SINCRONISED ....SOUND CAME 5-6 LATE THEN PICTURE RUNNING.....NOT SATISFIED WITH UPSCALING OF PICTURE ...I HAVE USED 43 INCH VU4K BEFORE.....AT PRESENT TV HAS GONE FOR EXCHANGE .......I WILL UPDATE U AS I GET THE REPLACEMENT.........VU REALLY DISSOPOINTED WITH UPSCALING.....I HAVE PRAISE FOR 43 INCH OLD MODEL OF 2015.....BUT THIS TV NOT THUCHED MY HEART......EXPERIENCE PROBLEM RIGHT FROM DAY 1..",
            "Value for money. Good picture and sound quality. Less smart but OK...",
            "very bad software..android OS is too slow when you open two applications .... picture looks patchy not a good product overall ...",
            "The installation team is not punctual or dont turn up as promised by Flipkart. Just because the warranty is involved I will have to wait for those non professionals. Else its a total waste.",
            "Nice",
            "Good buy",
            "Its very low price with high performance in terms of picture and sound and connectivity"
        ],
        "likes": [
            "133",
            "33",
            "12",
            "14",
            "4",
            "4",
            "14",
            "7",
            "3",
            "5",
            "133",
            "33",
            "12",
            "14",
            "4",
            "4",
            "14",
            "7",
            "3",
            "5",
            "2",
            "2",
            "2",
            "2",
            "6",
            "6",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "74",
            "33",
            "55",
            "14",
            "152",
            "47",
            "7",
            "14",
            "40",
            "6",
            "10",
            "16",
            "3",
            "3",
            "3",
            "5",
            "7",
            "4",
            "4",
            "3",
            "4",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "7",
            "3",
            "3",
            "4",
            "4",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "55",
            "47",
            "2",
            "4",
            "0",
            "0",
            "6",
            "2",
            "0",
            "1",
            "55",
            "47",
            "2",
            "4",
            "0",
            "0",
            "6",
            "2",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "4",
            "5",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "19",
            "10",
            "22",
            "3",
            "89",
            "26",
            "1",
            "6",
            "24",
            "1",
            "4",
            "10",
            "0",
            "0",
            "0",
            "1",
            "3",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "5",
            "1",
            "1",
            "2",
            "2",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Does this TV has Netflix?",
            "Q:does it have netflix and prime video?",
            "Q:we can play 4k videos in you tube on this led.",
            "Q:Does it have YouTube",
            "Q:what about Bluetooth?",
            "Q:show me position of HDMI and USB ports",
            "Q:Can it be used to connect PS4? If so how is the performance and is there any input lag ?",
            "Q:is it steblizer free?",
            "Q:Is we can connect videocon d2h to the tv through the jack wires?",
            "Q:how to connect screen mirror",
            "Q:how to connect phone to Esharing?(means screen mirror)",
            "Q:what is contrast ratio of this TV ?",
            "Q:is it DTS n dolby compatible ?",
            "Q:what is the height and width of the tv",
            "Q:IS IT SMART TV",
            "Q:Difference between 55 inch Iconium & Pixelight model ?",
            "Q:is it hangable",
            "Q:Which is the best 55 inch tv out of Vu pixelight, Vu iconium and Vu android tv?",
            "Q:Screen cast is available",
            "Q:Does it supports PS4 (Play Station 4)?",
            "Q:how can i connect home theater system with this tv.?",
            "Q:Is Vu Iconium 55 inch 55UH7545 and Vu Android 55 inch 55UH7545 is same?",
            "Q:is that 3.5mm jack available in this tv for headphone or home theatre ?",
            "Q:Does google work on this tv",
            "Q:does it has google play store ??",
            "Q:Does it have amozon prime app",
            "Q:can we use screen mirroring by wire?",
            "Q:hdmi cable home theatre suport yes or no",
            "Q:In vu andriod oreo 8.0 version does netflix works or not ??",
            "Q:Is their Bluetooth option ?",
            "Q:Can we download games or apps in tv rather than given in tv store?",
            "Q:Can you provide GST bill mentioned our company GSTIN ? Like B2B transaction.",
            "Q:how to connect F&D 5.1 speakers to this tv?",
            "Q:how to connect home theater systeam but not given audio out put systeam please solve the probleam",
            "Q:jio tv apps install ?",
            "Q:is there any processor, ram nd rom?",
            "Q:My picture in screen possible to change",
            "Q:Screen background picture changing possible",
            "Q:sim card supported??",
            "Q:its dolby saround available",
            "Q:How we can change the brightness in vu Iconium",
            "Q:mp4 support, can i connect home thratre",
            "Q:can we remove the stand of it",
            "Q:how to screenshare using laptop?",
            "Q:WILL YOU PROVIDE ME THE GST BILL MENTIONING MY GST NUMBER ON THE BILL SO THAT I CAN CLAIM THE CREDIT FOR THIS LED PURCHASE ???",
            "Q:iconium and andriod which is new model",
            "Q:how much ram does this tv have",
            "Q:what is the capacity of stabilisor required for 55 inch uhd 4k led tv",
            "Q:Where is the USB port ?",
            "Q:does this product effect eyes",
            "Q:fecbook and what sapp",
            "Q:does it required extra speakers for good sound..??",
            "Q:what is that option that they have given in advance what is blue screen means",
            "Q:how we can screen mirroring with samsung on max",
            "Q:how to connect BT headphones",
            "Q:Can we connet ios mobile to this tv through eshare",
            "Q:is this tv need power point plug or normal 3pin plug?",
            "Q:this tv have HDMI ARC for home theater",
            "Q:Is there 3.5 mm jack available to connect home theatre?? if yes, than where can i find it.. if no than how can i connect home theatre to it??",
            "Q:does I have a aux port",
            "Q:Can we connect setup box",
            "Q:can we play game with console",
            "Q:which one better in all aspects VU 55 or iffalcon K2A 55",
            "Q:support bluetutha yes or no",
            "Q:does it allow screen monitorimg?",
            "Q:is it stabilizer free",
            "Q:Is the sound clarity excellent",
            "Q:does it requires a separate stablizer ?",
            "Q:it requires stablizer.",
            "Q:i have sony 5.1 version home theater can it be connected with this led",
            "Q:How to open youtube in this tv",
            "Q:can it support external drive like 2 terabyte hard drive for uhd movies?",
            "Q:Is the power cord detachable, not able to figure out ?",
            "Q:which tv is best vu or mi",
            "Q:does chromecast is in built",
            "Q:hdr support or not support",
            "Q:does this tv contain google play store??",
            "Q:The max resolution option im getting on youtube app is for 1080p, i am confused if the Tv is 4k UHD it should play 2160p even on youtube, Anybody have any idea ?",
            "Q:Is it cell phone operating available?",
            "Q:does it play hevc x265 2160 pm video format",
            "Q:How Many GB Ram And Android Version 8.0 Upgrade Possibly?",
            "Q:is it supports youtube,netflix?",
            "Q:this is andriod tv",
            "Q:can we install android apps on this tv?",
            "Q:Does this TV support Netflix.",
            "Q:what is difference between vu iconium and android tv?",
            "Q:can we we add SD card to increase memory of inbuilt memory of 8gb",
            "Q:Is it better than iFFALCON K2A in terms of only picture quality?",
            "Q:can we connect Bluetooth",
            "Q:can i play 4k uhd videos through USB drive?",
            "Q:There ia gap in bezel and screen of the tv.. is it ok.. or there is any defect",
            "Q:how to get audio out for normal home theater for aux",
            "Q:In this tv, sound is delayed by a fraction of second at times.. Is it normal or its damaged product..?",
            "Q:It sound is outside of tv",
            "Q:can we connect wireless keyboard",
            "Q:how to pack this? In wooden box or in any other package ?",
            "Q:how we connect our Mobile without Bluetooth?",
            "Q:Will this TV last for long time",
            "Q:Does this TV as Optical Audio Output?",
            "Q:Supports miracast from android mobile or iphone??",
            "Q:does is support 3D content?",
            "Q:Prime can be installed?",
            "Q:wether this tv has google play store?",
            "Q:Does it have Google cast",
            "Q:tv start up time ?",
            "Q:which company belong",
            "Q:how can we connect wireless sound bars ?",
            "Q:can i install pubg in this led tv",
            "Q:Is 55 inch tv is too big?",
            "Q:Backlight are dled or eled ?",
            "Q:Does it have a browser?",
            "Q:how to sign in youtube",
            "Q:can someone help me with how to connect/cast my Samsung smart phone to VU 55 iconium TV?",
            "Q:how to fit the wall mount",
            "Q:I need to purchase in the name of my company. Is it possible to get a GST invoice?",
            "Q:How to get 4K video in YouTube app??",
            "Q:whether they will give jiofi along with TV",
            "Q:Does this tv supports 4k hdr 60fps gaming via ps4 pro?",
            "Q:Can you use for skype",
            "Q:How Do I Attach USB When It is Wall Mounted ?",
            "Q:Tata sky included in package",
            "Q:how to use the screen mirroing option?",
            "Q:Hot Star Not Open Any One Help Us?",
            "Q:I am unable to use Netflix properly. App hangs, and u cannot go to search option. Only icons showed can be played. Is it so in every tv? Could anyone help me please.",
            "Q:Whether Blu Ray format movies can be played on it?",
            "Q:does it have audio out? like headphone jack",
            "Q:Which type of usb port it have usb 2.0 or 3.0",
            "Q:Is it has ultra hd quality?",
            "Q:is wall bracket free or paid",
            "Q:its not provided in specs so i must ask....does mp4 video support?",
            "Q:difference between samsung",
            "Q:Hotstar is not opening. It getting closed.. Any idea how to fix the same?",
            "Q:what about bluetooth connectivity? how to connect bluetooth soundbar?",
            "Q:can i use intex sound system to this tv ????",
            "Q:do we need stabilizer or it is inbuilt",
            "Q:Does it have wall stand with tv",
            "Q:can we connect CPU with it",
            "Q:voice remote support",
            "Q:Can we cast our mobile screen in this tv ?",
            "Q:does it have voice search on remote?",
            "Q:how many remotes",
            "Q:What ALL smart things can we do??",
            "Q:Does the actual TV remote have an IR blaster or works on Bluetooth?",
            "Q:whether it hv hotstar app?",
            "Q:this tv is 3d ??.",
            "Q:Does It Have A Build in Wifi",
            "Q:Does this have IPS panel?!",
            "Q:Does it have HDR, the vu website says it does but flipkart doesn't ?",
            "Q:does this tv has built in chromecast",
            "Q:Can we mount on wall verticle",
            "Q:does this have HDR",
            "Q:Is it air mouse available",
            "Q:can i connect Bluetooth headphones"
        ],
        "answers": [
            "A:yes you can download the app, but doesn't work",
            "A:Yes it does have",
            "A:no we cannot play 4k videos on YouTube",
            "A:Yes it has.",
            "A:No Bluetooth is there",
            "A:One USB and HDMI port is in usable place. other cannot be used when wall mounted, optionally we can extend the ports using HDMI to HDMI Cable and USB to USB Cable which is located in back side.",
            "A:Yes you can connect via hdmi. I have no prob in playing lossless 4k 60fps videos via usb without any issue.",
            "A:No stabilizer inbuilt. 125W. Really need stabilizer?",
            "A:Yes or through HDMI.",
            "A:VU support screen mirroring using Eshare. Install Eshare app in your mobile.",
            "A:you will have to download an EShare app. and then connect to the Tv. Except the camera videos you cannot hear to any other videos.",
            "A:soft",
            "A:Yes,It is compatible.",
            "A:28. 5\" * 48.5\"",
            "A:yes its smart tv",
            "A:Pixlight has some better picture quality",
            "A:If you are asking about wallmount, then definitely yes.",
            "A:Pixelight has better picture quality, android official has better UI and iconium has better price. Now you decide.",
            "A:you can cast your video through EShare App only... will not be able to cast your screen for youtube or facebook videos(i.e no online streaming screen cast possible)...",
            "A:i have xbox one s, and it works great... so definitely going to support ps4. personal advice you should go for TCL iffalcon k2a .",
            "A:use HDMI with arc feature. set the TV audio settings to ARC",
            "A:Both have same panels But Android is more smart ... You can install Apps... Pixelight have more Picture qulity.",
            "A:No, there is no 3.5mm jack port available",
            "A:If you asking about Google Play Store then it works by downloading its APK file and installing it on the TV. but you can't find it on TV Store.",
            "A:Yes",
            "A:Yes",
            "A:screen mirroring is not working with this TV due to older version of andriod",
            "A:yup",
            "A:yes netflix works perfectly time in this , just go for it,,",
            "A:no",
            "A:not",
            "A:29AAGCC4236P1Z5",
            "A:I connected through audio jack cable",
            "A:hi it is easily connect step 1, from dth or set of box to home theatre hdmi in connect hdmi cable step 2, from home theatre hdmi ARC port to TV ARC port connect cable step 3, you will operate remote",
            "A:No",
            "A:No",
            "A:Nope, the pic changes according to ur input device, the pic of ur tv is based on ur set topbox. U can change the resolution of ur tv only when it is connected to a computer...",
            "A:yes",
            "A:Nope",
            "A:No didn't feel one...",
            "A:setting menu",
            "A:Yes you c an",
            "A:Yes. I have installed it with the wall bracket.",
            "A:download the eshare app for desktop",
            "A:Yes you can get the credit",
            "A:android version is newer",
            "A:1gb",
            "A:220 volt automatic stabilizer",
            "A:backside..and if wall fitted than very difficult to plugin",
            "A:no, picture quality is superb.looking like Sony picture quality.",
            "A:it has facebook ,skype and twitter apps .you can cast your phone and see whatsapp on the bigscreen if you wish to.",
            "A:Not required........If you want more theatre experience then u can",
            "A:hard screan",
            "A:in vu no screen mirroring without any app .",
            "A:u can connect if it's wired headset, if ur headset is Bluetooth then u cant",
            "A:Yes",
            "A:I am using power point plug",
            "A:yes it has",
            "A:yes",
            "A:Yes, Aux out is there for connecting to external audio",
            "A:Yes. I assume you are talking about connecting \"Set Top Box\" with this tv.",
            "A:Yes, it's possible to play games using console.",
            "A:VU 55 is Better. Picture quality is good,sound is awesome. All smart facilities in low cost.",
            "A:NO",
            "A:you mean screen mirroring? It does allow that for which you need to download an app in your mobile device",
            "A:No..As per Expert direction it's needs Stabilizer.",
            "A:Audio has a lag in comparison to video.",
            "A:No",
            "A:the installation person suggested to have a stabilizer. so ordered it.",
            "A:yes. you can",
            "A:there is an inbuilt app in this TV. you can open and enjoy it.",
            "A:yes",
            "A:It is fixed. Not detachable.",
            "A:VU",
            "A:no built in Chromecast",
            "A:It supports HDR",
            "A:can I get a link that how to download play store for this tv",
            "A:open chrome browser > play store > YouTube > Update",
            "A:if you are talking about phone mirroring, yes it is available.",
            "A:Hello, Downloaded and able to view it from from my TV,. Thanks",
            "A:It has 8GB internal storage, 2 core processors and Android version 7 installed. Doesn't have upgrade option.",
            "A:yes it supports youtube and netflix but picture quality is not upto the mark",
            "A:yes it is not official Android but it is Android.",
            "A:Yes you can..",
            "A:yes you can download Netflix app from TV Store and it works fine.",
            "A:Android TV has android playstore. Iconium Has its own app store. But you can install any apk file on Iconium also",
            "A:while buying product keep it in variants like 8gb 16gb 32gb.keep USB port side to the pannel and keep direct buttons in remote like screen share, Bluetooth and make user easy to operate. i need job",
            "A:Picture Quality is better",
            "A:NO BLUETOOTH",
            "A:Yes, of course. It works well with updated VLC player.",
            "A:No such gap visible.it does not play 4K video (2160p) resolution on YouTube or iPhone or GoPro 6. If you are buying because it’s shows 4K in specifications PLS don’t buy. Buy uk6500 LG",
            "A:Yes you can connect through aux as well as HDMI Arc.",
            "A:Vu 140 cm T.v is the best product in this prize we don't have any product buy in this prize & also t.v's picture quality is too good.",
            "A:OK for the price. Sound quality is not up to the mark But still better option compared to other high priced brands.",
            "A:logitech keyboard is working",
            "A:It came in cardboard box packing.",
            "A:Its super easy. Just install the app they show in screen and u have no other button to press. And u can use mobile for any damn thing. Typing amd Air mouse or touch pad. Anything",
            "A:Some of my friends have good experience with VU so far. I would definitely recommend, but still there is no guarantee if the piece you get would last a long time, whether it is VU or Samsung or Sony",
            "A:no it doesn't have",
            "A:it supports Eshare which is unique than miracast. you can play videoes, photos etc. in background of phone so you can do anything with phone while playing on TV. miscast is old technology.",
            "A:Hi, I can play HSBS where I couldnt able to find compatible 3D Glasses - Tried Anaglyph 3D glasses where it didnt work. Played Anaglyph 3D video and I am able to watch the video with Anaglyph 3D Glas",
            "A:app does get downloaded n main page opens up too but wen u try to play any video/episode/trailer, the app stops responding and hangs forever. the only thing then is to restart ur tv. Prime DOESNT WORK",
            "A:Yes",
            "A:Since it has android based OS so yes it has Google Cast.",
            "A:First boot time takes 10-15 seconds. If not switched off from main power next turn on takes just 4-secs.",
            "A:VU is a brand founded in Mumbai in 2006. It is the largest-selling TV brand in e-commerce platforms in India and don't worry about service they have service station in all the major cities.go for it!",
            "A:Through a 3.5mm jack. No Bluetooth.",
            "A:No",
            "A:No.. Normal as per hall.",
            "A:dled",
            "A:Yes it has",
            "A:You tube not possible to sing in but you can watch by searching videos",
            "A:Download Eshare application and connect your TV through that",
            "A:It will be installed by company professional team.",
            "A:It Depends on the seller.",
            "A:just type 4k videos on youtube but one thing you cant play 4k direct on youtube by tv default app",
            "A:No, Nothing Given",
            "A:Yes it is incredible",
            "A:yes",
            "A:Hi, It is not possible to access the back of the TV if the TV is fitted with wall mount provided by the manufacturer. Suggest to buy a tilt-able wall mount, so that the TV can be brought forward.",
            "A:no",
            "A:Tv has e share option, download the same app in your mobile, and connect...",
            "A:Hi You Have to update the hotstar app to make it work. But its of no use because lot of hotstar content doesn’t work. So you have to buy some casting device like chromecast or you can buy firestick.",
            "A:netflix is working properly , search option is working ( please use mouse opotion in the tv remote)",
            "A:yes it can...but! not for all type of blue ray formats.Work Exp: have issue with sound not at all coming for few formats, and faced the app crash issue most.think twice before you take desition.Ok",
            "A:yes it has. u can use wireless headphone as well.",
            "A:Both",
            "A:yes",
            "A:Free",
            "A:yes",
            "A:Main difference is Price. Picture quality and sound quality of VU tv is amazing.",
            "A:If you update the software Hotstar will work but you will never watch any large file from your usb it will not work I’m facing same issue 15 days I’m waiting",
            "A:No, there is no Bluetooth connectivity. It has got WiFi hotspot.",
            "A:Yes",
            "A:yes we need stabilizer for this tv",
            "A:yes",
            "A:Yes ofcourse",
            "A:No",
            "A:yes however Audio is not transferred.",
            "A:yes. but you have to purchase the voice enable remote separately",
            "A:Only one",
            "A:only Google Chrome YouTube Netflix hotstar but prime vedio does run after downloading and subscription",
            "A:No confirmed not",
            "A:Yes it has hotstar inbuilt",
            "A:No",
            "A:yes",
            "A:No",
            "A:Yes Don't worry it supports HDR AND HDR10",
            "A:No built in Chromecast.",
            "A:Yes. but stock wall mounting bracket sticks tv to the wall. You wouldn't be able to reach ports later.",
            "A:Yes. HDR 10.",
            "A:Doesn't come with TV. but you can buy it online.",
            "A:NO BLUETOOTH"
        ],
        "likes": [
            "6",
            "1",
            "1",
            "3",
            "12",
            "10",
            "7",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "14",
            "3",
            "6",
            "2",
            "3",
            "0",
            "4",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "47",
            "0",
            "0",
            "10",
            "3",
            "18",
            "5",
            "2",
            "3",
            "3",
            "3",
            "17",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "13",
            "5",
            "0",
            "7",
            "0",
            "4",
            "1",
            "1",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "0",
            "0",
            "2",
            "0",
            "8",
            "7",
            "7",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "32",
            "3",
            "11",
            "2",
            "8",
            "1",
            "16",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "1",
            "0",
            "0",
            "9",
            "2",
            "0",
            "4",
            "0",
            "12",
            "2",
            "0",
            "1",
            "1",
            "2",
            "34",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "27",
            "7",
            "1",
            "13",
            "0",
            "9",
            "1",
            "1",
            "5",
            "8",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "4",
            "0",
            "1",
            "0",
            "1",
            "0",
            "3",
            "1",
            "2",
            "0",
            "0",
            "0"
        ]
    }
}