{
    "title": "TCL C715 Series 126 cm (50 inch) QLED Ultra HD (4K) Smart Android TV with Handsfree Voice Control & Dolby Vision & Atmos  (50C715)",
    "product_specification": {
        "In The Box": "1N LED TV, 1N Stand, 1N Audio Cable, 1N User Manual, 1N Warranty Card, 1N Remote, 2N Batteries, 1N Wall Mount",
        "Model Name": "50C715",
        "Display Size": "126 cm (50 inch)",
        "Screen Type": "QLED",
        "HD Technology & Resolution": "Ultra HD (4K), 3840 x 2160",
        "Series": "C715 Series",
        "Smart Tv": "Yes",
        "HDMI": "3 Side",
        "USB": "2 Side",
        "Built In Wi-Fi": "Yes",
        "Launch Year": "2020",
        "Brightness": "330 nits",
        "Contrast Ratio": "5000:1 (Static)",
        "View Angle": "178 Degree",
        "LED Display Type": "Direct LED",
        "Aspect Ratio": "16:9",
        "Refresh Rate": "60 Hz",
        "Supported Video Formats": "JPEG, PNG, BMP, HEIF",
        "Other Video Features": "Color Gamut: 93% DCI-P3 Coverage, Backlight Adjustable, Color Temperature, Picture Mode: Standard/Smart HDR/Sport/Movie/Dynamic, Multimedia Video/Audio Decoder: H.265/H.264,MPEG1/2/4,VP8,VP9, Video Format Up to: 4K at 60 Hz-12 bit 4:2:2, 4K at 60 Hz-8 bit 4:4:4",
        "Number of Speakers": "2",
        "Speaker Type": "Integrated Speaker Box",
        "Speaker Output RMS": "30 W",
        "Sound Mode": "Dynamic, Standard, Movie, Music, Voice, Game, Stadium",
        "Supported Audio Formats": "MP3, AC3, AAC, AC4",
        "Other Audio Features": "Audio Delay, Dolby",
        "Processor": "64 Bit A55x4 900 MHz",
        "Graphic Processor": "Mali470x3 600 MHz-800 MHz",
        "Clocking Speed": "1.1 GHz",
        "Supported App - Netflix": "Yes",
        "Supported App - Youtube": "Yes",
        "Supported App - Disney+Hotstar": "Yes",
        "Operating System": "Android",
        "Screen Mirroring": "Yes",
        "Bluetooth": "Yes",
        "Other Internet Features": "Google Play Store, TV+ App Store, T-CAST, YUPPTV, T-Browser, Media Center, E-Sticker, Dailymotion, Prime Videos",
        "Power Requirement": "AC 100 - 240 V, 50/60 Hz",
        "Power Consumption": "135 W, 0.5 W (Standby)",
        "Width x Height x Depth (without stand)": "1112 mm x 79 mm",
        "Weight (without stand)": "11.8 kg",
        "Weight (with stand)": "12.1 kg",
        "Stand Features": "VESA Mounting: WMB234, VESA Hole Pattern: 200 x 200, Screw Size: M6 x 15, Screw Length: 15 mm, Screw Quantity: 4",
        "Other Dimensions": "Gross Weight With Packaging: 15.6 kg, Screw Size: M5 x 25, Screw Length: 25 mm, Screw Pitch: 0.7 mm, Screw Quantity: 4",
        "Warranty Summary": "1 Year Warranty on Product + 1 Year Additional on Panel",
        "Covered in Warranty": "Warranty of the Product is Limited to Manufacturing Defects Only",
        "Not Covered in Warranty": "Warranty Does Not Cover Any External Accessories (Such as Battery, Cable, Carrying Bag), Damage Caused to the Product Due to Improper Installation by Customer, Normal Wear and Tear to Magnetic Heads, Audio, Video, Laser Pick-ups and TV Picture Tubes, Panel, Damages Caused to the Product by Accident, Lightening, Ingress of Water, Fire, Dropping or Excessive Shock, Any Damage Caused Due to Tampering of the Product by an Unauthorized Agent, Liability for Loss of Data, Recorded Images or Business Opportunity Loss.",
        "Warranty Service Type": "Technician Visit",
        "Installation & Demo Details": "We'll facilitate the installation and demo through authorized service engineer at your convenience The installation will be done within 48 hours of delivery of the TV.The service engineer will install your new TV, either on wall mount or on table top. Installation and demo are provided free of cost.The engineer will also help you understand your new TV's features.The process generally covers:Wall-mounted or table-top installation, as requested.Physical check of all ports, including power and USB ports. Accessories also checked.Demonstration of features and settingsQuick run-through on how to operate the TV"
    },
    "product_description": {
        "Stunning Visuals": "This TCL TV features the Quantum Dot Technology to produce bright images in a rich colour palette.",
        "Voice Recognition": "This Smart TV comes inbuilt with Google Assistant that allows you to replace the remote with your voice. Just say “Ok Google” or “Hey Google” to control the TV, change channels, set reminders for programs, etc.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "3",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "2",
            "1",
            "1",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "3",
            "1",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review": [
            "Picture quality is average, at every angle not like a qled tv. I think its panel is B grade. Picture settings needs very fine adjustment. Sound is average. HDMI arc port is not properly matching with sony home theater. Picture upscaling is also poor. So don't waste your hard earned money for such scrap tv. So don't buy TCL qled TV, rather go for 4K tv only if you want to purchase in this brand. However after installation I got two updates. Picture settings can be improved by software updates, hopes TCL fix this in future updates. If flipkart replace this tv with other brand without any money deduction then I will definitely prefer other brands. If I compare it with my earlier Vu premium Tv 50inch then in every angle Vu Tv is best.",
            "Hello all this is a really good TV\n1.Picture quality watching 4K on this tv is wow .. colors are wonderful blacks are deep, I watched Grand tour season 2, 1st episode in that they show super cars in Switzerland.. too good.\n2.sound I will not say it’s the best but enough\n3.android on the tv is good response is nice .. not the fastest but good enough I would say...\n4.only negative point is that the panel is bit reflective and brightness is 330nits so if you are watching a very dark movie which has lots of blacks then you have make sure the room is dark to enjoy the movie to the fullest ( dark curtains should do the job)\nOverall I think it’s value for money 👍👍",
            "So nice Dolby vision and Dolby Atmos I loved my tv it was fabulous and it has HDR 10+ and TCL TVs are better than Mi TVs\nThe sound can hear at my apartment basement it was litterally amazing thank you flipkart",
            "Super excellent nd marvelous TV. Connectivity of Wifi nd screen mirroring r so fast. Clarity is very very good. Delivery & Installation had no problem for me. Thank U for flipkart nd TCL for their services.",
            "Good",
            "Budget qled TV with lots of features.\n\nPicture quality is good. Supports Hdr and 4k videos. Tv has decent looks. Sound quality is OK. 3 years warranty is another attractive feature. Tv is fully android. Good\nValue for money. Happy with the product.",
            "Absolutely Stunning 😍 My Q led Quantum Dot Fantastic picture Quality LG Samsung won't come near to TCL thank you Flipkart Big Billion Stunning Deal Breaker 2021",
            "Writing this review after 5 months of usage.\n\n1.) 4K/UHD: well it really make a difference. Currently there is enough streeming content available by Netflix and Prime and watching true 4K content really brings out the best viewer experience from this TV. Even watching regularly 1080p content also good but hey I brought this because its 4K and it's worth the extra money over the standard FHD LEDs.\n\n2.) QLED vs OLED: Does this impact the contrast and colour depth? Yes and it does an amazing job. Compare this with any standard LED tv and you will feel the difference in the picture dept. A slight compromise if you compare the performance against a OLED but hey I have all my organs intact as I didn't have to sell any to bring home the QLED and I have no regrets.\n\n3.) The built in audio does a decent job. Plays most of the frequencies. But if you want a theatre like effect have a decent sound bar connected via ARC it's worth the investment.",
            "Excellent tv 3 yr warranty great sound SD channel upscale is average HD channel great",
            "I am writing this review after 2 weeks of usage. Clarity and sound is awesome. Unexpected. I would recommend this tv. Initially I faced a connectivity issue with inbuilt chromecast. But it works when I tried again. Didn’t see any negative. Also works well with x-box one.",
            "Picture quality is average, at every angle not like a qled tv. I think its panel is B grade. Picture settings needs very fine adjustment. Sound is average. HDMI arc port is not properly matching with sony home theater. Picture upscaling is also poor. So don't waste your hard earned money for such scrap tv. So don't buy TCL qled TV, rather go for 4K tv only if you want to purchase in this brand. However after installation I got two updates. Picture settings can be improved by software updates, hopes TCL fix this in future updates. If flipkart replace this tv with other brand without any money deduction then I will definitely prefer other brands. If I compare it with my earlier Vu premium Tv 50inch then in every angle Vu Tv is best.",
            "Hello all this is a really good TV\n1.Picture quality watching 4K on this tv is wow .. colors are wonderful blacks are deep, I watched Grand tour season 2, 1st episode in that they show super cars in Switzerland.. too good.\n2.sound I will not say it’s the best but enough\n3.android on the tv is good response is nice .. not the fastest but good enough I would say...\n4.only negative point is that the panel is bit reflective and brightness is 330nits so if you are watching a very dark movie which has lots of blacks then you have make sure the room is dark to enjoy the movie to the fullest ( dark curtains should do the job)\nOverall I think it’s value for money 👍👍",
            "So nice Dolby vision and Dolby Atmos I loved my tv it was fabulous and it has HDR 10+ and TCL TVs are better than Mi TVs\nThe sound can hear at my apartment basement it was litterally amazing thank you flipkart",
            "Super excellent nd marvelous TV. Connectivity of Wifi nd screen mirroring r so fast. Clarity is very very good. Delivery & Installation had no problem for me. Thank U for flipkart nd TCL for their services.",
            "Good",
            "Budget qled TV with lots of features.\n\nPicture quality is good. Supports Hdr and 4k videos. Tv has decent looks. Sound quality is OK. 3 years warranty is another attractive feature. Tv is fully android. Good\nValue for money. Happy with the product.",
            "Absolutely Stunning 😍 My Q led Quantum Dot Fantastic picture Quality LG Samsung won't come near to TCL thank you Flipkart Big Billion Stunning Deal Breaker 2021",
            "Writing this review after 5 months of usage.\n\n1.) 4K/UHD: well it really make a difference. Currently there is enough streeming content available by Netflix and Prime and watching true 4K content really brings out the best viewer experience from this TV. Even watching regularly 1080p content also good but hey I brought this because its 4K and it's worth the extra money over the standard FHD LEDs.\n\n2.) QLED vs OLED: Does this impact the contrast and colour depth? Yes and it does an amazing job. Compare this with any standard LED tv and you will feel the difference in the picture dept. A slight compromise if you compare the performance against a OLED but hey I have all my organs intact as I didn't have to sell any to bring home the QLED and I have no regrets.\n\n3.) The built in audio does a decent job. Plays most of the frequencies. But if you want a theatre like effect have a decent sound bar connected via ARC it's worth the investment.",
            "Excellent tv 3 yr warranty great sound SD channel upscale is average HD channel great",
            "I am writing this review after 2 weeks of usage. Clarity and sound is awesome. Unexpected. I would recommend this tv. Initially I faced a connectivity issue with inbuilt chromecast. But it works when I tried again. Didn’t see any negative. Also works well with x-box one.",
            "Picture quality is excellent, HDR10 + , Dolby vison is pleasant to watch. Dolby Atmos Sound quality is good. Don't expect Atmos 7.1.2 effect from this 30W speakers. DTS Tru surround supported is just average,\nTv remote with a dedicated Netflix only button. Far field voice assistant is a plus.",
            "I am very much Impressed with picture quality offered by TCL QLED ! Sound quality is decent too ... Fully featured remote would have made a lot of difference. However, overall happy with the purchase this technological advanced TV with voice command feature at such a low price as compere with other brands............😊",
            "Wonderful tv using it since 1 month every feature working Nice and perfect as shown in specs great Qled tv at low price..... Just Awesome Product....👌👌👌",
            "Very good product good picture quality , good sound, value for money\n\n\n\nBut side viewing angle just disappointed\nOther wise good",
            "The sound starts to distort at more than 25% volume. (Which can be managed by external speakers, cause it supports Dolby Atmos)\nBut the rest of the tv is awesome, the the picture quality is great, and movie watching experience is like theatre. And of these in a affordable price.",
            "Today first day awesome picture quality and sounds, worth of money, one doubt 3 yrs warranty, demo person said maximum 1 year online purchase, please clarification warranty. And how to extension warranty.",
            "Tv looks good and the performance also good. But the installation was unsatisfactory.",
            "The TV is fine. Even though it is a QLED we don't feel the picture quality is good especially when you are viewing regular 1080 HD content. We watched Australian Open tennis and there is some lag in movement. For regular movies it's fine.\n\nMy reason for 1 star is because of installation. The person came and installed ok. Didn't know much about voice commands, etc. which is ok. The part that pissed me off is that he asked for Inr 250 for installation and argued that it is not free. I gave him the money and sent him off. The next day I got a call from TCL to check if I can put a review on Flipkart and the person was like it will only take 30 seconds and can you do it now. I informed him that the installation person took 250 for installation which should be free but then the rep was like it is not installation charges, it is for wall mount. The funny part is the wall mount is provided with the TV itself and we are not even using as we are using table top stand. Even after i told him this he kept going about the charge being for stand and covering up for the installation person taking money.",
            "Initial impressions after two days usage :\n\nThis product is superb and fantastic. Very clear pic quality fast connection even on mobile Hotspot. Its runs smoothly not hanging after connecting Internet.\nI like this QLED.",
            "Impressed with picture quality offered by QLED ! Sound is decent too ... Fully featured remote would have made a lot of difference. However, overall happy with the purchase this techonolgical advanced machine at such a low price 😊",
            "After using 2 days I can say that it's worth.. picture and sound quality awesome and even your cell phone u can connect internet and it's running quite smooth.",
            "There is screen bleeding issue while booting up and in some apps. The picture quality is good, if you know how they adjust the setting. The sound is upto the mark. Happy with the picture quality now, but I am worried about the screen bleeding",
            "I got this product in big billion days offer, good picture quality and options are lovely, especially Google voice assistant is excellent..",
            "Although it's QLED but black levels are not up to the mark",
            "Worst experience of my life. With flipkart and TCL",
            "The picture quality is good. But the after sales support from tcl is pathetic. I have been waiting for service for last 6months.",
            "Picture good colour sound better concavity good",
            "Genuine, Original product.\nPacking was good and Safely dispatched.\nReached before estimated time and delivery was prompt.\nAll specs shown on flipkart are exact the same.\nProduct is worth the price.\nThanks Flipkart...",
            "Great tv at this price range",
            "Actual quality of pictures only possible, if you subscribe HD channels. Overall product is good.",
            "Best tv",
            "Price need to be reduced for 65inch tv bit higher",
            "Good one",
            "Overall tv is good but some of points dispointed.\n\nAndroid 9 somewhat lag compare to android 10\nAnd app loading very slow\nTCL said it is 2GB ram, but nowhere shown in the TV.so it might be not 2GB ram\nWe can't install other apps like going in Google play store.\nOnly predefined apps we can install.\n\nSometime I see black cloud fluctuations while playing or loading app.",
            "Worst. Within 6 months 2 times Display issue had come. Lines on the screen",
            "Excellent picture quality within 60k price range. Sound is decent. Delivery by ekart was pathetic and product handing was very bad.\nWarranty mentioned is not correct and I can see other online retailers are giving 3 years warranty( again this needs to be checked with TCL team)\nOverall satisfied with the product.",
            "Very good product\nThanks for Tcl & Flipkart.\n\n\nDesigned & Display is very nice.\n\n\nPlz added sum extra features for Remote or provide additional fully functioning remote.\n\n\nOverall qled tv is very good for this price.",
            "Before buying this TCL C715 I was thinking it will be a average deal but after receiving this TV I must say this is the best TV with all premium quality, it gives rich and premium look even the TV is off",
            "All over supper product",
            "Viewing angel worst. TV speaker quality too waste. Clarity wise ok. No lags and no hanging problem. UI super.",
            "TV is Too Good in this Price.\nSound is Very Nice and no need of Any External Speakers.\nComing to Picture quality some what I am disappointed here only.\nBut overall 4/5.",
            "Must buy\nVery good tv in this range compare to sony & samsung.",
            "Super TV i really love it ..😍",
            "Processing speed is not so great. Overall worth a good buy.",
            "Super",
            "Over all best",
            "Best tv loved it",
            "Good picture quality",
            "OK not bad",
            "It's a very good pictquality everything one I can say is best tv with our valuable money",
            "Good",
            "Wonderful wonderful product.. awesome quality",
            "Mind blowing purchase.I got this 56 thousand from Flipkart . Better viewing experience. Review after four months of purchase*****. Must buy",
            "Good in all aspects.",
            "Good",
            "Very good TV. With Cristal clear clarity.",
            "Excellent product\nPicture quality excellent\nSound effects excellent\nConnectivity quickly connect\n5/5",
            "After 10 days so far so good..Impressed with the picture quality and sound.",
            "Value for money...... 👍👍",
            "Good",
            "Good product from tcl",
            "very good performance. Don't go by negative reviews. I purchased it. You definitely enjoy the picture quality with the lowest cost which no brand can sell.",
            "Good quality\nSatisfaction",
            "Overall good TV",
            "Good",
            "Worth buying, Best value for money",
            "Quite good",
            "Great details.\nGood upscaling for low resolution.\nSpeakers are great.\nLoved this tv",
            "Really happy with the product!!!",
            "Excellent",
            "Value of money",
            "Super",
            "In this price range TV is Good...go for it....",
            "Product was Good. As expected from the TCL, nothing is less, Everything about this Tv is Awesome, Thank you Flipkart, Thankyou TCL",
            "Good serevice and good prodct👌",
            "The picture is not very sharp. Colour contrast is not soothing to eyes.\nOverall, an average product in this price.",
            "TCL TV Such great sound an picture quality in this price and also QLED technology",
            "Valuable purchase.",
            "Clear picture and clear sound",
            "Super",
            "The product is great.\nDisplay Quality, Sound Everything, Just one thing there is no option of Wireless casting of the laptop screen.",
            "Nice picture quality and sound.",
            "Asesome picture quality",
            "Nice",
            "Excellent Tv",
            "Happy",
            "Good product best value for money",
            "Nice 😊\nWorth for money\nCost is varied time to time wait for low price",
            "Very good👍",
            "Good product",
            "Ok",
            "Beautiful TV",
            "The tv is nice and good quality performance all nice",
            "Awesome Picture clearly"
        ],
        "likes": [
            "106",
            "97",
            "23",
            "29",
            "4",
            "23",
            "19",
            "14",
            "12",
            "7",
            "106",
            "97",
            "23",
            "29",
            "4",
            "23",
            "19",
            "14",
            "12",
            "7",
            "6",
            "1",
            "0",
            "0",
            "2",
            "2",
            "2",
            "3",
            "0",
            "4",
            "1",
            "10",
            "5",
            "7",
            "6",
            "6",
            "28",
            "3",
            "5",
            "6",
            "6",
            "4",
            "2",
            "2",
            "2",
            "1",
            "2",
            "2",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "51",
            "20",
            "7",
            "4",
            "0",
            "14",
            "6",
            "5",
            "10",
            "5",
            "51",
            "20",
            "7",
            "4",
            "0",
            "14",
            "6",
            "5",
            "10",
            "5",
            "6",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "1",
            "2",
            "0",
            "1",
            "0",
            "1",
            "1",
            "1",
            "19",
            "0",
            "1",
            "2",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:It's OLED or qled",
            "Q:It is Qled tv or led tv 50 inch",
            "Q:Is it support screen mirroring with apple phone ?",
            "Q:Is this qled tv? What is model number of this tv",
            "Q:Can we connect ps4",
            "Q:Screen mirroring with normal phone",
            "Q:This tv have magical remote are normal remote",
            "Q:Does it support prime video?",
            "Q:Handfree voice control yes na no",
            "Q:What s the Ram and storage",
            "Q:Warranty 1y or 3Yrs ?",
            "Q:Can I connect set up box",
            "Q:Paly free fire game",
            "Q:Does it support external hard drive 3.0",
            "Q:Mi 5x 50inch led vs and who is better tcl qled 50 inch difference and qled better ya mi 5x led",
            "Q:Does this support hdmi 2.1",
            "Q:TCL Qled 50 vs Blaupunkt 4k 50 vs mi 5x 4k better Tv option",
            "Q:Hdmi erc or hdmi arc",
            "Q:Does it have inbuilt chrome cast",
            "Q:Is Hotstar supported.?",
            "Q:Does it supports for ps5",
            "Q:MANUFACTURED YEAR FOR TCL C175",
            "Q:Is table mount stand available in the box",
            "Q:Can i use it as monitor",
            "Q:What are the apps that are available here",
            "Q:Does the touch screen also have a feature?",
            "Q:Ips display or va",
            "Q:Wats magical remote",
            "Q:Can I play mkv format videos??",
            "Q:It's Play Store app support",
            "Q:What is exact dimensions of this TV. You have mentioned only 1112mm & 79mm only. What is the 79mm?",
            "Q:Can we control tv without remote",
            "Q:Does it support micro dimming?",
            "Q:Wireless Android TV Gamepad",
            "Q:why there is not mention 'QLED'",
            "Q:What's the brightness of this panel?",
            "Q:How to connect soundbar and smart tv getting sound from both tv and soundbar how to make it happen",
            "Q:How much warranty or guarantee comes with this tv ?",
            "Q:This tv need voltage stabilizer",
            "Q:Some review said this is come with 3 years warrenty. Is it true?",
            "Q:Is there inbuilt Webcam with this model?",
            "Q:Does it has airplay?",
            "Q:Does this tv support dual band wifi",
            "Q:Can I connect with philips tower speakers without Bluetooth?",
            "Q:Is MEMC supported?",
            "Q:What is the Refresh Rate ?",
            "Q:What Hotkeys does it have on remote control of Tv?",
            "Q:Is chromecast supported?",
            "Q:Does it support Bluetooth? Version?",
            "Q:Please brief the product type?",
            "Q:Power consumption in standy-by mode?",
            "Q:Power Consumption when TV On ?",
            "Q:What is the audio power output?",
            "Q:Does it have camera?",
            "Q:Does it work with TCL app?",
            "Q:Can I connect it to any soundbars?",
            "Q:Can I use bluetooth home theater?",
            "Q:Can I set wirelees mouse and keyboard ?",
            "Q:What is the length of connecting cable?",
            "Q:Does this tv support 5ghz wifi?",
            "Q:Does it support Dolby audio ?",
            "Q:What internet speed is required to use all the features of tv ?",
            "Q:Does it support voice search?",
            "Q:What is the operating system?",
            "Q:How much is the RAM and storage on this tv?",
            "Q:Is it HDR10?",
            "Q:It's qled tv in 50 inch TCL",
            "Q:Can I connect my bluetooth hands free in this tv?",
            "Q:Will this tv upscale 1080 p or lower resolution to 4k?"
        ],
        "answers": [
            "A:It's QLED TV and one of the best TV I have seen",
            "A:QLED 50 inch",
            "A:Not supported",
            "A:50C715",
            "A:you can connect",
            "A:Yes, screen mirroring/casting possible through smartphone. You can also use TCL MagiConnect app to do screen casting.",
            "A:Magical",
            "A:yes",
            "A:yeah .we can use Google assistant without any remote by just saying ok Google....but I remote button isore accurate and fast as in my experience.",
            "A:2GB Ram and storage 16GB",
            "A:3years",
            "A:yes",
            "A:no",
            "A:No",
            "A:TCL C715",
            "A:yes",
            "A:I would suggest you to go for MI as TCL QLED has marginally better contrast but blacks are not great. MI has better service coverage and much smoother UI experience than TCL.",
            "A:Hdmi arc",
            "A:yes",
            "A:Yes, it support. you have to install them by play store.",
            "A:Of course, beat tv in the market go for it",
            "A:2020",
            "A:Yes, both wall-mount and table mount available inside the box.",
            "A:Yes you get HDMI and also you can connect wireless",
            "A:Netflix, prime etc. Lots of other apps are available in the play store for download.",
            "A:No",
            "A:It's va display",
            "A:It's bluetooth remote can be worked at any angle.",
            "A:yes. I'm playing through mx player in the tv.",
            "A:Yes.",
            "A:thickness",
            "A:Yes. Voice command option is there. also you can use remote app on mobile.",
            "A:It supports micro dimming",
            "A:Gamepad works on this tv",
            "A:QLED is the only in Samsung brand",
            "A:330 nits",
            "A:connect with optical fibre cable",
            "A:3 years",
            "A:No doesn't require a aditional voltage stabilizer as the TV contains in-built Stabilizer and it protects from low voltege , High voltage and from powercuts.",
            "A:If you buy online you will get only one year",
            "A:no",
            "A:no",
            "A:Yes, probably. But I connected the TV through wifi.",
            "A:You can connect through HDMI cable",
            "A:No",
            "A:60Hz",
            "A:Netflix and Settings",
            "A:Yes",
            "A:Bluetooth 5.0",
            "A:QLED UHD Android Smart DTV",
            "A:<0.5W",
            "A:230W",
            "A:2*15W",
            "A:No",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:max 5 meters",
            "A:Yes",
            "A:Yes",
            "A:5 to 10 mbps",
            "A:Yes, voice input via remote control. Hands-free voice input via built-in MIC.",
            "A:Android P, Certified by Google Android TV",
            "A:2GB�RAM�- 16GB ROM�",
            "A:Yes",
            "A:yes",
            "A:yes",
            "A:It upscales to 1080 as it is a qled tv."
        ],
        "likes": [
            "36",
            "11",
            "8",
            "3",
            "1",
            "1",
            "3",
            "3",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "20",
            "8",
            "11",
            "4",
            "1",
            "1",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "11",
            "6",
            "9",
            "1",
            "0",
            "0",
            "4",
            "1",
            "1",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "2",
            "3",
            "1",
            "4",
            "3",
            "8",
            "1",
            "1",
            "1",
            "13",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1"
        ]
    }
}