{
    "title": "LG All-in-One 108 cm (43 inch) Full HD LED Smart TV  (43LM5600PTC)",
    "product_specification": {
        "In The Box": "1 user manual, 1 warraty card, 1 remote control, 2 Batteries",
        "Model Name": "43LM5600PTC",
        "Display Size": "108 cm (43 inch)",
        "Screen Type": "LED",
        "HD Technology & Resolution": "Full HD, 1920 x 1080",
        "Series": "All-in-One",
        "Smart Tv": "Yes",
        "Motion Sensor": "No",
        "HDMI": "2 Side",
        "USB": "1 Side",
        "Built In Wi-Fi": "Yes",
        "Launch Year": "2019",
        "Wall Mount Included": "No",
        "Contrast Ratio": "10,000,000:1 (Dynamic)",
        "Panel Type": "IPS Panel",
        "LED Display Type": "Direct LED",
        "Refresh Rate": "50 Hz",
        "Number of Speakers": "2",
        "Speaker Output RMS": "20 W",
        "Ram Capacity": "1 GB",
        "Storage Memory": "4 GB",
        "Supported App - Netflix": "Yes",
        "Supported App - Youtube": "Yes",
        "Supported App - Disney+Hotstar": "Yes",
        "Supported App - Prime Video": "Yes",
        "Supported App - Others": "Prime Video, Google, AltBalaji, Zee5",
        "Operating System": "WebOS",
        "Screen Mirroring": "Yes",
        "3G Dongle Plug and Play": "Yes",
        "Ethernet (RJ45)": "1",
        "Other Internet Features": "Amazon prime, YouTube, AajTak,Netflix, Content store ,Internet browser, hotstar, Alt Balaji, Sun Nxt, Yupp TV,Google Movies",
        "Battery Type": "2 AAA Batteries",
        "Power Requirement": "AC 100 - 240 V, 50/60 Hz",
        "Power Consumption": "85 W, 0.5 W (Standby)",
        "Width x Height x Depth (without stand)": "97.7 cm x 57.5 cm x 8.08 cm",
        "Width x Height x Depth (with stand)": "61.5 cm x 18.7 cm",
        "Warranty Summary": "1 Year Comprehensive Warranty and Additional 1 Year Warranty is Applicable on Panel only. (Offer valid till 30 - April - 2022)",
        "Covered in Warranty": "Defect Arising Out of Faulty or Defective Material or Workmanship||Warranty of the Product is Limited to Manufacturing Defects Only||Applicable on Purchase of All Size 80cm (32) and Above TV Models Only||The Warranty Extension will be Done Basis the Date of Purchase & Offer Validity||Extended 1 Year Warranty Offer is Valid Till 31st Dec",
        "Not Covered in Warranty": "Warranty does not Cover Any External Accessories (Such as Battery, Cable, Carrying Bag), Damage Caused to the Product due to Improper Installation by Customer, Normal Wear and Tear to Magnetic Heads, Audio, Video, Laser Pick-ups and TV Picture Tubes, Panel, Damages Caused to the Product by Accident, Lightening, Ingress of Water, Fire, Dropping or Excessive Shock, Any Damage Caused due to Tampering of the Product by An Unauthorised Agent, Liability for Loss of Data, Recorded Images or Business Opportunity Loss",
        "Warranty Service Type": "On-site",
        "Installation & Demo Details": "We'll facilitate the installation and demo through authorized service engineer . The service engineer will install your new TV, either on wall mount or on table top. Installation and demo are provided free of cost. The engineer will also help you understand your new TV's features. The process generally covers: Wall-mounted or table-top installation, as requested. Physical check of all ports, including power and USB ports. Accessories also checked. Demonstration of features and settings Quick run-through on how to operate the TV"
    },
    "product_description": {
        "Dynamic Color Enhancer": "This Full HD LED Smart TV features an image processor that adjusts the colour of your content to deliver rich and natural-looking images.",
        "Wide Viewing Angle": "The 108 cm (43) display of this LG TV will leave you enthralled with the realism it delivers. The colour reproduction, which is almost 100% accurate, can be enjoyed from all angles.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "2",
            "5",
            "5",
            "5",
            "5",
            "1",
            "2",
            "5",
            "5",
            "1",
            "5",
            "4",
            "3",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "1",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "4",
            "4",
            "1",
            "3",
            "5",
            "5",
            "5",
            "5",
            "3",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "2",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "3",
            "3",
            "5",
            "3",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "3",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "4",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "2",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "3",
            "4",
            "4",
            "4",
            "5",
            "3",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "1",
            "4",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "2",
            "5",
            "5",
            "5",
            "1",
            "3",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "4",
            "3",
            "3",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "3",
            "4",
            "3",
            "3",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "4",
            "3",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "4",
            "1",
            "4",
            "5",
            "4",
            "5",
            "2",
            "5",
            "5",
            "4",
            "3",
            "5",
            "4",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "3",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5"
        ],
        "review": [
            "TV is awesome and desire for a needful customer which demand in TV\nand I am happy to see audio jack its amazing to connect home Theatre enjoy movies and vedio songs",
            "Bought this LG 43 inch LET TV for my home. Without waiting for installation I opened the pack and completed the installation myself. I have connected my Dish TV set top box through HDMI. I was also able to set up my Prime TV account and watched a prime video. My initial opinion about the TV is that it is excellent. My top priority was picture quality. I am fully satisfied by the TVs picture quality, particularly the Animal planet HD channel. Even the SD channels are not bad. Regarding sound quality, I actually had no interest in knowing the TVs sound quality since I decided to connect my sound system with it. But the sound quality of the TV is not bad. It is not very effective but enough for normal watching. I am also happy that I have received a fresh product manufactured recently. The delivery was prompt. I am glad that after all the research and analysis I have bought a reputed brand TV at a nominal price with no cost EMI. It is impossible to buy a LG or Samsung TV at this price at the local market.",
            "Display quality is best and sound is best , connectivity is also best awesome tv at this price😊",
            "Received this TV with one day of placing order kudos to Flipkart for keeping their comment always. Moreover, Installation done on same day. LG Installation guy was superb he did wall mounted while my mother/father in law had no idea how TV will fit in that particular position. Thanks to LG representative Sh. Ranjan for his great support. Normally I am not prefer UHD and 4K combination to buy as both the option are futuristic, has no value as of now. Full HD with smart/android option is more than sufficient to cater all our regular requirements. I gone through several low budget option TV since last 3 months to choose from, finally convinced that either that does not have major streaming option i.e. NETFLIX and PRIME or Picture quality not delivered what they are committing. Moreover, Picture quality is not at per in comparison with Majore 3 brands i.e. Sony, Samsung and LG. Out of which I choose LG as this is more cost effective. However, LG's new vervision i.e. AI TV has 1 significant change i.e. voice control. For that, paying high price is unjustified according to me. I gone through almost entire review posted in Flipkart. I surprised to see that connectivity has very low rating, believe me I found the same as flawless. For new buyers understanding I want to mention that I do have SONY 55inch 3D Android TV, Samsung 55inch Smart TV, LG 43inch FHD 3D TV. In comparison to these TV's I found this is ready good TV at budget price. Picture quality is stunning, Voice is sufficient as it support DTS, attachment of home theater would be awesome. Hence, I highly recommending to buy this TV.",
            "BEST IN BUDGET\n\nIn this price this is best deal, color look different than va panel but its ok..no branded manufacturers giving 43 inch tv in this Price , Upscalinng of sd channel is better than vu, mi tv. Sound is good . Hdr mode is terrific..full hd videos are awesome deep colors, less contrast than samsung tv but this is ok. Highly recommend for big tv lovers.",
            "Best IPS LED Display with FHD Resolution.\nSound output is too good.\n1) The general settings is popup bit slower after updating my WebOs to 4.7\n2) In description 2 unit remote is mentioned but magic remote is not there . Major disappointment.\n3) lg tv plus app is also not easy to connect. Which can be used like magic remote.\nSo these 3 things are big disappointing, so i have given 4 star for the product.",
            "I am writing this review after using for 7 days. Best LED TV with IPS Panel in this range. Colours are really good ad sound is also sufficient for a medium size room. Smart features including all the apps like Prime, Netflix, hotstar and Zee5 works like a charm. I would recommend to go for this TV without second thought. LG brand is always trustworthy since I had my first CRT TV of LG brand. You might feel hesitate to spend few extra thousands when compare to chinese companies like Realme, MI etc but there is no comparison of Lg with these chinese brands. Customer support and installation was smooth including Wall mount( free of cost). I am very happy with my decision.",
            "Pros :\n1. Good picture quality even with SD set top box\n2. Good sound clarity\n3. Connectivity is good\n\nCons :\n1. No magic remote as it is 2019 model so very difficult to type and search\n2. Bass is less and so music lovers please don't go for it\n3. LG technicians don't know about the product, we need to learn to use it of our own\n4. If this tv is used with sundirect dth, if you increase/ decrease tv volume, dth channel will Change. LG technician says it a known issue\n\nOverall, good product at this price range from one of the leading manufacturer.\n\nIn my view, visited retail shops and reviewed MI, panasonic, Sony tvs and LG wins the race with cost and picture/sound quality overall",
            "I brought 43inch led TV at great price of 27,999 . Awesome picture quality and sound is outstanding . Gives best output of sound and picture in HD and Full HD mode. Service engineer was friendly and good in behavior, he did a nice work immediately within 24 hour after receiving the TV. Hence, I am going to rate it 5/5.\nGuys go for it its a best option.",
            "Lets talk about delivery..\nFlipkart takes 7 days to deliver the product to my pincode.\nInstallation is done very next day after delivery.\nProduct after 1 month use\nPros\n1. Best in class Display.\n2. Dolby Atmos support for sound.\n3. Build Quality is way better than other Chinese brand.\n3. Seamless connectivity.\n4. Supports smart device\n\nCons\n1. No bluetooth support.\n2. Doesn't have smart Remote.\n\nOverall a value for money product. And Yes brand value matters when come to parents point of view.",
            "TV is awesome and desire for a needful customer which demand in TV\nand I am happy to see audio jack its amazing to connect home Theatre enjoy movies and vedio songs",
            "Bought this LG 43 inch LET TV for my home. Without waiting for installation I opened the pack and completed the installation myself. I have connected my Dish TV set top box through HDMI. I was also able to set up my Prime TV account and watched a prime video. My initial opinion about the TV is that it is excellent. My top priority was picture quality. I am fully satisfied by the TVs picture quality, particularly the Animal planet HD channel. Even the SD channels are not bad. Regarding sound quality, I actually had no interest in knowing the TVs sound quality since I decided to connect my sound system with it. But the sound quality of the TV is not bad. It is not very effective but enough for normal watching. I am also happy that I have received a fresh product manufactured recently. The delivery was prompt. I am glad that after all the research and analysis I have bought a reputed brand TV at a nominal price with no cost EMI. It is impossible to buy a LG or Samsung TV at this price at the local market.",
            "Display quality is best and sound is best , connectivity is also best awesome tv at this price😊",
            "Received this TV with one day of placing order kudos to Flipkart for keeping their comment always. Moreover, Installation done on same day. LG Installation guy was superb he did wall mounted while my mother/father in law had no idea how TV will fit in that particular position. Thanks to LG representative Sh. Ranjan for his great support. Normally I am not prefer UHD and 4K combination to buy as both the option are futuristic, has no value as of now. Full HD with smart/android option is more than sufficient to cater all our regular requirements. I gone through several low budget option TV since last 3 months to choose from, finally convinced that either that does not have major streaming option i.e. NETFLIX and PRIME or Picture quality not delivered what they are committing. Moreover, Picture quality is not at per in comparison with Majore 3 brands i.e. Sony, Samsung and LG. Out of which I choose LG as this is more cost effective. However, LG's new vervision i.e. AI TV has 1 significant change i.e. voice control. For that, paying high price is unjustified according to me. I gone through almost entire review posted in Flipkart. I surprised to see that connectivity has very low rating, believe me I found the same as flawless. For new buyers understanding I want to mention that I do have SONY 55inch 3D Android TV, Samsung 55inch Smart TV, LG 43inch FHD 3D TV. In comparison to these TV's I found this is ready good TV at budget price. Picture quality is stunning, Voice is sufficient as it support DTS, attachment of home theater would be awesome. Hence, I highly recommending to buy this TV.",
            "BEST IN BUDGET\n\nIn this price this is best deal, color look different than va panel but its ok..no branded manufacturers giving 43 inch tv in this Price , Upscalinng of sd channel is better than vu, mi tv. Sound is good . Hdr mode is terrific..full hd videos are awesome deep colors, less contrast than samsung tv but this is ok. Highly recommend for big tv lovers.",
            "Best IPS LED Display with FHD Resolution.\nSound output is too good.\n1) The general settings is popup bit slower after updating my WebOs to 4.7\n2) In description 2 unit remote is mentioned but magic remote is not there . Major disappointment.\n3) lg tv plus app is also not easy to connect. Which can be used like magic remote.\nSo these 3 things are big disappointing, so i have given 4 star for the product.",
            "I am writing this review after using for 7 days. Best LED TV with IPS Panel in this range. Colours are really good ad sound is also sufficient for a medium size room. Smart features including all the apps like Prime, Netflix, hotstar and Zee5 works like a charm. I would recommend to go for this TV without second thought. LG brand is always trustworthy since I had my first CRT TV of LG brand. You might feel hesitate to spend few extra thousands when compare to chinese companies like Realme, MI etc but there is no comparison of Lg with these chinese brands. Customer support and installation was smooth including Wall mount( free of cost). I am very happy with my decision.",
            "Pros :\n1. Good picture quality even with SD set top box\n2. Good sound clarity\n3. Connectivity is good\n\nCons :\n1. No magic remote as it is 2019 model so very difficult to type and search\n2. Bass is less and so music lovers please don't go for it\n3. LG technicians don't know about the product, we need to learn to use it of our own\n4. If this tv is used with sundirect dth, if you increase/ decrease tv volume, dth channel will Change. LG technician says it a known issue\n\nOverall, good product at this price range from one of the leading manufacturer.\n\nIn my view, visited retail shops and reviewed MI, panasonic, Sony tvs and LG wins the race with cost and picture/sound quality overall",
            "I brought 43inch led TV at great price of 27,999 . Awesome picture quality and sound is outstanding . Gives best output of sound and picture in HD and Full HD mode. Service engineer was friendly and good in behavior, he did a nice work immediately within 24 hour after receiving the TV. Hence, I am going to rate it 5/5.\nGuys go for it its a best option.",
            "Lets talk about delivery..\nFlipkart takes 7 days to deliver the product to my pincode.\nInstallation is done very next day after delivery.\nProduct after 1 month use\nPros\n1. Best in class Display.\n2. Dolby Atmos support for sound.\n3. Build Quality is way better than other Chinese brand.\n3. Seamless connectivity.\n4. Supports smart device\n\nCons\n1. No bluetooth support.\n2. Doesn't have smart Remote.\n\nOverall a value for money product. And Yes brand value matters when come to parents point of v...\nREAD MORE",
            "TV reached on time as promised by flipkart and they arranged next day installation thru LG. Internet connectivity is quite good and my son is enjoying watching his favorite cartoons on it.\nGood decision to buy this TV. Thank you Flipkart and LG.",
            "The TV is good for average users. Connectivity is good. Sound is decent and clear for normal use. Installation was also done within 2 days of delivery. Value for money product.",
            "Exelent product nice picture quality great sound, screen cast, internet connectivity overall best smart tv in this price",
            "Tv is so good at this price point. Everything is perfect about the tv. The only thing missing on this tv is Bluetooth although it is a perfect piece of technology.",
            "very nice TV I bought it on diwali time and I'm writing this review on new years2020 Jan ,\n* it is good , it's sound is very loud with bass and all ,\n* my home theatre got less than the TV\n* picture quality is also nice ,\n* connectivity is awesome\n* installation guy was very nice does all his work, explained every thing in detail about the TV ,\n* delivery was very early\n* I think this is best smart TV in this range , love it",
            "I bought the 43in TV and it's awesome. The panel is amazing and they are giving 2 years warranty for it. Sound is good but not great. For the price it's the best you can buy. The UI is not very smooth but it's not that bothering since it's a tv and not a smart phone. The remote is very plasticy and looks cheap.. even my 8 year old 26in LG led TV has a better remote. But again for the price i can't ask more. Thanks LG",
            "Nice tv.. connectivity is good as of now... It's working normally as they said.. sound and picture quality is also good.. worth tv for this range.",
            "Good tv liked it.\nPicture quality is not as expected its little yellowish appearances.\nSound is awesome when i set it to dolby.\nConnectivity is good via app but directly when connect to miracast or else\nU cant see the 4k videos on it nor slow mo\nOverall it is good services of LG are good.",
            "The product is good. But when we speak in terms of picture quality and sound, connectivity is average. Delivery by Flipkart was on time. but the person who came for installation was not that experienced to guide how to connect tv with set top box.. instead he told us to read the manual to connect..it looked like he was in hurry and not willing to help.",
            "Very bright and clear display...sound quality also good as well as connectivity... Good customer and delivery service from Flipkart...thank u😊",
            "Just yesterday(03.03.2020) I received this TV. It is Excellent, sound quality is too good.Picture quality is fantastic.I am too much satisfied with this TV.Thanks LG & Flipkart for this wonderful product.\nYesterday night The Installation guy was came and installed my TV. He behavior is too good and most helpful person for me.\nEverything is so good. Thanks Flipkart.",
            "It's been a week I took this and Im happy that it is worth of money and it's a budget friendly smart TV one can find",
            "Nice product ... have almost all the basic features which is useful in daily life... sound quality is good",
            "Good to buy for the budget of 27k it's worth for money, one thing unsatisfied is no proper installation allocation service from LG it takes more than 3-4days for demo and the installation.",
            "An excellent product,no 2nd thought pls go a head , installed also the same day when I got the tv, technician is very friendly n helped .",
            "Wonderful product for this price. Nice and quality video and sound. And installation also was good on timely manner.",
            "Very good TV with best price. Nice picture and sound. It's webOS is also competitive to firestick, it's even faster. Till now most apps available. Would say all in all a value for money product. Definitely go for it.",
            "good TV and quick delivery .but TV remote is normal. smart TV but remote normal.please send magic remote LG All-in-one 108cm(43 inch) Full HD LED....",
            "Awesome and Excellent Product. Iam really satisfied to this worth of an item.",
            "Worst experience with lg\n\nProblem with installation boy his behavior is completely rude and speaking way is like a roudy .......( Sir will come when I want if u want the installation wait or else cancel ur order)....this is the words from the lg installation boy......",
            "First of all...Service from FK was top notch as usual. Initially, Installation was bumpy but LG CC was helpful.\nConsidering the price, Picture quality is Average with STB, but Good with online streaming like Youtube, Prime etc. Viewing Angle is not impressive, Contrast and Color distortion observed from different viewing angles.\nSound is above average, loud enough.\nDrawback is the Connectivity. Bluetooth not found. Typing with remote is a cumbersome job. Connecting with Mobile Phones are a hassle, hit or miss type. Somewhat consistent while connecting with Laptop.\nOverall satisfied. Still evaluating. Let's see, how long it runs.",
            "great TV , go for it, excellent LG service",
            "superb picture Quality. very nice. Sound system very nice. I loved this product.",
            "Great picture quality. Superfast installation although delivery was a bit slow but anyways fully satisfied with the product. So far so good.",
            "Awesome tv this one is good value for money",
            "Instalaton stil not complete",
            "Good picture with expected sound",
            "Awesome tv.dont go for mi, or any Chinese makes.though cheap but worthless picture quality",
            "It has no Bluetooth hence you can't connect Bluetooth Speaker and you Cannot use Magic Remote. Please think before buying. If you don't want this feature then overall good product.",
            "Bad experience!! I received lg 43 TV on 18th of June 2020 but still no person has been sent for installation.",
            "This tv is completely worth the price and can't think of any of the flaws in the set though this is just third day of use, will update if something comes out till then it's the best in 39-43 inch segment, some issues about magic remote as some of the reviewers mentioned believe me it won't be an issue. If you guys looking for purchase in this range, go.for.it and you will never be disappointed.",
            "V good",
            "Value for money",
            "Excellent ...\nWorth the money",
            "Picture quality is worst of all time. Images are blurr. Can not identify the faces easily. Product is stated to be full HD. But, it's no where near LCD also. Did not expect this bad picture quality from LG. I have a ten year old LG 14\" flat TV which has better picture quality.",
            "Very bad. Installation date was given as 14th october and nw its 17th october. Still no confirmation on when the executive will arrive. How will we know if this is a genuine product if u cannot send the executive before return period? Customer care also does not have the right answers. Didnt expect this from flipkart",
            "All Good and best TV ever I'm fan of all LG Products and I know what is LG. But Tv installation and service is very poor.",
            "LG Brand is Supper...\nGreat Quality, sound and for internet connectivity",
            "Everyone one in flipkart is chor so guys don't buy anything from flipkart I suggest to buy from any other shopping site..",
            "Fully satisfied...\nEvery thing is perfect sound quality and picture quality..\nLooking wise is also good.. 👌\nHappy to receive this LED.. 😊\nThanku filpkart😊",
            "Sound is good",
            "Picture quality is average. Not too good",
            "Nice tv and picture quality is very best and cast screen is good,😁😃😃😃",
            "Good picture quality",
            "Everything is cool. But it's not slim TV..",
            "Good",
            "Audio quality next level.... Picture quality fabulous... bezel very small...4k quality gorgeous....",
            "Magic remote not available. Speed delivery and installed good.",
            "Nice tv and on time installation by LG.",
            "Very nice product\nlove it 😘😘\nWorth of money",
            "Superb picture and clarity, sound okay.\nWeightless...\noverall Worth to Purchase",
            "Product is good. Sound quality met the expectation. Installation guy was also polite. U can't doubt on LG product. So go for it. It's value for money. I'll give the review after using 6 month again.",
            "It doesn't have bluetooth connection as shown in the product details.",
            "Installation team is very bad not come in given time period",
            "It's amazing product thanks so much fipkart value for money so thanks",
            "Fantabulous product and delivery got it for 29k\nInstallation and Demo was also execellent\n\nValue for money",
            "No magic remote ,only one usb\nInstallation and demo is super",
            "Good tv., Value for maney.\nGood quality\nGood sound\nExcellent picture quality\nOverall 9/10",
            "Awesome service by LG installation engineer\nAnd also LG Led tv product awesome. 5 star service\n\nThanks\nLG team and Flipkart",
            "Nice quality LG. Delivery was on time.\nTook so long for installation.",
            "I have purchased it for 26000.... Satisfactory Installation..... Picture, Sound, Connectivity Quality is better than same Price range TV",
            "Picture quality is not good. Connectivity is good. Sound quality is average.",
            "the sound is really good in this TV. rest is all fine",
            "at very cheap rate comparing to shops nyc led",
            "tv is excellent 3 star bcoz installation was late with no demo",
            "Demo and instalation good picture and sound quality good",
            "Awesome",
            "Audio quality is superb... I give 5 rating",
            "picture quality is good.\nSound is okay with inbuilt speaker\nexcellent when connected to home theater\nconnectivity is also good compared to other tv\n100% value for money",
            "not properly handled in transportation.",
            "bluetooth function not available and no magic remote ,",
            "Good for LG",
            "I'm very disappointed about the products when I receive this..\nThis is really very horrible..\nI suggested to all customers plss do ensure when ur products arrives.... 😠😠😠😠😠",
            "Excellent picture quality and sound, i am so glad.",
            "Really nice product. Lg has done nice work with webOs. Do feel the sound is little less. But 20w is sufficient for normal usecase. The price is higher than what I purchased for.",
            "good quality, fast delivery and installation.",
            "Good",
            "Good product, awesome",
            "Loved it.....perfection in quality sound and connectivity......must buy...",
            "Good",
            "Nice product clearty is good sound quality is too good with dolby system",
            "Great,, wants 3 hdmi minimum",
            "I m very happy with this product ❤❤",
            "TV is ok. User interface is difficult to use.\nOne issue I see that the wall mount is not there in box and not mentioned while order that we are getting from LG or not so I had ordered 845 Rs wall mount but on installetion day LG person came with there own wall mount free of cost and installed it. Due to this my purchased 845 Rs amount gone in drain. Ideally LG should clarify in contents at all we are getting when we are buying TV. This will save customer money for buying accessories which already getting LG also.",
            "I m happy and loved this Smart LED.",
            "Superb...🤩",
            "I'm happy",
            "Very good TV for it's price Range\nDelivery was super fast,was delivered in less than half a day\nClarity is good\nSound quality is awesome\nSmart TV with all apps for online viewing\n\nRemote could have been better with voice search\nDefinitely worth a buy !",
            "Good product from lg at best price",
            "Overall it was so good and also fast installation by the team. Worth for money.",
            "Superrr Picture Quality",
            "Good one but it does not have in built bluetooth",
            "Quality is really good. I like this product and & Flipkar services.",
            "Filp cart service is good.best offer price.product also good.tq",
            "Just go for it! (Model LG43LM5600 PTC) Picture quality is great and sound is superb! Even with SD channels it delivers best picture and in HD it is superb!Connectivity is smooth! Dont think about any negative review , this is best budget tv with lot of facilities. Thanks to Flipkart. Delivery is on time and safe secure. Installation by LG is without any hassale. Guys are humble and they have done their work like experts!! The brand is big and they makes life good really!☺",
            "Satisfied",
            "Full HD. Full Enjoy",
            "Nice product",
            "Good",
            "The TV works excellent. I couldn't have asked for a better deal. Packaging, shipment, and installation have been seamless.",
            "LG is well known brand for the quality and service. Installation call with in the 2days, I was out of station and many call I got from the installation boy, it is good, person behaviour and services was good. This TV have a 2star rating and model is 2019. I buy this TV during BBD in the offer price and found to me beneficial. Connecting with mobile.",
            "Good performance good quality sound and picture",
            "Good audio clarity... Good tv... Video is not that much good, but worthy for this price... Good service",
            "Good product, value for money, not happy with sound output, overall ok",
            "Good product",
            "Wow",
            "Nice",
            "Owsm picture quality ...value for money .",
            "Bad picture quality. Damage t. V",
            "Good",
            "Using from 8 months....not facing any problems......nice product at this price....",
            "Superb",
            "Good quality of product and service from LG",
            "Worth buying",
            "Good buy ..only flip side is u won't get many apps..only the apps built for lg os works...browse is bad..the typing system on remote is bad..unless u can use Alexa...u will struggle to type...overall at this price a decent buy...u could opt for Samsung or Micromax (55 inches) if you are apps and game frenzy",
            "Good",
            "Good product",
            "I bought it for 27500 was a good deal for me really very nice tv just go for it without any hesitation",
            "Amazing tv awesome sound all over a good TV but blootooth is missing",
            "Nice Product",
            "Good",
            "Product is good. Installation was done satisfactorily on the next day. Customer care response is satisfactory. Thanx LG.",
            "Its really Best to buy .. happy With LG\nSound super\nPicture Quality also Good",
            "Overall very good product.\nIt would have been awesome if it had smart remote and bluetooth connectivity.",
            "Good",
            "No google voice association future so i am disappointed",
            "Great product with great price.",
            "Very nice",
            "Value for money go for it\nPicture quality very good\nSound quality not good",
            "Good",
            "Overall product is very nice but boot is very slow it hangs many tes",
            "Awosme product but tv remote was simple",
            "Nice",
            "Good",
            "Good product at reasonable price",
            "u should go for it .... absolutely great and affordable!",
            "Good TV",
            "Got the TV on time and installation done next day...Good service by both Flipkart and LG.\n\nTV is over all Good and value for Money.",
            "Go for it",
            "Nice tv",
            "Goood",
            "Good picture quality....\nNo issue and compromise in quality\nFirstly i am confused for buying because other brand like mi,realme etc was cheaper than lg almost 4-5k but lg give very good quality",
            "Value for money. Got what I expected. LG has always a strong brand in TV.",
            "awesome",
            "Everything is superb.",
            "Its Amazing TV By Lg.i m Loving it👼",
            "Super",
            "Its good",
            "Satisfied with overall image quality",
            "Quite a decent smart television.. Would have been a better search option if Voice search was also there.",
            "Mind blowing led",
            "Sounds good, quality is good awsome tv",
            "Good ok super",
            "Only energy rating is not good and consumes more power..execpt that TC is good",
            "Lg company is better than all.it is perfect sounding and picture is nice.",
            "after 2 mnths of use , i dont have any concerns ,\n\nthere was no magic remote provided so it was bit difficult opertate tv with our magic remote",
            "Excellent quality great TV",
            "Nice product I m very proud to flip cart installed my TV as same day of delivery . Thanks for your good co operation",
            "Good but installation process too late",
            "Very good tv at this price.good sound good picture quality. I m satisfied with this tv. 💥💥💥💥💥",
            "Best one",
            "Very good..",
            "Awesome",
            "Nice product",
            "Stunning purchase ....Thank u Flipkart for fastest delivery.",
            "Its good",
            "Good quality and installation is very fast",
            "Suprbb",
            "Very good",
            "Good quality. So far soo good",
            "The picture quality us fine however the sound is not so bold and feels lighter.",
            "Picture quality is so Good but sound and connectivity is average",
            "I can only say just wow",
            "Good product value for money",
            "Good product thanks flifcart",
            "Great Smart Tv. Overall happy.",
            "Good Product, but only 2 Star Power Saving",
            "Product is good. But, Flipkart Service & Response is too worst when compared with competitors.",
            "Review after using 30days\npicture quality excellent 5/5\nsound - good quality 4/5\nconnectivity - 3/5\nonly 1 usb 2 hdmi which are loose\nsuddenly losing connection while watching dish tv\nvalue for money - 4/5",
            "Gd product",
            "Over all good product as compared to chainees product. You can go for it.",
            "Thanks flipkart nice product",
            "Good",
            "Very good TV, great picture quality.\nConnectivity is also good provided that your network connection is good.lots of options to go number of platforms like prime video, netflex, hotstar etc easily with home button on remote.\nCast function is also good and fast my mobile connecting very easily to this TV",
            "Very good",
            "Very good 👍 tv",
            "Good product",
            "Value for money",
            "Supper",
            "Nice TV. Satisfied with quality and satisfied with price 😊. Nice choice to me",
            "The product is very good",
            "Ordered the 43 inch Smart TV at 28000/- with 2 years extended warranty. Product installation and delivery just in tima and within 2-3 days. I am happy with this purchase and would like to recommend also.",
            "Brilliant display.\nI played a 4k video from you tube and was amazed by the quality.\nPlayed songs from spotify and sound was like a music system.\nIt didn't read the pen drive, that was strange.\nAbsolutely loved it.",
            "Tv is good .Sound and picture quality also good but While connect with net evey time ask password",
            "Good",
            "After evaluating all the options I preferred to go with this tv from LG. I have used it for 3 days now and can say that it is a very good tv specially for this price. The best part is the picture quality.",
            "Good",
            "Awsumm product\nReally enjoyed shopping from Flipkart, LG and Bajaj finserv",
            "Best tv in this budget segment👌👌👌👌",
            "It is LG No doubt very awesome....Thanks flipkart and LG. You have given Nice product and memory for life.. Keep it up with all such products...",
            "Good Product",
            "Good quality",
            "Its ok",
            "One day delivery, installed very next day by lg. Upgraded from Bravia 32inch, nothing to complain about picture quality, sound is loud and clear, vocals are clearly audible, web os is good. Overall a great product",
            "Good , but the processing cycle is slow & sometime it hangs also\nYou should go for any other OS",
            "Excellent",
            "its awasome",
            "Gyd",
            "Great",
            "Thank you so much 👍\nSo beautiful 👍\nVery good 👌",
            "Picture quality good. Sound quality is ok coz speaker is down firing type you have to use sound bar for better experience. For connectivity no bluetooth you have to use aux/hdmi port.\nSystem is slow.",
            "Complety satisfied sound, colours all thums up...",
            "Nice tv.. love it ♥️",
            "Best product at this price however sound quality not that good.",
            "Good sound,good picture quality",
            "Very good at low price. I loved it.",
            "Good one, prompt delivery without any hassle.. picture quality is good and also no issues with connectivity.",
            "Lg s always gud.. go for it blindly.. avoid china brands. Thanks",
            "Good packaging and on time delivery in lockdown situation. Very happy with Flipkart services and customer care, very polite and very kind. TV is also good in this price and kind of LG brand.",
            "Very nice TV from the LG products",
            "Fantastic experience ever",
            "Gr8 purchase.\nYou need to enter your wifi password every time while connecting.\nNo smart remote.",
            "Fast delivery, installation on time, over all\nGood.",
            "It’s just a value for money in this budget.",
            "All good but price fluctuation in flipkart is pathetic....i feel of boycotting flipkart now...",
            "Good",
            "Product is good, but installation took 18 days after delivery 😣,\n\nDisplay picture quality is good, for dish tv channels 10 to 15 points of sound is more than enough, but for ott apps sound should be at 30 to 45, again for ott apps sound become to much during action scenes and high base back ground music.\n\nConnects to wifi automatically.\n\nI am using 4tb hard disk to watch movies with out any issues.\n\nSide viewing angles are good, but if there is any window straight to tv and curtains are open than side viewing angles are not great due to light reflection.\n\nI am unable to install any video player from lg content store, so just using inbuilt player to play video from usb storage device.",
            "Very nice product",
            "Superb, brand is brand LG",
            "Picture quality was too good, best TV at this price",
            "Good product, excellent, value of money",
            "Eexcellent",
            "Lg tv is very nice product in reasnable rate.",
            "Top sound and picture quality.\nWorth buy mi nd other brand does not stand in terms of picture quality",
            "Thanks to Flipkart for the timely delivery and same day installation, regarding the product the picture quality is awesome only negative is the sound quality is not up to the mark, but music buff's can always have a home theater system installed.hats of to Flipkart for there services.",
            "It's a great product",
            "Clarity mast",
            "First I bought lg32 inch but not perfect now I bought lg 42 inch it is wonderful tv exllent super 👌👌👌👌",
            "Good product",
            "Excellent",
            "Very she installation engineer engineer mobile number please today installation date 22 not come my TV is not opening please call anybody engineer",
            "Pictures and sounds not matching as for expectations",
            "V nice...awesomw",
            "Excellent Product",
            "Best tv in 30k",
            "This product picture quality is good is a good product",
            "Value for money best tv good.",
            "Excellent product from lg at that price. Good Service and quality brought me here",
            "Good quality product value for money",
            "I am using this product which is very best.",
            "Nice deal",
            "Return delivery delayed. but product is good. And flipkart service also good",
            "Love it",
            "Product is really good\nDelivery and installation was done on time , but delivery guy took money for service since it was written free demo but he took money\nOverall tv is really good",
            "Next level..\nIn Display viewing Experience\nSuperb",
            "Over all a good tv at this budget!! If u are looking for a TV for long run just go for it!!",
            "This product is worth of money in aspect of mid range TV.\n\nThere is no connectivity issue so far for mobile broadcast/HDMI connection to laptop.\nPicture quality is cristal clear.\nSound quality is 20w which enough. And clearly audible even if you place the tv in hall .",
            "Good",
            "Awsm product in 24500/ only",
            "Excellent",
            "its very nice tv. good service by flipkart",
            "Excellent led tv good sound best picture quality..",
            "Value for money. Specially brand. Everything done on timely basis. Just loved the tv but missing Magic remote though",
            "Nice Led Tv",
            "Picture quality is good but sound is average , installation is not proper right direction",
            "EXCELLENT",
            "Fabulous quality 👌.... loved this product",
            "Very nice",
            "Super good",
            "Nice",
            "Value for money. Best sound experience and picture quality. Light weight and thin. Supports Dolby.",
            "Super",
            "Great Picture Quality, Good Sound output, great viewing angels with good connectivity.",
            "Value for money.. recommend to buy",
            "Picture quality and sound is very good very nice TV in this budjet",
            "The screen to body ratio is exceptional\nBlack is as deep as you'll get\nWebOS is really smooth\nInterface is very simple and user friendly\nScreen modes and sound modes are upto the mark\nBest available branded TV in this price range.\nGo for it!",
            "Good product 👌",
            "Value for money,every thing is perfect.Instalation also done within 2 days.",
            "I will give five star because I received TV before time and installation was done the very next day. Fully satisfied 😍😍",
            "Great feel at an affordable price.. thanks flipkart..",
            "Gud product",
            "Display Damaged within 6 months. Picture Quality also not that great. And poor in sound and connectivity",
            "I purchased this product 25000/- its better in this price. High performance with wifi. Totally reliable product.",
            "Amazing picture quality...",
            "tv was too good. Value for many and connectivity is too good",
            "Very nice product",
            "Worth buying TV in this price",
            "The display of TV was awesome..\nTo watch YouTube, Netflix or anything else you need a stable internet connection. Consumes high data.\n\nDisappointed with the installation guy.\nAsked extra bribe.",
            "Excellent....",
            "Very good smart tv and value for money.\ndisplay quality is very good. but one cons is that it doesn't have Bluetooth connectivity.",
            "There is sound issue. When you change channel beep sound you can heard. After muting for few seconds issue resolves. Otherwise TV is awesome. Value for money.",
            "Super",
            "Super.good.",
            "Overally tv is best. I sugest please go for it in this price. Lg improve their picture quality and sound.",
            "Nice, very good",
            "GOOD",
            "No match of quality and performance at this price point",
            "Well built, great picture quality, processor is bit slower but good for those who keep it for longer time because it is not going to lose its charm like other brands",
            "The Picture quality is superb with awesome smart features. The response is quite fast. Overall very good deal",
            "Nice",
            "Bought in January. Working very well. Will update from time to time.",
            "Good and best features of the money",
            "Nice lg led thanks flipkart",
            "I m very happy with this LG all in one tv.....really worth it.....got it at 26944 bucks....go for it.",
            "its good",
            "Poor behaviour by installation guy. They doesn't respond for my questions. Coming to smart tv everything is fine as v expected.",
            "Used it for 3 months and no complaints.. very good.. display quality is decent but not the best.. I am just wondering may be if I should have bought 4K tv from Samsung or LG for an additional 7000",
            "Good product..... don't worry for buying online product good service",
            "Good product",
            "I ve been using this TV for almost 10 months. No issues so far. The clarity is fine however issue is with the colour. When I visited a show room the sales guy showed me difference between lg and Sony TV picture quality. The Sony picture colour was very nice however lg picture had a bit brownish effect which does not give correct colour. But I thought may be the salesman wants to sell Sony TV that's why he has made settings in lg TV like that so I ordered for this LG TV online. When I got this...\nREAD MORE",
            "Nice product",
            "Excellent product",
            "Awesome TV one can get, installation was also good\n\nCome with web Os can connect wifi and smart tv",
            "good product in 28K price",
            "Flipkart always on time. Its good product and the installation service so fast.",
            "Value for money product... Blindly go for it.\nOne point I have to add here installation procedure is very lengthy. It takes near about 4 days in my case. Please improve it. Otherwise all very good.",
            "Good product..",
            "Best product to buy. Far better then MI TV picture quality is super. Installation people are always in hurry though",
            "Overall a good product. Sound quality could be better. Picture quality also could be better. But value for money. I'll suggest this for those who have low to medium usage of tv.",
            "Nice LG with these cost, picture and sound quality awesome..",
            "Nice product good picture and sound clearity.\nOnly I have to wait for installation.",
            "Great tv overall...picture quality is average...not that bright...sound quality is good...You need to watch at a distance so the video doesnt seem pixelated..best option available for under 30k for a branded tv",
            "Timely delivered and installation. thanks to Flipkart and LG..",
            "best product to buy....",
            "Very very nice products 👌👌👌\nBut installation time to late",
            "Nice product.",
            "Nice products",
            "This is super but the picture quality is low for my Airtel DTH and is excellent when i play movies from usb. It also supports USB HUB 2.0 very well",
            "Very poor sound quality and average picture quality 👎",
            "awesome peice",
            "Very good product in its category. Value for money.",
            "Good",
            "43Lg TV is a best choise if you want a perfect TV in a budget price of a reputed brand . Awesome picture quality , sound and installation was also done next day after delivery but there is no Bluetooth that's a negative point only.",
            "Good",
            "As the brand name stands for, excellent quality product was delivered . Trust for LG is still standing for them.",
            "Super Quality",
            "Good",
            "Product is nice butthe guy who came to fixed installation and demo. He didnt give any demo very dispointed with his service. He jst done installation and the behaviour of the guy is not good.",
            "It's good experience with LG product and after sale service is also good . I am fully satisfy with product quality , picture , sound .",
            "Very Nice Picture. More than my expectation. Installation took little time, which is understood during Covid-19 situation, but the product quality is excellent and HD picture awesome. Alothough used couple of days only, but looks this is a good VFM.",
            "Best product i ever got from Flipkart, on time delivery ,convinient installation, and picture quality is awesome.\nOnly thing which is bothering is when screen mirror feature is used lagging problem can be seen.\nBut overall quality is good at this price .",
            "No magic remote",
            "Excellent tv",
            "Super",
            "Very Nice product i like very much",
            "Nice TV",
            "Good",
            "Excellent TV with all modern features",
            "LG All-in-One 108cm 43 inch tv very good product and price also good",
            "Best product with configuration, but picture clarity is not good",
            "Lg products are good quality in video & service but audio quality is somewhat lacking.",
            "Very good product lg",
            "Just Awesome . Adjustable stand 💯",
            "Value of money .I like this product.but connectivity is little slow but still its nice.",
            "Must buy.. good quality..worth for money..",
            "Superb picture,and very good sound,you do not need extra speaker in a decent size room,HD movie experience is awsome.\nSo far connectivity is not a problem,and all is well.\nThe tv mount supplied by LG is not good at all,it is movable and so for such a big screen TV it is not stable.",
            "It was good . In connectivity i felt some problem due to because it doesnt saves password of wifi",
            "Very good\nTV",
            "Very good product",
            "Nice quality",
            "Good for this price",
            "Awesome",
            "Super",
            "Awesome picture quality and sound. Connectivity is good and screen sharing is seamless. I like it",
            "Owsam",
            "Couldn't find much points to lower the rating. Only one is motion rate is only 50hz and it does make a little difference when you are watching action movies.\nColours are punchy, thanks to HDR 10 support.\nThe web os isnt that powerful as android. Limited apps but you'll get all useful ones.\nSound is good you'll never need a soundbar.IPS panel is great with local dimming. Only 2 HDMI and no vga port. 3.5mm whole is in an awkward position should keep it at the side.\nLG service and quality is good as always. My TV got installed on the very next day. Flipkart delivery was on time.\nPrice got lowered by 1k now so its definitely a good buy. If you need a branded trustworthy tv. And if your are not running after 4k tvs because no dth providers delivers 4k channels. And through internet it will consume all of your data really fast.",
            "Nice",
            "Wow it's Awesome. Very good deal. Great experience. You can't get better then this in this price range. Loads of Thank to flipkart for giving us great deals and savings.",
            "Super led tv",
            "Sounds is not clear its very poor",
            "Superb and good... Value for money.",
            "Good product",
            "quite a nice tv",
            "Good product.Reasonable price .flat 50% off by flipkart.",
            "Nice product by flipkart",
            "Really very good product and installation & demo also very good.",
            "Money worthy",
            "Excellent TV . Exceeds all expectations",
            "Installation is too late but TV super",
            "At this price u won't get a branded 43 but if you want a full smart go for Android ie chinese tv all lg sony samsung r not android ..over all its good the cheapest branded 43 inches",
            "It's wonderful and value for money",
            "Great product....just loved it",
            "Just avoid this TV for bright room. Poor contrast and dull picture.",
            "Nice product but delivery is delayed due to current situation",
            "Quality products",
            "Good product",
            "Awesome",
            "They will torture you for an installation...you need to beg them as a beggar for an installation....product is ok..but services are so bad",
            "Good",
            "Overall Product is value for money",
            "Good Product, At This Prices this Product is Very good, Thanks LG & Flipkart",
            "Nice TV in this budget with good features and a company like LG",
            "Thanks for this flipkart",
            "Don't think just buy awesome tv",
            "Ok good",
            "poor experience",
            "good quality",
            "Good product at nominal price by flipkart",
            "Awesome view.. beautiful picture quality.. online videos are awesome to view.😊",
            "Picture quality very nice and sound is also best. No need to use additional Speaker/home theater",
            "Sound problem otherwise it's good",
            "Poor sound quality... don't buy",
            "SUPER PRODUCT THANKS FOR THE FLIPKART .....BUT MAGIC REMOT NT THERE ...",
            "Good",
            "very good rewiev very good working",
            "Must buy tv... awesome",
            "Best bang for the buck. It’s Full HD at the price of a HD ready, what else could one ask for. Backed by the super LG support.",
            "Nyc tv but we have to wait and see how long works perfectly",
            "Good",
            "Mobile hang and slow",
            "Best",
            "Nice",
            "Good",
            "Speaker have some defect so have volume problem",
            "Magic remote not included ...",
            "V Good 👌",
            "As per product perspective 1 of the best in it's range",
            "Picture ,sound awesome but tv built quality bad\nInstallation team gud and very fast",
            "Delivered as per schedule. And installation done as per schedule. Suggested to bye the product",
            "Nice product by Flipkart\nBut they are far more inclined to install TV",
            "You can go for this TV as it is launched by LG just to sale online. Its best in this price range. Remote is not that good.",
            "Good",
            "good picture quality if you have hd connection and sound quality is superb",
            "Excellent image clarity and voice, thanks to flipkart",
            "Best pic. Quality... Upscaling not the best... Sound ok... Best for the money I spend...",
            "Super..I m so happy",
            "High quality",
            "Picture & sound quality is good in this tv",
            "All are ok but incovience with installation remaining all nice",
            "Awesome",
            "Good",
            "Nic Tv",
            "Best picture",
            "Very good and picture quality is very perfect",
            "Worst Connectivity",
            "Thanks flipkart delivery fixing on time",
            "Lg technician who's came for installation is in very urgence but no problem its ok",
            "Nice",
            "Delivery is good. Tv all rounds are good but not build quality",
            "Nice TV can go for it",
            "Nice tv sound is very nice",
            "Awsome product....Loved it",
            "product is excellent but no name mentioned lg is back side ,I saw name lg in market so I have some doubt about originallty ,so please solve my problem,",
            "up to the expectation. nice tv,",
            "Was professional and polite.",
            "nice product",
            "Happy with the product and service",
            "Better",
            "darun product",
            "Nice packing and delivery by flipkart\nGreat product\nSound quality is very good no distortion at high volume\nWith great picture quality.......",
            "Very nice tv",
            "Good product for the cost",
            "Nice tv",
            "Superb I like very much this TV 👌👌👌",
            "Best TV",
            "Good product so thanks",
            "Led pictures quality is good",
            "Mind blowing Smart Tv. Awesome sound and vedio quality.",
            "Very good product and satisfying",
            "good",
            "I love lg best product by lg",
            "Good picture and sound quallity",
            "As the tv is average and another thing is batteries for the remotes are missing. I doubt about the authenticity?\nUsb is not working with in 4 months\nRefresh rate is worst u can feel the strain in eye while motion\nGo for vu or mi for budget\nOr go for higher brand",
            "Quality good",
            "good",
            "Picture clarity is superb, sound is excellent, remaining all features r excellent. Really worth",
            "Super",
            "Super purchase value for money",
            "Awsome",
            "smart Tv is very good. excellent quality of picture and sound.",
            "Overall good service n price.",
            "Picture quality in hd is not as clear as other brands at same or less price. Look wise so so",
            "I received it before the delivery date and also the demo & installation from LG was on time. All the things about this TV is good. But blutooth connectivity is not given. Picture and sound quality of this TV is awesome.",
            "Best",
            "Quick Delivery & Demo on next day. Satisfied with overall TV quality",
            "Value for money",
            "Currently it's working good",
            "LG at its best, but installation was poor and Flipkart delivery worst",
            "Very bad experience..LG Engineering open the box of led tv and the screen are broken, LED TV packing is very bad",
            "I thought it will have Bluetooth connection but it doesn't have that feature very disappointed. Other than that it is superb. Very fast delivery and installation. That was cool.",
            "good & fine velubale product 👌👌",
            "i like led tv",
            "gud",
            "Nice .....this not comes with magic remote...but okay...great picture quality",
            "Sound quality is bad",
            "Amazing",
            "good",
            "very good",
            "good",
            "Excellent but kindly check the product while installing...m get the defective product and also issue with display....video and sound issue ..after replacement it's awesome......",
            "good",
            "very nice product,value for money. Thanks to Flipkart.",
            "Nice",
            "No one has come to instill this TV till today.",
            "very good product",
            "worse service .\nSound effect is not at all good only in the first 2 months it was ok but now even after keeping volume at top high we could hardly hear.\nQuality is not at all good.",
            "Good one but no Bluetooth",
            "The description of internal storage and RAM is wrong in Flipkart description ,it is only 512 MB..Some of the android apps are missing like Sony Liv,Jio TV but apart from this all the features are great .Sound and picture quality are just awesome.",
            "Great Product",
            "Picture quality and sound also very very good,\nand this is best smart TV in this rang.",
            "Great product",
            "nice",
            "Everything is awesome.",
            "LG ALWAYS GOOD COMPANIES",
            "It's awesome product.If you have this TV you don't need to buy sound system.I got this TV at Rs. 26,999/-..",
            "VERY GOOD LED",
            "Picture and sound quality superb",
            "Super Quick delivery and installation... Happy about flipkart service",
            "value for money I love lg",
            "1st of all thank you to Flipkart for delivering the product within 2days.\nWorth buying this TV for this much price as you get all the smart features what are required.",
            "Good product",
            "picture quality and sound quality is very good. very nice led tv..go for it..",
            "super lg",
            "good",
            "Considering the price point, worth to buy.",
            "Nice priduct..and Good Service installation team",
            "it's working good",
            "Very nice Product as compare to price.\nNice sound.\nFast delivery and same day installation was done.",
            "value for money",
            "product is very good but flipkart dilevary very very bad . very disapointed",
            "valuable for money",
            "very good tv",
            "super, very good product\n\nbut exchange policy is very very bad",
            "good product",
            "installation is very bad",
            "LG product are always wonderful, sound and picture quality is good. But magic remote not given with tv ..moreover a detail hand book should be provided for first time user of smart tv....",
            "The TV is very good. sound quality is OK. picture quality is also good.",
            "super",
            "awesome product with good installation",
            "sound is not impressed as Samsung, go for Samsung it the best OS and software, quality, Bluetooth is not available, very bad",
            "Nice",
            "nice product\npicture auiltity is also awesome\nsound quality is good\nI m happy with purchase this item\ninstallation nd demo process is good\nthanks for flipkart......",
            "This LG TV is working in good condition so far",
            "Ok but I phone,MOTO phone not connected",
            "very nice...tv function also.. intalltion parson is also. very nice..",
            "nice experience till date.",
            "Good product",
            "Nice product",
            "sound it's not good when am decreasing sound its increasing and increase means it's decreasing... remaining all are good.",
            "amazing pic",
            "amazing tv go for it fast and safe delivery thanks Flipkart",
            "ok",
            "good",
            "value for money..liked it a lot",
            "Best deal u could have for the season😎",
            "Very good product got with special discount and offer 😀😀",
            "nice",
            "good product",
            "features good... but brightness is more shoulb be watched from distance where the hall is big . not suitable for sm all rooms.. connectivity is slow sometimes. when connected to mobile wifi... otherwise good...",
            "Buy it First No compliants super b",
            "ok good",
            "Good quality and value for money.",
            "tv functions good , but transport is not good, cover is damaged.",
            "item was delivered just as promised. installation was done within two days and demo also done. Picture and sound quality is excellent. connectivity is seamless.",
            "Good product",
            "It's good product value for money.",
            "Good product",
            "good quality\ngood delivery",
            "Super quality",
            "Awesome TV. Default picture and sound settings are superb.\nNo voice control but can cast YouTube directly from mobile. Easy app navigation using remote or LG TV app.",
            "Nice product",
            "Worst product overall, very dissatisfied",
            "Superfast delivery by flipkart.. Very good tv as well..",
            "Good one..",
            "smart TV at smart price.",
            "excellent"
        ],
        "likes": [
            "114",
            "143",
            "91",
            "24",
            "12",
            "4",
            "5",
            "2",
            "1",
            "1",
            "114",
            "143",
            "91",
            "24",
            "12",
            "4",
            "5",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "3",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "30",
            "65",
            "17",
            "47",
            "34",
            "10",
            "3",
            "3",
            "2",
            "2",
            "2",
            "2",
            "2",
            "3",
            "4",
            "4",
            "7",
            "3",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "38",
            "60",
            "10",
            "6",
            "4",
            "1",
            "2",
            "0",
            "0",
            "0",
            "38",
            "60",
            "10",
            "6",
            "4",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "1",
            "1",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "5",
            "16",
            "3",
            "20",
            "15",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "3",
            "8",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:wifi connectivity available ??",
            "Q:does it contain USB port?",
            "Q:does TV comes eith voice search remote?",
            "Q:which one is better quality sony or lg",
            "Q:does it has miracast option?",
            "Q:Does a wall mount come with TV ? If not, how much does the service engineer charge for wall mount ?",
            "Q:Do we have screen mirroring option in this TV",
            "Q:Can we use some Windows Apps like Zoom Meeting or Android Apps like we do in a Browser ? Which Browsers it supports?",
            "Q:Is digital optical port available in this tv to connect external speaker",
            "Q:which is Dolby digital sound yes or no",
            "Q:Does this model include magic remote?? What's it's BEE star rating??",
            "Q:pls send remote pics..and does it working like mouse??",
            "Q:Can I Know The Bluetooth Connectivity From Mobile",
            "Q:Which tv supports PUBG games",
            "Q:can it work with magic remote?",
            "Q:how can v install apps like hotsta?is there any install apos?",
            "Q:how to use screen mirroring system i am not working",
            "Q:megick remote give",
            "Q:can we connect gaming wireless console .like motorola .",
            "Q:It has prime video and youtube",
            "Q:if wall mount free with 43 led r not?",
            "Q:can we play YouTube",
            "Q:is this tv have inbuilt Chromecast?",
            "Q:Which TV is better LG All in One 46LM5600PTC or Sony Bravia KLV 40W562D?",
            "Q:In this tv have bluthooth",
            "Q:is this tv install on ?how long this in",
            "Q:How many energy rating stars?",
            "Q:how many days take installation work plz tel me",
            "Q:It is 2020 model",
            "Q:Is it have a super sign control mode",
            "Q:Is this TV is OLED?",
            "Q:Is panel a+?",
            "Q:can we connect dolby atmos speakers, it is compactible with tv",
            "Q:this is android TV are not? this tv support to the mobile games",
            "Q:can we use whatsapp??",
            "Q:is google assitant avilable in this tv?",
            "Q:does this tv support bluetooth",
            "Q:can we install telegram in this ?",
            "Q:Can we use it for cc tv futages ??",
            "Q:Can it save password of wifi network? So that once I connect then next time it may be autoconnected? If so, where to find the option?",
            "Q:youtube,netflix,prime videos,hotstar are preinstalled in tv alredy",
            "Q:does it have playstore?",
            "Q:which one is the best in new Nokia 4 k 43\" or this LG tv",
            "Q:camera included in this tv",
            "Q:what is different are full hd and ultra hd",
            "Q:Is it required stabilizer for led 43 TVs?",
            "Q:which tv is best intex or lg",
            "Q:can i connect my jbl Bluetooth speaker through aux cable in this lg tv?",
            "Q:which best tv sony or lg",
            "Q:Does this tv have a built-in camera to make video calling? does it have telebean to use it for or either through skype/Google meet/ WhatsApp/ any of lthis kind?",
            "Q:can it support mobile",
            "Q:can i download 5 paisa aap",
            "Q:43 inch tv is magic remote compatible?",
            "Q:Smartphone can connect this tv",
            "Q:can I connect mic",
            "Q:Alexa supported or not",
            "Q:Does 1gb ram cause any lag issues?",
            "Q:is this tv supports magic remot",
            "Q:If i buy a magic remote for the model 43LM5600PTC .....does the remote support this TV?",
            "Q:which is best LG or Nokia",
            "Q:WALL MOUNTED STAND GIVEN FREE WITH TV RIGHT??? IT IT COME WITH TV?",
            "Q:Can it connect with wireless keyboard",
            "Q:can we do screen sharing",
            "Q:which is better VU premium or LG",
            "Q:Can we use zoom cloud meeting app?",
            "Q:does other model magic remote will support for this tv",
            "Q:Can this tv connect on setup box",
            "Q:is this tv full hd or hdr",
            "Q:Is hoichoi app installable in this TV?",
            "Q:Do we need to attach st top box externally?",
            "Q:i use for business use bill with gst number provided?",
            "Q:home theator will connect?",
            "Q:can i watch videos by connecting mobile Bluetooth",
            "Q:is 4gb storage with or without apps?",
            "Q:how is this tv with SD channels",
            "Q:can we get own wall mount kit from market and get it fix from lg engineer",
            "Q:it refresh rate is 50hz is suitable for 43inch? someone advice me that content is freeze on this rate.its true???",
            "Q:If wall mounted how will connect DVD player? Because the connection is coming backside of rhe TV.",
            "Q:Can we connect cpu to use as a computer desktop",
            "Q:Is there any Mother board failure?",
            "Q:Bluetooth connectivity is available on this TV or not ..?",
            "Q:how to do to connect my Bluetooth speaker to lg tv",
            "Q:Does it supports clash of clans?",
            "Q:Can you tell webOS version no",
            "Q:does it work for CCTV",
            "Q:clearity in TV",
            "Q:can i connect Bluetooth by using connector??",
            "Q:it is 4k hd",
            "Q:is this tv have Bluetooth connection",
            "Q:is it touchscreen",
            "Q:what is actually length of tv",
            "Q:2 star is bad or good electricity power bill high or no",
            "Q:does it play .mkv format videos?",
            "Q:Does it support HDMI ARC feature?",
            "Q:Does it include wall mount brackets with tv or we have to buy",
            "Q:can we connect a sound bar in this tv?",
            "Q:As per specification , sound is 20w but when i see reviews the some people says its 10w. what is correct? 10w or 20w?",
            "Q:Can we play 4k video in this tv through pen drive?",
            "Q:does this TV support Sun NXT app??",
            "Q:does it sopport pubg",
            "Q:plystor support this???",
            "Q:Is this compatible with iPhone ?",
            "Q:Can I connect camera this tv",
            "Q:please tell me",
            "Q:Iam connect to iPhone this tv",
            "Q:wiFi is available this TV",
            "Q:is it have blootooth",
            "Q:it is perfect for 12 bu 18 rooms",
            "Q:how to wall mount this and will there be extra cost for this.",
            "Q:which color this model?",
            "Q:Can this TV be wall mounted?",
            "Q:does this tv has voice control on remote?",
            "Q:Does it have play store?",
            "Q:Bluetooth connection available",
            "Q:This is VA panel or IPS?",
            "Q:head phone jack available for this Tv?",
            "Q:its dolby digitial audio...?",
            "Q:what is the contrast ratio of this tv?",
            "Q:Am i connect and use mobile wifi to Tv",
            "Q:Does the wall mount comes free with this TV ?",
            "Q:Is it android tv and would it support playstore?",
            "Q:Does the 43 inch model has bluetooth feature and where can i get the original magic remote if its not included with this?",
            "Q:How is the LG Service.can we compare with Samsung",
            "Q:Bluetooth is available this TV",
            "Q:i already have magic remote . can it be operated by magic remote.",
            "Q:Is this comes with flexi mount?",
            "Q:What kind of remote is available in 43 \" tv",
            "Q:Can it be operated with a Magic Remote??",
            "Q:Can we connect mobile without cable",
            "Q:its wallmount or not",
            "Q:Is stabilizer required for power fluctuations to this tv ...? if yes, which is best stabilizer to use?",
            "Q:does this tv support freefire game",
            "Q:Can i play ps4 in this? Does it have hdmi port??",
            "Q:do this support google assistant??",
            "Q:how is the picture quality of this 43 inch tv?? ( bright ness,contrast)",
            "Q:how many hdmi port contains",
            "Q:screen mirroring inthis tv",
            "Q:Does it include Smart remote with 43knch variable or simple remote. if remote is simple than how smart feature can be use.",
            "Q:which tv is best lg or vu",
            "Q:The magic remote is included In 43inch Box or simple remote. I want to know how smart features can be used",
            "Q:can i wireless connect my Bluetooth device?",
            "Q:Bluetooth connectivity TV with mobile",
            "Q:Mirror cast available in this model",
            "Q:How SD channels perform?",
            "Q:does this support alexa?",
            "Q:motorola vs lg 43\" bettar tv",
            "Q:Netflix YouTube premium hotstar premium can free for 6 months or Not?",
            "Q:WhatsApp and google here",
            "Q:google is here",
            "Q:Can the episodes be recorded for later??",
            "Q:does it contains cromecast or anycast",
            "Q:how much weight this product?",
            "Q:Idtv features is available or not?",
            "Q:wall mount stand is not provided with tv ,is this provided at the time of installation",
            "Q:which one is best motorola smart tv or Lg smart tv ?",
            "Q:is this full android or half android?",
            "Q:which year model is this",
            "Q:can i download every app ?",
            "Q:what is diff. between magic & normal report ?",
            "Q:this android system?",
            "Q:Can we download extra apps from stores like Google stores",
            "Q:while purchising the product how can i ensure the service from LG,direct wth LG or through flipkart?",
            "Q:is it contains exactly 43 inch size?",
            "Q:which is best Lg, realme or motorola",
            "Q:which model this tv?",
            "Q:you explain me tv model number 43LM5600PTC Tv Remote control features?",
            "Q:Is a inbuilt stablizer available???",
            "Q:cab we connect mobile with tv through Bluetooth",
            "Q:Which is better lg 43 inch or lg all in one 43 inch",
            "Q:is the wall mount tiltable",
            "Q:Is Google inbuilt in tv?",
            "Q:which one is better mi or Sony,?",
            "Q:Which is Better Realme Smart Tv or LG Smart Tv?",
            "Q:Which wall mount comes with TV (43in) ? Is it fixed wall mount or the one which is flexible and movable to front left and right. If it is fixed then how can I get installation done with moveable one.",
            "Q:does magic remote support in this model ?",
            "Q:we coonect home theater with tv through bluetooth",
            "Q:Realme Tv or this LG tv?",
            "Q:does it support hd set top box",
            "Q:do I have to buy wall mount separate?? and is the installation free of charge??",
            "Q:do remote is voice support or not??"
        ],
        "answers": [
            "A:yes..",
            "A:Yes",
            "A:YES",
            "A:SONY",
            "A:yes",
            "A:Yes.. please make sure that mentioned wall mount should be provided to u by the service engineer",
            "A:Yes",
            "A:Android apps",
            "A:Yes.it is available but you have to buy it separately. Thank you",
            "A:yes its have dolby digital sound..",
            "A:The model does not have the magic remote. they have just added two buttons side that is [Netflix and amazon prime]. What's it's BEE star rating?? This is kind of energy-efficient trademark",
            "A:no this model doesn't have magic remote.",
            "A:Bluetooth connectivity is good , product is very good.but not trust in Flipkart as there service is not good ,they didn't deliverers the product in committed day.",
            "A:Andriod tv",
            "A:no magic remote supports but mouse can be connected through usb slot, only problem is there is only one usb slot",
            "A:no hotstar in lg webOs Tvs.",
            "A:If you want to use screen mirroring. use the option scree share in your tv. The TV will display the available devices for screen cast. JIo, hotstar and other streaming apps do not support screen cast",
            "A:no. no magic remote....but you can use lg plustv mobile app which is almost like magic remote on phone....",
            "A:Yes",
            "A:Yes. Both are available.",
            "A:no",
            "A:YES",
            "A:no",
            "A:i think u go with lg because services of lg are far better and they are last longer and also u got 2 year of warranty i am also using this product since feb 2020 and there is no problem at all.",
            "A:yes",
            "A:yes it's install",
            "A:Two",
            "A:1",
            "A:No",
            "A:no",
            "A:No. Its LED.",
            "A:yes,it is good.",
            "A:yes",
            "A:it has Lg's web OS with built in apps like Hotstar, netflix, primevideo, zee5 etc. It supports android apps like youtube and others. but don't know about gaming",
            "A:Yes on your phone only....As you can see only whatsapp via screen share on this tv.",
            "A:not",
            "A:No",
            "A:yes",
            "A:yes.",
            "A:Yes but for recent used connection only.",
            "A:Yes",
            "A:LG offers many apps for its smart TV, some of which are available for free through the LG Content store/LG App Store. But, few of the apps that you install from the store are subscription based.",
            "A:LG tv",
            "A:No",
            "A:Full hd",
            "A:Yes. it is recommended in case fluctuation in your city.",
            "A:lg any day. moreover it is non chinese",
            "A:Yes, easy..",
            "A:If u r not very picky in colors and premium sound quality and just want a value for money product from an established brand, LG is the option to go for...hands down!!",
            "A:no",
            "A:yes",
            "A:no..it has webos operating system better than android.",
            "A:No magic remote give me",
            "A:No, It doesn’t have built-in chrome cast.",
            "A:no",
            "A:not",
            "A:yes if internal memory is about to get full.",
            "A:Yes.",
            "A:No our mobile wifi also not connect",
            "A:lg",
            "A:yes",
            "A:yes",
            "A:yes",
            "A:undoubtedly LG is better. VU is in budget category",
            "A:no",
            "A:yes",
            "A:yes it get easily connected",
            "A:Full hd screen",
            "A:no such can be downloaded, download application only through lg store which has merely limited application",
            "A:yes",
            "A:Yes bill is provided but not sure about gst number",
            "A:yes it will connect",
            "A:yes",
            "A:8 gb",
            "A:good, colour picture is much better",
            "A:lg Engineer",
            "A:No. Never happened. I enjoy Netflix and prime video in HDR without any issues. YouTube HDR videos 1080p60 plays very smooth.",
            "A:There is space provided for that. Don't have to worry for that.",
            "A:it has 2 hdmi port.so u can connect cpu by hdmi cable",
            "A:Noo",
            "A:YES",
            "A:sorry, there is no bluetooth its biggest cos",
            "A:no",
            "A:webos version",
            "A:it wont work for anything..its led tv",
            "A:yes",
            "A:yess you can",
            "A:yes",
            "A:no",
            "A:nope",
            "A:42",
            "A:2 star for TV is good enough, as TV power consumption is less or similar to a CFL bulb.",
            "A:YES",
            "A:yes",
            "A:yes",
            "A:no",
            "A:yes its 10w",
            "A:NO",
            "A:No",
            "A:NO",
            "A:yes brother",
            "A:Never",
            "A:yes",
            "A:it's value 4 money",
            "A:No",
            "A:yes",
            "A:no",
            "A:perfect",
            "A:no extra cost, lg engineer will carry wall mount",
            "A:black",
            "A:absolutely",
            "A:no, smart remote is not with tv",
            "A:no, only lg store",
            "A:no",
            "A:IPS",
            "A:no",
            "A:no",
            "A:I didn't check it actually",
            "A:yes",
            "A:No. But the engineer will it bring and do it for free.",
            "A:its not android tv",
            "A:No",
            "A:offcause yar it is as good as a branded tv company like samsung or sony",
            "A:yes",
            "A:It has no Bluetooth hence it doesn't support Magic Remote.",
            "A:Yes",
            "A:It is a basic smart tv remote as it is 2019 model. If u expecting latest Courser remote it is not with this model.",
            "A:can't operate",
            "A:No",
            "A:wall mount",
            "A:Not required as such. As it can work on AC 100 - 240 V, 50/60 Hz. Range is sufficient if you have a low voltage issue. But if the voltage fluctuations more frequent you can buy V-Guard Plus Supreme.",
            "A:yes",
            "A:yes",
            "A:no",
            "A:awesome picture quality also brightness is so bright",
            "A:3",
            "A:yes",
            "A:Not smart remote . it is SIMPLE remote.",
            "A:LG is better",
            "A:no magic remote",
            "A:YES",
            "A:Noo",
            "A:yes",
            "A:very nice....",
            "A:No",
            "A:Lg",
            "A:no",
            "A:WhatsApp",
            "A:yes",
            "A:No...",
            "A:No",
            "A:less than 8kg",
            "A:not",
            "A:Yes",
            "A:LG",
            "A:It is based on Web O.S. But inbuilt apps can be updated as and when updates are available.",
            "A:2019",
            "A:no",
            "A:we can use magic remort like mouse in pc .",
            "A:no",
            "A:No",
            "A:through LG company",
            "A:yes",
            "A:LG",
            "A:lg all in one 108 cm full HD LED smart TV",
            "A:it has excellent features",
            "A:no",
            "A:Yes",
            "A:LG all in one 43 is better",
            "A:yes very nice",
            "A:Inbuilt browser is available and screen share feature for cast. Google Chromecast is not built-in.",
            "A:sony",
            "A:LG Smart TV is much better",
            "A:It comes with movable wall mount.",
            "A:No it doesn't have magic remote",
            "A:No",
            "A:LG",
            "A:YES !!",
            "A:installation free of charge",
            "A:not"
        ],
        "likes": [
            "7",
            "67",
            "24",
            "52",
            "16",
            "59",
            "4",
            "4",
            "2",
            "2",
            "52",
            "6",
            "8",
            "2",
            "1",
            "3",
            "4",
            "2",
            "1",
            "1",
            "0",
            "1",
            "1",
            "2",
            "2",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "44",
            "99",
            "20",
            "6",
            "7",
            "51",
            "1",
            "1",
            "0",
            "2",
            "1",
            "1",
            "1",
            "0",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "4",
            "18",
            "21",
            "21",
            "4",
            "37",
            "0",
            "1",
            "0",
            "0",
            "71",
            "5",
            "13",
            "0",
            "0",
            "4",
            "7",
            "2",
            "1",
            "1",
            "0",
            "1",
            "1",
            "2",
            "1",
            "2",
            "2",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "6",
            "46",
            "6",
            "1",
            "3",
            "77",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "1",
            "0",
            "3",
            "3",
            "3",
            "6",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    }
}