{
    "title": "SAMSUNG The Frame 138 cm (55 inch) QLED Ultra HD (4K) Smart TV  (QA55LS03RAKXXL)",
    "product_specification": {
        "In The Box": "1N LED TV, 1N POWER CORD, 2N BATTERY-ALKALINE(AA Size), 1N REMOCON, 1N STAND-LEFT, 1N STAND-RIGHT, 1N OC",
        "Model Name": "QA55LS03RAKXXL",
        "Color": "Black",
        "Display Size": "138 cm (55 inch)",
        "Screen Type": "QLED",
        "HD Technology & Resolution": "Ultra HD (4K), 3840 x 2160",
        "Series": "The Frame",
        "Smart Tv": "Yes",
        "Motion Sensor": "Yes",
        "HDMI": "4 Side",
        "USB": "3 Side",
        "Built In Wi-Fi": "Yes",
        "Launch Year": "2019",
        "Wall Mount Included": "No",
        "LED Display Type": "Edge",
        "Refresh Rate": "120 Hz",
        "Number of Speakers": "2",
        "Speaker Output RMS": "40 W",
        "Supported App - Netflix": "Yes",
        "Supported App - Youtube": "Yes",
        "Supported App - Disney+Hotstar": "Yes",
        "Supported App - Prime Video": "Yes",
        "Operating System": "Tizen",
        "Screen Mirroring": "Yes",
        "Bluetooth": "Yes",
        "Ethernet (RJ45)": "1",
        "Power Requirement": "AC 100 - 240 V, 50/60 Hz",
        "Power Consumption": "155 W, 0.5 W (Standby)",
        "Width x Height x Depth (without stand)": "123.5 cm x 70.78 cm x 4.25 cm",
        "Width x Height x Depth (with stand)": "75.07 cm x 20 cm",
        "Warranty Summary": "1 Year Comprehensive and 1 Year Additional on Panel from Samsung",
        "Covered in Warranty": "Defect Arising Out of Faulty or Defective Material or Workmanship",
        "Not Covered in Warranty": "Warranty does not Cover Any External Accessories (Such as Battery, Cable, etc.). Damage Caused to the Product due to Improper Installation by Customer. Normal Wear and Tear to Magnetic Heads, Audio, Video, Laser Pick-ups and TV Picture Tubes, Panel Damages Caused to the Product by Accident, Lightening, Ingress of Water, Fire, Dropping or Excessive Shock. Any Damage Caused due to Tampering of the Product by an Unauthorized Agent, Liability for Loss of Data, Recorded Images or Business Opportunity Loss",
        "Warranty Service Type": "Technician Visit",
        "Installation & Demo Details": "We'll facilitate the installation and demo through authorized service engineer at your convenience.. The service engineer will install your new TV, either on wall mount or on table top. Installation and demo are provided free of cost. The engineer will also help you understand your new TV's features. The process generally covers: Wall-mounted or table-top installation, as requested. Physical check of all ports, including power and USB ports. Accessories also checked. Demonstration of features and settings. Quick run-through on how to operate the TV"
    },
    "product_description": {
        "Art Mode": "Give your living space a contemporary touch with this TV. The Frame beautifully complements your living room’s decor as well as your style. When it is on, the TV serves as a source of entertainment, and when it is turned off, it looks highly sophisticated in your living space.",
        "QLED-certified": "Thanks to Samsung’s Quantum Dot technology, you can experience 100% colour volume on this TV. You will experience lifelike colours, no matter how bright or dark the scenes get.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "1",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "2",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "1",
            "2",
            "2",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "1",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "3",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4"
        ],
        "review": [
            "Ordered in BBD n hot this beauty for just 3000/month till 24months.\nDelivery was quicker than expected date and installation team from samsung came the next day itself and did their best job as always.\n\nThe initial experience in the TV is top notch.. Thanks to 120 Hz refresh rate picturesque is very smooth.\nNetflix prime video works very well could stream YouTube at 4K. From Jio Cinema to Hotstar all much needed apps are there. Still if you need android experience jus getting a android TV box will do the job and universal remote of samsung is compatible with tv boxes setup boxes and much more.\nIt's been jus 2 days now will update a neat usage review soon",
            "Best LED/QLED TV right now in the market, and for 75K it is a steal. I read here some people are complaining about the picture quality of the TV to them I say there might be something wrong(defect) with your TV, plz get it exchanged for a new piece, The picture quality on the frame is amazing with little setting changes as per your need. The TV has gorgeous Art Mode, also the game mode is good too. The TV itself looks gorgeous, the one box is also a good tool to minimize the wire clutter, The blacks are deep & the best in any LED tv's right now and very close to OLED tv's, this tv has amazing 10bit IPS screen with gives amazing pictures, the 2019 QLED have truly narrowed the gape between Super expensive OLED in terms of picture quality, it's very hard to tell the difference between the both now, therefore it dosent make any sense NOW to spend another 70k to 1Lac extra for OLED's when QLED's are near identical. Plus OLED comes with its own set of issues like it are not bright enough or colours are not vibrate enough as compared to LED/QLED, also not to forget the screen burn issue which is unique to OLED's, On the other hand QLED's have legendary brightness and are known for vivid colours, this helps a lot for any QLED owners in home conditions where you have windows and good amount of natural light coming inside which does not bother or effect your picture contrast and sharpness. The HDR 10+ is another amazing feature which makes the picture look more vibrant & colorful, most of the new online content on Netflix and Prime are now available in HDR. 120Hz motion flow feature does wonder for gaming and watching sports but some may not like it while watching Films or regular TV, you can simply go to the pictures settings and turn it off. Recently I watched \"the boys\" which is available in 4k HDR on Prime and it was a treat. The billion day sale price was a steal. I have been planning to buy a TV since June this year my budget was 2Lac and I was inclined towards OLED TV's but after a long research & seeing the price difference it just didn't nake any sense not to go for this tv. My final verdict is samsung has come up with a winner here. If you can score this TV for under 1Lac then go for it without thinking much.",
            "This TV is an absolute stunner and at 85k (during big billion sale) it was a golden opportunity to get this home. As the name suggests, it truly looks like a portrait on the wall. Great picture quality with wide viewing angles. The only thing missing I would say are Alexa and Google assistant which is available in other regions. Not sure when Samsung would be introducing support for Alexa and Google assistant. Overall, a great product with amazing picture quality.",
            "If you are looking for a sleek tv, then this is not it. If you are looking for TV with great resolution and stylish, then you should buy this tv. Overall amazing experience, connectivity with devices is very smooth and quick. The frame looks amazing when it's off. Apart from that the 120Hz refresh rate is very rare in TVs. Internal memory is little low but overall amazing. Netflix, Prime are pre-installed. Also the universal remote is amazing.",
            "Bought this for 77k using my emi card in great Indian sale. Decided this over OnePlus TV(not the pro , the normal one costing 69k) for the following reasons:\n1. Picture is lot better. Panel is better and refresh rate (120hz) is double than that of OnePlus\n2. Sound is better ( than normal Q1 and not q1pro)\n3. Samsung invented Qleds !!\n\nso far , usage has been lag free and quite good. for a medium sized room, you don't even need a home theatre system.",
            "Another great product purchased. Netflix button is there on the remote. TV delivered on 16oct19 and the installation was done next day. They're very friendly and described each and every function with extra effort (like how to use my mobile as remote, Live Camera streaming to TV, how to use the all time ON Photoframe when TV is Off , and much more). About the image quality, it's 55\" QLED 4K with 120 hertz refreshing rate with 100 percent color volume. 40 watt speakers. No need of additional speakers.",
            "Love the qled panel. Absolutely love the art mode. Very happy so far. If I have to knit pick, the no gap wall mount is not absolutely no gap, it has some gap. So I'm not sure if that depends on the skills of the guy installing or that much is acceptable gap.",
            "After lot of thoughts between Oneplus Q1 Pro & Samsung the frame, went ahead with this purchase. God I'm never gonna regret.\n\nHave visited Samsung Opera House (Bangalore) to check the TV before buying, but to my dismay it was not in display and not sold offline (As per inputs from store employee). Happened to see the display of Q60 & Q70.\n\nVisited the Oneplus Store and checked out the Q1 & Q1 Pro TV's.\n\nOn visual comparison between Samsung Q60 & Oneplus Q1 Pro, felt the display of Samsung...\nREAD MORE",
            "Absolutely Loved it.\nExcept sound everything is perfect in this TV.\nConnectivity, ease to use, remote compatibility with multiple devices like Firestick and tatasky, all top notch.",
            "This was the first time I had ordered such an expensive electronic item online. I was naturally very anxious for how it will go through. But this turned out to be the best purchase I have done in Flipkart. The Samsung The Frame TV 2019 is one of best and unique TVs in the market right now. And the price offered by Flipkart was a real steal deal. It has the best picture and sound quality at this price. I have no complaints as of now with the TV. The only issue i faced was the delayed delivery. I had ordered the product on 2nd October and the promised delivery date was 14th October. But I received the product on 24th October and there was no proper updates from Flipkart about the status. The Flipkart customer care people were not able to provide any real time updates or resolutions. The installation by the Samsung executives was real quick and professional. Overall I am very satisfied with this purchase through Flipkart. The only suggestion I have for Flipkart is to improve their logistics infrastructure specially during the special sales days. Many of the customers would not be as patient as me.",
            "Ordered in BBD n hot this beauty for just 3000/month till 24months.\nDelivery was quicker than expected date and installation team from samsung came the next day itself and did their best job as always.\n\nThe initial experience in the TV is top notch.. Thanks to 120 Hz refresh rate picturesque is very smooth.\nNetflix prime video works very well could stream YouTube at 4K. From Jio Cinema to Hotstar all much needed apps are there. Still if you need android experience jus getting a android TV box will do the job and universal remote of samsung is compatible with tv boxes setup boxes and much more.\nIt's been jus 2 days now will update a neat usage review soon",
            "Best LED/QLED TV right now in the market, and for 75K it is a steal. I read here some people are complaining about the picture quality of the TV to them I say there might be something wrong(defect) with your TV, plz get it exchanged for a new piece, The picture quality on the frame is amazing with little setting changes as per your need. The TV has gorgeous Art Mode, also the game mode is good too. The TV itself looks gorgeous, the one box is also a good tool to minimize the wire clutter, The blacks are deep & the best in any LED tv's right now and very close to OLED tv's, this tv has amazing 10bit IPS screen with gives amazing pictures, the 2019 QLED have truly narrowed the gape between Super expensive OLED in terms of picture quality, it's very hard to tell the difference between the both now, therefore it dosent make any sense NOW to spend another 70k to 1Lac extra for OLED's when QLED's are near identical. Plus OLED comes with its own set of issues like it are not bright enough or colours are not vibrate enough as compared to LED/QLED, also not to forget the screen burn issue which is unique to OLED's, On the other hand QLED's have legendary brightness and are known for vivid colours, this helps a lot for any QLED owners in home conditions where you have windows and good amount of natural light coming inside which does not bother or effect your picture contrast and sharpness. The HDR 10+ is another amazing feature which makes the picture look more vibrant & colorful, most of the new online content on Netflix and Prime are now available in HDR. 120Hz motion flow feature does wonder for gaming and watching sports but some may not like it while watching Films or regular TV, you can simply go to the pictures settings and turn it off. Recently I watched \"the boys\" which is available in 4k HDR on Prime and it was a treat. The billion day sale price was a steal. I have been planning to buy a TV since June this year my budget was 2Lac and I was inclined towards OLED TV's but after a long research & seeing the price difference it just didn't nake any sense not to go for this tv. My final verdict is samsung has come up with a winner here. If you can score this TV for under 1Lac then go for it without thinking much.",
            "This TV is an absolute stunner and at 85k (during big billion sale) it was a golden opportunity to get this home. As the name suggests, it truly looks like a portrait on the wall. Great picture quality with wide viewing angles. The only thing missing I would say are Alexa and Google assistant which is available in other regions. Not sure when Samsung would be introducing support for Alexa and Google assistant. Overall, a great product with amazing picture quality.",
            "If you are looking for a sleek tv, then this is not it. If you are looking for TV with great resolution and stylish, then you should buy this tv. Overall amazing experience, connectivity with devices is very smooth and quick. The frame looks amazing when it's off. Apart from that the 120Hz refresh rate is very rare in TVs. Internal memory is little low but overall amazing. Netflix, Prime are pre-installed. Also the universal remote is amazing.",
            "Bought this for 77k using my emi card in great Indian sale. Decided this over OnePlus TV(not the pro , the normal one costing 69k) for the following reasons:\n1. Picture is lot better. Panel is better and refresh rate (120hz) is double than that of OnePlus\n2. Sound is better ( than normal Q1 and not q1pro)\n3. Samsung invented Qleds !!\n\nso far , usage has been lag free and quite good. for a medium sized room, you don't even need a home theatre system.",
            "Another great product purchased. Netflix button is there on the remote. TV delivered on 16oct19 and the installation was done next day. They're very friendly and described each and every function with extra effort (like how to use my mobile as remote, Live Camera streaming to TV, how to use the all time ON Photoframe when TV is Off , and much more). About the image quality, it's 55\" QLED 4K with 120 hertz refreshing rate with 100 percent color volume. 40 watt speakers. No need of additional speakers.",
            "Love the qled panel. Absolutely love the art mode. Very happy so far. If I have to knit pick, the no gap wall mount is not absolutely no gap, it has some gap. So I'm not sure if that depends on the skills of the guy installing or that much is acceptable gap.",
            "After lot of thoughts between Oneplus Q1 Pro & Samsung the frame, went ahead with this purchase. God I'm never gonna regret.\n\nHave visited Samsung Opera House (Bangalore) to check the TV before buying, but to my dismay it was not in display and not sold offline (As per inputs from store employee). Happened to see the display of Q60 & Q70.\n\nVisited the Oneplus Store and checked out the Q1 & Q1 Pro TV's.\n\nOn visual comparison between Samsung Q60 & Oneplus Q1 Pro, felt the display of Samsung...\nREAD MORE",
            "Absolutely Loved it.\nExcept sound everything is perfect in this TV.\nConnectivity, ease to use, remote compatibility with multiple devices like Firestick and tatasky, all top notch.",
            "This was the first time I had ordered such an expensive electronic item online. I was naturally very anxious for how it will go through. But this turned out to be the best purchase I have done in Flipkart. The Samsung The Frame TV 2019 is one of best and unique TVs in the market right now. And the price offered by Flipkart was a real steal deal. It has the best picture and sound quality at this price. I have no complaints as of now with the TV. The only issue i faced was the delayed delivery. I had ordered the product on 2nd October and the promised delivery date was 14th October. But I received the product on 24th October and there was no proper updates from Flipkart about the status. The Flipkart customer care people were not able to provide any real time updates or resolutions. The installation by the Samsung executives was real quick and professional. Overall I am very satisfied with this purchase through Flipkart. The only suggestion I have for Flipkart is to improve their logistics infrastructure specially during the special sales days. Many of the customers would not be as patient as me.",
            "good product and good quality",
            "good product and good quality",
            "Very nice saree liked so much thankyou flipcart👌🏻👌🏻👌🏻💐",
            "Very nice saree liked so much thankyou flipcart👌🏻👌🏻👌🏻💐",
            "Good quality awesome👍👍👍",
            "very bad product 😐",
            "Love it very good product tnxx flipkart",
            "Worst quality of the material.",
            "It's wonderful, I'm very happy and satisfied thank you sooo much ❤️❤️❤️",
            "Amazing sareee..... feeling good",
            "good product and good quality",
            "good product and good quality",
            "Perfect match this product\nI am very happy 🥰",
            "Perfect match this product\nI am very happy 🥰",
            "It's wonderful, I'm very happy and satisfied thank you sooo much ❤️❤️❤️",
            "Amazing sareee..... feeling good",
            "very light weight and beautiful work.. very pretty saree.. must buy.",
            "Nice saree, same as shown",
            "beutiful saree.... I m happy",
            "Very good. Cloth is too smooth",
            "good product and good quality",
            "good product and good quality",
            "Same as photo not bad worth for money spent.",
            "Same as photo not bad worth for money spent.",
            "Fantastic product. The colour combination and the thread work is really royal. The cloth isn't sheer, medium thick, but the outstanding work on the body is t...\nRead full review",
            "This saree is nice,but it's not a full length saree.it is small in length.also it claimed that it has blouse pics in it,but it hasn't nay blouse pics.flipcar...\nRead full review",
            "The Saree is value for budget I had gifted this to my wife on our wedding anniversary .she just loved it as it was light weight and looking good. Thank You S...\nRead full review",
            "The Saree is value for budget I had gifted this to my wife on our wedding anniversary .she just loved it as it was light weight and looking good. Thank You S...\nRead full review",
            "Good quality awesome👍👍👍",
            "very bad product 😐",
            "good product and good quality",
            "good product and good quality",
            "Most beautiful same as picture and best quality of clothe thank you so much flipkart I Love it",
            "Amazing saree thanks flipkart 👍",
            "Dilevered 4 days in advance . Really good quality , and looks better in real life than photo . Just go for it without thinking",
            "Value for money and quality good .product was very smoouth but colour was seeing in flipkart its very thick and seeing after delivery its very light..",
            "It's very osm 😍 value for money 🌟💥 thankyou Flipkart 🥰❤️❤️❤️💝",
            "Material is good, color as like the picture",
            "Good color ❤best quantity ❤l like ❤",
            "No words to explain..nyc one",
            "good product and good quality",
            "good product and good quality",
            "Good quality and matches your expectation! Highly recommend the brand and quality!",
            "Excellent Product",
            "Amazing saree I love it ❤️❤️🥰🥰",
            "Fabric is very poor anymore",
            "Just osm go for this saree it is quite gdd",
            "Just osm go for this saree it is quite gdd",
            "So bad product",
            "So bad product",
            "Beautiful saree at such an affordable rate. It looks quite expensive and the color is to die for. Go for it without any doubt.",
            "Good product good quality",
            "good product and good quality",
            "good product and good quality",
            "This product is amazing",
            "This product is amazing",
            "Very bad i don't like money loss",
            "Was expecting much better quality . All threads are coming out from the Saree. Bad packaging and even bad cloth material.",
            "Just like the pic or more better thn pictures I didn't expect from flipkart this much good quality saree thnku so much",
            "Very poor sari. Cheap quality",
            "Super saree..quality is s good,I love the colour.",
            "Superb quality.....very nyc",
            "good product and good quality",
            "good product and good quality",
            "It was so so ,it could be better but ok according to price,you can buy it for casual purpose.",
            "IT'S REALLY liked by My mom\nI am very Happy to gift this saree to mom",
            "Very nice saree, liked it ❤️🙂",
            "Quality of this product is very bad",
            "Vry bad ....don't like it",
            "Vry bad ....don't like it",
            "Worth an product is..🤗💯",
            "This product is very nice ❤💕 thanks flipkart",
            "good product and good quality",
            "good product and good quality",
            "It is very good product i like it so much",
            "Very well balanced and light weight......",
            "Very nice and comfortable",
            "Very soft .....nice saari👍",
            "Vry bad ....don't like it",
            "Vry bad ....don't like it",
            "good product and good quality",
            "good product and good quality",
            "It's very beautiful saree",
            "Gud products @ reasonable value👍",
            "Very nice saree same colour.",
            "Nice fabric color is decent.",
            "It's very osm 😍 value for money 🌟💥 thankyou Flipkart 🥰❤️❤️❤️💝",
            "Material is good, color as like the picture",
            "Good product,and delivery boy is good",
            "Excellent product 👌👌👌👌👌👍👍👍👍👍👍go for it...",
            "Very nice product 👌👌 I love it\nThanks for flipkart",
            "Really nice fabric, colour and design 🥰 very nice saree definitely buy it",
            "good product and good quality",
            "good product and good quality",
            "The saree is awesome ❤️. I love this🥰 the colour , the fabric , the design everything is perfect 🤩 the length of the saree is also perfect 🤩 it's 5.50 m",
            "This is very beautiful saree",
            "Very nice product I am like it",
            "Bad saree because after washing the color came out.",
            "Just awesome saree.।।।\nSame as shown in pic.\nFully satisfied.\nBest purchse.\n😍😘😍😍😍",
            "Just awesome saree.।।।\nSame as shown in pic.\nFully satisfied.\nBest purchse.\n😍😘😍😍😍",
            "Very nice product 👌👌 I love it\nThanks for flipkart",
            "Really nice fabric, colour and design 🥰 very nice saree definitely buy it",
            "good product and good quality",
            "good product and good quality",
            "Very nice 💙💝so good❤😍 tq flip card",
            "Bad quality material r used this product",
            "Nice Saree. worth for money..",
            "Exactly the same as in the pic 🥰\nThankyou @flipkart❤️",
            "good quality and good fabric",
            "Same color and quality of silk as shown in the image 👌👌🤗😊😊🤩🤩🤩",
            "good product and good quality",
            "good product and good quality",
            "Nice saree.... Worthy for this price...",
            "It's beautiful to look and satisfied also.",
            "Good product and smooth exlent quality best price",
            "Nice saree\nSatisfying\nI will give 5 stars to this\nHappy with 🥳",
            "it's a nice product and quality saree .good quality and genuine product",
            "Very nice product",
            "Worthly Product in such low price..",
            "Worthly Product in such low price..",
            "Good ☺️",
            "Good ☺️",
            "good product and good quality",
            "good product and good quality",
            "The cloth is very nice as it is in the picture, it came the same way I liked the sari",
            "V beautiful saree at this price. I really like it",
            "Very nice saree, liked it ❤️🙂",
            "Quality of this product is very bad",
            "Good product and smooth exlent quality best price",
            "Nice saree\nSatisfying\nI will give 5 stars to this\nHappy with 🥳",
            "good product and good quality",
            "good product and good quality",
            "Awesome saree thank you flipkart",
            "Beautiful saree .,...amazing",
            "Just wow , quality of this saree is awesome . Packing was also good . Worth of money and fully satisfied with the product.At last I want to say \"Don't think ...\nRead full review",
            "Just wow , quality of this saree is awesome . Packing was also good . Worth of money and fully satisfied with the product.At last I want to say \"Don't think ...\nRead full review",
            "Bad quality",
            "Bad quality",
            "It's wonderful, I'm very happy and satisfied thank you sooo much ❤️❤️❤️",
            "Printed work is not good",
            "good product and good quality",
            "good product and good quality",
            "Lovely colour combination and fabric is too good",
            "Lovely colour combination and fabric is too good",
            "So good ,i m very happy thanks to flipcart ,very very good this product.......💯💯💯.",
            "Very nice saree texture and colour is very good",
            "Wrost product & loss my money",
            "Hi good morning all's 🌹 f cade beautiful so good thank you f Kade 🌹",
            "Good quality.... Nice product...",
            "Very local qty product...it's waste of money..",
            "good product and good quality",
            "good product and good quality",
            "Nice quality",
            "Nice quality",
            "Must buy product..loved it",
            "Worst product… only in photo saree looks good… directly it’s worst…",
            "bought it for my mother and happy to receive this saree",
            "great products, as expected from Flipkart.",
            "Osam product I love 💕 it 💓👌",
            "Osam product I love 💕 it 💓👌",
            "good product and good quality",
            "good product and good quality",
            "Product is amazing and beautiful and very good quality i am very impressed very good color this Saree Highly recommended packaging is very good.",
            "Too good...☺️,& superb quality... Just go for it....",
            "Supar saree iam happy tq filpkart",
            "Supar saree iam happy tq filpkart",
            "Amazing🤩 saree same as the emage very shiny🌟 too good TQ flip cart",
            "Saree nice beuriful color\nOne saree damaged",
            "Very good product and very good boy delivery staf boy",
            "Very good product and very good boy delivery staf boy",
            "good product and good quality",
            "good product and good quality",
            "I ordered this for my mother and she liked it ! It's for summer",
            "Best saree reasonable prices..",
            "Very nice 👍",
            "Very nice 👍",
            "I got this for my mother to my surprise she likes it as it is very light and good for summer season",
            "Amazing saree. Worth for money. Quality is great. Fabric is so soft and comfortable. Colour is so fast and bright. Overall must buy.",
            "Supar",
            "Supar",
            "good product and good quality",
            "good product and good quality",
            "Worst👎 Product ever. 😡😡😡😡",
            "All is well, but I received different colours",
            "Wow saree .very beautiful.cloth is super soft.party wear saree.one day before delivery so thanks Flipkart.for adding a beautiful collection in my wardrobe th...\nRead full review",
            "Wow saree .very beautiful.cloth is super soft.party wear saree.one day before delivery so thanks Flipkart.for adding a beautiful collection in my wardrobe th...\nRead full review",
            "Just waw...... Saree is so so so beautiful",
            "It is nice in product as a comparative rate👌",
            "Very nice saree... Colour also very good",
            "Very nice and soft I love it",
            "good product and good quality",
            "good product and good quality",
            "I like this product and beautiful saree 🥰🥰",
            "I like this product and beautiful saree 🥰🥰",
            "Good",
            "Good",
            "Very good. super product. speed delivery. My expectations is full fil.",
            "Awesome quality saree so beautiful thanku so much",
            "Ok ok quality is not good",
            "Ok ok quality is not good",
            "good product and good quality",
            "good product and good quality",
            "As per expectation and super fast delivery by Flipkart",
            "Very nice saree..loved it.. Thank you Flipkart",
            "Must buy product..loved it",
            "Worst product… only in photo saree looks good… directly it’s worst…",
            "LOVE THIS SAREE QUALITY IS GOOD AND EXCELLENT PRICE SAREE IS VERY LITE TO CARRY AND COLOUR IS VERY VIBRANT MUST BUY PRODUCTS LOVE IT SHE LOVE TO WEAR 😍",
            "Good👍 but very thin material",
            "Truely a excellent saree\nNever expected this quality in this price range\nValue for the money",
            "Truely a excellent saree\nNever expected this quality in this price range\nValue for the money",
            "good product and good quality",
            "good product and good quality",
            "Best Saree with bright colour looking with amazing design Blouse piece.\nI Love with this product",
            "Loved it. Best quality products",
            "Loved it very nice material,same as said by the seller ,",
            "Wonderful saree... Great value for money",
            "Wow!!\nThis banarsi saree looks awesome.i just love the quality of saree.\nIt gives traditional look.\nIt is genuinely superb and amazing. I buy it for my siste...\nRead full review",
            "I got my order on time..\nAnd happy to buy it..\nI love that color and it's so pretty... This saree is looking so nice..\nAnd fabric is also good...\nI am happy ...\nRead full review",
            "Nice such a beautiful sarree",
            "Nice such a beautiful sarree",
            "It is beautiful saree extraordinary great colour for less price, I liked the colour & design too it is just awesome👌👌👍😊",
            "Very nice saree I love it",
            "good product and good quality",
            "good product and good quality",
            "Excellent",
            "Excellent",
            "Just wow , quality of this saree is awesome . Packing was also good . Worth of money and fully satisfied with the product.At last I want to say \"Don't think ...\nRead full review",
            "Just wow , quality of this saree is awesome . Packing was also good . Worth of money and fully satisfied with the product.At last I want to say \"Don't think ...\nRead full review",
            "Nice color, and also nice looking design with silver color combination. Royal look",
            "Nice cloth n good colour beautiful saree delivery service is fast thank u flip cart"
        ],
        "likes": [
            "180",
            "93",
            "21",
            "44",
            "26",
            "27",
            "61",
            "16",
            "9",
            "9",
            "180",
            "93",
            "21",
            "44",
            "26",
            "27",
            "61",
            "16",
            "9",
            "9"
        ],
        "dislikes": [
            "39",
            "31",
            "8",
            "7",
            "5",
            "2",
            "14",
            "2",
            "0",
            "1",
            "39",
            "31",
            "8",
            "7",
            "5",
            "2",
            "14",
            "2",
            "0",
            "1"
        ]
    },
    "qna": {
        "questions": [
            "Q:does it have Samsung smart things pre installed in it",
            "Q:Does this has HDMI ARC",
            "Q:does it have apple air play",
            "Q:Is it better than oneplus tv?",
            "Q:what is the difference between 120hz and 60hz which is better",
            "Q:What is the ROM/storage for apps in this tv?",
            "Q:If play any console games PS4 pro Xbox one",
            "Q:Can v play high end games through mirror / cast from andriod or Apple phone ?",
            "Q:Does it have local dimming?",
            "Q:Does it come with multiple frames or just black? Videos show white frame as well.",
            "Q:does it have Memc technology?",
            "Q:Is this TV or Photo Frame.",
            "Q:does it include any color frame in box?",
            "Q:does anyone feel earthing issue at the bottom of the tv ( near both speaker), when i place my hand in the bottom of the tv, i can sense some earthing feel in my hand. does ur tv also have same effect?",
            "Q:when is the 2020 model launching? whats the difference between 2019/2020 model? Is it worth the wait or shall i buy this model only?",
            "Q:does this have a youtube",
            "Q:Dolby vision and Dolby atoms supported this TV",
            "Q:Is it supports 5ghz wifi or not",
            "Q:It is suitable for PS4 pro",
            "Q:Is jio tv supported",
            "Q:Does it support Dolby Atmos pass through? I have an LG SL10YG Dolby Atmos Soundbar and if I connect this TV to it, will I get Dolby Atmos output?",
            "Q:is it screen mirroring to any android mobile",
            "Q:Does this TV has 120hz panel?",
            "Q:Is it 2018 model or 2019 model?",
            "Q:Does this tv has Ambient Mode ?",
            "Q:Is this TV supports Dolby Vision and Sound?",
            "Q:is this tv an android tv?",
            "Q:how to connect frame tv with apple iphone x",
            "Q:If the tv is connected to Set Top Box, then does the Bixbi work when it is commanded to change the chnnel?",
            "Q:Can I watch YouTube videos in 4K? In Which FPS?",
            "Q:does it have memc?",
            "Q:Is it support Skype",
            "Q:What is the current required 1Amp or 2 Amps ....",
            "Q:Can we stream directly from Android? Does it has Android TV built in?",
            "Q:Does This Tv Have Inbuilt Set up Box ??",
            "Q:CAn I play game on iPhone and mirror / cast on this tv so that I enjoy the visuals on big screen",
            "Q:Can it can support Xbox one x?",
            "Q:Does the TV ship with Magnetic Frame Enclosures(Top, Bottom,Right & Left side) as shown in Samsung Ads & Unboxing Videos?",
            "Q:What should be the distance from sitting and placing the tv",
            "Q:Is it having ELED or DLED for backlighting..?",
            "Q:Which is better Samsung Frame TV or Samsung Q60R TV?",
            "Q:Does it come with normal remote control as the tv is for my aged parents and smart remote control is difficult for them to use?",
            "Q:The product description says the launch year as 2019, so is it Samsung the frame 2019 or Samsung the frame 2020, because both models are very different.",
            "Q:Does it have mouse pointer remote like in LG??",
            "Q:Is this TV has edge led or direct led back light",
            "Q:what is this black Samsung box",
            "Q:how many gb we get perday to watch video with tv internet?",
            "Q:Is it 2019 or 2020 model?",
            "Q:what is the picture quality in darker scenes?like do you get to see grayish color or deep backs.",
            "Q:how is it's upscaling feature?",
            "Q:can i install apps",
            "Q:can i used this tv as computer monitor ???",
            "Q:Is it Super AMOLED display?",
            "Q:how can i turn on the tv or change channels without remote there are not buttons for power , channels or volume on tv or one box ?",
            "Q:Its written that it is a qled certified tv...is this something different from actual qleds..you cand match the other qled tvs that samsung is offering here on Flipkart..its just the case for this tv?",
            "Q:can we display our personal art work? or only art work displayed by samsung?",
            "Q:1=does it have hotstar preinstalled?",
            "Q:What is the thickness of the tv",
            "Q:Can I watch 4K or 2K livestreams from YouTube,Twitch ? at 60FPS?",
            "Q:Does it fully sticks to the wall or there is some gap left behind it. What is the response of No-Gap wall mount?Is it reliable for long run usage.",
            "Q:Will the frame come even when I cut the power supply ?",
            "Q:is this TV have HDMI 2.1 support?",
            "Q:Best picture settings and adjustment fir sports mode, in normal movie mode, cricket ball can be seen twice... How to change that?",
            "Q:black light bleeding issue? To findout , need to take a picture from phone",
            "Q:request you guys to answer.. How are the viewing angles of the TV? is the picture quality same when viewed from different locations (sides).",
            "Q:Does it really have 120hz refresh rate?",
            "Q:what is the stabilizer required for this TV?",
            "Q:Is bixby assistant working on tv?..or it's asking for update",
            "Q:Can we play 3d movie on this TV?",
            "Q:When you touch slightly at the bottom of the tv, yu can feel something like earthing feel, if any one has this feel on ur tv? What yu did... Those who bought suggest me soln...?",
            "Q:Can i connect my laptop to view ppt ??",
            "Q:tv has bluetooth connectivity ? frame is made up from aluminium or plastic ?",
            "Q:Does it have ground stand.??",
            "Q:tv has Bluetooth?",
            "Q:Can I Connect android phone for screen mirroring?",
            "Q:Does it have genuine 120hz refresh rate or the satndard for tvs 50/60hz? I mean when you connect it to PC, does it show 120 hz in Windows display settings?",
            "Q:how can i change the channels, that the remote do not shows any botton for that?",
            "Q:Does it have YouTube, hotstar?",
            "Q:can we change channels through set up box remote by direct typing channel no?",
            "Q:one connect box in the box or buy separately",
            "Q:Is it a qled or uhd as showing in samsung website?How can we know if it is a qled apart from its box?",
            "Q:can we operate with our mobile instead if its remote",
            "Q:hows the wall mount quality, would it fall if my sub woofer (300watts rms, 1200w peak) hits the bass at max power? it shakes my entire house even the vessels drop in my kitchen, shakes my windows hard",
            "Q:does this tv support VCR?",
            "Q:what is the type of panel it has? like A+ or something. Thanks.",
            "Q:does it have inbuilt bluetooth",
            "Q:can we table mount this tv?",
            "Q:does it support Google Play store",
            "Q:Can I know the available Storage, The apps in the App Store and is it worth?",
            "Q:does it suppot playstore (anroid)",
            "Q:Can we find other apps like zee5, Mx player etc?",
            "Q:Which model is this (QA55LS03RAKXXL)? 2019 or 2020?",
            "Q:Art mode free for lifetime??",
            "Q:is this septop box inbilt or not???",
            "Q:Does it support HDR from PS4 Pro(HDMI)?",
            "Q:what is the length of the cable joining the tv and one connect box?",
            "Q:Do we need to have stabilizer for this TV while keeping the art mode on or it will adjust the power fluctuation if there would be any?",
            "Q:wall mount unit with this package?",
            "Q:screen mirroring option available",
            "Q:Could you advise me what is the distance between the Stand legs. Need this information since my TV stand is not that big. Thank you.",
            "Q:Does it have subwoofers ?",
            "Q:1TB external HDD is compatible with this TV? USB port is 2.0 or 3.0?",
            "Q:Does it conpatible with alexa?",
            "Q:how many nits brightness of this tv?",
            "Q:Storage Capacity in frame tv",
            "Q:how can i connect my home theatre with one connect box ..coz there not any 3.5 mm jack or other connectivity.. accept sound optical port",
            "Q:Is this tv is better than oneplus Q1 pro?",
            "Q:How many HDMI 2.1 ports does it have and how many varc ?",
            "Q:Does this TV have HDMI 2.1 Support. I bought it last year but I haven't seen it mentioned anywhere. wanted to know if it is supported before I buy a 2.1 cable",
            "Q:Can i connect more than One Wireless Headphoes at a time?",
            "Q:does it have wall mount?",
            "Q:does it come with table stand or wall mount?",
            "Q:how are the viewing angles for this screen?",
            "Q:Does the screen art changes itself",
            "Q:does it have 2 way wifi, magic remote. can this tv be voice controlled??",
            "Q:is it 2020 model or 2019 model?",
            "Q:Sd and HD upscaling better than Sony?",
            "Q:Does this tv support apps like Voot and Eros Now?",
            "Q:one connect cable",
            "Q:does it support WhatsApp app ?",
            "Q:can we put other setop box than tata sky in this tv",
            "Q:Does Frame Tv has ambient mode ?",
            "Q:Does it feature NFC ?",
            "Q:what is the dimensions of one connect box?",
            "Q:in what formats can we play movies on this TV via pendrive/hdd?",
            "Q:Does it have one connect box with box?",
            "Q:what are the dimensions of frame tv 65 inch?",
            "Q:Does screen heat at bottom side?",
            "Q:ram of this tv",
            "Q:can you set your pictures as a frame?",
            "Q:Does it have chromecast build in?",
            "Q:Does anyone see to pink screen flash on TV start?",
            "Q:samsung qled or lg nano cell, which is the best ?",
            "Q:can i get gst invoice for claiming GST input?",
            "Q:does it have Dolby atmos?"
        ],
        "answers": [
            "A:Yes most of them others you can download from Samsung store",
            "A:Yes",
            "A:Yes",
            "A:it is 100% better than One plus",
            "A:the difference will visibly noticed when you play a movie or sports which is having very high level of frame rate per second. higher frame rate gives extra smoothness when we watch.",
            "A:8GB Rom and 2.5GB RAM",
            "A:Yes you can play both these consoles using Gaming Mode for the best results.",
            "A:Yes technically you can. But don't expect the latency and frame rate to be smooth for high FPS game. It may end up looking sluggish.",
            "A:No, but this one has supreme UHD dimming",
            "A:The frame it comes with is an ordinary fixed type black frame. The optional detachable frames are separately sold and pretty expensive (not sure if they sell it in India).",
            "A:Nope it doesn't have , And Memc helps increase refresh rate from 60Hz to 120Hz,reducing the blur by inserting an artificial frame, whereas this TV default frame rate is 120Hz so Memc is not required.",
            "A:Primarily TV and Secondly Photo frame..It has feature to be use it as photo frame and build according to that..best picture quality you would get in this range on this TV",
            "A:no",
            "A:yes ...this tv gives shocks.....it's a manufacturing defect u can file case in consumer court for compensation and claim to replace tv via warranty also",
            "A:You can buy the model right now, there will not much difference in specification, as the product have maximum features when compared to other premium brands.",
            "A:Yes and you cast youtube natively from your phone also",
            "A:This TV support HDR10+, Dolby Audio, whereas Dolby Vision is not supported.",
            "A:yes for sure",
            "A:yes",
            "A:Jio TV doesn't have to do anything with a TV. It will support. Most TV these days will support Jio TV",
            "A:Ya sure if you have dolby atmos soundbar you will get Dolby atmos output.",
            "A:Yes",
            "A:its Motion Rate is 200 you can check on official website which means 100Hz display. It is not 120Hz. as 1 motion rate = 0.5 hz. And for 120Hz it should be 240. that's why it is not a 120hz panel.",
            "A:2019",
            "A:Yes... It has motion sensor too, it will turn on and off automatically when yu r in frame mode... Yu can see settings in art mode.. Try it and it works for me",
            "A:Samsung do not have or support DOLBY VISION. Yet, it has HDR 10 and Dolby audio",
            "A:No. This is not an android TV. It runs on Samsung Proprietary operating system called Tizen. However, it supports most popular steaming apps including prim e, hotstar, zee5 etc.",
            "A:On TV go to Settings>General >Apple AirPlay Settings>AirPlay ON. Use Code. On IPhone go to Control Center Click arrow on right side of Music and/or Screen Mirroring Done. Enjoy IPhone connected.",
            "A:Yes it works, Bixby takes time to understand command, eventually you ll get fed up and change your channel by remote.",
            "A:Yes, 60Hz. YouTube HDR bt2020 is also supported on 4K",
            "A:no",
            "A:yes",
            "A:1AMP",
            "A:It’s not Andriod tv. The os runs on this tv is Tizen",
            "A:No it doesn't have built in set top box. many get confused as it has one connect box, i was too but after receiving the tv confirm that.",
            "A:Yes You Can But the Real time Response is late so you can't enjoy the game.But with PC its fantastic it has 100hz refresh rate with radeon antilag and free sync but you should have an amd GPU.",
            "A:Yes, of course. I have xbox one x and it worked as expected. The TV is smart enough to detect when xbox is switched on even when the TV is in off (frame) mode.",
            "A:No. You need to buy that if you want.",
            "A:Minimum 6 feet is preferrable for better watching experience",
            "A:This is having true OLED system of light the display panel. Same as what LG tvs have. Samsung calls the technology as QLED. That’s all.",
            "A:i think samsung q 60 r tv is a better product as frame tv has many flaws",
            "A:It has smart remote control",
            "A:This Samsung Frame Tv is a 2019 model",
            "A:No",
            "A:Edge LED TV",
            "A:That's \"One Connect\" box. All the connections to the TV has to be given here. There would not be any connections to the TV directly.",
            "A:Depends on your usage",
            "A:2019",
            "A:pictures Quality is awesome .. you can adjust the brightness and backlight to get perfect picture in dark scenes. very rarely you will missing having full array and dimming",
            "A:upscaling feature is very nice 4k movies look amazing on this tv. go for it",
            "A:Yes but only from Samsung store apps not android apps",
            "A:Yes but it would be difficult to use as the screen is too big",
            "A:NO Its QLED",
            "A:Yes, there are no manual buttons, Remote is mandotory !!",
            "A:Good punchy colors,120hz refresh rate. 40 watt sound. Min1080p content on NETFLIX, AMAZON suits. You need 25 MBPS speed internet for best experience. AUTO MOTION best for movies and not for sports.",
            "A:we can display our personal art work also. you have to upload the pic in the TV album.",
            "A:No",
            "A:about 2 inches from the wall and 0 gap.",
            "A:yes, you can!",
            "A:You can make it fully stick, or make a gap it depends on you which one you choose",
            "A:Unfortunately it won't... It's just like a screen saver on windows computers.",
            "A:yes",
            "A:turn intelligent mode on and set the picture to dynamic quality",
            "A:no doesn't have any light bleeding issue",
            "A:yes till 120-140 degrees.",
            "A:Yes",
            "A:I am staying in mumbai, here no fluctuations in power supply, so we don't need.",
            "A:Yes",
            "A:No",
            "A:I too have same effect. I even changed the pin polarity to the plug to see whether it stops. But same effect.",
            "A:We have a remote PC option where you can connect the PC / laptop to the TV.",
            "A:Blutooth-yes. Metal frame.",
            "A:yes",
            "A:yes it has bluetooth from which u can connect soundbar, headphone n speaker",
            "A:Yes",
            "A:yes ..",
            "A:3 options:- a) Hit the Bibxy button and tell the channel number in numeric (not very impressive) b) push the channel button upwards from the remote c) Hit button '123' in remote and key in channel no.",
            "A:YouTube, hotstar,sunnxt ,netflix,sonyliv, Amazon prime are working fine",
            "A:yes",
            "A:in d box",
            "A:Its QLED, Check the same content in UHD tv so u can easily figure out. Make sure to have good internet speed.",
            "A:I installed the \"Samsung Smart Things\" app on my smartphone and its working smoothly as an additional romote.",
            "A:Wall mounting quality is good. The stability depends on your wall or the structure where you want to fix it. If your structure can handle the bass at max level, the wall mounting certainly will.",
            "A:yes",
            "A:This is A+ panel with fair less reflections than regular ones as it's qled instead of traditional led",
            "A:yes...and it compatible with almost all bluetooth devices",
            "A:If you mean instead of wall mount, you want to install it on a tabletop, then yes, pair of table stands are provided inside the box. Be aware you need a wide table (at least 44 inches).",
            "A:no it has its own app store from samsyng",
            "A:you will get 8gb of storage and you will found almost all the apps in the app Store.",
            "A:it's not an android TV.its tizen OS.less space not recommended to install extra apps",
            "A:yes",
            "A:2019",
            "A:no",
            "A:one connect is not inbuilt.",
            "A:Yes it does",
            "A:more than 2 mts",
            "A:no",
            "A:yes",
            "A:yes",
            "A:For wall mount : 42\" inches from ground to centre of the tv or above, but below is not recommended,..( For stand legs Yu can get more information in you tube.. Mostly it is user preference..)",
            "A:Why would one look for subwoofer at first place in a TV. It has got respectable sound quality though. Any 15K to 25K sound bar will produce far superior sound that finest speakers built into TV.",
            "A:It is easily compatible with my Seagate and WD 1 and 2TB HDD. The ports should be 3.0 as I never faced any latency in the content being read from the HDD unless Its a massive 4K HEVC movie file.",
            "A:No",
            "A:4000 nits....",
            "A:2GB only",
            "A:home theater/ avr can be connected through HDMI/optical port",
            "A:definitely yes",
            "A:There are no HDMI 2.1 port in 2019 version. Only 2.0 ports. It supports 120hz at 1440P and 60hz at 4K",
            "A:yes support",
            "A:no",
            "A:yes. suberb picture quality",
            "A:you get table stand as well as no gap wall mount",
            "A:very good, meets my expectations",
            "A:no",
            "A:2 way wifi? You mean casting TV screen to smartphone & vice versa? It's there. By magic remote you mean operable from anywhere? Yeah it can be operated even from other room. It has Bixby, not great.",
            "A:It is 2019 model. 2020 is yet to be launched in India",
            "A:So yes .HD too but not as Sony .The pride is half of sony so its worth it",
            "A:yes nice good",
            "A:included",
            "A:yes it does .",
            "A:I have Tata Sky at home, but I think any other set top box should work fine.",
            "A:no, it has art mode.",
            "A:No",
            "A:5 by 16 inches",
            "A:in all formats. Any format which can't be played will not even get detected through pendrive.",
            "A:yes",
            "A:It's available on technical details",
            "A:I did not noticed it. After posing your question I checked but not observed any heating issues",
            "A:2gb",
            "A:Yes",
            "A:yes",
            "A:No.",
            "A:ofcourse qled because it is more advanced and a different technology altogether.",
            "A:yes",
            "A:yes Dolby Atmos 2.2, with 40 watt speakers"
        ],
        "likes": [
            "60",
            "54",
            "60",
            "2",
            "2",
            "7",
            "3",
            "1",
            "3",
            "24",
            "12",
            "7",
            "4",
            "0",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "3",
            "1",
            "2",
            "2",
            "10",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "2",
            "2",
            "1",
            "0",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "27",
            "15",
            "8",
            "22",
            "22",
            "4",
            "4",
            "0",
            "0",
            "1",
            "2",
            "2",
            "1",
            "26",
            "0",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "1",
            "4",
            "2",
            "2",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "21",
            "21",
            "25",
            "1",
            "0",
            "2",
            "0",
            "1",
            "0",
            "17",
            "6",
            "3",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "9",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "7",
            "2",
            "0",
            "12",
            "8",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "5",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "5",
            "3",
            "2",
            "8",
            "8",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "34",
            "0",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "7",
            "3",
            "7",
            "3",
            "3",
            "5",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "1",
            "2",
            "0",
            "0",
            "5"
        ]
    }
}