{
    "title": "CloudWalker Cloud TV 109 cm (43 inch) Full HD LED Smart TV  (CLOUD TV 43SF)",
    "product_specification": {
        "In The Box": "Remote Control\n2 AAA Batteries\nUser Manual\nWarranty Card\n1 Unit LED TV",
        "Model Name": "CLOUD TV 43SF",
        "Display Size": "109 cm (43 inch)",
        "Screen Type": "LED",
        "HD Technology & Resolution": "Full HD, 1920 x 1080",
        "Series": "Cloud TV",
        "Smart Tv": "Yes",
        "Motion Sensor": "No",
        "HDMI": "2(Bottom)",
        "USB": "Side",
        "Wi-Fi Type": "In-built Wi-Fi",
        "Built In Wi-Fi": "Yes",
        "Launch Year": "2017",
        "Contrast Ratio": "4000:1 (Static) (Static)",
        "Picture Engine": "XLuminous",
        "Panel Type": "IPS Panel",
        "LED Display Type": "DLED",
        "Aspect Ratio": "\"16:09\"",
        "Refresh Rate": "60 Hz",
        "Number of Speakers": "2",
        "Sound Technology": "Dolby Digital Sound",
        "Surround Sound": "Yes",
        "Speaker Output RMS": "8 W x 2",
        "Sound Mode": "Music, Theatre, News, User, Standard",
        "Other Audio Features": "Audio Equaliser\nAdjustable Audio Modes\nAutomatic Volume Control",
        "Number of Cores": "2",
        "Processor": "CPU - Cortex A7",
        "Graphic Processor": "GPU - Mali 400",
        "Ram Capacity": "1 GB",
        "Storage Memory": "8 GB",
        "Clocking Speed": "1.2 Ghz",
        "Supported App - Netflix": "Yes",
        "Supported App - Youtube": "Yes",
        "Supported App - Disney+Hotstar": "Yes",
        "Supported App - Others": "All App on Google Store",
        "Supported Mobile Operating System": "Android/iOS",
        "Operating System Present": "Yes",
        "Operating System": "Android Based",
        "Screen Mirroring": "Yes",
        "App Store Type": "Google App Store",
        "3G Dongle Plug and Play": "No",
        "Ethernet (RJ45)": "1",
        "Other Internet Features": "Regular Software updates by OTA, C-Share interface for Mobile content & Mobile remote, Smart Search: Search Online Videos on TV, Free Content Discovery Engine, Downloads & Plays Android Apps like YouTube, Netflix, Hotstar, Amazon Prime, ShowBox, MoviesHD etc, Android 4.4",
        "Touch Remote": "No",
        "Power Requirement": "AC 100 - 240 V, 50/60 Hz",
        "Power Consumption": "75 W, 0.5 W (Standby)",
        "Width x Height x Depth (without stand)": "972 mm x 565 mm x 92 mm",
        "Weight (without stand)": "7 kg",
        "Width x Height x Depth (with stand)": "970 mm x 206 mm x 616 mm",
        "Weight (with stand)": "8.5 KG",
        "Warranty Summary": "1 Year CloudWalker Warranty",
        "Covered in Warranty": "All Parts including Labour Charges",
        "Not Covered in Warranty": "As per warranty policy mentioned in warranty card",
        "Warranty Service Type": "On-site",
        "Installation & Demo Details": "1. Covered Under Standard Installation - Table Mounting Using Standard Stand Supplied as Accessory with TV - Extra Charges are Applicable for Wall Mounts as, Rs. 399 for 32 inch Display Size and Rs. 499 for >32 inch Display Size - Connecting with Available Power Source (within 1 Meter) - Connecting / Setting Up Various Available Input Source for Audio Video Based on Model - Connecting with Available WiFi (for Smart TV) - Checking TV for Proper Functioning - Demonstration of the TV and its Features"
    },
    "product_description": {
        "Full HD Resolution": "A Full HD resolution of 1920x1080 pixels means you can immerse yourself in movies for a quality viewing experience.",
        "XLuminous Display": "Enjoy stunning visuals provided by the clear and sharp XLuminous display. Also, the DCTI/DLTI technology provides rich and vivid colours.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "4",
            "4",
            "4",
            "4",
            "1",
            "5",
            "5",
            "5",
            "1",
            "1",
            "4",
            "4",
            "4",
            "4",
            "1",
            "5",
            "5",
            "5",
            "1",
            "1",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "1",
            "5",
            "1",
            "1",
            "5",
            "4",
            "2",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "2",
            "3",
            "3",
            "5",
            "1",
            "3",
            "5",
            "5",
            "3",
            "5",
            "1",
            "1",
            "1",
            "5",
            "4",
            "1",
            "5",
            "1",
            "5",
            "4",
            "5",
            "1",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "1",
            "1",
            "1",
            "5",
            "5",
            "5",
            "1",
            "3",
            "4",
            "4",
            "5",
            "4",
            "5",
            "1",
            "1",
            "5",
            "5",
            "1",
            "3",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "2",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "3",
            "2",
            "5",
            "5",
            "2",
            "2",
            "3",
            "5",
            "3",
            "5",
            "4",
            "1",
            "1",
            "4",
            "3",
            "4",
            "5",
            "1",
            "1",
            "1",
            "2",
            "5",
            "1",
            "2",
            "4",
            "3",
            "5",
            "3",
            "1",
            "3",
            "4",
            "2",
            "5",
            "5",
            "1",
            "3",
            "4",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "1",
            "1",
            "5",
            "4",
            "5",
            "1",
            "3",
            "4",
            "4",
            "4",
            "4",
            "3",
            "5",
            "1",
            "5",
            "5",
            "2",
            "4",
            "3",
            "5",
            "4",
            "3",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "1",
            "1",
            "5",
            "5",
            "1",
            "2",
            "1",
            "5",
            "1",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "1",
            "4",
            "5",
            "4",
            "5",
            "2",
            "4",
            "5",
            "4",
            "5",
            "1",
            "5",
            "4",
            "5",
            "5",
            "1",
            "4",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "3",
            "4",
            "1",
            "1",
            "1",
            "2",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "1",
            "4",
            "5",
            "4",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "2",
            "2",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "3",
            "5",
            "4",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "1",
            "1",
            "4",
            "5",
            "4",
            "5",
            "1",
            "5",
            "3",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "3",
            "1",
            "4",
            "1",
            "5",
            "4",
            "1",
            "4",
            "2",
            "5",
            "1",
            "5",
            "1",
            "1",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "1",
            "5",
            "1",
            "5",
            "1",
            "1",
            "4",
            "5",
            "2",
            "4",
            "4",
            "5",
            "4",
            "4",
            "4",
            "3",
            "4",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "3",
            "3",
            "4",
            "4",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "1",
            "5",
            "4",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "1",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "2",
            "5",
            "4",
            "4",
            "5",
            "2",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "4",
            "2",
            "5",
            "5",
            "1",
            "1",
            "2",
            "4",
            "1",
            "3",
            "5",
            "3",
            "5",
            "5",
            "2",
            "4",
            "4",
            "3",
            "3",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "3",
            "1",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "3",
            "5",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "5",
            "1",
            "4",
            "1",
            "1",
            "1",
            "1",
            "4",
            "1",
            "1",
            "1",
            "5",
            "5",
            "5",
            "2",
            "4",
            "4",
            "5",
            "5"
        ],
        "review": [
            "First of all I would say this TV is a bang for the money. I thought a lot before getting this TV but I finally took a bold step. First impression was amazing. It's far from perfect but good enough to let other smart TV's look worthless. YouTube works perfect, apps like showbox, google chrome, yupp tv, hotstar everything works seemlessly. Build quality is average, mouse pointer needs improvement, sound quality is good, picture quality is very good. Having said that, this TV needs a lot of improvements, haven't encountered any bugs till now but there is a slight lag on heavy usage. Screen mirroring is is very laggy, I found a lag of upto 3seconds which is too much. But when YouTube and other apps work seemlessly, I don't really need to use screen mirroring. Cloud TV remote app (Android) is good, does lot more than what you'd expect. If you are looking for a smart TV in budget, this thing will not let you down. Definitely a thumbs-up from my side.",
            "Awesome tv, its value for money, great picture quality, great smart features, smart remote with air mouse is very useful, I would have happily given 5 star to this product but reduced rating because some times remote stop working and have to restart the tv to get its working gain don't know whether its software problem or remote prob or prob with tv sensor.",
            "Date: 03/09/2017\nDon't buy this TV from Flipkart. Haven't used the product (CloudWalker 43inch Full HD Smart TV) and can't comment on the performance and quality. Basic parts were missing and the installation could not happen as expected. That shows the Quality of the company and the product.\n\nThere are no positives and I only have negative comments. I would give the rating as (- 5*)\nHere are my concerns:\n1) The product was not delivered as per the scheduled time. I was supposed to get the product before 12PM and I got the product finally around 5PM after making 20+ calls to Flipkart.\n2) The worst part stars from here: Technicians came around 7PM and opened the box and found out that TV stand was missing and they could not install the TV.\n3) I had to make another 20+ calls to Flipkart for the missing part. They said it is not their problem and I have to ask Cloudwalker (the TV maker) for the missing parts.\n4) I called Cloudwaker support and they asked me to sort this out with Flipkart for a replacement TV.\n5) Flipkart team said they don't have the stock and I had to wait until I get the replacement TV. They even denied to refund the amount saying there is no defect in the product and its just a missing component.\n6) Now I have the CloudWalker 43Inch Full HD Smart TV (The so called SMART) which is of no use and Flipkart customer service team in not ready to take the TV and provide the refund.\n7) I wasted almost 1.5 days of my energy taking to Flipkart and Cloudwaker service team for an explanation which resulted in just a waste of time. I literally had to fight with Flipkart customer support team for a full refund which they said it will take 4 to 5 business days for them to arrange for a pickup and then do the refund. Now I have to wait for few days for Flipkart to pick the defective TV and get the refund processed.\n8) Overall my experience with Flipkart and The CloudWalker TV is horrible. I will never buy anything from Flipkart agin and will also deactivate my account soon.\nDate:03/10/2017:\nI have changed the rating from -5* to 4* now. This rating is not for Flipkart but for the CloudWalker TV.\n\n1) Filpkart team was not ready to help me with the missing part and said it will take 3 to 5 business days to get a replacement TV. Once the sale is done, they don't care about the customers.\n2) They never tried to resolve my issue and instead they canceled my order and initiated the refund and pickup of my TV from my house. Looks like Flipkart's intent was not to sell this TV.\n3) In the meantime, I got a call from Cloudwalker head office and they assured to send the missing part by expedite shipment and apologized for the inconvenience caused.\n4) Customer support from CloudWalker is extremely awesome. They would have called me at least 10 times and apologized for the missing part.\n5) They sent the technician to my house immediately to help me get the TV wall mounted in less that 2hrs time.\n6) It was like a running commentary where they were updating me on the status. I was in office and they were constantly updating me on the installation progress.\n7) It is so unfortunate that they are not selling the product directly or through other sites.\n8) Coming back to the TV. Picture quality and sound quality is really good. However, it takes more than a minute to boot. this is definitely a negative one.\n9) Documentation / user manual is not clear and its really difficult to change the password of the user. Still figuring it out. Have to call them and get a quick overview again.\n10) As mentioned earlier, my 4* rating is for CloudWalker and It will always be -5* for Flipkart.\n\nWill provide more feedback on the product in the coming weeks.",
            "Very good smart TV...few features needs upgradation:\n1) It takes long startup time.\n2) It starts on home screen but as we normally watch Set top box which is on AV input...so by default it should start in AV input where it was switched off.\n3) While watching YouTube or USB picture controls are disabled and we cannot change colors,contrast etc.\nPlease do these modifications in software so that we the initial purchasers of this good TV can also be upgrade to new version.\nThanks",
            "I ordered the TV next day Flipkart delivered, as soon as delivered the engineer also came for installation. When the engineer opened the box the screen has broken. I was so disappointed. I called Flipkart and asked for replacement. That one took 5 days. I got a replacement TV for that also delivery and installation both came same time. When we open again the frame was not in the correct position. The engineer some how fixed. But I am not satisfied. So I asked for again replacement. But this time no option for replacement so they refund the amount and it took 5 days.\n\nSo the conclusion is Flipkart did wonderful job. They did amazing support to me. I am very much satisfied. But now I don't have TV so I can't say about the performance. But one thing I can say is packing should improve from Cloudwalker.",
            "I WAS SEARCHING FOR A SMART TV SINCE THREE MONTHS FINALLY DECIDED TO GO FOR THIS SMART TV ,\nI AM MUCH HAPPY WITH IT\nEASY TO USE OPTIONS TYPING BECAME VERY EASY WITH THE AIR MOUSE REMOTE,\nLARGE FULL HD SCREEN\nCLARITY WE CAN NOT COMPARE WITH BRANDS LIKE SONY LG SAMSUNG ETC BUT GOOD 4 OUTOFF 5\nMY ONLY DISAPPOINTMENT IS SCREEN MIRRORING WE CAN NOT DIRECTLY MIRROR OUR SCREEN\nTHE PHONE SHOULD BE COMPATIBLE AN CSHARE APP HAS TO BE DOWNLOADED. EXCEPT THAT\nSUPERB TV GO FOR IT YOU WONT BE DISAPPOINT.",
            "Excellent TV . Great built in feature. Use wall mount to enjoy the sound. Not tried the screen mirroring option till now. A best TV to buy",
            "Cloud walker is best TV for budget and clearity and smart view.its good for genuine us.i will raffer to buy frds.",
            "Honest review\nI have used this product for over 2 years\n\nCons\ndisplay has got a lot of dead pixels and spots...\nSpeaker is pathetic(output frequency for external speakers is also very low)\nBuild is very weak\nWifi strength is low about 30% lower than ordinary phone and laptop\n\npro\nit used to be cheap, but now way better options are available at the same price",
            "TV is working fine... but the service is very very bad... my TV remote not working... I complaint this to company... I ready to pay for new remote... but this company not ready to give me a new remote... without this tv remote how can I operator this smart TV... Stupid company... now support assistant also not respond my email... full silence...",
            "First of all I would say this TV is a bang for the money. I thought a lot before getting this TV but I finally took a bold step. First impression was amazing. It's far from perfect but good enough to let other smart TV's look worthless. YouTube works perfect, apps like showbox, google chrome, yupp tv, hotstar everything works seemlessly. Build quality is average, mouse pointer needs improvement, sound quality is good, picture quality is very good. Having said that, this TV needs a lot of improvements, haven't encountered any bugs till now but there is a slight lag on heavy usage. Screen mirroring is is very laggy, I found a lag of upto 3seconds which is too much. But when YouTube and other apps work seemlessly, I don't really need to use screen mirroring. Cloud TV remote app (Android) is good, does lot more than what you'd expect. If you are looking for a smart TV in budget, this thing will not let you down. Definitely a thumbs-up from my side.",
            "Awesome tv, its value for money, great picture quality, great smart features, smart remote with air mouse is very useful, I would have happily given 5 star to this product but reduced rating because some times remote stop working and have to restart the tv to get its working gain don't know whether its software problem or remote prob or prob with tv sensor.",
            "Date: 03/09/2017\nDon't buy this TV from Flipkart. Haven't used the product (CloudWalker 43inch Full HD Smart TV) and can't comment on the performance and quality. Basic parts were missing and the installation could not happen as expected. That shows the Quality of the company and the product.\n\nThere are no positives and I only have negative comments. I would give the rating as (- 5*)\nHere are my concerns:\n1) The product was not delivered as per the scheduled time. I was supposed to get the product before 12PM and I got the product finally around 5PM after making 20+ calls to Flipkart.\n2) The worst part stars from here: Technicians came around 7PM and opened the box and found out that TV stand was missing and they could not install the TV.\n3) I had to make another 20+ calls to Flipkart for the missing part. They said it is not their problem and I have to ask Cloudwalker (the TV maker) for the missing parts.\n4) I called Cloudwaker support and they asked me to sort this out with Flipkart for a replacement TV.\n5) Flipkart team said they don't have the stock and I had to wait until I get the replacement TV. They even denied to refund the amount saying there is no defect in the product and its just a missing component.\n6) Now I have the CloudWalker 43Inch Full HD Smart TV (The so called SMART) which is of no use and Flipkart customer service team in not ready to take the TV and provide the refund.\n7) I wasted almost 1.5 days of my energy taking to Flipkart and Cloudwaker service team for an explanation which resulted in just a waste of time. I literally had to fight with Flipkart customer support team for a full refund which they said it will take 4 to 5 business days for them to arrange for a pickup and then do the refund. Now I have to wait for few days for Flipkart to pick the defective TV and get the refund processed.\n8) Overall my experience with Flipkart and The CloudWalker TV is horrible. I will never buy anything from Flipkart agin and will also deactivate my account soon.\nDate:03/10/2017:\nI have changed the rating from -5* to 4* now. This rating is not for Flipkart but for the CloudWalker TV.\n\n1) Filpkart team was not ready to help me with the missing part and said it will take 3 to 5 business days to get a replacement TV. Once the sale is done, they don't care about the customers.\n2) They never tried to resolve my issue and instead they canceled my order and initiated the refund and pickup of my TV from my house. Looks like Flipkart's intent was not to sell this TV.\n3) In the meantime, I got a call from Cloudwalker head office and they assured to send the missing part by expedite shipment and apologized for the inconvenience caused.\n4) Customer support from CloudWalker is extremely awesome. They would have called me at least 10 times and apologized for the missing part.\n5) They sent the technician to my house immediately to help me get the TV wall mounted in less that 2hrs time.\n6) It was like a running commentary where they were updating me on the status. I was in office and they were constantly updating me on the installation progress.\n7) It is so unfortunate that they are not selling the product directly or through other sites.\n8) Coming back to the TV. Picture quality and sound quality is really good. However, it takes more than a minute to boot. this is definitely a negative one.\n9) Documentation / user manual is not clear and its really difficult to change the password of the user. Still figuring it out. Have to call them and get a quick overview again.\n10) As mentioned earlier, my 4* rating is for CloudWalker and It will always be -5* for Flipkart.\n\nWill provide more feedback on the product in the coming weeks.",
            "Very good smart TV...few features needs upgradation:\n1) It takes long startup time.\n2) It starts on home screen but as we normally watch Set top box which is on AV input...so by default it should start in AV input where it was switched off.\n3) While watching YouTube or USB picture controls are disabled and we cannot change colors,contrast etc.\nPlease do these modifications in software so that we the initial purchasers of this good TV can also be upgrade to new version.\nThanks",
            "I ordered the TV next day Flipkart delivered, as soon as delivered the engineer also came for installation. When the engineer opened the box the screen has broken. I was so disappointed. I called Flipkart and asked for replacement. That one took 5 days. I got a replacement TV for that also delivery and installation both came same time. When we open again the frame was not in the correct position. The engineer some how fixed. But I am not satisfied. So I asked for again replacement. But this time no option for replacement so they refund the amount and it took 5 days.\n\nSo the conclusion is Flipkart did wonderful job. They did amazing support to me. I am very much satisfied. But now I don't have TV so I can't say about the performance. But one thing I can say is packing should improve from Cloudwalker.",
            "I WAS SEARCHING FOR A SMART TV SINCE THREE MONTHS FINALLY DECIDED TO GO FOR THIS SMART TV ,\nI AM MUCH HAPPY WITH IT\nEASY TO USE OPTIONS TYPING BECAME VERY EASY WITH THE AIR MOUSE REMOTE,\nLARGE FULL HD SCREEN\nCLARITY WE CAN NOT COMPARE WITH BRANDS LIKE SONY LG SAMSUNG ETC BUT GOOD 4 OUTOFF 5\nMY ONLY DISAPPOINTMENT IS SCREEN MIRRORING WE CAN NOT DIRECTLY MIRROR OUR SCREEN\nTHE PHONE SHOULD BE COMPATIBLE AN CSHARE APP HAS TO BE DOWNLOADED. EXCEPT THAT\nSUPERB TV GO FOR IT YOU WONT BE DISAPPOINT.",
            "Excellent TV . Great built in feature. Use wall mount to enjoy the sound. Not tried the screen mirroring option till now. A best TV to buy",
            "Cloud walker is best TV for budget and clearity and smart view.its good for genuine us.i will raffer to buy frds.",
            "Honest review\nI have used this product for over 2 years\n\nCons\ndisplay has got a lot of dead pixels and spots...\nSpeaker is pathetic(output frequency for external speakers is also very low)\nBuild is very weak\nWifi strength is low about 30% lower than ordinary phone and laptop\n\npro\nit used to be cheap, but now way better options are available at the same price",
            "TV is working fine... but the service is very very bad... my TV remote not working... I complaint this to company... I ready to pay for new remote... but this company not ready to give me a new remote... without this tv remote how can I operator this smart TV... Stupid company... now support assistant also not respond my email... full silence...",
            "..\n1, Ecart logistics is worst carrier. No *\n2, Installation done as per schedule 5*\nProduct details..\n\n1, Remote is pretty good 5*\n2, Panel is worst. Just like cheap. 1*\n3, Not a great picture quality.. Just like HD Not full HD.\n4, Voice (speaker) worlds Worst worst worst Audio, Audio out also. Not supporting with my multimedia speakers n my headphones too. Unable to listen dialogs clearly.. My CRT TV Is 100000 times better than cloud walker. - 1000*\n\n\n5, there is screen mirror option. Options is there actually.. But not connected with my MI NOTE 4.\n.\n\nFRIENDS Finally m telling.. If this TV Comes with below 20k then proceed other wise just keep away..",
            "ordered this 43 smart tv on 8th April 2018 got it on 11 April at Hamirpur HP but found its screen broken....after 20 days process of return & replacement finally got new Smart tv on 1st May 2018....jeeves engineer provide good service of free installation & Demo......Picture quality excellent....Sound is good...mirror cast good....Android version old 4.2...and U tube & remote mouse also not works...properly.....But overall its good purchase in this price......",
            "Though I wasnt sure about investing any money in a new brand.. i was pleasantly surprised by the specs on this TV. The superb part was the service displayed by Flipkart.. I ordered the TV at 8 pm and it was there at home the next afternoon before 1.. Simply superb.\n\nThough its been just a day since it arrived, I am enjoying the smart features it provides. The picture clarity is very good and sound could have been much better. However, plug it into a home theatre system and you have the problem solved. The interface is easy to understand too.\n\nAll in all, happy with the product quality and the service extended. Totally value for money.",
            "Initially felt its a risk in buying this product though specs are competitive but here are my first impressions, Pre-purchase technical support from \"cloudwalker\" customer care is good and flipkart one-day delivery, installation without any further delays felt company's effort in positioning their product.\n\nComing to the product-\n1) Product packaging & Build quality is decent.\n2) Picture & Sound Quality stands up to the expectations\n3) Smart features are really cool\n4) Super Remote really complements this product\n5) Technical support from CloudWalker in understanding TV features are pretty impressive (Called once, Support from second line support executives made really understand the features well).\n\nNegatives:\n1) Documentation needs to be improved to really understand how to use the features effectively.\n\nOver all recommended product at positioned price & initial impressions are good and happy with product.\n\nHope product will be reliable and wish to see the same level of customer support in long-run.",
            "After looking at some reviews and with a cramped budget in my pocket. I wanted to buy a TV that would provide me a good display, decent sound and fantastic smart features offered by big players in this segment. It satisfied all of them within my budget.\nPicture : 4/5\nSound : 3.5/5\nWorth a buy considering the above ratings. Hope this helps for the buyers. Happy Entainment !!!",
            "Well this one is a beast... Just like beauty n the beast...\nLED screen clarity is superb.. full hd videos play well... I feel each n every scene beautiful in my new TV\n\nPros:\nLED screen is good\nPicture quality awesome\nPlays almost all format videos\nName of TV is eye catching\nCDE engine is good\nU can install any apps\nSound is ok I wud give 5/10 becas no woofer built in\nAll SD and HD channels come very nicely\n\nCons:\nSound technology needs improvement\nRam is less\nSometimes slow\nAirmouse sometimes stucks....So need restarting\nNo brandname so feared abt warranty..But Indian company so I purchased\n\nSo to conclude give a try.... U will like it for sure...",
            "very nice and clear picture and sound good connectivity. my smartest TV and very fast service by FLIPKART and JEEVES thank you so much..... FLIPKART.",
            "This is the honest review that you can trust and rely on.\nIt is a budget tv at range of 28k full hd led tv\nIt is loaded with features like air mouse, smart features like in built wifi and apps.\nBut the loading and buffering is time consuming and on youtube app it maximum plays at 720p only\nThe remote control consumes alot of battery, my fresh battery provided by the company got over in first 7 days of use as the bluetooth feature of air mouse consumes it.\nNow ive put a pair of Duracell batteries. Hope they last long enough ! FingersCrossed\nIt provides 2 HDMI slots & 2 USB slots out of which 1 is permanently gonna be used and blocked by air mouse receiver port.\nThe corners and surrounding of tv panel is plastic low quality built so its quite sensitive and gets scratched easily if contacted by sharp objects like I got my corner of tv scratched by a slight touch of my wrist watch.\nAnyways all in all\n28k is totally worth the price.\n2 days before the promised date it was delivered and installed.\nSo please buy if you have a tight budget.\nMy views on:\nDisplay : 4/5 ( Theres slight backlight bleed, its not pitch dark like the quality you get on Sony or LG or Samsung product, but an acceptable one due to the company and price range)\nSound : 4/5 ( Total of 100 volume bar, I dont need to cross 60 as I have installed the tv in my room and its quite decent and loud and clear)\nUser Friendly : 5/5 ( Due to access of fast and quick air mouse)",
            "Superb! Everything is great in 30k what else you need, clearity is also good on non hd, sound is nice but not up to the mark overall good product with less price.",
            "The picture and sound quality of the TV is great. Very handy remote. Truly a smart remote. Air mouse functionality makes internet browsing very easy. Totally satisfied with the product",
            "Working good, but RAM is 1GB so not use with that much of speed as our smart phone.\nAnd there is no ftr for transfer data from pendrive however it has a 8 gb internal memory for store any download item direct from tv browser or tv play store.\nAs a smart TV it is good.",
            "My first full hd smart tv ....cshare app is good but cant browse external storage from phone...1080 video through mob is not good. From pendrive videos are good. Cde is ok but i dont think we use it mostly. Youtube app is good but other apps such as sony tv , voot tv quality s not good ....in tata sky hd the clarity is good ....i hope i addressed most of the things here .....and see that the viewing distance is more than 9 ft otherwise its not that good",
            "Well this one is a beast... Just like beauty n the beast...\nLED screen clarity is superb.. full hd videos play well... I feel each n every scene beautiful in my new TV\n\nPros:\nLED screen is good\nPicture quality awesome\nPlays almost all format videos\nName of TV is eye catching\nCDE engine is good\nU can install any apps\nSound is ok I wud give 5/10 becas no woofer built in\nAll SD and HD channels come very nicely\n\nCons:\nSound technology needs improvement\nRam is less\nSometimes slow\nAirmouse some...",
            "Good tv. Best tv in this budget range. Androids is brilliant can download any app from play store. Picture and sound quality good. Only prob I faced is there is a lag in the screenmirror with iPhone. Overall best android tv HD quality is that if Sony. Please go for it. This has Apple TV inbuilt. Smartest tv.",
            "I was looking to buy SMART / Android TV and did a lot of research before nailing down to CloudWalker.\nPlease don't get confused between SMART and Android TV. SMART may not be Android but Android would be SMART :-)\nI had visited various Electronic showrooms where i could find other Android TV which priced around 50K+.\n\nOther options?\n\nBuy normal LED FHD TV + casting device\n\nIn the same budget i was getting CloudWalker with Built-In WIFI with Android OS (8 GB storage +1 GB RAM).\n1+1 year warranty gave me confidence, in case anything happens to TV as other bands (Sony, LG) was only giving 1 year warranty.\nFK delivered TV on time but installation vendor Jeevas took time /multiple follow-ups to get it installed.\nLikes\n======\n- Android OS\n- Out of 8 GB , 5GB storage is available for installing Apps which is enough for TV.\n- Colors, brightness, contrast is good.\n- Switching between Apps and TV is easy.\n- AirMouse - This gives flexibility is using mouse in any direction.\n- Cshare Apps - You can Cast Media files, Control TV using Mouse and use phones Keyboard, open Apps, Cast Camera on TV, Mirror TV on phone.\n- Support - I am impressed with support provided by CloudWalker team. They quickly answered my queries and helped a lot.\nDislikes\n========\n- Poor Packaging - There was no bubble wrap and protection on FRONT and BACK side of TV in box.\n- Poor TV manual- It did not had steps for configuring TV and explaining the features. its very basic.\n- One USB port blocked for AirMouse USB dongle. So you will only have 1 USB available for use.\n- TV boot time is around 50-1 min sec.\n- USB ports are located on back right side of TV, so its difficult to access port - I am thinking to buy a USB extension cable for same.\n- Outdated Android version ( this comes with Android 4.4 where other brands are at least running on Android 5.5)\n- Less RAM - 1 GB feels bit less when you try to close Apps / open Apps but its manageable.\n- Slow Casting mobile screen to TV using Cshare.\n-\n\nTips\n====\nPicture and Sound -\nIf you are like me who found TV screen is very bright then you can define the Brightness, Contrast, Colors\n- Select TV AV option on remote\n- Now look for button with 3 lines on remote below Volume keys on remote\n- This will open SCREEN SOUND options.\n- Select the User option and define the levels as per your preference.\nNow you can use this setting from remote using \"PictueMode\" ( 2nd row on remote)\nSimilarly you can adjust Bass , Treble Surround Sound etc from SOUND options. This has made lot of improvement when listening to Music and News.\n\nApps\n=====\nSo far i have HostStar, Voot , YTKids, TubiTV (HD quality English movie's).\nYou should have high speed Internet connection to enjoy Live Streaming on TV ( I am using 40 MBPS connection).\nIn this budget this is one of the best Android TV available in market. You need to be bit tech Savvy to fully understand and use this TV.",
            "good product, delivered in tym, installation completed in same day... picture quality is excellent , sound quality is average, over all under 25k, it's valuable product... Rating - 8/10",
            "Worth buying....after a lot of research i brought this tv really awesome....there is no second thought just go for it.\nFirst flipcart delivery really excellent...booked on 6th may got 7th may (sun).thanks to flipcart team.\nThe tv excellent features are air mouse facility and very good GUI interface...the remote is excellent features and very easy to access....\nOnly issues is sound its ok in this pricing segment...\nPicture quality really superb and smart option nice.\nWe really loved it the product thanks to cloudwalker team.",
            "I have used this TV for 5 days and i am reviewing about this product .\nThis TV is best TV in this price ..As we go to specifications..\nPicture quality is good\nSound is some what less as we connect home theater we can get rid that\nIf we want to cast screen we need to download an app and we should cast and in that app we can use it as keyboard,casting and etc..\nIn remote there is a wireless mouse facility which we need not purchase a wireless mouse.\nThis has internal memory 8GB which is more enough for TV\nBetter buy this TV ...Firstly after purchase we somewhat disappoint but after using some days we love this and we will be very happy....",
            "I am happy with the product . Demo was not appropriate and the person who came for demo was not technical sound and not able explain the things.\nSet up box technical team said your cloud TV needs software update whereas you can connect your TV directly. Currently we are pressing HDMI button all the time.\nRequest please send your technical person for proper demo and updation of software.\nRegards,\nNarayan",
            "After 1 month of use..\nPicture quality very nice..\nSound quality is ok..\nOne of the best feature of smart tv is screen mirroring bt you need two wifi devices at the same time to connect screenmirroring..\nAir mouse some time lag..\nWifi connection with tv is very nyc..\nOverall a good product at this price range apart from above mentioned issues..",
            "Wow...amazing.the best smart TV at the price.awesome quality.very happy with the delivery.delivery was on time.and TV was installed on the same day.here is my points for the following qualities.\nVideo quality=5/5\nAudio quality=4/5\nInternet access=5/5\nFeatures-5/5\nRemote connectivity-5/5\nThe best feature is air mouse",
            "Bought this TV because of the tag \"SMART TV\" ,But the only smart about this TV is the remote. it's one of the best smart remote on the market.\n\n- Buy this TV if you are to use it only for watching Dish TV channels.\n- Sound is average, Picture quality is not bad for its price.\n- BUT IF YOU HAPPEN TO BUY THIS TV INORDER TO USE INTERNET CONNECTIVITY THEN DON'T.. DON'T BUT IT !!!\n- Since the RAM is almost negligible the video that you can play online are never 1080p or HD, it will keep buffering on and on, Even after buffering the TV still takes time to process the video and play!\n- Normally a 4 minute HD music video will last a good 8minutes as it will keep buffering (Not because of Poor internet connectivity)\n- Moreover the Remote App which is suppose to work seamlessly from your smart phone ain't working. it just won't Pair.\n- The EXPERIENCE that I'm looking for in simply not there but then again if you only watch Dish channels and don't really use Internet on this TV then go for it.",
            "I would say that it is a very bad product. I am writing this review after an year of using this TV. All I would say about this TV is, it is cheap. Agreed. But is it worth it? Definitely not. Why? Let me first discuss about the pros. It has an exceptional air mouse (which also absorbs a lot of battery power, and hence be ready to change it frequently), it is android powered and hence almost all apps work good on this. The picture quality is average to good.\nNow lets come to the aspects which makes it bad. The sound is pathetic (I also find the same problem with almost all the Flat screen TVs). The wifi reception is very weak (Though my Wifi router is placed just beneath the TV). Every online video has a lag. Technically there all a lot of dropped frames. Hence watching online content in YouTube, Netflix or Hotstar is terrible. I notified this with the technical team. They were kind enough to even replace it with the new TV. I would bow down for the service that cloud walker did and the same to the flipkart service as well. But the problem was not with one TV. Every TV has the same problem.\nMy suggestion. If this TV was not Smart, I would have rated 4 stars.\nVerdict:\nGet a even bigger screen TV without smart features and invest on a ChromeCast.",
            "paisa WASOOL hai bhai.....in very low budget very smart tv...we are happy....thank you flipcart....instalation man also nice guy...he work properly on fitting tv on wall...thank you...",
            "Tv is all fine... Good features for a cheap price. The smart TV feature works fabulously. Response is fast. I am happy with the product. What I am unhappy about is no one came to install the TV at my place and I had to work everything myself. Hence disappointed a little with flipkart.",
            "The product is not not up to the mark all is good but sound quality is very much low and not clear picture quality is ok but is u want to use this tv with ur set top box then dont buy this bcoz the picture quality is not adaptive to set top box nor we can adjest in setting you have to see blure quality.",
            "I am loving it, big value for the money and features are very competitive.\nHD quality is nice and TV sound quality is not so great but with Samsung home theater it is coming nicely,,.\nflipkart delivered in 2 days and tooks 2 more days to get installed.\nbefore any one investing on big brands like Samsung/Sony/LG or Panasonic.. CloudWalker is best product I would say .",
            "I really like the product..Sound quality is so good..as well as the picture quality...air mouse works perfectly... medias run smoothly...a big thumbs up for this..best smart tv in a budget...Google Play Store allows you to download almost every apps onto your smart tv...I don't get why people run after Flagship Tv..like Sony Samsung etc..when you can get good smart tv in a budget..got the delivery on time..and the installation was done on the same day..thanks Flipkart for this experience.",
            "As a full HD Led TV, it works perfectly. The Smart TV option is alright, casting on screen has its lag issues and not many apps work as seamlessly. For the price range, it's a decent purchase",
            "good product valve for mane very nice sound is impree is low ather wise is good",
            "Purchased this TV some months ago and I am totally satisfied with the product. It's quality is very good and price is also reasonable. The clarity of the TV is just awesome. The sound quality is good. So if you are planning to buy a new TV you can surely go for this one.",
            "Best product ..value for money.\nPicture 4.5 * comparitevly sony 4.5 /5\nSound 4.5* as a led brilliant sound quality and doesn't needed speaker\nRemote is of good plastic\nOver all i recommend this to everyone",
            "Bought on 25th January 2018 for 25000rs\nUpto now running well all are good at this range for the best price.",
            "A decent TV in this medium prce range . As expected from its price not is not a premium product although it can add attraction to your drawing room just in little money .\n\nAbout sound quality -\nIt has 5 sound modes out of which one mode is the user mode where you can set every detail of the sound like bass , balance , treble etc . But even after many attempts and minor and major adjustment you will miss something in the sound clarity .\nIt means that the sound quality is ok . If its not very bad then its not a very good even.on a scale of 5 i would give 2 for sound quality.\n\nAbout pictures quality :-\n\n\"Amazing\" - Thats the one word for the picture quality. While watching this you would not feel that you are watching a budget tv . It will give you viewing experience like any other premium high end televisions.\n5 out of 5\n\nAbout smart function :-\nQuite simple and decent . Some apps may take time to load but they run almost smooth except for some certain situations.\n3/5",
            "Awesome in this price range good picture quality sound ok software has to improve Bluetooth is missing remote is good its having air mouse 🖱 overall quality is good flipkart sarvices is good but technical demo as to improve",
            "Best smart TV in this price range.Better than any other smart TV within this range.picture quality is also very good(don't want to compare with Samsung or similar brands as it's price is almost double).happy with this product.not giving 5 star only because I am using it for last few months and want to see it after 2 years as it has 2 years warranty.",
            "Flipkart always provide a very good service, product was delivered in excellent condition& demo also was provided as they mentioned. i gifted to my dad for new year he was so happy its very good for tgis price",
            "Very Good product in the range strongly recommend if budget is low, grate features pictures quantity is good , must go for it if you are looking smart TV in range of 30k 43\" Inc LED SMART TV I give ***** stars .",
            "I would like to thanks the cloud walker team who helped me a lot to solve my TV problem.One of the best service support I have ever seen....",
            "This tv picture quality is good .sound quality good. net connection is good work.and air mouse working is superb👍👍👍.this tv is a valu for money.\nThis tv perfectly work .",
            "I just used this new TV for 2 months now.. It's Damon good product. I give 5 starts for it bcz\n1. Every month software update\n2. After updating first I notice the sound quality is better now second mouse pointer is pretty faster now, no lag in interface\n3. I recommend use HD setup box to see better TV experience\n4. Use mx player for movies u watching\n5. More than 4 app open at a time of shows the interface lag\n6. We won't use after market app won't be able to installed in TV\n7. Bad lands game is awesome in playing in TV",
            "Best tv in this range , air mouse is the best feature looks like that we are on laptop , 1 gb ram and 8 gb internal good combination with cortex A7 processor runds on android os , display quality excellent , light weight , screen mirroring , make ur smart phone as remote with wifi connectivity , any android app runs , i was thinking about the brand as i was using sony but this tv is really good , in 25 to 30 thousands range, only speaker quality is not upto the mark",
            "Awesome Smart LED TV. Worth the money. Crystal Clear picture and Superb sound, Very nice output through 5.1 Sound System.\nEven you can compare these Smart TV with branded TV like Sony, Panasonic, Samsung. Must go for it.",
            "Right review pls read it is helpful to u I am from Gujarat ahmedabad first I say it is amazing TV sound excellent image 4/5 other smart TV option is very good don't afraid to buy online TV pls buy your money is safe cloud TV feel like you are in seven cloud c share app give u smart option bindass buy cloud TV thanks cloud Walker for give so much discounts really chapped. Fad ke mila",
            "I Don't know that how many years it works but features that it have Excellent connectivity to smart phone and smart remote Superb sound is all so tooooooo good.......",
            "Worth for money. This smart tv is amazing. Loving it. Good service . Please maintain this . Thanks you so much",
            "As per price tag very good andorid package with the tv feature.\nDisplay quality is good\nSound out of 10 i will give 7\nTv startup is slow takes same time as you will that you are starting an outdated smart phone.\nRest is all fine\nCloudwalker need to bring the update for tv of downloading all app and may can develop the update like we can attach camera to tv for skype or any video call.",
            "I have purchased cloudwalker tv last month. It is awesome. Worth it . I have analysis all brand tv in that I found better this tv. Sound-5/5, clarity 5/5, connectivity 4/5. Performance 5/5.\nIt is an INDIAN brand. I have proud of this product. Simple words Tv awesome.\n\nNote: Please check it properly, because my TV have one LED issue in corner. It is always glowing but not appearing issue. Need check the quality must.",
            "Great service given by cloud walker\n\nI have taken my time to write this review only to help people in understanding the pros and cons\n\nI have taken all the below mentioned issues with both flipkart n cloud walker and I received great response and service from them.\n\n\nyou can call the cloudwalker team with any of the below mentioned issues to try.. they will right away send a technician and help you with this.\n\nPros :\n\n1. Big tv, descent price\n2. CDE feature looks nice and very useful\n3. Wifi works great\n4. Tested Ethernet It works perfect.\n\nCons :\n\n1. Full HD doesnt work, in fact tv hangs a lot if you play any 720p videos.\n2. Air mouse stops working after few days",
            "Hi All\n\nI had done a decent research before taking the decision of buying Cloudwalker. As per the earlier reviews and comments had worried on negative comments. However as a tech savy want to give a try though it's a risk as of everything goes well I'll be having a out and out next generation smart TV at my home.\n\nFinally after using it for 2 months. I'm really impressed and satisfied.\n\nPros\n\nProfound Technology.. Next Generation Engineering\nGood Screen panel.. Spectacular quality and HD\nStu...\nREAD MORE",
            "Awesome one. Air mouse working fine. Good quality. Idea to buy a smart TV by Indian manufacturer worked well. Same smart TV cost expensive if go for LG, Samsung etc.",
            "1. Price is good for the bigger size smart TV.\n2. Looks is also good after installation on wall.\n3. Quality is ok for normal resolution video, HD videos are not seems looking good, clarity is not up to mark.\n(I played HD & Ultra HD hollywood movies but not satisfy with the resolution output)\n4. After installation the time on screen is re-set automatically...(when I set time it will change automatically after shutdown TV)\nDon't know why, need to call customer service.\n5. Sound is good for big hall. (I have 16ft hall room, but when I set sound to 30% - 40% its more than enough)\n6. Features also good.\n7. The service of Flipkart and Cloudwalker is also remarkable.\n8. The person from Cloudwalker team is so friendly and well manner.\n9. Packaging and installation also up to the mark.\n10. Hope for the best forward.",
            "Let me tell u one thing first i have bought this tv on credit card with no cost emi of 9 months..but at the time of purchase they showed me the emi chart was different but now the emi of each month is 300 rs more as per their emi.. this thing disappoint me.\nCome to review\nIt was delivered on 20 aug i have installed it by my own.\nPicture quality is good.\nRemote control is good having mouse capabilities too.\nSound quality is not upto mark but it might be good after wall mounting.. it's just placed on table so far so the sound is going backward.\nContent in inbuilt memory or usb drive play so well instead of online content like YouTube.\nScreen mirroring is too slow.\nOverall performance is good so 4 stars out of 5",
            "Received the product on 12th of August. Installation done on 14th.. Technician who came for installation was not that supportive, he just installed and went.. Features were not explained at all..\nPicture quality is not that good if we compare it with other brands like Sony or LG\nNoise gets added when you increase volume above 60 70.. but that much sound range is not require if u are using TV in home\nHappy with the features like TV mirroring, air mouse. Apps like Hotstar YouTube etc. you can use perfectly..\nWith budget of 30k, it's a good deal..",
            "HDMI has problem.. Many times loses connection... So again i hv to go tosourse menu and i hv to select HDMI 2 Option... Apps works very slow.. In laptop same video streaming runs through wifi mobile connectibity, but in tv keeps on buffering... Else quality is good must required hd connection... If u view SD channel that might look blurred.. It is not supporting all video formate, u hv to install application to run other formate... I hv install vlc but not checked formate. But avi formate not running in default player. Apps keep buffering so if u hv good net speed than only buy this tv.",
            "Hi, I bought thos product after analyzing so many things and took very bold dicison to go with cloud Walker. In first impression Delviery and installation was very good and after installation ease of use is also inpressive for cloud walker .This 43 inch Smart tv looks good and picture quality is very good comparing with other competitive companies in this price range. Its Air mouse is awesome .\nSound quality is also good .the only chellenge to use phone mirroring with my phone ,as cloud share app is partially working on my phone. With other phone its working fine. It may be due to Android version...\nRest Product is very nice",
            "Flipkart & logistic company ( gati logistic ) world 3rd class service 2 time failed to deliver my tv after 5 dey later I got my tv tv is good but Flipkart & logistic company ( gati logistic ) very disappoint me all process I'll call Flipkart and Gati logistic minimum 20 times before place your order be careful don't buy this tv is not full smart tv some function is not some function is not work properly TV is many time hang Remote Mouse is failed detection YouTube video 1080 is not supported only 720 p support sound is not clear via USB 1080 videos is not play properly I will try many video player apps Dish TV review video coming soon on my YouTube channel channel name ( Chandan Bera )",
            "Excellent picture quality and smart tv function for the price paid, but sound quality not good as per my expectations, customer service from Cloudwalker team was good and quick visit is highly appreciated",
            "Was nice experience and proud to be early adaptor to the new user experience, was made this purchase for only the reason of Indian maker and wasn't regretted. I recommend this product, loved it.",
            "Nice LED TV. Excellent features with in a good reasonable price. Sound quality is just ok but remaining all features are working good. Additional one year warranty is more advantage. Better to go with cloudwalker lED instead of other brands.",
            "cloud walker one of the startups trying their best.but still very good in pitcure quality good sound excellent smart tv in this segment comparing to its rivals",
            "Superb job for a new company. Picture quality is up to mark and the UI is amazing. Hope to see good support in future. Thanks Flipkart and Cloudwalker.",
            "Very nice product in this price....sound is good not best..remote is amazing...u can't adjust picture brightness n contrast in smart feature...but as it is a android TV u can do it with any app help..service from the company third class...",
            "Seems to be a great buy after using for a week... However does come with minor glitches -\n\n1 sometimes have to re insert the provided USB for the remote to work properly..\n2 hdmi has to be selected again after a while of use as screen becomes blank after a 4-5 minutes of usage... But after works fine thereafter\n3 remote buttons could have been softer\n4 app installation is a challenge\n\nClarity is great - sound is ok - not the best of android system installed but I wonder if I should expect more for the price I paid... I am a first time buyer of smart tv",
            "I will update an honest & brief review on the CloudWalker Cloud TV 109cm (43) Full HD Smart LED TV purchased from Flipkart.\n\n1. The delivery was within the stipulated time period\n2. The installation of product was successful.\n3. Cloud TV with build and features seems to be very lucrative but my thoughts changed after NOT able to use the product even after delivery.\n4. Initially in first two days, the TV remote stopped working and hardly any connected device can be operated through TV buttons. Later 3rd – 4th day, the TV screen started showing several lines and blurred images.\n5. After initiating the replacement, the technician visit happened immediately. A ‘Jeevas’ technician visited the place and submitted his feedback on the complaint. To my surprise, I must say it took more than 10 -15 days for execution of the replacement request @ Flipkart. So, friends replacement @ Flipkart is not easy, it’s really a challenge.\n6. The height of the harassment is when the replacement product delivered against the problematic product is again faulty.\n7. The Cloud TV delivered is not booting after successful installation. Again, second complained was launched immediately after installation of the Cloud TV followed by ‘Jeevas Engineer visit’. The engineer made several attempts but the Television did not boot and he agreed that the TV set is faulty.\n8. On enquiry @ Flipkart, every time, it is understood that till date, Flipkart Officials do not have any update on its technician visit.\n9. Later, Cloud TV asked to share a video first for the issues in TV.\n10. Friends, I am still struggling for the refund of this faulty TV brand, so if you are buying Cloud TV, Be ready to Struggle even if it gives you a Lifetime warranty.\n11. If I would have space to upload the video, I had surely shared it to you all. However, you may contact for the actual video.",
            "The delivery was very quick from Flipkart and so the installation. The picture quality and sound quality are far better than any other branded tv's out in market. its the latest in all TV 's.",
            "One word for this product \"AWESOME\". I have been using product for more than 10 days and below are some of ratings from my perspective.\n\nPicture quality: 5/5\nSound: 4/5\nNetwork Connectivity: 5/5\nTV Remote usability: 4/5\n\nSome of the features needs still upgrades. Like below are few listed:\n- TV boot time is around 10 sec. Need to be reduced.\n- 1 USB port is blocked by bluetooth mouse pointer. So you can use only 1 USB port.\n- Can not change picture color / brightness / contrast while watching movies from pen drive.\n- Sound is average. You can hear clear disturbance when volume is 100%.\n- Lot of keys in TV remote, due to which remote is too big.",
            "So after a big confusion whether to go for a fresh brand in television series, or not, i decided go for cloudwalker. The delivery was done as per committed date. Installation agency contacted promptly on the very same day and the technician comes in and mounts the TV. The build quality and asthetics are really great.\nThe thing which went WRONG is TV REMOTE. The Navigation and Selection keys are non-funtional. The complaint was lodged on day 1. Now the real issue as expected came with after sales service. Very PATHETIC and SLOPPY. BIG DISAPPOINTMENT. Funny it was as, technician just went back saying that even he doesn't know what will happen next.\nA NOTE to CLOUDWALKER - I don't think it is right to get your product returned just for a remote .I hope flipkart helps me resolve the issue soon.\n\nNOTE to FLIPKART- Nothing felt like 'FLIPKART EXCLUSIVE' or for the matter 'FLIPKART ADSURED'\n\nUser experience will be shared if my problem gets solved. ✌",
            "Go for it good TV with lots of features keeping in mind about the brand is new I tried a gamble but seems good",
            "It takes a long time, a few minutes to start from standby....one can loose patience",
            "Good product. There were some defects initially but they replaced my tv. It is all good now",
            "Some of my Co-Workers had purchased this item & suggested the same for me.(Need to get use to the Air Mouse)\nOverall, very happy with the product - Excellent Service & Co-Ordination from Flipkart\\Delivery & Demo Team!!!",
            "A genuine review...Overall TV is superb at this price...And delivery service....And installation &demo also super",
            "Don't bye this TV\n\nPicture quality average. Sound quality not good, this not Dolby digital sound as mention in details.\n\nThis TV have smart TV but facing issue like slow working, too much lagging in operate tv, also not working innstalling app like hotstar ozee or Jio TV.\n\nTV remote stop working in few day in two months, Also note that this TV remote is too much costly at 1600/- on there website.\n\nFlipkart not to return this product and not supported if you facing issue with tv. Please take care and purchase brand products. Go with Sony Samsung LG Micromax or vu.",
            "Screen shakes very badly and flickers all time, never expected this quality in TV's category",
            "Loved the way it's designed in that price range.",
            "this TV very good but sound is average sound on BEST TV",
            "Delivery was little bit late but installation was fast. After one followup TV delivered. As of now TV is good. Will verify the complete feature and give you the complete review.",
            "Just go for it .....Really it is very good at this price segment it beat the vu smart TV that is in its smartness than vu. Really the smartness is inside....",
            "This TV Support Oakter remote?",
            "Flipkart has delivered the product on time and the installation has been done on time.\nBut the TV had some issues with regards to selection option and finally it got hanged.\nIt is now third day we have raised a complaint and daily the service company to which the Cloud Walker Company has designated the service job sends a message that we will address your complaint but in the evening they will send another message as per your request we have postponed the service for tomorrow.\nIt is not good from the Cloud Walkers part to have being tied up with such technical partner.",
            "it's not full hd. it's 720p .. don't buy cloudwalker tv.",
            "One word No. Do not buy this becuse, android which is running on this TV's are very old. They don't even have an update schedule and ETA for update. Most of the play store video apps are not supposed like hotstar Jio apps etc. If they have an update plan then only buy this.\n\nEdit: Got two updates, another one on the way it seems. Hope for good. No update later. Most of the apps crash after an year. Ram management is poor.",
            "Masterpiece. Hats off to the guy who invented this TV. Saved additional money of purchasing a Chromecast or a Teewe to toggle between TV and mobile. Can also upload a movie from mobile to tv and play the Same at ease. Many more features..Just Fantabulous. Great work. Prompt delivery and service too..",
            "Using this TV from last 3 months, no issue timely delivery and installation done. Worth for money.",
            "A quality product.. Hd tv.. A good product for this price range..",
            "Sound Quality is too bad,\nmade complaint month back still no resolution given, pathetic customer service.\n\nwast of money..",
            "poor sound quality",
            "very good product , and good price",
            "pros 1. good display quality 2. good metal frame 3. air mouse cons 1. bad audio quality 2. hangs on app loading 3. tv sound remains on even after aux connected",
            "Once you figure out the air mouse! It's a delight. The only thing is that you have to be more equip wth the installation process, the service team maybe a bit slow + their screen share app needs a major overhaul,as it laggy like anything.\n\nAlso this model doesn't seems to support 100mbps speed. Lower .\nLeaving these concern aside,it's an amazing TV. Really happy",
            "I order cloud 43SF TV from Flipkart..first time got faulty tv with screen defects but they replaced with new one.\nThis review on cloudwalker 43SF:\nPros:\nGood picture quality\nRemote - work as airmouse\nMirroring features\n\nCons:\nSound is not dobly as cloudwalker quoting on website\nBluetooth missing",
            "Super 👌👌👌👌",
            "Air mouse is only good.\npathetic sound quality. You will not understand the audio part..so be ready wiy subtitles. And you can't connect 5.1 with TV. set top box can be connected but you can't connect 5.1 to Tv so forget prime videos and you tube and others with good sound quality.\napp lags and hangs.. no Netflix. app update is serious problem. prime videos doesn't open easily.. u have to try for 10 times atleast.\nOldest version Android 4 with no update in last 2 yrs\nBlack spots on screen. Total garbage.\n\nworst customer care.. no responsibility . No home service , they will ask you to click picture and mail. No response then.\n\nHonestly Don't buy.. it.",
            "Mentioned description Full HD not coming in YouTube so may update did no use, so I am giving 1 star",
            "Good product in this range ...i would suggest everyone to buy...",
            "very good tv",
            "Very bad quality youtube is hang wifi low singnal...",
            "Some green light are coming after 1 month of use... And when I change I channel some lines to to come sometime",
            "Truly an honest review...one of the best choices I have ever made.best picture quality..brilliant sound..remote was cool..must buy smart T.V.",
            "Mobile mirroring problem. My letv Le 2 mobile is not supported mirroring. I hope solve the my problems Cloudwalker team. Replay please.",
            "Sound clarity is not good. Other things are very good",
            "I have bought this around five months back. Pic resolution and the quality is OK. But sound is very poor. Within 3 months one black stripe is appearing.",
            "Not delete butten on remot..!!..??\nProblume for deleting any image, video in file.",
            "As per my expectations and my view it is worth for what I spent.\nThe team Jeeves installation support good.\nOnly the thing is Demo is not up to the satisfies.",
            "Its good and comfortable",
            "Good",
            "wow superb tv",
            "Perfect Smart TV\nSuperb sound Quality....\nSuper remote is awesome....",
            "Features and app very cool to use and option to increase the internal storage and customise for wallpapers and etc",
            "It's good experience to use Android OS in TV.\nBit slow due to 1GB RAM.\nRest All features are good.\nPicture is good but sound bit low 5/10, the wifi is very poor...",
            "Screen quality is fine. but when connecting smartphone to tv using cshare app was very slow. its not having inbuilt cast.",
            "Good picture and sound quality but. Software issue be theare and air mouse pointer not working some times .....",
            "Best Tv in budget. I have purchased it for my daughter, she is watching cartoons and learning by using this product. Screen mirroring is a not working but other features are amazing.",
            "Nice look & best smart tv in 2017",
            "The delivery of this product is very good & installed in 2 hours after dilevery.the t.v. is overall average",
            "Best Features and Amazing Smart TV,\nBefore Buying ,\nI was confused but after buying and installation, I am happy.",
            "TV is wonderful, features are awesome. Especially the sensor, it's powerful. Advanced remote and it supports all high definition movies in all formats. Screen mirroring lags but ok.\nDelivery and installation was quick and perfect.",
            "Good one",
            "Pro\n1)Good pic quality\n2)great smart android features\n3) can be easily synced with mobile to play movies, act as remote through c share...though mirroring lags but movie playback is nice.\nCon\n1) 2 scratch visible on my panel when some light is thrown on it but are not visible during TV on condition\n2) audio quality is just OK\n2) access to ports is bit difficult, USB extension cable can be used for that",
            "The product is good, but the software needs an update. It is not allowing me to easily switch between running apps and some of the apps do keep crashing. Overall the experience is good, but can be better with fixes to the above issues.",
            "Amazing quality in such low price.. very simple and user friendly. You can play any movie or video through PAN drive using USB port. Support almost every video format..Smart functions are too good. Sound quality is superb.. Delivery and installation done in 3 days only.. Thanks Flipkart Team...",
            "Gr8 smart tv ever",
            "I bought cloudwalker 43 inch LED TV on Sun, Mar 12th '17, from flipkart. After 2 weeks remote stopped working. I changed battery then it came up.Again after 1 week same issue repeated. Cloud Walker told me they will replace the remote but I am not sure the issue will fix or not. Definitely they have a design flaw in their remote controls. Changing battery with in 1 week is not possible. So please make sure any of the customers facing the same issue and then buy the TV.",
            "tv is good but many problem was created like mobile connectivity .picture quality average.screen mirroring was not directly connected with tv it is connected with extra router.so it is biggest drawbachk.",
            "Tv looking is good but I have so many issues such as 2 speaker in right speaker the sound is coming buzz and the performance of tv is slow we paid 30k and got that type of speed and when we play game its speed is becoming more slow and when in mobile mirror tv not work same as mobile slow so my opinion is to maintain all this thing and in our tv speaker issue so repair it....",
            "Average",
            "Improve Customer support service",
            "Good product.value of money.",
            "Product- value for money. Go for it!\nDid not get 2 yrs warranty as described on the invoice.\nFlipkart says warranty is given by Cloudwalker and Cloudwalker says its with Flipkart.\nAt the end of the day, they fool you somehow!",
            "This is the first time, I went on to purchase an upcoming brand. The delivery was promt and Installation was quick. Since the beginning (August 2017), The issue is always with the remote. Within a month, It has stopped functioning which has been replaced with a new one after multiple follow ups with the customer care. But, Since last one month, The remote is again dead and smart TV has become dabba TV again. And, This time the so called Jeeves support team came and closed the ticket stating that remote needs to be purchased of worth 1500/- as the 3-month warranty period for remote is over.\nI'm a big fan of flipkart. As this TV is an exclusive product of Flipkart, I went for this TV without a second thought and it became a foolish decision. Whats the point of 2-year warranty for a TV when a faulty remote got 3 month warranty? R u doing TV Business or a remote business behind the scenes? I'm highly disappointed with the remote and customer service and I wont be recommend it for sure for anyone who want to go for a smart TV.",
            "Well tv is great but installation was not. That guy installed the tv higher on the wall then i said.",
            "Really smart, value for money.\nEverything is perfect except 720p is max on YouTube and dried remote batteries on 5th day, checking with new batteries... Sometimes hanging but it's ok(i think app issues).",
            "Product is good as per mentions\n\nBut the service of wall mounting\n\nAnd demo is very poor\n\nThe service guy even don't know how to fix wall mount\n\nThe wall mount and screws are not genuine\n\nIt local made very disappointed with wall mount and fitting",
            "It's fine on HD Channels. Hope for better service in future.",
            "Nice product but need improvment when connect mobile",
            "I will not give single star but i have seleted atleast one by default.. screen quality is poor.. functionly wise not much setting user can find in tv. Audio output sound will not controlled by tv remote. Hotstar, jio tv etc. Apps not working. I havent check all apps but there willsome more which also might not work. Full cheatting on built in wifi. Tv got wifi dongle added on usb port to get wifi. Range of that wifi dongle is too poor might be 1 or 2 meter. Call me or msg me before anybody buy this. I will send them original images of this tv.\n\nSevice is also not good. Cloudwalker person does not visited my home for wifi issues till date. Its been 2 weeks. if you buy it you will get traped. I suggest Go for other brands.",
            "Just Wall mount only by jvees team\nNo demo how to use product ???? Dear friends as on today dated 29/6/17 nobody come for demonstration TV mirroring is not working. Don't buy from Flipkart. Please don't buy if don't have a iPhone.",
            "Lots of blurreding found, not up too mark, picture quality are so much bad, Internet features r good also after two day it's turn automatically off sometimes automatically muted disconnect with setup box so lots of problem after all don't buy guys",
            "Review After 2 yrs of usage: overall OK\n\n\nPros: cheap rate, air mouse\nCons: poor sound quality, no android update, slow system response, app response is very slow ex. youtube, prime, hotster, mirror app not at all working from beginning",
            "Review after three years . Excellent TV",
            "I am complaining for tv not working since many days but there is no response from cloudwalker customer care. I have emailed many times to there email id...its really getting worsen and also spoiling name of flipkart too",
            "After one year colour problem this is a China product not buy tv not internet",
            "Very good in this price range.\nBut wifi is not good. Smart features like Android, Apps - is worst.\nIf you just want to use this TV as normal TV with cable/DTH and connecting USB HARD drive/pen Drive to watch movies then it is very nice TV.\nBut if you want to use apps like Prime, then useless",
            "reviewing after three years unable to view videos through any app like Prime video/Sunnxt or you tube even though connected through wlan connection. Not able to recognize 5gh wifi router signal.",
            "Third class experience",
            "good product",
            "Does not support streaming apps, slow response, OS is not very good",
            "little bit slow but product is good.",
            "Nice product",
            "Cast screen not work connectivity only problem otherwise ok",
            "it is superb in this price..\ngo for it instead of high budget Or branded..",
            "owsem full water cleared panel",
            "I purchased the TV ON the 27 Thousand and my TV screen unfunctional , cloudwalker team asked to to change it with 21 thousand rupees cost with in warranty... support really disgusting..",
            "Good in terms of picture quality, but after using for six months. have issues with its volume...sounds breaks up on increasing after 60. Sound could have been better as it is not audible at many times, in a decent sized hall.",
            "Good",
            "nies",
            "Excellent product",
            "nice",
            "Better than MI products",
            "Nice product",
            "Excellent product and great support.",
            "I bought this TV on 14th May 17, all most one year is over no problem everything works fine. I am happy that I hve selected the right product.",
            "Picture quality is good but sound quality needs a lot of improvement. Remote is delicate ,would require frequent replacements if used a lot. Company needs to make durable remote",
            "If you plan to buy a Cloudwalker TV, please read this carefully. 14 months after purchase, but well within the 2-year warranty my Cloudwalker 43 inch smart TV stopped working. First the sound went; after several complaints an engineer came. He said there was nothing wrong and went away. Two days later, the TV stopped altogether. The same engineer came, opened the set and said one part was defective. He said it would take 7-8 days to replace and went. Ever since, I have been chasing this company to honour its warranty commitment. After 3 weeks of being fobbed off with assurances, I have still to get resolution. Last week I was told a senior engineer would inspect the set but there is no sign of him My advice - please do not buy Cloud Walker products. Better to spend a few thousand more on a better brand than waste your money on a company that does not honour its warranty obligations.",
            "very bad speakers. dont purchesed any ine",
            "Good... But improve sound clarity...REM all are so nice..",
            "Good one",
            "Super smart TV",
            "Has the worst customer service and follow up. Not even 6months and the motherboard is fried. Waste of money. it's covered under warranty and I have raised the Complaint more than 15 days still no proper response. Please don't waste money on cloudwalker productsdue to worst after sales",
            "Nice product in low price.. very good feature in it..but had some problem with TV technician during wall mount..not good behaviour with us..",
            "Value for money however refresh rate is less.... you can see frames in pictures",
            "wonderful but first time start up on your TV required Email account access with internet And no more options the skip button\nthan remote button hard not for smooth some time two times press the button",
            "Bluetooth not given ? Pls update",
            "Everything is great abot the TV except the sound. Even if you have a pair of speakers I would be really difficult to connect one. I had to connect mine to my set top box.",
            "ok go for it",
            "Great tv completely satisfied but it is a bit laggy while using apps",
            "Sound is not at all good",
            "This is the best one\nNo comparing\nSamsung,Sony,LG and remaining TVs under this TV.\nNo need to put more for TVs,this is the best",
            "good tv",
            "picture quality is ok but the sound quality is horrible.",
            "looks are nice but I can be more better..",
            "Remote is bad it's not working, I cheged weekly ones battery's it not good",
            "good",
            "nice good product",
            "good for money but only sound a not good",
            "My humble request to buyers, don't buy this product, this is worst performing led tv....., picture quality is worst, sound is terrible, cannot hear a single word.... it causes headache due to lag in picture movement and fidelity in audio is high",
            "good v",
            "cloudwalker is a good product and picture quality is verygood.we were happy and enjoying.\nthankyou cloudwalker.",
            "its very good",
            "Excellent product",
            "so far so good",
            "Tv is working fine but only problem with air mouse remote. I have replaced its remote one time but it again started creating problem, otherwise no issue with tv set.",
            "Picture Quality good, sounds Average, other features are Good. Ultimate nice in this price.",
            "Company claims it's a full HD television but at the first day I realised it's not full HD when I played YouTube on it. It's Last resolution is 720p which is not full hd. very disappointed.",
            "Realy nice product,, video quality superb... Audio quality not nice.. Overall nice...",
            "super every option is very good",
            "Nice product with best price.. Awesome quality. Sound and picture too good.",
            "very very nice TV",
            "very bad",
            "worst product ever seen in my life. So returned back and got refund.",
            "good product",
            "excellence work",
            "Worst tv. Display bad, sound bad quality and audio jack is not work... Totally money for waste.",
            "it's not good for the clearity and sound quality also the sync of the mobile for all phones not working properly",
            "tx",
            "ok",
            "worst service ever.. if you got stuck in middle, cloud walker team takes to fix the issue for a month..",
            "excellent...flipkart and retailer omni",
            "very good product except for sound quality for the price.",
            "nice product. need to improve in sound clarity",
            "very good collection",
            "excellent product. low cost best product.",
            "Its worth for my budget",
            "Great performance, one thing that speakers are not so good. You need external speakers for better quality. Apart from that everything's perfect.",
            "its good.",
            "verry nice",
            "Review After 6 months of usage:\n\n1. This is not a full HD TV its just an HD TV\n2. This TV can be used only with setup box for better performance.\n3. Poor performance with wifi connection, video keeps hanging even after the video is full loaded\n\nMore reviews coming soon",
            "very poor service.... no spar parts available and takes weeks to replace any spar part during warranty also. if you have family and kinds who will watch TV on daily basis look for a better option.",
            "the product is good , but inbuilt spreker sound is not good. bad sound",
            "nice product..",
            "Really Nice Product",
            "excellent clarity, on time delivery,\n\ndifficult to use without Internet",
            "Problem with sound.",
            "Good product",
            "super tv ,compare to samsung smart tv this is best",
            "Is too good",
            "Good",
            "worst pick . multiple issues cannot connect external speakers, YouTube hangs , no hd option for YouTube, downloaded app hangs while running . height is there will be no response from support . My suggestion please don't buy this",
            "trust me..its good its been more then 1 month...works just perfect",
            "Sound is not good no blutooth ,tv is good but impurvment I was 4 star this tv",
            "Nice TV working good. Highly recommend.",
            "Good product",
            "Service worst in dindigul and delivery courier partners is very worst not delivered in on site only customers pick up the product 10 km in delivery address but not delivery in courier partners",
            "Very good product and i suggest to everyone in my friends circle to buy this product",
            "when the tv is on ... staring stage works slowly..",
            "Picture quality is super and sound quality is worst",
            "Picture quality is good for this price.. obviously u cant compare it with big brands. Slightly green lines had come in 1 month time, but after restarting TV, the lines went away.. so far going good.. But hoping it to last years longer..",
            "Value for money.",
            "very good TV thanks cloudwalker also thanks Flipkart. 👍👍👍👍",
            "Worth buying.",
            "bed tv remote os not working in 8 months sound not clear",
            "It's take more time to start. Remote battery empty early.",
            "Ok",
            "After use of 5 days,this smart TV is very attractive and it's features are very useful",
            "Worst tv ever. Sound quality is worst. I brought the tv and i was shocked to see that, if u connect the home theater system also the tv sound is still ON and as said tv sound is worst. Waste tv system. If u have to use only home theater then you should increase the volume and then mute the tv to listen from home theater system... Ha ha ha. What a system... Pls dont buy the product.. when requested for return, the technician is saying this is latest feature in this tv...ha ha ha. And he told he will update as sound not as expected. But he updated as issue resolved...still waiting for resolution.... Pls think twice before you purchase this tv.",
            "Dont buy we recived product after 2 months....",
            "Waste of money don't buy it",
            "Performance does not match advertising. WiFi performance is so so.",
            "Nice product in this range",
            "T.v is not hd picture",
            "It's amazing item with new clarity.",
            "On air mouse functionality of reomte is not working",
            "Good",
            "Excellent Futures",
            "Awesome product within this price range. The only issue is Air Remote battery drained very quickly apart from that everything is good. I am completely satisfied and recommend to buy this product.",
            "Nice TV",
            "Screen mirroring is only possible with c share app? Or any other method",
            "Nice product",
            "Very good",
            "Best Product in this price range.\nGood connectivity to Wifi, Good Sound & Picture quality.\n\nResponse time should improve.",
            "It's a good purchase with25k smart TV,delivery installation every thing done in intime.one star deceased b cos picture quality little bit dull comparing to Samsung. Other than that accessibility,operating TV fine.",
            "Software updates not given tv source and menu buttons not working condition 3.5mm audio jack is tummy mobile casting not working with causes app remote failure in one year cost about 2k totally lose of money",
            "Super",
            "Very good product",
            "very goood",
            "Nice TV. Thanks fkipkart",
            "Amazing service by flipkart.. Initial order had remote issue but the entire set was replaced as per the promised deadline.. The replaced product is awesome!!",
            "Excellent . worthy product.quality and features best compared to other brands.",
            "Worth of money\nBut sound quality is low",
            "Good quality screen and loud sound, value for money. helpful service provider, happy to purchase cloudwalker Led",
            "Very good smart tv in 25 k..",
            "It's good product for less price",
            "Excellent... No words to say, Amazing....",
            "Best smart tv in this budget\n\nStill not able to Play 1080P videos through Youtube.\n\nNeed fix ASAP.\n\nNo accessories are available especially remote control.",
            "Sound is horrible and screen mirroring not proper support\nSome App automatically exit during running condition",
            "Installation and demo service bad vender not come proper date",
            "Good Service\nNice picture quality\nAwsome sound",
            "Good",
            "Every year trouble shooting I am very disappointed after warrenty period.",
            "Good",
            "Very nice and excellent product",
            "Nice tv in good budget",
            "Sperior qaulity product",
            "good",
            "No doubt the product is superb in this price.\nOnly one suggestion is to put usb port in accessible place. Remaining all well",
            "good product thanks Flipkart",
            "Colours seems washed-out. Considering it price ok ok display. Audio not great....need some external music system. Airmouse is great.",
            "Good",
            "Nice product",
            "I purchased 43\" Full HD LED Smart TV with slight doubt in mind since the brand was not known, Recd it quickly. Packing was ok. On delivery they made us to open the packing & checked for any physical damage.\nInstallation was also arranged quickly. During installation software problem was detected. Jeev's Installation person tried various ways but could not resolved. He put the request for replacement. Then Cloudwalker technical person resolved the problem with reinstallation of entire software.\nTV is excellent. Picture quality is great, sound is good. Features are amazing.\nIts unbelievable that tv of such advance featurs & performance is available at such a low price why one should spend thousands more for known brands tv for similar or even better specs, features & performance.\nGo for it. Its going to be rwal threat for all leading brands.",
            "Super",
            "Good",
            "Very very nice that's all",
            "Best",
            "Superb Product",
            "Item is good but cshare app not good connect that is improve or update new verson",
            "Good product",
            "Nice product. Colour and clarity is good but while compare with Sony and Panasonic little bit less. Sound is good.",
            "Buy this as never seen before",
            "Smart Tv in good price\nnice",
            "Very good product",
            "Wonderful .",
            "The title says it all",
            "It's awesome",
            "Good",
            "Sound quality need to be increased",
            "Product is good . Worth smart tv\nDelivery is too late",
            "I bought tv 43 inch 15 days before every thing is good but sound is very less in this price ypu can by this product thank you",
            "Great Television set for money",
            "Worst product I have changed 3 led's pathic performance, app doesn't work, remote doesn't work ...cloudwalker person' s are also not supportive, finally changed the product.",
            "Pathetic experience with cloudwalker. Having several issues with the tv.\n\nI would like to return the product as I am not happy with the quality of the product. I have the below problems with the smart tv.\n\n1) Mouse works intermittenly\n2) Unable to connect to the wifi within the range of 10 meters\n3) Screen flickers intermittenly\n4) The picture quality of the product is not expected\n\nCustomer service is also very pathetic.",
            "Fantastic! Product buy from flipcard.Delivery is also fast as per name",
            "I m satisfied with this smart TV in my budget",
            "Good",
            "Best quantity products",
            "Good",
            "Awesome product in a very cheap value..... Thanks to flipkart",
            "Best TV but buttons are not in correct way",
            "Good product, customer service is excellent.",
            "Very nice TV for that budget thanks",
            "Company are not respncible in warranty..\nDo not purchase ths product",
            "Good product",
            "Value for money",
            "Have been using t for quiet a few months really liked the product ... Cheers",
            "I bought Cloudwalker full hd 43 inches tv and it provides good features at 25k... Which is in the budget of middle class people. only thing i want to say is.....i got delivery on time and after few days i found color issue in display then i placed a replacement request which is cancelled ....then i again raised a replacement request and till now still waiting for the same.\nHope product will get replaced soon....",
            "Such a good TV. Wroth for money. All the functions are working fine. Screen mirroring is not working properly.",
            "Make in INDIA Product, Worth for money.\nVisited near by Service center too (JEEVES in HSR Layout)\nnearly gives same clarity as Samsung TV's.\n\nNegative: Screen mirroring has Lagging issue.",
            "Audio not up to mark. While booting it take much time. Boring. Inadequate RAM. Buffering.S/Pdif is it OUT or IN no clarity. It is not audio out. Just it is headphones jack. Manual is not useful. Very poor standards. Anyhow worth for money we spent.",
            "Very good product thank you flipkart",
            "Nice product",
            "Using it from last one month and it is working great... Functions and Interface is so cool. Super remote is awesome. Smart function is very nice...loved it...Thank you CLOUDWALKER & FLIPKART....KEEP IT UP.",
            "Good product value of money quality is premium......",
            "Very nice",
            "1.Not up to the level in sound and picture quality\n2.Smart TV facility is not up to the expectation\n3.Options are confusing in settings\n4.remote s not comfortable to use\n5.Not worthy for 30k",
            "TV is good,picture quality and sound effect is nice.but TV delivery was very slow. Over all it is good .☺",
            "Good tv at lower end.. you tube & Prime videos are running well. only problem is miracast with cshare app.. lags a lot",
            "Excellent product\nWorth of money......\nBut the installation team sucks\nVery bad behaviour\nDont know how to treat customer\nIt took almost 10 days to install the TV.",
            "Overall good except sound quality and remote working randomly",
            "Remote works at random time. TV is ok quality only.",
            "cloudwalker good tv",
            "Guys dont even try to buy this product.... They mention its full HD but its not...each and every app has a lot of lags and glitches ....you cant play a smooth video in youtube.... My true experience guys dont ever have an idea of buying it.....",
            "Excellent Television, no doubt on choice",
            "Product deliver & installation was done in time. TV comes with nice features.",
            "This LED is with superb features, but having hanging problems and sound issues. So I registered complaint for the and technician came and take the model number and all and gone then almost 50 days passed and nobody has responded yet. VERY PATHETIC WAY OF HANDLING CUSTOMER, negetive 5 stars to cloudwalker team...",
            "sound quality was very good, all the HD channels i watched on this TV were real good. worth for money and i recommend this TV.",
            "Remote performance is very poor.",
            "Very good product save mony",
            "Mouse not working in the remote",
            "I am very happy...",
            "super SUPER 3rd class tv an also service was too bad dont purchase superb 3rd clas tv. news better tv on this price purchase mi tv",
            "service center don't take calls trying from last two days they just keep on hold for hours,",
            "Thanks for your help with my childrens and my choice of a new one and nice cloudwalker tv GOOD FOR YOUR HELP",
            "Its lookinga good product so far. Picture quality good. Sound great. 2 yrs warranty compared to 1 yr by competitors. New entrepreneus should be given a chance. Go for it!",
            "Good",
            "Best item",
            "One of the best budgeted smart TV in India with tons of features. Really loved it.",
            "Nice tv",
            "Problem start after 11 days purchase date 25 may but still my problem not solve",
            "Value for money.!!",
            "kindly avoid buying it guys. Purchased the TV and dead pixels appeared after few hours of installation. Never has such a bad experience with any product.\nAlso note you cannot return the product , It can only be replaced. Now I am stuck with a bad TV awaiting replacement.\nI got a call from the technician named Praveen..The solution he provided is wait for a couple of days and if the problem exists we will replace it..Ridiculous..Also without my knowledge he closed the request.\nI called him back and he said he will get the TV replaced. Luckily I called flipkart and they informed me my request for replacement is closed and je raised a new replacement request..\nI regret my decision and do not want you to waste your hard earned money.\nEven picture quality is really cheap...So my advise kindly avoid..",
            "Purchased in bbd 23500 ,,,not a bad deal,,,Working is too Gud,,, quality is also Gud,,,, Guaranteed 23500 price not avail in e-commerce platforms,,,,Tnx to Flk for faster delivery,,,,,\n\nWaiting for dhanteras if same price available",
            "Nice TV nice sound picture quality full HD",
            "Very bad products\nNot buy .\nMy tv problem within 10 days.",
            "Initially had a problem with TV software but within 3 days it was corrected. Best TV in that range. Full with good futures",
            "Don't believe on negative review....It's great tv...\nAir mouse must be improved Better.",
            "Video clarity is not clear with local cable network set yop box",
            "Any cast view is very slow",
            "Nice product",
            "Worth for money",
            "Value for money with the features it offers. Remote doesn't respond occasionally. It irritates then. Will have to see the service the team provides.",
            "Awesome flipkart right time delivery and cloud walker tv 43inch full Hd ,also worthy in low price thank u..",
            "Good for the price",
            "Good product smart TV not working",
            "So far so good",
            "Good TV. Only issues r mirror screen option doesn't work. Remote takes so much of battery. Always need to change remote battery.",
            "Product is awesome, worth for money, awesome in HD CLARITY, but is not much good.. I that's the only drawback.",
            "Awesome product.",
            "Nice product. The sound quality us a bit down. CDE mode is great. Overall iys a value for money",
            "Product is good but sound quality not good ..all features are adorable.",
            "Good tv with reasonable price.",
            "Audio is bad. Picture quality is ok",
            "Product is good but the remote control is not dat good",
            "Remote problem was there otherwise tv is good. Build quality is low but as we look at this price range its pretty good. Thums up from my side, just little laginess in air mouse.",
            "To good TV",
            "It's really a cool and smart TV to have got delivered on the second day after ordering installation was followed by couple of hours so far no issues",
            "best tv according to price u cant get more than this at this range",
            "Very good",
            "Very poor quality of pictures.......... Some cross lining on screen before installation.............. Not success product............",
            "He don't know about TV he knows how to connect TV to mobile",
            "Great!",
            "Picture quality very average and sound quality very bad.just around after some months the tv is not responding to the remote.i made several complaints but no kne came after promises.and now after 15 days or so still the part to be replaced has not come so i am without a tv fo4 almost 15 days and still counting.worst sfter sales service i have experienced after micromax.bad choice to buy a cloudwalker",
            "Best tv at this price point and more over best customer support of Flipkart and CloudWalker",
            "Air mouse feature does not work properly. No clarity on playing SD channels. Maximum resolution that can be played on YouTube is 720p I checked with cloud walker team n they informed me that an update will be done for the software in 2-3 weeks to resolve it.",
            "Android content are not running well on this and one of the big issue is remote\nWe careful\nSave your money",
            "Cloud walker TV awesome",
            "1week over was so scared but so far so good.no issue found hoping same in future\nAlmost 3 months over. Faced some issues with remote but I register issue and they replace remote. Nice customer service response and quick service in Bangalore",
            "Best pictures. Colitis and sound",
            "Nice tv",
            "Nice and I like the delivery on time.....",
            "Product is Good But Delivery is too late i hate this service",
            "The support team is awesome. Helps us to solve the issues. Great product and interesting contents on the home screen.",
            "Nice product, display quality and smart TV features are nice",
            "It is not a full hd tv, cannot play 1080p videos via usb or online, support is just to nothing, olease dont consider this brand, must go for VU or micromax in this range\nAlso editing to describe some more flaws, youtube and other app is very slow, they does not respond always",
            "Good one except for the speakers.. Worth buying.",
            "One draw back audio device is not clear to 👂",
            "Happy but not Very happy, burn in issues in just 5 months",
            "It's an awesome TV with this price range",
            "Excellent",
            "Good",
            "Product is as per the description. Enjoying - now it is almost a month now.",
            "Good",
            "Great product , great delivery worth buying",
            "IN clowdwalkerTV there is no option to connect to external sound bar. I have purchased external home theater but unable to connect to tv. So i have raised complaint towards clowdwalker and the send expert for checking , he also trying to connect clowdwalker tv to home external sound bar but no any port found to tv for cable connection finally he was also agreed can not connect external sound bar to tv. Customer care resonance is good but they also can't do anything due to no option in tv.",
            "Great Deal In low Price,Picture kwality is very Good Thanks",
            "Sound is not gud but all features are awsome",
            "Nice led tv good price range",
            "It's a very good t.v in this price range.",
            "Not happy with the TV.. Low picture quality",
            "very good product",
            "The product is good... delivery before the said date. Installation on next date completed with free of cost. Everything is good. 5 out of 5",
            "Good product.. worth full mony.. tnk u flipkart",
            "Tv is good and only remote is consuming more power need to change the batteries in a shot span of time",
            "Was delivered in good condition n in time",
            "Wonderful TV.....Amazing videos.Clarity is superb...Overall the product is worth for money!!!!",
            "Good product good in conditions and dilevered to my house within 3 days",
            "superb TV at this prize..\nIt's very gud product....i am really enjoying.... Nice Graphics... :-)",
            "This product is very worth full on this price, Service also very good.",
            "Superb Smart LED..!!!\nNeed to improve Sound quality and packaging of TV...\nall the features are superb...\nmust buy at cheap price...!!!",
            "Beats all other brands hands down... fantastic experience and with the extra purchase additional warranty, there is also peace of mind",
            "Good one",
            "Its really good, enjoying the big screen.",
            "Great product at best deal.",
            "value for money, good product, excellent customer support",
            "Nice product, worth for money,,, screen pixel is excellent...",
            "No thanks",
            "Value for money, a good product with latest feature, keep it up.",
            "cheap price and the best in smart",
            "Very nice...",
            "This TV is good picture quality looking is very good and Resonble best price is got it.",
            "Product is good and resolution is up to the mark.. we satisfied completely with all the features of cloud walker..",
            "Super prodect",
            "Product is good & service also ok",
            "Clarity was too good sound also good..... Esay to connect with internet very smart",
            "Good TV with all features and nice air mouse to operate easily.worth it",
            "Tv is good",
            "Nice TV with awesome sound",
            "Very nice",
            "Good...",
            "Is it work anyview cast like vu smart TV without wifi",
            "Superb Tv with this price range...!!!\nGo For It.....",
            "Awesome product. Worth for money.",
            "Awesome product sounds little bit low otherwise the product will be super",
            "Good product",
            "Nice product for this cost. Good delivery by flipkart",
            "Sound output is very bad... Screen mirroring lags a lot and is very slow... Price should be around 25k",
            "Good",
            "Nice product ....but remote not working sometimes",
            "My TV has now not working",
            "It was delivered very next day when i ordered and from the past two month I dint get any issue with this product. its gud in low range even warrnty also given for two years. Thanks to Flipkart.",
            "I recommend for Cloud Walker Tv sound picture clarity is very good",
            "Don't waste your money.. basic functionality like brightness adjustment and contrast adjustment features are not available.. picture quality is too bad.. response time is less.. I lost 30k:(",
            "Vry happy with the delivery and installation, however the TV was not upto the mark. Wifi is nt getting signals even within 5 ft of distance from router. Have applied for replacement, awaiting since last 3 days. Will review once i get the replaced unit. Continuing this after 1 year now. The tv got some weird marks inside the led. Launched a complain. After around 2 weeks the tv got replaced. The replacement tv doesnt fit in the existing wall mount. Waiting for more than 3 weeks now for them to get a new wall mount and have the tv fixed on wall. Worst ever after sales service. I regret my decision to buy this tv. Its been more than 1 and month now and i am still waiting for the replaced TV to be installed. Have sent numerous emails to cloudwalker but no luck.",
            "Software is not good. Cannot control mouse pointer. It is always moving downwards. Also tried with mobile control.",
            "Nice product",
            "Waste of money",
            "The Sound is not loud enough so i can't feel the Deploy effects .\nIf you are wall mounting the TV then it would be difficult to reach the HDMI and usb ports .\nI can feel the slowness here and there . Mirroring is lagging so you cant play games and expect it to render on TV real time , so there will be gap to 2 seconds .\nNot sure about the warranty . The installation guy said it is 1 year warranty but in flipkart is shown as 2 year.",
            "Awesome tv but some time tv remote hanging",
            "Not satisfied with picture quality",
            "Value for money",
            "It's a great product , and as per the price tag I think it's a must buy",
            "remote is not working(8 months)...sound quality is not clear at alll",
            "Pretty good processor. Value for money. Easy interface.\nAir remote is awesome. Pixel quality could have been better.",
            "Its awsm",
            "This product is very poor. Quality Don't buy, spiker quality is 3rd class levels.",
            "Super android tv",
            "Every since I got this product, I'm facing one or the other issue. First remote stopped working and I had to replace the remote. And now TV restarts by itself for every few minutes. Now I'm not sure what to do with the TV.",
            "Good features! Value for money",
            "Good quality",
            "Concept of 2 in 1 remote is nice. Apps working nice and fast. Sound is decent. Delivery timelines are too good. Highly recommended.",
            "After getting broken product and replacement,npw its good product..very good quality....value for money...",
            "Nice",
            "Very nice TV @ this cost\nUI is like woww\n\nRavi Madhav",
            "Awesome television! I heard that there was a problem with Hotstar and tv mirroring but hotsar is running well no issues no buffering. Little with mirroring, some lagging issue when we connect mobile to tv. I haven't purchased any dish tv or cable connection because through wifi broadband connection its running excellent.Its really smarter than any other branded smart tv. I can use usb mouse, mobile phone to control tv if your remote cell are down.",
            "Osm TV...!!! Delivery and installation done on the same day....very good service...",
            "It's a worth buy. Gives you all or more than you are spending your money for",
            "though the picture loads slow and quality is little less, the size and performance is goof",
            "Simply great. My father in law loved this gift. Thanks.",
            "Excellent",
            "Picture quality OK. But autio very low .",
            "The product is good but the accessories like remote is not working properly. Are else i can give it 5 star rating...",
            "Good product at this range.\nIts been only 2 days till now good experience.\nBefore ordering i was bit confuse but after using it pretty much Happy.",
            "Its a good value for money LED TV.",
            "Excellent!!!",
            "Excellent Product ...",
            "Great tv guyss dont listen to anyone just buy it its really more than expected in 30k ranges!",
            "Amazing features pretty old android version. Few operational issues but overall value fir money and good picture quality. Would recommend to buy others",
            "Worst experience\n\n\nSpeaker quality is very poor",
            "Nice product nd sir plz help me tv connect screen mirrioing",
            "I am very much impressed with Cloud walker,Nice product ...",
            "Superb cloud Walker...thanx",
            "Awesome TV with Awesome Features..\nNice display and Smart Features is Working Good,Good thing is You can Download Any App and use it Easily Like Share it and Xender for Data Transfer,FB And Whatsapp too..\nMust Buy Don't think..",
            "NYC delivery...",
            "Please Do not buy this Product.\n\nViewing angel is bad, poor resolution from both sides.\nSuper remote cell exhaust every week.\nSound quality is pathetic.\nThis is a made in china product.\nWifi range is too short, also disconnected automatically.\nscreen mirroring is pathetic. very slow.\none usb port will be not usable as super remote adapter use it.\nHD quality resolution is so poor.\nThis tv doesn't have 3.5 mm audio jack & bluetooth",
            "No knowledge of product by service technician",
            "TV arrived on April 15th without a remote and I have been bounced back and forth between Flipkart, Service center and the Brand Cloudwalker without any resolution for 30 days.\n\nAnd now Flipkart is asking me to get a replacement for the entire TV.\n\nFlipkart backend team has never kept the commitment to call back and inform me of the resolution and after 30 days now I have to again wait for a new TV and then I might actually be able to rate the product.\n\nOne thing is clear, Cloudwalker and Flipkart Service cannot be relied upon so even if the TV turns out to be great I will have to live in fear about the service from Cloudwalker. If they couldn't send me a remote then I hate to think what would happen if there is a major issue.",
            "Delivery has taken more time",
            "No value for Money. Pixels are bad, plastic of product is cheap. Replacement Warranty does not help as same product delivered. TV remote doesn't function. Slugish... No one care from Flipkart or the manufacturer once the product is sold. No wall mounting kit is available...\n\nRaised dispute no one has turned up since the product bought on launch date March 03, 2017\n\nDon't waste ur money as I am fighting to get my money from Scammers.... :(",
            "i got this tv on march 11 with an damaged dispaly and i requested for replacement or refund and its been totally 15 days out so far no proper response from flipkart nor cloudwalker regarding my complaint and daily i am calling the flipkart customer executives nearly 15 to 20 times but the response is they just give one date for death line and says that our back end team wil resolve this and the main thing in that is after the death line is completed and still no issues have been resolved and once again as usual i just contacted the flipkart customer executive and they are saying without shamefully that pls give some more time i.e 3 days more to resolve the problem and the comedy part in this is that they are begging for the 3 rd time and still the problem didnt solved.Hats off to you FLIPKART and your courier partner!",
            "Fully Satisfied as per Costing...",
            "Buy it at your own risk.\nDon't expect any support from either Flipkart or Cloudwalker.\nGood bye Flipkart....",
            "Screen damaged when received , bad packaging by cloud Walker ...waiting for replacement..",
            "First time remote was not working so I got the replacement. Second time white line was showing on the screen but remote was working fine...Now i returned it and got the refund..So i am not able to give review but I am giving only one star gor the service and not for product, may be product is good.\nAlso the executive engineer or technician from cloudwalker was not familiar with the product.\nThanks to Flipkart for helping and guiding me time to time.",
            "Plz plz plz be aware!!!! Don't buy any costly electronic item from flipkart. I purchased CLOUDWALKER 43 inch smart tv on 19-4-2017. Product had manufacturing defect on its screen, i claimed for replacement, but till 19-5-2017(1 month) they don't replaced. Now i am mentally fedup and harrased. They provide third grade service. They have no service backup for cloudwalker tv . They are thugs as they sell the items and forget you to be frustrated.",
            "ptoduct qualoty is very bad. kindly please arrange . and do need ful",
            "Box missing wall mount stand and tv is yet to get installed",
            "Very nice.service is also good",
            "bad pic qwality",
            "I would NEVER recommend it. Complete waste of money and time. Has been more than a month and I regret buying it.\nCons:\nRemote seems to be controlled by itself.\nTV is super slow.",
            "faulty product..there is gap between diaplay and pannel.",
            "Good product",
            "Product is good",
            "Excellent Product, me and my child enjoying this product.",
            "Sound Quality issues. Not Happy with the quality of the T.V",
            "Still I didn't get wall mount..",
            "Fast installation done by Jeeves thanks for yourfast service",
            "Received defect product Flipkart gave replacement which was long process feeling happy but stress was so much to explain . Tv overall good",
            "Exilent product and delivery"
        ],
        "likes": [
            "126",
            "30",
            "27",
            "66",
            "431",
            "8",
            "10",
            "10",
            "16",
            "2",
            "126",
            "30",
            "27",
            "66",
            "431",
            "8",
            "10",
            "10",
            "16",
            "2",
            "2",
            "5",
            "17",
            "18",
            "10",
            "17",
            "1",
            "1",
            "1",
            "1",
            "4",
            "4",
            "6",
            "3",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2604",
            "66",
            "594",
            "1124",
            "13",
            "4",
            "18",
            "6",
            "14",
            "3",
            "9",
            "3",
            "2",
            "2",
            "4",
            "17",
            "7",
            "3",
            "3",
            "4",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "3",
            "2",
            "2",
            "6",
            "3",
            "4",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "3",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "27",
            "3",
            "3",
            "2",
            "3",
            "23",
            "13",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "83",
            "17",
            "66",
            "38",
            "234",
            "4",
            "5",
            "6",
            "15",
            "0",
            "83",
            "17",
            "66",
            "38",
            "234",
            "4",
            "5",
            "6",
            "15",
            "0",
            "0",
            "3",
            "22",
            "32",
            "16",
            "33",
            "0",
            "0",
            "0",
            "0",
            "7",
            "6",
            "13",
            "5",
            "3",
            "1",
            "1",
            "2",
            "3",
            "5",
            "7",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "4",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "5",
            "331",
            "21",
            "278",
            "561",
            "2",
            "0",
            "6",
            "1",
            "6",
            "0",
            "4",
            "1",
            "1",
            "0",
            "2",
            "21",
            "6",
            "3",
            "2",
            "4",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "3",
            "2",
            "2",
            "13",
            "5",
            "11",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "10",
            "7",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "0",
            "0",
            "0",
            "1",
            "5",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "12",
            "0",
            "0",
            "0",
            "2",
            "49",
            "24",
            "0",
            "0",
            "0",
            "6",
            "11",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:can it be used with set top box.",
            "Q:Can I use dish tv and cable TV conction for normal use",
            "Q:which brand is better among vu, mi, clould depend on pic, clearity, service in 4k ultra hd tvs pls reply urgently",
            "Q:is it 4k television",
            "Q:can i play all format of video (such as AVI, MKV, MP4, WMV, 3GP etc) and audio (aac, ac3, mp3 etc)?",
            "Q:does it come with wall mount ?",
            "Q:How is the picture quality for SD channels?",
            "Q:is this Android TV....???",
            "Q:does it support netflix?",
            "Q:Can I cast my laptop Windows 10 or Mac to this? Does Cshare work from Windows or Mac?",
            "Q:how to installation",
            "Q:What is the actual length of the TV.? Is it 109cm or 970mm..?",
            "Q:can connect with mouse",
            "Q:how much charge for wall mount",
            "Q:how to screen mirroring in this tv",
            "Q:This TV is android based or just a smart TV?",
            "Q:can we use video calling app like google duo or fb video calls",
            "Q:can I display my mobile screen into the cloud Walker TV",
            "Q:does it has inbuilt stabilizer? or we can buy?",
            "Q:stabilezar Required this LED??",
            "Q:will amazon prime app work on 43 inch smart TV",
            "Q:can i connect my andriod phone to watch movies",
            "Q:I am unable to use smart functions of my product... as soon as I try any smart functions from remote, TV doesn't recognize instructions from remote",
            "Q:can I display my mobile screen into the cloud Walker TV like if I want to play my home screen of my mobile in the TV can I play it?",
            "Q:How to improve sound quality what is the best soundbar",
            "Q:Dose we can connect Google chromcast to it",
            "Q:any one tell me which one is the best sound system for this tv.. plz suggest any audio device like home theatre r soundbar",
            "Q:what about bluetooth",
            "Q:is it have subwoofer",
            "Q:How can I connect blutooth home theatre",
            "Q:can i cast my phone",
            "Q:hotstar supported or not",
            "Q:Is the angle of the tv is 170 degree???",
            "Q:vga available? this tv",
            "Q:Can I connect my xbox one S 1 TB console and play high graphics games with this set",
            "Q:please guys anyone tell me which brand of tv will be better vu or cloudwalker? which service and features are better please tell me please",
            "Q:How can I connect blutooth",
            "Q:is it having ips panel",
            "Q:Is it has DVB T2 tuner ?",
            "Q:Is it possible to connect Bluetooth dongle through usb port inoreder to use devices such as speaker?",
            "Q:what is ram and inbuilt memory of this tv",
            "Q:what is ram and inbuilt memory",
            "Q:Can I install terrarium TV on this app",
            "Q:hey is this really didn't have Bluetooth? then how can i connect my 5.1 Bluetooth speaker to this tv, wirelessly",
            "Q:Can i connect keyboard and mouse to smart tv",
            "Q:4K videos are not supporting in my TV what I purchased",
            "Q:what is the contrasrt ratio??",
            "Q:what is the viewing angle of this television ?",
            "Q:what about internet connection... is it possilbe to run it on mobile hotspot???",
            "Q:What is ideal refresh rate?",
            "Q:Does it have 3.5mm audio jack",
            "Q:How do I decide on which screen size is ideal for me?",
            "Q:What is 4K?",
            "Q:what is the total weight of the package?",
            "Q:will it support google playstore?",
            "Q:Does this TV support sony dvd",
            "Q:dose it has 3D feature ?",
            "Q:supports noughat android??",
            "Q:how is the performance while playing youtube or netflix?",
            "Q:Will it work on d2h videocon set top box?,",
            "Q:Does it have a Air mouse function on Remote ?",
            "Q:do i require dish recjever or can i directly connect airtel dish wire to the led as some of the leds have inbuilt reciever?",
            "Q:this tv was wall mount?",
            "Q:What is the difference between Full HD & HD ready?",
            "Q:What is a 3D TV?",
            "Q:How do smart TVs connect to the Internet?",
            "Q:What is Smart TV?",
            "Q:Why HDMI ports are required?",
            "Q:is it a dolby digital surround?",
            "Q:can i purchase cloud 32 inch remote only",
            "Q:how to connet wireless display connent to samsung galaexy j7max",
            "Q:Is it an android tv? Does it have play store? can i install new apps like jio tv?",
            "Q:Do I get wall mount with the TV?",
            "Q:Anyone facing TV software update issue? I can't update the software.",
            "Q:Do I get brand warranty?",
            "Q:Can I connect home theater in this TV???",
            "Q:does it havr an in built chromecast",
            "Q:does it operates through mobile remote?",
            "Q:how to off tv speakers after connecting external speakers.",
            "Q:how to switch off tv speakers after connecting external speakers. please help me",
            "Q:Does it dupport web browsing?",
            "Q:I have connected speakers from AUX output. how to stop the sound coming from tv speakers??",
            "Q:Does this TV support HDMI ARC function with Sony Home Theatre Support?",
            "Q:can we download games",
            "Q:Does this tv have audio and video port (AV) to connect dish box!",
            "Q:Can I connect my pc with it",
            "Q:hdmi arc port is available?",
            "Q:Does it have inbuilt stablizer",
            "Q:when i play 480p video on tv do i get blurr picture or not.",
            "Q:can I play android games",
            "Q:does it support dongle for connecting to internet internet?",
            "Q:android version please",
            "Q:what this tv uses as a moniter",
            "Q:how to connent samsung j7max wierless display",
            "Q:can i connect it my lan wifi",
            "Q:is it have bluetooth?",
            "Q:Is there any place I can see a demo unit on display in Pune ?If yes can you provide the complete address of the showroom. Thanks",
            "Q:mts video fromet play tv",
            "Q:I can't decide between a curved screen & a non-curved screen. What's the added benefit?",
            "Q:What is TV viewing angle?",
            "Q:Is This TV Support DTS and Dolby Digital Surround Sound ???"
        ],
        "answers": [
            "A:yes its works..",
            "A:Yes you can but initially you have to connect it with internet and make an account afterwards no login or connection is required for normal use.",
            "A:Vu best",
            "A:No. HD resolution 1920x1080",
            "A:mkv format not supported this tv",
            "A:Yes.",
            "A:Great....I am using this TV from the last one month. I have not noticed anything wrong with this deal. I am enjoying watching TV and surfing internet. I recommend, Go for it.",
            "A:yes..it's Android 4.4.",
            "A:Yes it does. You must have an account with netflix",
            "A:yes",
            "A:installation will be done by the team,post you buy the product ,without any charges.Probably in a day or two once product recieve.",
            "A:109cm",
            "A:yes you can connect mouse & keyboard",
            "A:NIL",
            "A:just install cloudtv remote app in play store and check",
            "A:android based",
            "A:yes , but you have to connect a web cam to your tv , or else you can view the other person but other person can't see you",
            "A:yes.",
            "A:No, it doesn't have inbuilt stabilizer. you have to buy seperately.",
            "A:No... stabilizer is not needed",
            "A:Yes. You can install any Android app.",
            "A:yes",
            "A:Please check if the internet is connected.",
            "A:yes you can share your mobile screen in the cold Walker tv as well as you can use tv screen in your mobile. you can use your mobile as mouse, as touch pad, as air mouse etc etc. dude you will just lov",
            "A:Theater mode sound is best",
            "A:Yes",
            "A:you might need to buy additional digital to analog converter in order to use external sound system since most of the speakers are analog and TV has digital circuit system.",
            "A:no Bluetooth also High Definition video ar not supported",
            "A:no",
            "A:No u can't connect Bluetooth speaker 🔊 to this TV It won't have Bluetooth transmiter u have have to purchase in flipkart it cost around 1k",
            "A:Yes and no. Yes you can cast via Cloud Walker app which is slow and no you can't directly cast your mobile screen.",
            "A:Yess....",
            "A:yes",
            "A:yes",
            "A:yes",
            "A:go with VU",
            "A:it cannot connect to Bluetooth",
            "A:no",
            "A:tv is anroid based and equipped with normal tv setup with hd. setup box will be required.",
            "A:yes u can connect",
            "A:Has 1GB Ram and 8GB Internal Storage",
            "A:1 gb ram and 8 gb inbuilt memory..",
            "A:Yes you can install any Android apps including Terrarium TV on this TV.",
            "A:u cant",
            "A:no you cant",
            "A:4K video playback is not supported... so u need to play 1080p videos....",
            "A:1200:1",
            "A:company saying 178 degree, but my experience is when u see from exact in front it's ok, but when u see from sides it's brightness, contrast & color changed.",
            "A:some time not working",
            "A:The refresh rate is the number of frames the television can display per second. The standard rate is 60 60 Hz. Higher the rate, smoother the movements in videos- best for fast-moving sports/gaming.",
            "A:yes it has..",
            "A:Your distance from the screen, most often decides the screen size required. If you're too close, you’ll see a pixelated image & if you're too far, you'll miss details. Check our buying guide for more!",
            "A:4K, aka Ultra HD, comes with a 3840x2160 pixels resolution- (4x of full HD TV). The extra resolution adds better definition & depth to the pictures, resulting in images that look incredibly life-like",
            "A:10kg",
            "A:YES",
            "A:yes..it has port for DVD player .. u can connect and watch the contents..",
            "A:no its not having 3D feature",
            "A:yes it's supports.",
            "A:totally depends on your internet speed... no problem with TV. it's perfect",
            "A:yes,it working,I am using since last 2-3 months",
            "A:Yes",
            "A:With HDMI cable connect to the tv",
            "A:Yes, came in box along with TV.. Was installed by jeeves",
            "A:Full HD has 1920 x 1080 rsolution- ensures a higher picture quality HD ready. It essentially consists of 2Mn pixels vs a 1Mn pixels in HD Ready! Refer to our Buying Guide for more details.",
            "A:3D is an added feature in many high-end TVs. You can watch videos that are made in 3D with your 3D glasses, depending on the type of screen (Active or Passive). Do check our buying guide for details!",
            "A:A smart TV uses either a direct, wired Ethernet connection or built-in Wi-Fi to connect to a home network for internet access. Most models today have built-in Wi-Fi.",
            "A:A smart TV comes with built-in Internet connectivity, to access a range of online services including video on demand, social networking and may have fully featured web browser to access websites.",
            "A:HDMI ports are required to connect cable box or Blu-ray player or a video game console or a streaming gadget, or a smartphone/tablet. You can decide the number of inputs required as per your usage.",
            "A:No. Sound is quite normal.",
            "A:You have to contact support/ customer care of cloudwalker tv for details....",
            "A:You need to install Cshare app by seeing steps provided in cloudwalker TV when you click on Cshare app.After download Cshare app in your Mobile,you can connect to TV and use it wireless as a TV remote",
            "A:Yes it's android tv with playstore and we can install Jio tv",
            "A:Yes wall mount comes free with all 22 inch & above TVs",
            "A:I have updated..no issues",
            "A:All TVs come with assured brand warranty up to 3 years. You can also get extended warranty at best price on select models",
            "A:Aux and Coaxial outputs are available on this TV. Check what inputs your HT accepts.",
            "A:Nope",
            "A:no",
            "A:You cannot ! There is no such option.",
            "A:TV speaker should automatically turn off once connected to external speaker. TV outputs sound only to one speaker at a time",
            "A:Yes it supports",
            "A:After tv upgradation sound as been stopped..",
            "A:yes",
            "A:not compatible",
            "A:through HTMI connected. Am facing the problem, home theater pin AV not connecting properly. after connecting home theater through AV pin, sound coming out.",
            "A:yes. through HDMI cable",
            "A:no",
            "A:No",
            "A:Playing a video in 480p, is already a low resolution video, it can be played clear in mobile, bcz mobile screen pixels are too small but TV pixels are larger, so yes it's get blur when you played 480p",
            "A:yes u can",
            "A:No,",
            "A:KitKat 4.4 but it is fully customized by Cloudwalker team. You cannot make any sort of tweaks and only compatible apps can be installed.",
            "A:No its an LED TV with Android feature",
            "A:get cloud TV app from playstore.. connect to ur home wifi. open the app and note down the link address.open browser on the TV and type the link..ur phone contents will be displayed",
            "A:yes, you connect internet connection to TV by LAN cable and wife both",
            "A:No, it doesn't has bluetooth.",
            "A:No this is been sold online and not avilable instore",
            "A:yes all smart function is in this Smart Tv",
            "A:A curved screen is developed for a more immersive viewing experience, regardless of the angle the screen is viewed from, as well as offering the latest color- and depth-enhancing technology.",
            "A:It is the maximum angle at which a display can be viewed with acceptable visual performance",
            "A:no"
        ],
        "likes": [
            "35",
            "55",
            "4",
            "3",
            "0",
            "5",
            "6",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "3",
            "2",
            "2",
            "1",
            "1",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "74",
            "3",
            "8",
            "10",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "6",
            "5",
            "5",
            "5",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "16",
            "31",
            "0",
            "0",
            "0",
            "4",
            "7",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "2",
            "2",
            "1",
            "1",
            "2",
            "2",
            "2",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "65",
            "0",
            "6",
            "12",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "9",
            "7",
            "9",
            "9",
            "2",
            "1",
            "1",
            "1",
            "1",
            "2",
            "3",
            "4",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "1",
            "0"
        ]
    }
}