{
    "title": "SONY Bravia W672G 108 cm (43 inch) Full HD LED Smart TV  (KLV-43W672G)",
    "product_specification": {
        "In The Box": "Warranty Card, AC Adapter, AC Power Cord, Remote Control, Table-Top Stand, User Manual - 1U each, Batteries - 2U",
        "Model Name": "KLV-43W672G",
        "Color": "Black",
        "Display Size": "108 cm (43 inch)",
        "Screen Type": "LED",
        "HD Technology & Resolution": "Full HD, 1920 x 1080",
        "Series": "Bravia W672G",
        "Smart Tv": "Yes",
        "Motion Sensor": "No",
        "HDMI": "2 Side",
        "USB": "2 Side",
        "Built In Wi-Fi": "Yes",
        "Launch Year": "2019",
        "Wall Mount Included": "No",
        "LED Display Type": "Direct LED",
        "Refresh Rate": "50 Hz",
        "Supported Video Formats": "AVI, ASF, MP4, MKV, WebM, TS",
        "Number of Speakers": "2",
        "Speaker Output RMS": "20 W",
        "Supported App - Netflix": "Yes",
        "Supported App - Youtube": "Yes",
        "Supported App - Disney+Hotstar": "No",
        "Operating System": "Linux based",
        "Screen Mirroring": "Yes",
        "Content Providers": "Netflix and YouTube",
        "Ethernet (RJ45)": "1",
        "Internet Access": "Yes",
        "Power Requirement": "AC 100 - 240 V, 50/60 Hz",
        "Power Consumption": "65 W, 0.5 W (Standby)",
        "Width x Height x Depth (without stand)": "97.4 cm x 57.2 cm x 6.8 cm",
        "Weight (without stand)": "12 kg",
        "Warranty Summary": "1 Year Manufacturer Warranty",
        "Covered in Warranty": "Warranty of the Product is Limited to Manufacturing Defects Only",
        "Not Covered in Warranty": "Physical Damage",
        "Warranty Service Type": "Off-site",
        "Installation & Demo Details": "Please note that any unauthorized handling or self-installation of the product will lead to return & product warranty being void\nWe'll facilitate the installation and demo through authorized service engineer at your convenience.. The service engineer will install your new TV, either on wall mount or on table top. Installation and demo are provided free of cost. The engineer will also help you understand your new TV's features. The process generally covers: Wall-mounted or table-top installation, as requested. Physical check of all ports, including power and USB ports. Accessories also checked. Demonstration of features and settings Quick run-through on how to operate the TV"
    },
    "product_description": {
        "FHD TV": "Enjoy every visual clearly on this television’s 108 cm (43) FHD screen. Each visual will come alive on screen with good impact and less noise.",
        "X-Reality PRO and HDR": "Enjoy exceptional clarity on this television, thanks to the X-Reality PRO picture processing technology. This television’s High Dynamic Range (HDR) will enhance each frame on screen without losing on details.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "1",
            "3",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "2",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4"
        ],
        "review": [
            "Great picture quality and sound connectivity also good 1080 full HD, screen mirroring option is there and built in Wi-Fi Sony Bravia is wonderful TV is working perfectly , installation is done buy Sony technician it's free and Wall mount is also free,I am strongly recommended to buy everyone this TV, thanks to Flipkart.",
            "Crystal clear picture quality and the colours feel so natural. This is what Sony TV's are meant for. Sound quality is absolutely perfect with noticable bass. Obviously you won't get that extreme bass. To enjoy quality picture via STB, a HD subscription is must.\nA must buy affordable quality product.",
            "This is a nice TV comes with trust of Sony. If anybody going for 32 inch smart TV then this is best one.",
            "thaks flipkart very very much. 🥰🥰🥰🥰 . I love it. picture quality is perfect and sound is also great. thank you again thanks a lot",
            "Super sound and picture quality with inbuilt boofer. The brand name SONY. is sufficient for everything. Even more featured TV at low price are available in market but no comparison with Sony. Just love it.!👌👌",
            "The name SONY says everything .. This Tv having better and best picture quality (produces natural colour) than LG , Samsung tv’s.. HDR quality is much better than LG&samsung 4k tv .. Just amazing sound quality the dynamic drive speakers gives rich sound clarity .. But little connectivity issue while screen mirroring apart from that just amazing ...",
            "Product is very good. Only issue is with the delivery time. Got delayed it for over a week. Flipkart needs to set expectations.",
            "Super quality...you wont regret after buying crysp display clear sound although its not android and many leds in this range but believe me it has plenty of options...everthing great after all its sony?",
            "picture quality is good",
            "Very good",
            "Great picture quality and sound connectivity also good 1080 full HD, screen mirroring option is there and built in Wi-Fi Sony Bravia is wonderful TV is working perfectly , installation is done buy Sony technician it's free and Wall mount is also free,I am strongly recommended to buy everyone this TV, thanks to Flipkart.",
            "Crystal clear picture quality and the colours feel so natural. This is what Sony TV's are meant for. Sound quality is absolutely perfect with noticable bass. Obviously you won't get that extreme bass. To enjoy quality picture via STB, a HD subscription is must.\nA must buy affordable quality product.",
            "This is a nice TV comes with trust of Sony. If anybody going for 32 inch smart TV then this is best one.",
            "thaks flipkart very very much. 🥰🥰🥰🥰 . I love it. picture quality is perfect and sound is also great. thank you again thanks a lot",
            "Super sound and picture quality with inbuilt boofer. The brand name SONY. is sufficient for everything. Even more featured TV at low price are available in market but no comparison with Sony. Just love it.!👌👌",
            "The name SONY says everything .. This Tv having better and best picture quality (produces natural colour) than LG , Samsung tv’s.. HDR quality is much better than LG&samsung 4k tv .. Just amazing sound quality the dynamic drive speakers gives rich sound clarity .. But little connectivity issue while screen mirroring apart from that just amazing ...",
            "Product is very good. Only issue is with the delivery time. Got delayed it for over a week. Flipkart needs to set expectations.",
            "Super quality...you wont regret after buying crysp display clear sound although its not android and many leds in this range but believe me it has plenty of options...everthing great after all its sony?",
            "picture quality is good",
            "Very good",
            "Quality product...awesome picture quality 1080p...sound also good must buy Sony Brabvia products",
            "Excellent Picture quality as well as sound...\nI am highly satisfied 🥰🥰😍😍\nRegards,\nsupriyo",
            "Picture quality is awesome, connectivity from hot spot and screen mirror/ wireless display working fine. Installation was done on time by installation guy. everything is okay.",
            "I'm big happy",
            "In a single word it's really FABULOUS 👌.Best value for money and delivery of Flipkart is awesome.Sony service also very quick.",
            "Good one.. safe n timely delivery.",
            "but it's one star TV. power saving",
            "Good",
            "good product",
            "value for money. best buy",
            "Good product from Sony",
            "excellent experience",
            "Super quality",
            "Very good.",
            "I write this review after 3 months after bought my TV, SONY picture clarity and contrast is damn high. U can see the picture quality compare to other brand TVs. sound is also good.",
            "Sony is Sony...",
            "Product is fine but i am overcharged.",
            "Very nice products",
            "Although price is high but nice TV. Delivery & installation done faster than expectations. Also, demonstration done by service engineer was very good & efficient. 🌝🌝",
            "full happy... Thanks Filp card....",
            "The device installation and demo was to come from flipkart. But they have been so so so bad about their time managment that its been 12 days after i got the TV and yet today its not been installed yet !!!",
            "Tv is ok hotstar not supported...\nAnd not installed another source",
            "Best tv for smart members..",
            "Great tv..picture quality and sound...go for it. Value for money. Just the installation and demo took few days after the delivery makes me rate 4 star. Awesome! Tv...satisfied. best at this price",
            "Good... but TV assembled so late",
            "best product",
            "Excellent",
            "good",
            "It holds up to it’s brand value . Good quality picture and sound",
            "best TV",
            "Superb tv.\nBuild quality is awesome.\nPicture and sound quality is excellent.\nSony is a brand for reason. Just Go for it.\nAnd omnitech retail is very good seller.",
            "I really loved this product. Sound and picture quality is really good.",
            "Good product, delivered in good condition.",
            "Nice products Sony TV9",
            "If you are looking for small segment TV then this Sony model is BEST BEST buy for you.\nNote-This is purely HD TV i.e 1080p.\nCost is high but the features & standard is Extremely high class.\nJust go for it if you have any thoughts to buy a TV.\nMe n My Wife 199% satisfied and almost every day she is remi ding me the same. :) :)",
            "There were a couple of dead pixel on brand new product out of the box. It was hard for me to believe that kind of quality from Sony. I guess they have deteriorated the quality for their baseline products.",
            "Installation Was Worst..... Charged money....\nNot satisfied with the installation.... Very bad",
            "Nice pic quality, worth for money .",
            "Highly recommended, very high picture quality, dobly atmos sound effect and reliable tv set without 4k",
            "best tv 📺 that I saw in my life",
            "don't think just buy",
            "TV is good",
            "It’s awesome TV. I never seen this much full HD TV.\n\n\nRegards\nSHAIKSHAVALI.P\nAndhra Pradesh",
            "Very slow and less feature as compared to price.",
            "All is good\nAnd it's Cons are:\n1.Power consumption is high since it has 1star ( in Power Savings Guide)\n2.Refresh rate is little bit low.",
            "If you have a medium size room then this 32 inches Led is best. Because of inbuilt Woofers sound quality is really good.",
            "The Tv is just excellent. I am always a fan of sony company especially in terms of TV. The picture quality of this TV is just awesome. I specially purchased it because it is Full HD tv and I am not disappointed. But one thing I will say that if you guys are purchasing it then do get a HD setbox where you can get all channels in hd otherwise pictures will not be as good as it is used to be .",
            "Good and fast service by sony...Quick installation within one day after flipkart dropped tv at home.",
            "I am very happy with flipkart for fast safe delivery my product",
            "Nice one",
            "excellent picture quality.i love Sony.",
            "excellent product",
            "very good picture quality and good sound quality",
            "Sony is Sony super",
            "Excellent picture quality and sound effect is awesome",
            "IT HAS EVERYTHUNG THAT ONE CAN WANT EVERYTHING IS 10 ON 10.EXCEPT SOUND BECAUSE IT DOSE NOT HAVE ANY BASS IN ITS SPEAKER.",
            "Awesome product!!!!😊👍👍 THANKS FLIPKART,KEEP IT UP👍👍👌👌",
            "In this tv you can not install apps you wanted. It's one star energy efficient. Flipkart delevery was bad, I had to travel 90 km to pick the product as the agent refused to delever at home as it was \"two heavy\"...when the area pin code is not deleverable then it should be removed from this app.\n\n\nThe only reason to buy this product was because of SONY brand and it was non china...",
            "Best 32 inch tv if any body only wanted to buy 32inch so i will recommend this tv😍😍❤️❤️ thans flipkart ❤️",
            "Good service and fast service from Sony.",
            "Ok",
            "Nothing to give negative marks.",
            "Excellent",
            "This is an excellent TV and I will recommend everyone to consider this TV. This is not an exact smart TV or Android TV but if you need that just add a roku in your list.",
            "Such a great product from sony\nI really loved it\nIts sound lovely",
            "Good",
            "Nice",
            "Good picture quality and sound is also good. Value of money",
            "Excellent product.",
            "Awesome picture quality",
            "Screen mirroring strucks and no bluetooth conectivity too high price compared to showroom price",
            "Very good product. Excellent sound. Good connectivity.",
            "SUPER",
            "Superb LED 32 TV ...",
            "I think product quality and packing are really very good. I also think this product is worth the cost.\n\nAlthough I feel the product (TV) is processing is a little slow. I mean as in today's world commands given by remote can process a little faster. For example, when I press Youtube it shows processing.\n\nI am surprised to see the product manual, why Sony makes it so complicated. It's really ridiculous that the product manual is more complicated than the product itself.",
            "Good",
            "new user for LED. Fantistic picture and quality.",
            "Sony engineer bed",
            "I attached flipkart I took the TV a month ago Sony's damage was removed but so far I have not been refunded so please give me mine too and you people will not do anything with flipkart will be like me",
            "Nice product",
            "Good product",
            "Excellent",
            "Good",
            "Super",
            "Good product\nGood installation and demo by ss technologies vizag",
            "Super",
            "Paras sharma. Good demo given and friendly behavior.",
            "Excellent",
            "Everything is good. Installing system is very good..",
            "Amazing picture and sound. Worth every rupee spent.best 32 inch full hd tv in the market at the moment. Simply fabulous. Installed promptly and clean.",
            "Sound best & picture quality is super best & screen mirring is poor starting 10-20 min after is best screen mirring all over is best TV 32 inch, No comprising other TV picture quality and sound quality Sony bravia w672G is full hd (1080) is really best experience 👌🔥😍",
            "Except sound, rest of functionalities are up to the mark.",
            "Excellent service by Mr Sujit.,, thank you Sony",
            "Super tv",
            "nice one!",
            "Excellent",
            "Good and timely delivery and installation hassle free\nService provider Rahul kachhi is very helpful",
            "Very good picture quality and sound quality as well...value for money ...very happy",
            "Very good product",
            "Good",
            "Nice",
            "Bad item's",
            "Worked as expected.",
            "Good product and excellent service.",
            "Fine",
            "Overall good service. I am happy with that. Thank you",
            "Mind Blowing",
            "just awesome",
            "Amazing product.😘😘",
            "Nice and awesome products",
            "The product is excellent",
            "Thank you flipkart for the awesome deal",
            "Delivery is good but insulation late",
            "Connectivity is worst but value of product",
            "Excellent deal, value for money. Excellent picture quality, sound quality is very impressive. Thanks to Flipkart for deliver the product on time in good condition.",
            "Good",
            "Nice product and installation services are very good",
            "Good quality",
            "Irfan Khan came for installation and he explained all the functionality very easily",
            "Good",
            "This is my second Sony Bravia TV. The first one was purchased in 2013 and still functional! Enough said😎",
            "Picture quality and sound quality good\nWallmount not given at free of cost who bought in online",
            "Installation done",
            "Tv will deliver but installation won't be done then waited me for 10 days so don't buy these product",
            "Mr. Manubhai installation TV and Good Services by him.",
            "Best picture and sound quality",
            "One Of The Best HD TV",
            "Good",
            "Very costly",
            "I have got this TV installed yesterday. Picture clarity and sound is very good. Got connected with wifi very well. Yet to test the wired network and set-top box connectivity.",
            "Picture quality awesome. Sound also very loud with woofer , no need to add home theatre . Miracast connectivity is available for mobile to tv wireless Connection. Picture share plus is there , we can share pictures easily . Bluetooth should be there it's missing , otherwise it's a great product.",
            "I purchase sony tv during Flipkart sale,recevied in good condition,good built quality,an engineer from sony service centre visited and gave demo completed,sound quality perfect, picture efects awesome, thanks for sony.",
            "Good",
            "The television was ordered before time and the installation guy came on the same day he was very knowledgeable and the product was installed very well",
            "Satisfied with installation..and demo by Manikandan.k",
            "Product is good, and most importantly the delivery, setup by the sony technician before time was so good. We bought this for our aged parents as a surprise gift. Obviously they cant set up the TV by themselves and was dependent on the SONY technicians visit. As per the initial plan they were supposed to setup it up after 3 days of the delivery. But surprisingly they came the very next day and have set it up. Thank you team.\nComing to the TV by itself, so far so good. Will update more after setting up Internet and use the smart features. Presently our parents cant setup the internet, though they have a modem. They need assistance, and so we will wait for the smart TV setup and give more details here :)",
            "Awesome",
            "The installation was nice and smooth and done promptly. Impressed with the service of Sony in this remote area.\nTV and picture quality is awesome,as expected.",
            "Very nice TV",
            "Sanket Nale has given excellent service and very cooperative.",
            "Sony led TV is such a good TV.iam satisfied with this product.",
            "Ok",
            "Awesome Led tv , Picture and sound quality for W672G is excellent , paying extra for Sony tv is worth, Just go for it",
            "Value for money",
            "It is a very good product and value buy.",
            "Good",
            "Sony is a bit costlier but the viewing experience is just wow\nOne can only feel the difference with other TVs when you watch different brands side by side in Showroom",
            "Really good tv.picture quality is great and sound is very good.no need to connect sound bar.sony bravia,bas naam hi kafi ha.",
            "Overall good buy",
            "Picture quality and sound quality super very good product fast delivery by flipkart Thank you Flipkart",
            "Sony is just a excellent.you can go for it",
            "Go for it, you will not get quality picture clarity and amazing sound in this price. Fell in love ❤️ with TV.",
            "Awesome Quality with excellent sound nice service",
            "Nice",
            "Value of money.",
            "Super Tv",
            "Just speechless. Excellent picture quality and excellent sound quality and no doubt value for money. Price is little bit high but value for every penny.",
            "Installation completed today",
            "Good...but picture quality.... try to improve",
            "The best you can have!!",
            "Buy",
            "Installation done after 10 days to sony team after call made to sony call centre.filpkart not even answered the call made.",
            "Excellent TV with great picture and Sound. The only drawback I could find was absence of Hotstar application.",
            "value for money...Sony has improved sound system for this t.v...sony excellent..",
            "Very good TV Sony always treatable",
            "super TV"
        ],
        "likes": [
            "65",
            "73",
            "45",
            "49",
            "4",
            "3",
            "13",
            "14",
            "30",
            "24",
            "65",
            "73",
            "45",
            "49",
            "4",
            "3",
            "13",
            "14",
            "30",
            "24",
            "11",
            "23",
            "16",
            "26",
            "24",
            "12",
            "11",
            "4",
            "4",
            "3",
            "3",
            "6",
            "18",
            "9",
            "3",
            "3",
            "9",
            "3",
            "4",
            "6",
            "1",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "3",
            "4",
            "5",
            "3",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "2",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "14",
            "70",
            "9",
            "14",
            "0",
            "2",
            "0",
            "1",
            "7",
            "5",
            "14",
            "70",
            "9",
            "14",
            "0",
            "2",
            "0",
            "1",
            "7",
            "5",
            "1",
            "5",
            "3",
            "9",
            "8",
            "3",
            "3",
            "0",
            "0",
            "0",
            "0",
            "1",
            "9",
            "3",
            "0",
            "0",
            "5",
            "1",
            "2",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "2",
            "4",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1"
        ]
    },
    "qna": {
        "questions": [
            "Q:Wireless screen mirror is there",
            "Q:Can i play pubg...?",
            "Q:This Tv is coming with wall mount or we have to buy??",
            "Q:Will this TV run on the inverter?",
            "Q:Is this TV supports Blueray Videos and also confitm is this TV has Youtube",
            "Q:Is it smart tv?",
            "Q:Is there any pip or pap feature?",
            "Q:is cast mirroring available ?",
            "Q:Mkv video supported in this product?",
            "Q:will pendrive use",
            "Q:has this TV inbuilt setup box?",
            "Q:is there any software upgrade for this product in future?",
            "Q:Is it androied tv?",
            "Q:(1) Is it wall mountable? (2) Can I watch videos in my mobile memory card through this TV? (3) Can I somehow cast any app running on my mobile into this TV, for example Jio TV?",
            "Q:What is the difference between remote of 622f and 672g and its features",
            "Q:can i use hotstar in this model",
            "Q:can we use Hotstar",
            "Q:wall mount is there",
            "Q:its support 3.0 pendrive",
            "Q:this tv support zee5, Disney app, and available this tv wifi.",
            "Q:this tv have bluetooth conectivity",
            "Q:Cam we can set with wall",
            "Q:can be use this tv computer moniter",
            "Q:is it a smart tv or a simple",
            "Q:does a voltage stabilizer required?",
            "Q:can we connect home theater to this tv?",
            "Q:Do i get a free subscription forr prime video and netflix?",
            "Q:Is this tv has free tv stand",
            "Q:Can i connect an online Media streamer ?",
            "Q:Realme tv 24v sound best OR this sony tv please tell",
            "Q:Does this tv has Google assistant",
            "Q:DTH Connection available in this Smart TV",
            "Q:What is the sound output 20 or 30..in Sony homepage it is mentioned that sound output is 30w But here it is 20w.",
            "Q:If this has HDMI(ARC) port",
            "Q:It is more energy consumes?",
            "Q:Can we connect laptop key board & mouse wireless?",
            "Q:How is display colour deep black?",
            "Q:does it support mp4 files?",
            "Q:Is headphone available in the box content ?",
            "Q:Is the tv supports 1 tb hard disk segate",
            "Q:Does it have app store?",
            "Q:does it have hotstar",
            "Q:is this tv Bluetooth connectivity",
            "Q:Does it has inbuilt wifi facilitiy ?",
            "Q:which is better between 43inch lg vs 32inch this one?",
            "Q:It should have headphone jack",
            "Q:Which model is the best between sony klv32w672f & sony klv32w672g?",
            "Q:which model is good 43w800f ,43w662f ir 43w672g.?",
            "Q:can we change the browser",
            "Q:sound output is what?",
            "Q:Is Bluetooth available??",
            "Q:How to connect home theater 3.5 jack",
            "Q:is YouTube available",
            "Q:is mobile connect are not",
            "Q:Is this TV is user friendly for family members?",
            "Q:how to change my bpl tv",
            "Q:can i watch live TV throug wifi?",
            "Q:which apps are installed in this tv",
            "Q:which model is best W22G OR W672G and what comparision in this two model ?",
            "Q:Which ups support this LED",
            "Q:Optical support output ?",
            "Q:can I see 1080p 720p movies using pendrive usb??",
            "Q:have voice search in remote?",
            "Q:any browser is installed or not",
            "Q:in this product sony liv app support",
            "Q:Can I download additional application?like hotstar, voot ,zee5",
            "Q:sound output 20w or 30w",
            "Q:Can we connect 3G dongle to this tv??",
            "Q:is this support zee5 cinemalu app?",
            "Q:does this tv has Google play store",
            "Q:can i use this led as a monitor?",
            "Q:Is this 2019 model ??",
            "Q:It should have head phone jack with Bluetooth",
            "Q:what about internal storage and ram ??",
            "Q:Is W672G better than W662F ?",
            "Q:Does it support dolby atmos?",
            "Q:suggest 4k anroid 50 inch sony tv",
            "Q:l would like to know, how is it pictures qualities?",
            "Q:Does it have s/pdif out?",
            "Q:in this product hotstar supported",
            "Q:can i watch live cricket match through wifi?",
            "Q:Is it skintuch tv",
            "Q:Can i do chromecast without any wifi",
            "Q:Smartphone connect option",
            "Q:Is there Google assistant.If yes how to connect",
            "Q:Should I attach fire stick with it for getting more apps",
            "Q:We can see 3D movies",
            "Q:How's the quality of upscaling for SD Channels content?",
            "Q:Can I attache Android Box with it?",
            "Q:what kind of panel va or ips",
            "Q:can installed hotstar ?",
            "Q:can I download any app from playstore",
            "Q:does it have optical / coaxial connection",
            "Q:this tv can support to Smart view option like connect to TV Smart view true mobile",
            "Q:Does the 32inch KLV-32W672G support prime video, YouTube and Netflix?",
            "Q:does it support hotstar app?",
            "Q:can we have wall mount and table top both the facility availablr with this product?",
            "Q:4k videos support?",
            "Q:Wich different in 672g vs 772e 43 inch tv",
            "Q:whis is better sony w67g smart tv or sony android tv?"
        ],
        "answers": [
            "A:You can chrome cast the contents on the TV",
            "A:Use screen mirroring on your phone",
            "A:Normal wall mount free not in box demo person will carry",
            "A:yes I'm using it with inverter.",
            "A:Blueray will not support but Youtube is available",
            "A:Yes Sir it's internet tv",
            "A:PIP but one old cable (tuner) and any other any one HDMI or composite video",
            "A:yes, but difficult to stabilise connection",
            "A:yes ! all type format it support.... as i experienced of it",
            "A:Yes, You can",
            "A:No Sir",
            "A:yes",
            "A:No Android but Smart TV",
            "A:Yes! All three possible.",
            "A:it has option of you tube and Netflix and can be used with set top box.",
            "A:No Sir",
            "A:Unfortunately Hotstar is still not available but so was VOOT & ZEE5 which eventually got pushed in through software updates, so hoping someday they would rope in Hotstar into their league",
            "A:yes as it is an original sony tv company service person will contant you after delivery and he will install this tv on to the wall. Sony company person will visit to check this product.",
            "A:yes nd 120 gb hardisk also",
            "A:Yes",
            "A:No, Not having Bluetooth connectivity.",
            "A:Yes... It has all arrangement given in package itself to mount it on wall.",
            "A:Yes, you can certainly connect any LED tv to a PC which has a HDMI port. But mind you only the picture would be visible on the TV, without any sound.",
            "A:smart tv.. cool FHD picture",
            "A:no",
            "A:no",
            "A:no",
            "A:yes",
            "A:Yes",
            "A:Till now best 32inch tv for sound ,picture quality, software update .4 tv shops I have verified every shop seller tells best led Sony bravia 32inch full hd till now Then I buyed from flipkart.",
            "A:Yes",
            "A:DTH connects via vgr pins and vgr slot is not available. but you can connect to DTH via vgr to hdmi converter. So, yes you can connect to DTH.",
            "A:30W I believe",
            "A:Yes",
            "A:NO",
            "A:YES",
            "A:Yes, color of tv is black.",
            "A:Yes",
            "A:No.",
            "A:No",
            "A:No",
            "A:No sir not available in this model",
            "A:No Sir",
            "A:Yes Sir",
            "A:Depends on your budget.",
            "A:Yes TV has one",
            "A:Sir both are good F is 2018 and G 2019",
            "A:43w800f is 2018 model and Android : 43w662f is 2018 internet TV and 43w672g 2019 Internet TV",
            "A:YES",
            "A:super..",
            "A:No Sir",
            "A:No high sound output in tv",
            "A:Yes almost like android tv",
            "A:yes",
            "A:Yes Sir",
            "A:check in the list of products available for exchange. if the tv and model is available in the list, please check and add in the exchange against the new TV",
            "A:Only Amazon Prime, Sony LIV, You tube & Netflix",
            "A:You tube, Netflix, Amazon Prime Video, SonyLiv",
            "A:I presume that W622G is a HD ready LED TV while W672G is a full HD tv. Difference is of the screen resolution. Always go for a FHD led tv, as in case of HD ready TVs there is colour bleeding.",
            "A:Any branded but please ask manufacturer if same works good on this LED",
            "A:No. You can not use the internet through Optical or USB data card. It's internet only can be operated by Wifi only.",
            "A:yes",
            "A:No Sir",
            "A:Yes",
            "A:Yes Sir",
            "A:Voot and Zee5 are already in the list of apps which you would see after updating your software, always keep your software update on auto mode - Hotstar is the only app which is missing from the list.",
            "A:30W",
            "A:Internet only two options Wi-Fi or Wired (LAN)",
            "A:Zee5 pre installed,NETFLIX,YOUTUBE,AMAZON PRIME VIDEO,VOOT,BIG FLIX.But Hotstar till now doesn't available.But it's really really awesome and me and my family really satisfied.",
            "A:No",
            "A:Yes Sir, but will advice monitor",
            "A:yes",
            "A:Headphone jack yes, but no bluetooth",
            "A:i think it's not there. TV is different and Computer is different. but the picture quality is superb and Sound is just awesome.",
            "A:yes of course",
            "A:yes",
            "A:Yes",
            "A:it's HD not 4K tv so picture quality is excellent but not superb. one issue I faced is while screen mirror, there's a interrupted/distorted sound in musics.",
            "A:No Sir",
            "A:No Sir",
            "A:No",
            "A:No",
            "A:no",
            "A:You can cast your smart phone through WiFi.",
            "A:No, not connected",
            "A:Yes its just smart tv only youtube we can use",
            "A:no",
            "A:it is ok but not so good",
            "A:OK,",
            "A:ips panel",
            "A:yes",
            "A:No this is not an android tv. This is running on Sony’s own OS. So no play store download.😊",
            "A:No",
            "A:yes",
            "A:it's support",
            "A:Nope",
            "A:Yup",
            "A:no",
            "A:772 was with Trilluminous",
            "A:Both are good it's depend on your requirement"
        ],
        "likes": [
            "25",
            "46",
            "26",
            "9",
            "9",
            "9",
            "8",
            "10",
            "2",
            "6",
            "6",
            "2",
            "6",
            "3",
            "4",
            "5",
            "19",
            "6",
            "3",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "59",
            "23",
            "12",
            "71",
            "71",
            "5",
            "8",
            "35",
            "3",
            "3",
            "6",
            "13",
            "18",
            "10",
            "8",
            "4",
            "4",
            "2",
            "3",
            "11",
            "4",
            "5",
            "16",
            "7",
            "5",
            "6",
            "3",
            "3",
            "3",
            "3",
            "12",
            "2",
            "1",
            "1",
            "7",
            "2",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "3",
            "14",
            "9",
            "1",
            "2",
            "1",
            "2",
            "3",
            "1",
            "1",
            "2",
            "0",
            "4",
            "2",
            "1",
            "4",
            "28",
            "7",
            "2",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "3",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "2",
            "4",
            "2",
            "13",
            "3",
            "2",
            "28",
            "30",
            "0",
            "1",
            "24",
            "0",
            "0",
            "1",
            "7",
            "12",
            "5",
            "4",
            "1",
            "1",
            "0",
            "0",
            "8",
            "2",
            "2",
            "19",
            "8",
            "3",
            "8",
            "2",
            "2",
            "2",
            "3",
            "22",
            "1",
            "0",
            "0",
            "12",
            "2",
            "5",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "3",
            "3",
            "0",
            "0",
            "0",
            "1",
            "2",
            "4",
            "3",
            "2"
        ]
    }
}