{
    "title": "Vu Cinema TV Action Series 126 cm (50 inch) Ultra HD (4K) LED Smart Android TV with Sound by JBL  (50LX)",
    "product_specification": {
        "In The Box": "Power cable, Remote control, Battery, User manual, Table & wall mount stand.",
        "Model Name": "50LX",
        "Color": "Front Bezel: Matte Black Finish, Rear: Black, Stand: Gold",
        "Display Size": "126 cm (50 inch)",
        "Screen Type": "LED",
        "HD Technology & Resolution": "Ultra HD (4K), 3840 x 2160",
        "Series": "Cinema TV Action Series",
        "Smart Tv": "Yes",
        "Motion Sensor": "No",
        "HDMI": "3 Side",
        "USB": "2 Side",
        "Wi-Fi Type": "IEEE 802.11 a, b, g, n, ac, 2.4 GHz and 5 GHz",
        "Built In Wi-Fi": "Yes",
        "Launch Year": "2021",
        "Wall Mount Included": "Yes",
        "Brightness": "400 nits",
        "Contrast Ratio": "1000000:1 (Static)",
        "Picture Engine": "Quad Core Processor",
        "Picture in Picture (PIP)": "No",
        "Picture And Picture (PAP)": "No",
        "Analog TV Reception": "Color-sound Systems in VHF and UHF Band: PAL-D/K, B/G",
        "Digital TV Reception": "Television Standard in VHF Band / UHF Band: DVBT-T2",
        "Panel Type": "Pixelium Glass Technology",
        "Digital Noise Filter": "Yes",
        "LED Display Type": "Direct LED",
        "Aspect Ratio": "16:9",
        "Refresh Rate": "60 Hz",
        "Supported Video Formats": "AVI (XVID, MPEG2, H.264), MKV (H.264, H.265), MPG (MPEG2), TS (H.264, H.265)",
        "Other Video Features": "HDR10, Dolby Vision HDR, HLG, Dynamic Backlight Control, Active Contrast, Enhanced Viewing Angle, Motion Enhancement, MEMC, Game Mode, Gamma Calibration, Cricket Mode, VOD Upscaler Technology, Digital Noise Reduction",
        "Number of Speakers": "6",
        "Speaker Type": "6-Speakers Front Soundbar",
        "Sound Technology": "Dolby and DTS Virtual X",
        "Surround Sound": "TruSurround X",
        "Speaker Output RMS": "100 W",
        "Sound Mode": "Standard, Theater, Sports, Music, Speech, Late Night",
        "Supported Audio Formats": "MP3, PCM, AC3, AAC, MP2",
        "Other Audio Features": "Audio Enhancement Type: TruBass HDX, TruSurround:X, Dialog Clarity, TruVolume HD",
        "Number of Cores": "4",
        "Processor": "Quad Core Processor",
        "Graphic Processor": "Dual Core",
        "Ram Capacity": "2 GB",
        "Storage Memory": "16 GB",
        "Supported App - Netflix": "Yes",
        "Supported App - Youtube": "Yes",
        "Supported App - Disney+Hotstar": "Yes",
        "Supported Mobile Operating System": "Android",
        "Operating System Present": "Yes",
        "Operating System": "Android",
        "Screen Mirroring": "Yes",
        "App Store Type": "Google Play Store",
        "Pre Installed Browser": "Yes",
        "Content Providers": "Netflix, Prime Video, Hotstar, YouTube, Google Play Store, Google Movie and TV, Google Music, Google Game",
        "Content Languages": "English",
        "System Languages": "English",
        "Bluetooth": "Yes",
        "Mobile High-Definition Link": "No",
        "3G Dongle Plug and Play": "No",
        "Ethernet (RJ45)": "1",
        "Component In (RGB Cable)": "No",
        "Composite In (Audio Video Cable)": "No",
        "NFC Support": "No",
        "Headphone Jack": "Yes",
        "Digital Audio Output": "Optical",
        "Audio Out": "Yes",
        "RF Connectivity Input": "Yes",
        "Analog Audio Input": "Composite In",
        "Touch Remote": "No",
        "Smart Remote": "Yes",
        "Color Screen": "Yes",
        "RF Capable": "No",
        "IR Capable": "Yes",
        "Internet Access": "Yes",
        "LED Backlit Buttons": "Yes",
        "Operating Distance": "3.5 m",
        "Battery Type": "2 AAA Batteries",
        "Remote Charger": "No",
        "Other Remote Control Features": "Netflix, Prime Video, Hotstar, YouTube and Google Play Hotkeys on Remote, Google Voice Assistance, Smart Remote, Remote Controller Technology: IR/1 and Bluetooth",
        "Power Requirement": "AC 100 - 240 V, 50/60 Hz",
        "Power Consumption": "130 W, 0.5 W (Standby)",
        "Clock": "Yes",
        "Auto Power Off": "Yes",
        "Sleep Timer": "Yes",
        "On/Off Timer": "Yes",
        "Child Lock": "Yes",
        "Other Convenience Features": "Power Off if No Signal, Program Lock, Software Version OSD Indication, Favorite Channels List",
        "Parental Control": "Yes",
        "Width x Height x Depth (without stand)": "1118 mm x 676 mm x 78 mm",
        "Weight (without stand)": "10.6 kg",
        "Width x Height x Depth (with stand)": "1118 mm x 741 mm x 225 mm",
        "Weight (with stand)": "11.2 kg",
        "Stand Type": "Wall Mount and Table Top Stand",
        "Stand Features": "Gold",
        "Other Dimensions": "VESA Wall Mount Dimensions (Horizontal / Vertical): 200 X 200 mm",
        "Warranty Summary": "3 Year Warranty on Product from Vu",
        "Covered in Warranty": "All Manufacturing Defects",
        "Not Covered in Warranty": "Warranty Does Not Cover Any External Accessories (Such as Battery, Cable, Carrying Bag), Damage Caused to the Product Due to Improper Installation by Customer, Normal Wear and Tear and Damages Caused to the Product by Accident, Lightening, Ingress of Water, Fire, Dropping or Excessive Shock, Any Damage Caused Due to Tampering of the Product by an Unauthorized Agent.",
        "Warranty Service Type": "Technician Visit",
        "Width x Height x Depth": "45 mm x 170 mm x 21 mm",
        "Weight": "70 g",
        "Installation & Demo Details": "We'll facilitate the installation and demo through authorized service engineer at your convenience The installation will be done within 48 hours of delivery of the TV.The service engineer will install your new TV, either on wall mount or on table top. Installation and demo are provided free of cost.The engineer will also help you understand your new TV's features.The process generally covers:Wall-mounted or table-top installation, as requested.Physical check of all ports, including power and USB ports. Accessories also checked.Demonstration of features and settingsQuick run-through on how to operate the TV"
    },
    "product_description": {
        "Pixelium Technology": "This VU Cinema TV features up to 500 nits of brightness, and Pixelium technology that optimises the light reflections. As a result, you see improved visuals with impressive brightness.",
        "Triple Image Technology (Dolby Vision, HDR10, HLG)": "This home entertainment appliance comes with an image processor that supports Dolby Vision, HDR and HLG video triple decoding to enhance the details, sharpness, depth, and black and white level. This feature optimises the contrast and colour accuracy to improve the clarity levels even in dark scenes and to reproduce lifelike visuals.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "4",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "3",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "3",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "3",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "2",
            "4",
            "3",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "3",
            "5",
            "2",
            "5",
            "1",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "3",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "3",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "3",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5"
        ],
        "review": [
            "Good Product.\nThe TV is very good for the price range, i have used oneplus QLED Q1 and would like to compare with it.\n\n1) Picture Quality:\nQuality is excellent for an non -qled TV, the black levels are not so deep compared to Oneplus TV.. but other colours look vibrant and and natural. Screen is bright enough, 4K HDRs look stunning, 1080p is also looks great, it plays 4k HDR and 2160p at 60 FPS is YouTube. SD channels understandably looks dull, Dolby vision is supported and looks even great, but as black levels are bit low dark scenes look washed out a bit, but still it looks great if watching from a distance, u need to fine tune a bit in the picture settings to get some desired colours, one annyoing thing with this TV is in most picture settings motion enhancement is kept On. so if u are watching movies means u will feel soap opera effect and everything moves smooth that u will not enjoy movie, so while watching movies make sure u turn smooth motion to OFF.\nOverall i rate it 5 out of 5 as it is nonqled tv\nEdited on 2-2-21\n\n2) Sound Quality\nIf u think 100 watts is enough and sounds great, get ready to get disappointed, I don't know if its problem with my Tv or System is like that, the sound doesn't sound good, my onelpus at 50w sounded excellent, but this TV dont know if its problem with my TV, but its sounds below average, no clarity and audio settings are also so much confusing with so many On and Offs, may be need to fine tune that, and also i feel some sounds are missing it sound like it is not playing all vocals, feeling something is missing, will check and comeback later and give sound feedback.\nTill then Overall Rating is 3 out of 5\nEdit: it's a problem with software got desirable result after fine tuning and changing settings\n\n3) TV Menu and Remote\nTV is typical android TV Menu and u can download all popular apps and games,\nRemote is fine but its plastic and looks of cheap quality, but its ok as it as all basic buttons and shortcut keys to many popular apps, and also shortcut to input selection.\none thing is whenever power on TV it goes to Android Menu, it doesn't go to HDMI, i haven't found any setting which makes HDMI as default screen, can be bother some for old people.\nNot giving overall Rating as it depends on individual preferences\n\n4) Screen Mirroring\nscreen mirroring is absolutely great and everything works, i mirrored YouTube videos and games from pocox3 to TV and it plays almost lag free, games also look great even if its casted from mobile,\nRating 4.5 out of 5\n\n5) Connectivity\nHas all major connectivity at side and if u are wall mounting consider putting USB extender cable and one extra HDMI cable and leave the cable, so u can connect HDMI devices and External HDD easily whenever needed.\nIt connects to my Pocox3 hotspot and connection is very stable and plays videos at 1080p without buffering,\n\none more thing many say its rebranded of Hisense Tornando TV, i cant comment on that as I don't have that TV, Physical photo wise and specification wise both looks similar in every aspect.\n\nWill add few more feedback later after using for more days.\n\nAt present i am giving it 5 out of 5.\ni will probably wait for one update so that sound issue can be resolved, really u wont believe is it a sound of 100 wats speaker,",
            "Best tv in this price segment. With this feature s, you will get this tv on half the price of samsung, lg or sony. Excellent picture. Clear sound. And 3 years warranty. Delivery was on time. Installation guy was very humble and good. Free installation. Gave his number, if any issue comes. Thanks flipcart. Thanks VU. Cinema tv is best.",
            "Its a really good TV with Amazing picture clarity, Standby mode to switch on tv faster if on standby and decent sound quality.\n\nSound is too loud and very good as well but its not the best since i am used to of hearing through Bose, Bose speakers are much much better in quality, but then in price too.\n\nIt should have been priced 5k less, but never the less, there isn't any 65 inch TV in this range with these features and quality, so had to opt it and i am very much satisfied with it.\n\nThis TV is hisense procured with maybe some optimization done from VUs end. I could make this out that this is hisense procured since the name of motherboard is also hisense when i checked with CPU app. They dint even bother to change it... :P.\n\n3 Years warranty is great to have.\n\nWhile purchasing if you still do not have any other TV with lesser price with these features, then go for it, you won't regret it.",
            "I have been using the TV for around 1 week now and my first impressions are really good. Before buying this, I already had used a 40\" VU TV along with a 48\" Samsung, so I had no qualms about its picture quality and was confident about buying. And this had not let me down. Amazing picture quality for the price. You really feel like owning a personal theatre. I chose this model over the cheaper 65\" model because of JBL speakers. Well the speakers are not really out of the world but they do the job for a small drawing room - decent clear sound, only thing missing is good bass, for which I plan to buy a bass booster soon.\nMy only issue is with settings of picture, while the quality is amazing but the default settings keep coming back, not sure why it cant save the settings. The default settings have a backlight option set at 100 which is harmful for the eyes and in one week almost everyone in my house is having pain in their eyes, before I figured out the issue. Even automatic settings dont help, you have to manually reduce the backlight setting to 40-50 level for all presets. Thats the only issue, I hope it saves the preset settings for future. Will confirm the same in my next edit of review after one more week.",
            "Picture Quality is not upto the mark whereas in TCL having almost same prices having far better picture Quality.Sound is cool but not good as 100W speakers.i purchased it in a hope that it is Indian Brand to support Make in Bharat.",
            "Thanks to Flipcart. I ordered my TV on 26 th january. promptly as suggested i received it within two days in good condition. installation was also in time and fully saties fied for their immediate response. Good as per my observance for the first one week.",
            "Picture clarity is excellent and sound is like home theater. 4k and 8k channel are looking like real picture. In 65 inch worth for money",
            "VU cinema series TV..best tv ...nyc sound..4k vdo picture quality super...worth in this price...luv to bought this...very much satisfied and happy wth this product...also flipcart service is very promt and professional....smooth installation by professional technician...my Vikas...very soft spoken and decent guy...",
            "This is the only review you will need.\nThis model is the updated version of 2020’s VU Cinema TVs with more storage, ram and a better processor. The 103W soundbar is a highlight. I can 100% recommend anyone to go for this TV blindly, there is no compromise made. Be sure to checkout the tips section for best experience.\n\nPICTURE:\nThe panel offers rich vibrant colors and excellent contrast. The color gamut coverage is great. Brightness level is literally a benchmark. Even the black levels are super-deep for an LED. It even supports HDR 10 and Dolby Vision content which many modern releases are available in. No defects like light bleeding were observed. The overall picture quality is directly comparable to top end TVs\n\n4K on youtube etc. looks brilliant . I am still to play true 4k content on this but thats not needed to see how good the display is. Upscaling of content is excellent too. 1080p content looks flawless, virtually indistinguishable from a 4k print at first glance. Even SDR content is displayed well. I recommend turning off clear motion feature for SDR content as these features tend to impact image quality of SDR content on all TVs.\n\nSOUND:\nThe sound bar is amazing and produces all frequencies well, especially the bass. The punchy yet balanced bass makes sound effects and background score all the more impactful. There are many expensive top end TVs, especially Sony TVs that compromise on sound quality. It is such and important aspect of viewing that gets overlooked by premium brands so that customers have to buy separate speakers/soundbars. VU has placed the customer first and packed an excellent sound system that will be enough no matter how big a hall you place this tv in. Just a volume level of 20 is enough to rock my house. It is perfect for parties as every beat and note is felt from these speakers. The tv even has an audio only mode that turns off the display for such situations.\n\nINPUT:\n\nIts got all the necessary ports and also reads my hard drive well. I am yet to check if there is input lag for gaming.\n\nTIPS for best experience:-\n1) Picture:\n> Use backlight level of 50-70. This panel is so bright, using backlight above 70 is just pointless. Even 50 is practically enough unless there is too much lighting in the room.\n> Turn off active contrast. Its a gimmicky feature all Tv brands are pushing nowadays but we are better off without using it. Using it artificially enhances the contrast between distinct colors which can cause some details to get blown out around bright areas of a picture. It also makes shadow regions in images look unnatural. I recommend not using this feature on any brand and instead increase the contrast setting to suit your eye.\n> I prefer natural or standard preset but there are enough options to suit your preference. Even dolby vision mode has options. Since the panel already produces rich colors, i would keep color setting at 50-55.\n\n2) Sound:\n> Turn on tru bass (this makes the bass punchy and even adds warmth to sounds like voices).\n> Turn on dialogue clarity.\n> Turn off surround sound.",
            "1. Perfect & most realistic Picture\n2. No Need of Sound bar, JBL 100W is just Awesome 👍\n3. Connectivity is Perfect\n4. Viewing Angle is Superb when Viewing enhancement turned on\n5. Keep Motion Enhancement clear in Settings, So that we can experience Cinematic..\n6. Dolby Vision is just Awesome\n7. Plays HDR content without any Lag\n8. Keep set the Sound mode to theatre & keep on Wall Mount Setup, Sound is Perfect\n9. APart from HD & 4K, SD content also looks nice up to Max Level..\n10. Little Bit ...\nREAD MORE",
            "Good Product.\nThe TV is very good for the price range, i have used oneplus QLED Q1 and would like to compare with it.\n\n1) Picture Quality:\nQuality is excellent for an non -qled TV, the black levels are not so deep compared to Oneplus TV.. but other colours look vibrant and and natural. Screen is bright enough, 4K HDRs look stunning, 1080p is also looks great, it plays 4k HDR and 2160p at 60 FPS is YouTube. SD channels understandably looks dull, Dolby vision is supported and looks even great, but as black levels are bit low dark scenes look washed out a bit, but still it looks great if watching from a distance, u need to fine tune a bit in the picture settings to get some desired colours, one annyoing thing with this TV is in most picture settings motion enhancement is kept On. so if u are watching movies means u will feel soap opera effect and everything moves smooth that u will not enjoy movie, so while watching movies make sure u turn smooth motion to OFF.\nOverall i rate it 5 out of 5 as it is nonqled tv\nEdited on 2-2-21\n\n2) Sound Quality\nIf u think 100 watts is enough and sounds great, get ready to get disappointed, I don't know if its problem with my Tv or System is like that, the sound doesn't sound good, my onelpus at 50w sounded excellent, but this TV dont know if its problem with my TV, but its sounds below average, no clarity and audio settings are also so much confusing with so many On and Offs, may be need to fine tune that, and also i feel some sounds are missing it sound like it is not playing all vocals, feeling something is missing, will check and comeback later and give sound feedback.\nTill then Overall Rating is 3 out of 5\nEdit: it's a problem with software got desirable result after fine tuning and changing settings\n\n3) TV Menu and Remote\nTV is typical android TV Menu and u can download all popular apps and games,\nRemote is fine but its plastic and looks of cheap quality, but its ok as it as all basic buttons and shortcut keys to many popular apps, and also shortcut to input selection.\none thing is whenever power on TV it goes to Android Menu, it doesn't go to HDMI, i haven't found any setting which makes HDMI as default screen, can be bother some for old people.\nNot giving overall Rating as it depends on individual preferences\n\n4) Screen Mirroring\nscreen mirroring is absolutely great and everything works, i mirrored YouTube videos and games from pocox3 to TV and it plays almost lag free, games also look great even if its casted from mobile,\nRating 4.5 out of 5\n\n5) Connectivity\nHas all major connectivity at side and if u are wall mounting consider putting USB extender cable and one extra HDMI cable and leave the cable, so u can connect HDMI devices and External HDD easily whenever needed.\nIt connects to my Pocox3 hotspot and connection is very stable and plays videos at 1080p without buffering,\n\none more thing many say its rebranded of Hisense Tornando TV, i cant comment on that as I don't have that TV, Physical photo wise and specification wise both looks similar in every aspect.\n\nWill add few more feedback later after using for more days.\n\nAt present i am giving it 5 out of 5.\ni will probably wait for one update so that sound issue can be resolved, really u wont believe is it a sound of 100 wats speaker,",
            "Best tv in this price segment. With this feature s, you will get this tv on half the price of samsung, lg or sony. Excellent picture. Clear sound. And 3 years warranty. Delivery was on time. Installation guy was very humble and good. Free installation. Gave his number, if any issue comes. Thanks flipcart. Thanks VU. Cinema tv is best.",
            "Its a really good TV with Amazing picture clarity, Standby mode to switch on tv faster if on standby and decent sound quality.\n\nSound is too loud and very good as well but its not the best since i am used to of hearing through Bose, Bose speakers are much much better in quality, but then in price too.\n\nIt should have been priced 5k less, but never the less, there isn't any 65 inch TV in this range with these features and quality, so had to opt it and i am very much satisfied with it.\n\nThis TV is hisense procured with maybe some optimization done from VUs end. I could make this out that this is hisense procured since the name of motherboard is also hisense when i checked with CPU app. They dint even bother to change it... :P.\n\n3 Years warranty is great to have.\n\nWhile purchasing if you still do not have any other TV with lesser price with these features, then go for it, you won't regret it.",
            "I have been using the TV for around 1 week now and my first impressions are really good. Before buying this, I already had used a 40\" VU TV along with a 48\" Samsung, so I had no qualms about its picture quality and was confident about buying. And this had not let me down. Amazing picture quality for the price. You really feel like owning a personal theatre. I chose this model over the cheaper 65\" model because of JBL speakers. Well the speakers are not really out of the world but they do the job for a small drawing room - decent clear sound, only thing missing is good bass, for which I plan to buy a bass booster soon.\nMy only issue is with settings of picture, while the quality is amazing but the default settings keep coming back, not sure why it cant save the settings. The default settings have a backlight option set at 100 which is harmful for the eyes and in one week almost everyone in my house is having pain in their eyes, before I figured out the issue. Even automatic settings dont help, you have to manually reduce the backlight setting to 40-50 level for all presets. Thats the only issue, I hope it saves the preset settings for future. Will confirm the same in my next edit of review after one more week.",
            "Picture Quality is not upto the mark whereas in TCL having almost same prices having far better picture Quality.Sound is cool but not good as 100W speakers.i purchased it in a hope that it is Indian Brand to support Make in Bharat.",
            "Thanks to Flipcart. I ordered my TV on 26 th january. promptly as suggested i received it within two days in good condition. installation was also in time and fully saties fied for their immediate response. Good as per my observance for the first one week.",
            "Picture clarity is excellent and sound is like home theater. 4k and 8k channel are looking like real picture. In 65 inch worth for money",
            "VU cinema series TV..best tv ...nyc sound..4k vdo picture quality super...worth in this price...luv to bought this...very much satisfied and happy wth this product...also flipcart service is very promt and professional....smooth installation by professional technician...my Vikas...very soft spoken and decent guy...",
            "This is the only review you will need.\nThis model is the updated version of 2020’s VU Cinema TVs with more storage, ram and a better processor. The 103W soundbar is a highlight. I can 100% recommend anyone to go for this TV blindly, there is no compromise made. Be sure to checkout the tips section for best experience.\n\nPICTURE:\nThe panel offers rich vibrant colors and excellent contrast. The color gamut coverage is great. Brightness level is literally a benchmark. Even the black levels are super-deep for an LED. It even supports HDR 10 and Dolby Vision content which many modern releases are available in. No defects like light bleeding were observed. The overall picture quality is directly comparable to top end TVs\n\n4K on youtube etc. looks brilliant . I am still to play true 4k content on this but thats not needed to see how good the display is. Upscaling of content is excellent too. 1080p content looks flawless, virtually indistinguishable from a 4k print at first glance. Even SDR content is displayed well. I recommend turning off clear motion feature for SDR content as these features tend to impact image quality of SDR content on all TVs.\n\nSOUND:\nThe sound bar is amazing and produces all frequencies well, especially the bass. The punchy yet balanced bass makes sound effects and background score all the more impactful. There are many expensive top end TVs, especially Sony TVs that compromise on sound quality. It is such and important aspect of viewing that gets overlooked by premium brands so that customers have to buy separate speakers/soundbars. VU has placed the customer first and packed an excellent sound system that will be enough no matter how big a hall you place this tv in. Just a volume level of 20 is enough to rock my house. It is perfect for parties as every beat and note is felt from these speakers. The tv even has an audio only mode that turns off the display for such situations.\n\nINPUT:\n\nIts got all the necessary ports and also reads my hard drive well. I am yet to check if there is input lag for gaming.\n\nTIPS for best experience:-\n1) Picture:\n> Use backlight level of 50-70. This panel is so bright, using backlight above 70 is just pointless. Even 50 is practically enough unless there is too much lighting in the room.\n> Turn off active contrast. Its a gimmicky feature all Tv brands are pushing nowadays but we are better off without using it. Using it artificially enhances the contrast between distinct colors which can cause some details to get blown out around bright areas of a picture. It also makes shadow regions in images look unnatural. I recommend not using this feature on any brand and instead increase the contrast setting to suit your eye.\n> I prefer natural or standard preset but there are enough options to suit your preference. Even dolby vision mode has options. Since the panel already produces rich colors, i would keep color setting at 50-55.\n\n2) Sound:\n> Turn on tru bass (this makes the bass punchy and even adds warmth to sounds like voices).\n> Turn on dialogue clarity.\n> Turn off surround sound.",
            "1. Perfect & most realistic Picture\n2. No Need of Sound bar, JBL 100W is just Awesome 👍\n3. Connectivity is Perfect\n4. Viewing Angle is Superb when Viewing enhancement turned on\n5. Keep Motion Enhancement clear in Settings, So that we can experience Cinematic..\n6. Dolby Vision is just Awesome\n7. Plays HDR content without any Lag\n8. Keep set the Sound mode to theatre & keep on Wall Mount Setup, Sound is Perfect\n9. APart from HD & 4K, SD content also looks nice up to Max Level..\n10. Little Bit ...\nREAD MORE",
            "Let's make VU TV a premium brand like sony, lg, samsung, mi.. . OMG.. After using two days i am writing this.. A value for money TV.. Picture is awesome.. 5 star.. Its a sound gaint.. Gave it 105 star..ou of 100 star. True dolby atmos sound & vision.. Colours are real.. Truely a CINEMA experience.. Just go for it with out a doubt.. One thing is clear that VU tv is none other than a Hisense Tv.. This a one product of HISENSE TV with a new name.. So clear ur doubt.. If u want 3 year warranty on a tv then go for it.. Other than Hisense tornado is the option with 1 year warranty.. Fast delivery by FLIPKAT.. but one thing i want to share with FLIPKART that, Technician who install the tv are likely to be more professional. \"Javes\"(installation company) is not sent professional technicians, they work with local technicians.. And very last if u want to convert your dining or living room to a cinema hall then surely go for it.. The VU tv is not a less then any other big brand tv.",
            "Excellent product good and safe delivery and instalation person good coming to tv very big screen this is not tv\nTheatre value for money overall excellent",
            "Very good LED I like it super product thank you Flipkart",
            "VU cinema TV. After this marvelous purchase, me, my family dnt wanted to go to theatre and waste money.\nSound: Aah, the soundbar giving me the ultimate sound effect thanks to \"dts- surround\" system which gives you clyster clear sound(without woofing) makes you feel sound every corner with 3d auro.\nIt's better to have a closed room then the sound will be the same I mentioned. Otherwise it will be like normal tv sound ( better than the rest)\nFor your information, I have sony ht300 connected with tv.\n\nPicture: What to say..... Dolby picture gives ultimate picture quality like none another tv in this segment with 500hz quality.\n\nAll around purchase experience: A BETTER CHOICE TO BUY A BIG SCREEN WITH GOOD SOUND.\nCLOSE YOUR EYES AND GO WITH THIS👍😊",
            "Just buy! I would urge you to not waste your time in comparing the TV in terms of cost and quality with other brands. Undoubtedly the best configuration in this cost. I bought this a month back and it looks just perfect. Like anybody else I spent hours and hours to be sure. I only don’t have any feedback on the service provided by Vu as it is only a month.\nBest Brightness, Best Sound system, Good refresh rate, Good inbuilt routers(in layman language).",
            "Review after usage of one month. Super TV. Very good picture quality. If your are fond of watching movie in theatres, you can watch movie in this TV in cinema picture and theatre sound mode, u will get kind of theatre feeling. One con is that the normal SD channels doesn’t look that great. Sound is very good, only buy this tv if you don’t have sound bar, else you will be wasting money in again buying attached JBL speakers.\n\nFinally I want it say it’s a good tv and 3 year warranty is just good.",
            "The output quality is guaranteed, the back panel such Rock solid , a fantastic choice with this price segment. Sound is good compared to other leading brands. Feeling like watching at theatre.",
            "Certainly a best deal and to buy this cinema scope type TV is worth with the three year warranty coverage. Chromecast not functioning well with streaming videos of YouTube etc., had to be fixed and updated. Planning to buy another TV of the same brand.",
            "Stunning picture quality and sound. Very familiar user experience and simple to use. Interface is very fast and boot up is also quick. Very good sound effect from the JBL speakers. Really a cinematic experience",
            "It's better than most affordable models of big brands 3 brands, so if you want to have best TV experience in a budget and not spend 80k for it, go for this 🤟.... with 3 years of warranty.",
            "Reviewing after 1 month of usage. I was very hesitant while getting this brand. I have previously used a samsung 40inch non-smart tv.\nPICTURE : Settings available to customise as required, brightness and color have capabilities. Do try multiple settings and use the preferred one.\nSOUND : tvs with good sound are less now a days. Speakers are capable of giving a lot of bass and also there are handy settings for turning them on or off. As mentioned in one of the comment. Theatre mode works good. If not a bass lover, disable to 0 bass as at times bass will affect voice a bit.\nCONNECTIVITY : not seen problem at all\nCurrently on Android 9\n\nVery less options on 65 inch variant, definitely a good buy on this price range.",
            "The sound quality for a 100w soundbar is not upto the mark, Picture quality is good and refresh rate is better than other tv. Overall the performance of the tv is good just a little disappointed by the sound quality",
            "Wonderful tv in vu series\n1.picture quality is very good\n2.Audio Was decent theater mode is good\n3.Conctivity also good\n4.Remote control is not upto mark it's look like old\nIam full satisfaction in picture quality and Sound it's wonderful if u want picture quality go for blind",
            "Awesome picture clarity upscaling is very very good\nIm using sd setup box upscaling very good im veruy satisfy",
            "Awesome Led and worth every penny. :)\nForget about big brand Leds as you can get same configuration or even better at this cost.\nThank you Flipkart for timely delivery and installation.",
            "It was best decision I made, delivered on time, installation was quick & smooth. Writing this review after 5 weeks of usage, picture quality excellent with exceptional viewing angle, true colour display. Sound is very good, I never increased beyond 20 % of max valume for regular Chanel, higher valume in music channel does give good bass , it's more than sufficient , but can't expect performance of high end home theater experience. Overall more than happy with performance.",
            "after using 2 months, i would like share the review of this product, 3 years warranty is amazing, 100 watt sound is not so good, up to 10 points of volume is good, after 10 points volume not increasing much more, moderate increase, dialague clarity is not as much as we expected, background sounds dominated the dialogues , connectivity was good, picture quality is awesome",
            "Good picture quality with impressive sound. Go for it with eyes closed. My first order had black patches in the edges so got it replaced within 10 days. Second tv has been good so far",
            "Excellent TV and especially it's giving the best for the value. Most recommended to anyone who is really willing to buy a TV with a good sound and picture quality. The JBL sound bar is very decent and doing it's job. Overall, satisfied with the whole performance of the TV in this price range😀.",
            "Good quality picture resolution and overall worth money,. Only thing sound 100w can't fix to high level , there is no button for sound bass ON, OFF and sound average.. I like the product for this range..",
            "GOOD PRODUCT WORTH FOR MONEY",
            "TV is simply awesome. Very good picture clarity. Sound output is good much better than its peers. After connecting to wifi it works perfect. No lags at all.",
            "Good for price range",
            "Picture quality is good, but sound is not constant.\nNeed to do some adjustments",
            "Awesome cool picture with theater feel. Those who really want a theatre feel in their home they can go for this.",
            "With almost 3 months of searching finally iI gave a push to buy this tv.\nIT IS MIND-BLOWING!!!!!!\n\nSOUND: 5\nPICTURE:\nCONNECTIVITY: 5\nDESIGN: 5",
            "Best tv in this segment,\ngood sound no need home theatre,\npicture quality very nice,\nThis is the perfect tv 👌👌👌",
            "My vu action cinema tv had shown some problem within 10 days & we asked for replacement or refund according to the policy of Flipkart but flip kRt send a technician & the problem was not visible according to the technician.So,,the Flipkart rejected my request.We,r highly disappointed by your action.\nAs per return policy problem is communicated within time frame , we have reported white patch is comming in my tv as per observation which is recorded and shown to vu representative ,under this situation customer request should be consider ,either replace this tv with new piece or refund.\n\nIssue not resolved",
            "Good display and sound system",
            "I liked the picture quality very much and build quality of this tv is also awesome.\nBut when it comes to sound its very bad specially while watching movies, you barely can understand what they are saying in lows that's why you have to keep sound on higher side in order to understand. But bass and highs are awesome.",
            "Cinema tv is really good just got delivered today insrltallation same day nice service by flipkart..\nTv is really good and mammoth. picture quality is awesome.sound no doubt jbl speaker 100w.. really u will have cinematic experience.no need to buy separate sound bar.",
            "Everything is fine.. but the while watching movie some times the change of picture is shady in black and blur. It all depends on the input video quality.\nRest of the thinks are fine.. picture perfect ..😀👍\nWaiting for the Android 10 update..",
            "Very good for medium budget.",
            "My kid enjoying this large screen... Even we can see the tv closer by 4 feet also..",
            "Value for Money",
            "Good picture quality.\nBuild quality is also good.\n\nSound is not up to the mark. While watching movies some time music effect louder than vocal sound, but ok.\n\nNeed software update to overcome existing bugs like changed picture and sound settings are reset when TV restarted.\nBacklight always reset to 100% after starting TV.\nMissing automatic screen brightness control depends on room light.\n\nI think VU should provide latest Android 10 with Google TV launcher instead of existing Android 9.",
            "thumbs up",
            "Was confused between bravia x80j and this but i am completely satisfied with this. There is difference between picture quality of both but very little and the price tag of bravia is just double picture quality of this tv is at power with samsung and sony colours are punchy details are good sound is awesome at last if you want to save money then just go for it…",
            "Nice product picture and sound quality is awesome",
            "Excellent quality... Must buy... Love it 😊",
            "Amazing product dont think too much just go for it.",
            "Recieved damaged product display problem",
            "Very good sound quality and image clarity. The video is on another level. The first delivery, I received a damaged product but the replacement was quick and I received the product in proper condition.",
            "Suggestion: Buy VU premium TV and home theater if you want better sound. You will save 10 thousand.\nExpectation not meet in the sound.",
            "Good Product.",
            "Fabulous android tv with a fair price, picture quality was simply superb, sound was great with inbuilt soundbar by JBL.. sound is very high in small hall and teeters, sub-woofer sound is good.. over all TV was simply superb.. with the cinematic sound with Dolby Atmos.",
            "Good rebranded televison.",
            "TV was delivered on 11th March in good condition. But till date (25 March) no one came for installation. Horrible service by installation team.",
            "The picture quality is excellent.\nNot satisfied with the audio.",
            "Picture quality 5/5\nSound quality 5/5\nPerformance 5/5\nThank you to Flipkart...",
            "Except 100 watt JBL sound ( not like 100 watt) but sufficient for small living room or hall,\n\nPicture quality is marvelous.",
            "Sound quality for 100 Watt sound bar is very poor ... Wasting of extra money.... Better to go for premium TV.",
            "Poor Support and Installation policy.",
            "Great TV for thr price, forget LG, Samsung and Sonys for this price",
            "Excellent service by Flipkart and VU",
            "Awesome purchase",
            "Picture quality superb 5/5\nSound quality awesome 4.5/5",
            "Excellent.......!!!",
            "Picture quality is too good. Sound is also loud and clear.",
            "Good. Quality good picture good sound",
            "Amazing picture quality and Awesome Sound\namazing theatre experience.... wow.....,\ntoo good\nthanks VU\nthanks flipkart",
            "Value for money product.. Good service by flipkart as also the Vu technician.. Keep up the good work 🥂👍👍",
            "Good product, I liked sound quality and picture quality",
            "Very good and value for money TV with android 9. Hope we get an update.",
            "For installation of a 65 inch size tv, 2 persons are required.You sent a single person.He did his job with our assistance.So, send 2 persons to instal a 65 inch tv for the convenience of your esteemed customers.",
            "Nobody Came for installation\nNobody Telephoned\nand its very very Bad",
            "Excellent TV, especially Sound outcome is awesome, Value for money, I've recommended two others.",
            "one of the best tv from VU\nall the thing are perfect\nwhen we talk about connectivity ,picture quality\neven sound quality.",
            "Picture quality is exceptional! Speakers need some tweaking based on content watched to get the best output. Performance and Speed of proceed is neat. Overall a 5 star rating.",
            "The picture is nice but not exceptional. There could be some backlight bleeding. Also due to absence of micro dimming, you get see the black part glowing. Over all i took this tv as wanted a 65 inch at a competitive price. On second thoughts should have gone for a branded one with 55 inch for almost similar price.",
            "Good",
            "Nice deal, awesome clarity and sound",
            "The delivery & installation service is really bad from flipkart.\n\nIt is always considered to be delayed. How hard is to organize an installation when you have delivery lead time of 4 days.. That gives you 5 days to prepare your installation.\n\nThe problem is culture of the organization which takes leverage to go down the last min of timeline.\n\nHardly i have ever noticed them on time. Jeeves operates from 4 warehouses across India.. Operation management is completely missing",
            "Good product but delivery true late",
            "Tv install is not done properly. Rest all good",
            "It's too big size for my 16x21 hall and the sounds quality is ok only for movies from external Hard disk playing. Not that much like external sound bar. For watching dish TV it is ok like some what more sounds quality.",
            "I am using this TV since 6 months. I has given our family a compact, cost theater experience right at our living rooms. All is good except that it makes you gets addicted 😂",
            "Picture Quality is good, Sound Quality is average. Flipkart delivered too late after repeated followups.",
            "Problem in updating apps",
            "Very good",
            "Very nice",
            "Nice",
            "Super picture quality good sound quality reasonable price",
            "Sound effect extent",
            "It's simply awesome",
            "Good product",
            "Superb sound and picture quality",
            "I am using this Tv from 1 months. Pl buy this is you are going to use as Internet TV and HD channels only. No recommended for standard Channel users.",
            "Superb awesome",
            "Given review after using 2month. This is best value of money product. Almost 4month searching TV after that buy this vu50lx. It's 2021 model 100wt sound very good picture quality. I suggest to everyone buy this vu50lx TV.",
            "Really awesome 👌 super quality worth of money",
            "Best tv",
            "The sound is good but not screen quality.....the whites are very bright and suppressing other colours.",
            "Picture quality and all is good.\nBut sound should have been better considering 100w sound bar",
            "Screen mirroring n sound quality is completely bad",
            "Best buy excellent TV and prompt delivery and installation.",
            "Tv is just owesome... Just enjoyed it ..from picture quality to sound just exellent... Connectivity is very good... User friendly... Easy to use...",
            "excellent picture qulity and sound also good",
            "After 15 Day's Of Using, Now I'm in the current situation to tell about this, Just One Word, Close Ur Eyes And Buy This, The Picture And The Sound Quality Just Going Through My Heart. Fabulous 🙃😀",
            "I used one week VU TV 55 Cinema TV , the picture quality is very good and also sound. compared other modal tv , vu is best tv .",
            "Ok good bit not great, dialogue clarity very poor",
            "Product it's good.... But installation is not good",
            "Very nice TV..\nGood picture clarity and superb sound.",
            "Super",
            "Its an amazing product. Picture clarity is just awesome.",
            "Very nice product, value for money!!!",
            "Bought this after lot of research and it lived upto my expectations.\nGood combo on this price segment.",
            "Value for money. Good quality.",
            "Classy Product!",
            "Same hisense tornado tv with vu logo.. and 5k extra.. expected a better product from VU",
            "All facilities with low price .but 100w not required for small family",
            "It's very nice product and enjoyed the view and integrated JBL Sound system.",
            "Best product quality is best.with best sound",
            "Excellent",
            "Tv is awesome and sound quality is also good great value for money",
            "Good Product",
            "Good",
            "Awesome product,very good picture clarity,nice sound effect ,Totally a good one to buy",
            "Very happy with the product.",
            "I am very satisfied with the picture quality 💯. Sound is good. Overall satisfied with the product",
            "GOOD",
            "Tooooo good",
            "Not up to mark. Not worthy as per the cost. Don't go to the size. True replica of hisence. I became fool",
            "Price is more. Hisense tornado at same price is will be more value deal. TV Is nice. Only 2 small drawback. One HDMI could have be eARC and Android should have been version 10.",
            "Very very happy with my decision of buying this 65 inch TV instead of going for a lower sized higher brand TV. The picture quality, sound and connectivity is great. Highly recommended.",
            "Picture is not good. The only thing you enjoy watching is 4K videos or Netflix. Any context from Tata sky is of poor quality. Sound is bad- Period. Don’t buy this - go for Sony.",
            "Network connectivity at its best.. Worth the money.",
            "I have received item but installation still not done more than 9 days...very worst support. I called to support team evey time they are telling installation will be done one day or 2days but still not done already passed 9days.",
            "I am not sure about this vu brand, vu is an assembler,vu purchase penal from hisense tv company, so why we purchase from vu company, we have to purchase direct hisense,",
            "Over all value for money. I am very happy with my purches and without any confusion you can go for it. Their is no need of sound bar tv sound is loud.",
            "Planning to buy 1 more so you can understand how best this TV is. If you have to use hard earned money then just go for it. Also increase 100 watts jbl speakers is awesome compared to previous premium models.",
            "Best budget 4K TV brand in India with better after sale service.",
            "Value for money....sound effects very nice comparing to other tv......",
            "Very nice product 👌",
            "Not bad",
            "Good T. V.\nMust Bye",
            "Pls go for 55inch .. great speaker quality good picture and beat part is it comes with 3 yrs comprehensive warranty",
            "Nice protackt",
            "Good Picture and Sound Quality. Value for money.",
            "Good quality but installation very fast but installation charge very high 2500 no bill provided .",
            "Avrg ..think twice bfr opting",
            "Good product. 💪",
            "Best 65 inch 4k TV",
            "Excellent picture quality..😊\nDolby sound is awesome..🤗\nValue for money..😎\nThanks to flipkart service...😍",
            "Awesome tv",
            "Good experience .. TV is very good and services staff also provided good support during installation.",
            "Good one",
            "Good.",
            "superb",
            "Good",
            "Great TV at a wonderful price. Thanks to Flipkart for safe and efficient delivery. Installation service was satisfactory.",
            "Nice",
            "Using this tv since last 2 months. Amazing picture quality and JBL sound system is superb.. must buy budget tv",
            "Good tv.ThanQ Flipkart.",
            "No use of sound bar except that TV is worth. Good quality pictures",
            "Good Product",
            "Great experience,👍",
            "It's good one",
            "It's too big size for my 16x21 hall and the sounds quality is ok only for movies from external Hard disk playing. Not that much like external sound bar. For watching dish TV it is ok like some what more sounds quality.",
            "Very nice product. Go for it without any confusion. I love it this product.",
            "Super",
            "Very good and Cost effective.",
            "Good product at this price range",
            "One of the best tv in this price range .... Awsome picture quality and best sound quality nd very fast processor",
            "I like this tv, but picture quality is normal condition but sound quality is good.",
            "While watching TV we will face the picture absence problem",
            "TV is good…..I am expecting it a little higher….but it is same like any other local TV",
            "Good.Prompt delivery.VU tv excellent for this killer price.Thank you Flipkart",
            "Good tv in short go for it without any hesitation ... sound quality too good",
            "Nice products.",
            "Over all experience is very good, value for money.",
            "just wow",
            "Tv was good but instalation was too late",
            "Overall it's a value for money.\n\nWell, sound is not as per 100watt. Company should improve on sound quality.",
            "Good product",
            "😍Amazing sound and picture quality 😍\nTruly value for money",
            "Good",
            "Good",
            "it has got many features and much better than mi as this is pure Android which doesn't spam your apps. Loved the dynamic picture mode",
            "Happy to have made decision to with VU for 65k inr\n\nValue for miney",
            "Excellent buy at this price...",
            "It's worth of money. Good product also improved sound quality..",
            "Exilent",
            "Very Good Product... Must buy",
            "Clarity was OSM\n🇮🇳",
            "Amazing TV, go for it without thinking. Good sound with amazing picture quality. Also, the app is quite fast, only prime video lags a bit.",
            "nice tv☺️☺️",
            "Super tv like this",
            "Great product and excellent delivery by Flipkart, but installation took lot of time.",
            "Excellent picture",
            "Good product",
            "Very good product",
            "Excellent picture quality\nSound quality\nAndroid is superb\nEasy use\nValue for money",
            "Good product",
            "Nice froduct from VU",
            "Excellent product and I am very happy with the picture & Sound quality they offer this price. Value for money, I would definitely recommend to purchase this product to everyone instead of going for big price television sets.\n\nThanks to Vijeta Saraf for introducing VU to Indian markets in best prices. Also thanks to Flipkart for providing prompt services.\n\nGo with Swadeshi...",
            "Good. Value for money.",
            "This tv is really a cinema tv it's picture quality,sound and many more will give you a feeling of cinema.Its bazzals are very thin.Overall this tv really give you a cinema feel in your house that's whuy its name is cinema action tv.",
            "Super remote power on/off button is not working properly",
            "Overall it's good tv to recommend.",
            "Sound is Very Excellent",
            "Good product",
            "Love it. Best TV 👍🏻",
            "Overall it is good",
            "Awesome sound and picture quality. The best TV for cinema lovers",
            "Excellent TV WORTH BUYING",
            "Good product",
            "Super",
            "Good",
            "Excellent product",
            "Picture quality was good. Delivery and installation was good. Sound was not up to the mark for a 6 box speakers. But a quite good purchase.",
            "Go fo it",
            "Satisfactory",
            "Very good and supportive",
            "Asom Tv .... ultimate Tv",
            "Mind bloing tv 👍😜👍👍👍💖💖💖💖💖",
            "Good picture quality and good sound",
            "good tv",
            "Best Android Tv",
            "Good",
            "It is good to have the tv with a soundbar. Overall I am satisfied with this product.",
            "Very very good",
            "Good product and good sound clarity sound effect is very clear",
            "Awesome",
            "Performance wise its nice but little disappointed with sound.\nActually dobly audio is good but dont feel 100 wats, its looks like 30watts.",
            "It was so great......sound bar is so great working fantastic.....working so fine.....I recommend this to everyone, valued product at this price.",
            "Vu TV is good and satisfied with the results. Value for money product.",
            "Very nice",
            "Excellent",
            "Very good product that price range Tqq flipkart",
            "Excellent 65 inch Tv\nHappy to purchased it thanks to Vu team and flipcart",
            "Good product. Professional installer",
            "Smooth working",
            "Good one",
            "Picture quality is gud and sound is to gud feel like home theater",
            "Excellent",
            "Awesome rated five star because of every thing is super already using Samsung and MI it is far better. Sound quality is WoW.",
            "Best Bahubali tv all features are good",
            "Superbbbb",
            "Value for money",
            "Fantastic and picture quality awesome go head to buy",
            "Nice quality and good Sound",
            "Nice tv",
            "Bad Installation and quality is very dad tooo",
            "Beautiful and perfect for us",
            "Very good product at this price range",
            "Overall excellent tv tq u Flipkart and thank you VU team",
            "Well this is my first day of usage, and in a room of 14 by 16 feet, this TV looks perfect.\nBuild quality is little bit cheap (Remote especially, also the sound bar in 50 inches is of plastic, so that cloth look is missing in 50 inches)\n\nRest picture quality, sound quality is more what I expected .. Happy to have this TV",
            "Well let's just say not regretting a single penny put on this ..... really happy with the purchase for a regular house this is prefect i.e a family of 4 with a 3bhk house",
            "Nice TV good sound too ..... worthy",
            "After 10 days observation i am giving 5star rating totally worthy.",
            "Very good tv and service",
            "Valuable product. Worth buying. But installation guy was in a hurry",
            "Really Nice tv in this price but I had a bad experience with the 5 days delay installation from flipkart",
            "Good",
            "This tv can't 100w sound rms\nI play ott contents then increase volume level 100. But cant 100w level sound output\n\nThis tv picture Quality is good videos play hd quality only cant play normal videos then display videos few areas blur\nPlay HD channels picture Quality Picture Size levels perfectly cant play SD channel then picture not Quality",
            "Compare 65inch tv's Audio just like Home theater,and Video also nice compare Redmi.",
            "VGood",
            "Product is very good and performing satisfactorily. Smart functions are working very well. Sound is also quite very good. It is excellent experience to watch cinema because of its picture hall effect",
            "Very nice and attractive product. Really very good pictures qualitu",
            "Superb TV , much better than Hisense...Just 5 days ago received it, retail review will be write letter.\n\nBut the must go product without hesitation.\n\nIffalcon, MI, TCL much behind it regarding quality.",
            "Picture quality is good, apps work fine, connectivity is ok but the speakers are far from sounding like 100w.",
            "Excellent n very nice 👌",
            "Good tv you can bye it without any thinking go ahead it’s better than other brand.",
            "very good picture and sound",
            "Picture quality, Sound, and connectivity are excellent.",
            "Got the 50 Inch VU Cinema Action TV (Though it doesn't say CINEMA ACTION in package and name of product, but I checked it on VU's Official Website).\n\nBought it for about 38000 (3 year warranty included) in Big Billion Days 🥳\n\nSince it is my first Smart TV, I am totally fascinated by every aspect of the TV.",
            "Sathishkumar from Purvika electronics has done the installation and demo and has done really well. Very happy about his service.",
            "Soo Good Television set... I Feel some issue in Sound ...but technician fully guide me... Solve this issue easily through setting... Then after very nice sound...",
            "Thanks for your replacement",
            "Good",
            "awesome video quality. sound quality is also good",
            "Tv delivery fast.but installation after 10days ...what our any picture celerity was to good...",
            "Nice tv nice sound good picture quality.\nFeel like theatre",
            "Super picture",
            "Picture clarity , sound clarity are bang on target . Lot better than costly qleds of Samsung .\nHope tv remains the same in long term\n\nUpdate few months : remote stopped working. Had no tv for 5 days😔. Remote fail with in 6 months didn’t expect this by",
            "Simply awesome",
            "Maybe the best budget tv",
            "I love this TV. Close your eyes go for this TV.",
            "Awesome",
            "Ok",
            "Initially I was opting for samsung or sony 55 inch. I thoroughly compared the overall futures for sound & picture specifications. Everything for Vu cinema TV was way exceeding the features I was looking.\nSimply superb TV in all aspects. 👍👍👍",
            "Picture and sound quality is excellent.",
            "Very good product",
            "very nice product for me",
            "Amazing... Worth ever rupee. Don't think twice.. just buy it guys... Awesome",
            "Excellent",
            "It's really a good product. Having all the features. Service is also very good.",
            "Vu is the best",
            "Good product and picture quality and sounds are good..",
            "Awesome product..",
            "VU cinema best tv in 2021",
            "Excellent work by vu",
            "Best tv amegine sound and pic quality",
            "Nice choice very happy with this product",
            "Awesome picture quality. Worth every penny.",
            "Vu tv picture quality is super .sound quality is verydood.",
            "Go for it,selected it very quickly and selected the best one lucky.",
            "Best value for money...",
            "very good TV enjoy",
            "Worth for every penny. Loved inbuilt 100w JBL speakers.",
            "Good 👍",
            "After long search I choosed this one. Definitely u won't regret after buying. Just go for it.",
            "Superb tv, unmatched.....",
            "Nice tv and awesome picture quality and sound. Its a value for money and connectivity also good. Am satisfied this tv",
            "It's really great TV nice value to the money.!!if ur going to buy don't even hesitate to buy....",
            "Best 4K TV for the price range for such great picture quality and features.\n\nSound not as great as it was projected to be. 100 Watts speakers is just a selling strategy.\n\nDidn't like the remote",
            "Tq",
            "very nice good product and value for. delivery given intime.",
            "Stunning",
            "Very good product. The sount of the Tv is very good. Picture quality is also better. I love the product.",
            "nice product",
            "Very good TV",
            "Good",
            "Supper",
            "good product",
            "Value for money, Best in class.\nIf you've budget of 70K then go for 65 Inch.\nThe attached soundbar which has 6 JBL speakers provides the crystal clear sound.",
            "Out of word",
            "Good led tv top divse",
            "Very nice TV sound effects and pictures quality",
            "Sound quality is not good otherwise superb tv",
            "very good",
            "Dark scene are not that much clear. Apart from this, everything else is awesome.",
            "It's a good deal in this price range. sound is good. picture quality is good colours fade when we see the tv from sides. connectivity is good. overall it is a decent tv.",
            "It was osm",
            "Very nice",
            "Excellent",
            "nice product with good picture quality",
            "Worth for money.",
            "TV is amazing , Picture quality is good, HD channels work like charm, SD Channels are pixalated. Audio I'd good bass is good not heavy. Overall TV is worth buying."
        ],
        "likes": [
            "198",
            "128",
            "61",
            "20",
            "52",
            "60",
            "9",
            "7",
            "13",
            "8",
            "198",
            "128",
            "61",
            "20",
            "52",
            "60",
            "9",
            "7",
            "13",
            "8",
            "10",
            "3",
            "5",
            "6",
            "8",
            "11",
            "4",
            "6",
            "7",
            "2",
            "3",
            "2",
            "0",
            "1",
            "1",
            "6",
            "4",
            "1",
            "2",
            "1",
            "1",
            "0",
            "0",
            "1",
            "1",
            "11",
            "31",
            "57",
            "30",
            "11",
            "24",
            "43",
            "13",
            "4",
            "9",
            "4",
            "5",
            "3",
            "3",
            "3",
            "3",
            "5",
            "7",
            "7",
            "4",
            "1",
            "6",
            "2",
            "2",
            "2",
            "2",
            "2",
            "1",
            "2",
            "2",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "2",
            "2",
            "2",
            "3",
            "5",
            "5",
            "6",
            "4",
            "6",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "1",
            "6",
            "2",
            "3",
            "4",
            "2",
            "3",
            "4",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "3",
            "1",
            "1",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "67",
            "49",
            "21",
            "9",
            "34",
            "19",
            "1",
            "1",
            "5",
            "2",
            "67",
            "49",
            "21",
            "9",
            "34",
            "19",
            "1",
            "1",
            "5",
            "2",
            "4",
            "0",
            "1",
            "2",
            "4",
            "7",
            "1",
            "3",
            "4",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "9",
            "7",
            "2",
            "3",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "13",
            "6",
            "1",
            "6",
            "17",
            "3",
            "0",
            "2",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "3",
            "3",
            "1",
            "2",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "4",
            "4",
            "6",
            "4",
            "8",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "12",
            "3",
            "4",
            "8",
            "2",
            "5",
            "16",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "9",
            "2",
            "2",
            "2",
            "2",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "5",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Which one is better either vu premium android tv nor vu cinema action tv ?",
            "Q:Does it support voice control",
            "Q:Having wall mount??",
            "Q:It has cricket mode.?",
            "Q:Does this TV supports Dolby Atmos speakers",
            "Q:For gaming good or bad",
            "Q:Which is better vu this tv or motorola zx pro or nokia 2020 or hicense tornado in 55 inch category",
            "Q:Can I use my jio fibre broadband connection with this TV?",
            "Q:Can we cast our mobile screen or connect any mobile to this TV?",
            "Q:what is model year",
            "Q:Internal memory uv",
            "Q:Panel type tv",
            "Q:What is the material of wall mounting brackets..plastic or stainless steel",
            "Q:Does it have Bluetooth",
            "Q:Can we use 3 Party apps",
            "Q:Can we play sound together in 100w inbuilt speaker and Home theatre without bluetooth",
            "Q:This TV support Google Assistant or not",
            "Q:For 55\" what is the distance between two legs stands ?to keep it on table",
            "Q:Is there a autobright adjustment facility available?",
            "Q:If we are using normal setop box, the picture quality is it good? Or we needs to upgrade HD setop box?",
            "Q:ram is low",
            "Q:It have a low refresh rate in comparison to the screen size, does it affects on screen performance?",
            "Q:Souna bar is 2.1 or 5.1 ?",
            "Q:Does this tv has dolby atmos",
            "Q:Vu cinematic is best or hisense tornado is best",
            "Q:It is suitable for PS4",
            "Q:How is sound and picture quality..?",
            "Q:is there any diffrence in 50 and 55 inch model ? other than the size ofcourse",
            "Q:Google assistant is there",
            "Q:Is aaha app available?",
            "Q:the package both wall mount and table top stand is mentioned . both stand you are going to provide?",
            "Q:Is there any need of stabilizer in this led",
            "Q:Screen mirroring yes r no",
            "Q:Bluetooth available or not",
            "Q:does it support HDR ?",
            "Q:Dolby Atmos soundbar can be connected extranally",
            "Q:Does it support pairing TWS or Bluetooth headset or earphone?",
            "Q:Can we pair our TWS or bluetooth headset with TV?",
            "Q:Are the jbl speakers in-built or separate jbl soundbar?",
            "Q:Does this TV support Dolby Atmos if I connect it to the Atmos Hometheatre system",
            "Q:It's have extra speaker pin",
            "Q:Vu ultra vs vu sinema who best",
            "Q:Is the wall mount movable one or basic standard?",
            "Q:How are the viewing angles? from left and right?",
            "Q:Can I use as a moniter",
            "Q:Is there option to hang this to TV panel?",
            "Q:Video upscaling available cinema Action TV",
            "Q:Can we connect hard disk and watch movie from that?",
            "Q:Does it supports prime",
            "Q:Is it good for PS4?",
            "Q:TV consists VPA or IPS panel? And the BRIGHTNESS LEVEL OF THE TV IS 400 OR 500 nits",
            "Q:Does it has memc technology and support 5g wifi or only 2.4",
            "Q:Hows the bass effect from 100w speakers?",
            "Q:Does it hdmi eARC? Or only ARC?",
            "Q:Can we play games with wireless joysticks",
            "Q:Duration of warranty?Reviews it's stating 3 years?Is it 3 or 1 yr?",
            "Q:Does this works with Alexa??",
            "Q:Is upgrade android 10",
            "Q:Does this tv support sony htrt3 5.1 Dolby digital",
            "Q:Is it stebilizer free",
            "Q:Does inbuilt soundbar has bass ?",
            "Q:Are the in-built speakers Dolby Atmos? I'm not looking for a feature where the TV supports Dolby devices but doesn't have Dolby Atmos speakers.",
            "Q:Will there be an Android update to 10 any time soon?",
            "Q:Is it bulletproof or not",
            "Q:Whether this VU LX 65CM Cinema series model OS can be upgradeable from version 9.0 ?",
            "Q:Can i connect my tata sky with this tv",
            "Q:Is it Full 4K UHD or just support 4K content ?",
            "Q:Does it support hands free voice control",
            "Q:Vu cinema tv 55inch ram",
            "Q:Install Other App Pikashow App..And Run",
            "Q:8 bit or 10 bit panel?",
            "Q:Does it tv Dolby vision",
            "Q:Is it touch screen",
            "Q:Eye shield certification for this TV or any eye irritation comes this TV viewing time",
            "Q:Which size best for 12 foot distance from the tv unit?",
            "Q:Can this model support prime video",
            "Q:Is it recommended to connect the tv to a stabiliser?",
            "Q:How to pair vu smart remote with airtel dth",
            "Q:Is it have the aux cable port",
            "Q:Back light control is available?",
            "Q:What was the dimensions of the television",
            "Q:Can we connect Sony D40 sound system in vu cinema led 50 inch UHD 4k tv??",
            "Q:Is tbis tv has camera inbuilt",
            "Q:What Android Version, its android 10 or 9 ?",
            "Q:Is there any gap between screen and body of tv",
            "Q:How is SERVICE of VU tv, is it fast and easy for customers?",
            "Q:Does vucinema action tvs support for 5.1 dolby audio while streaming prime video and sunnxt and hotstar",
            "Q:Can we play free free fire by keyboard and mouse",
            "Q:Does it support 3D",
            "Q:How many feet viewing distance",
            "Q:Is 3.5mm headset jack",
            "Q:What is the total electrical power consumption of this tv (including built in soundbar )? Does it cost high electric bill ?",
            "Q:Does it have airplay 2?",
            "Q:Does this TV support Upscaling technology?"
        ],
        "answers": [
            "A:Vu cinema action tv",
            "A:Yes it supports voice control via remote",
            "A:wall mount is free and inside the box",
            "A:yes",
            "A:Supported.",
            "A:Good",
            "A:VU or Hisense would be a great choice.Since my friends use VU and it was promising so went with VU but it costs slightly higher than HiSense with similar features.",
            "A:yes of course. not only jio but all fibernet, u can connect through wifi or LAN port.",
            "A:Yes you can connect the mobile using google home or any steaming platform with casting support.",
            "A:2021",
            "A:RAM 2GB Storage Memory only 16GB",
            "A:Baze less panel and it come with full glass.",
            "A:Stainless steel",
            "A:yes it has.",
            "A:No",
            "A:Yes",
            "A:Yes",
            "A:yes",
            "A:no there is no such features are available.",
            "A:HD box would d b better",
            "A:average RAM",
            "A:yes",
            "A:Its a 5.1",
            "A:no",
            "A:vu",
            "A:Yes it is , Infact my son plays games on PS4 on it everyday",
            "A:Both are awesome. JBL speakers makes total justice",
            "A:No difference other then size",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:No",
            "A:No",
            "A:It’s available",
            "A:yes",
            "A:yes",
            "A:Yes",
            "A:Yes",
            "A:6 jbl speakers with sound bar",
            "A:Last dolby digital +",
            "A:Yes, A soundbar is built in the tv.",
            "A:Cinema is Best,",
            "A:1. In the package you will get only standard/basic wall mount 2. If you want flexi wall mount then buy it in advance so that it will available at the time of installation",
            "A:from Left to right and Good viewing different angles.",
            "A:yes, U can",
            "A:Yes",
            "A:yes",
            "A:Yes we connect hard disk & watch movie from that",
            "A:Yes",
            "A:yes, its working smoothly",
            "A:It is a VA Dled panel as mentioned in its spec sheet which you can download it from vu site. 55\" has 400 nits of brightness and 500 for 65\"",
            "A:Yes it has memc and support both wifi band.",
            "A:it's just good, but it's not like wat u expect from 100w, I have both this tv and oneplus tv, even though one plus as 50w it's bass and sound quality is much better than this tv.",
            "A:Only ARC",
            "A:ofcourse but you have to connect usb extension for good connectivity otherwise the connectivity will lack because of its big screen size...",
            "A:Please check while buying. It depends on the seller. When I bought it during big billion day it was showing 3 yrs. Now it shows 1yr.",
            "A:No",
            "A:No..its android 9 no official confirmation for the upgrade",
            "A:Yes",
            "A:yes.But it's safe to connect with stabilizer.",
            "A:Medium Bass",
            "A:No.. vu tvs doesn’t have Dolby atoms… for Dolby atoms audio tv should hv arch port which is not present here…if you are taking tv along the sound bar which is inbuilt u will get only Dolby audio…",
            "A:Yes",
            "A:no",
            "A:no",
            "A:Yes..",
            "A:It's 4k UHD",
            "A:No",
            "A:2gb",
            "A:VU already installed application only",
            "A:Actually color depth of panel is 8-bit, but with processor and Tcon hardware it is capable to play 10-bit color depth content. HDR10 ( High dynamic Range 10) and it has Dolby Vison as well.",
            "A:yes",
            "A:No",
            "A:yes it is",
            "A:55 inch",
            "A:Yes",
            "A:Not required",
            "A:no need of pairing.just u connect with dth cable",
            "A:yes",
            "A:yes",
            "A:57\" length 65\" diagonal",
            "A:Bluetooth can be used to connect with D40 with TV but you will not get the best experience out due to SBC codec.Analog Audio Jack can also be used and Here you may get better quality than Bluetooth",
            "A:No",
            "A:9",
            "A:No",
            "A:good",
            "A:For Amazon Prime External Audio It has Option For Dolby Digital & Dolby Digital+",
            "A:Yes",
            "A:No",
            "A:the description of the product itself mention the same. however, as a user 10-15 feet distance will be conformable for eyes.",
            "A:No.",
            "A:no",
            "A:No.",
            "A:Yes"
        ],
        "likes": [
            "30",
            "19",
            "30",
            "13",
            "6",
            "14",
            "6",
            "7",
            "9",
            "2",
            "2",
            "2",
            "3",
            "3",
            "5",
            "4",
            "3",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "2",
            "3",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "19",
            "23",
            "21",
            "4",
            "4",
            "6",
            "2",
            "1",
            "2",
            "2",
            "2",
            "5",
            "3",
            "3",
            "1",
            "2",
            "0",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1"
        ],
        "dislikes": [
            "4",
            "3",
            "10",
            "6",
            "2",
            "9",
            "4",
            "3",
            "4",
            "0",
            "0",
            "1",
            "1",
            "1",
            "6",
            "2",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "3",
            "3",
            "4",
            "2",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "4",
            "9",
            "8",
            "0",
            "0",
            "3",
            "0",
            "1",
            "0",
            "0",
            "0",
            "6",
            "4",
            "7",
            "1",
            "1",
            "3",
            "4",
            "6",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "2",
            "2",
            "0",
            "0"
        ]
    }
}