{
    "title": "SONY Bravia W622F 80 cm (32 inch) HD Ready LED Smart TV  (KLV-32W622F)",
    "product_specification": {
        "In The Box": "1U (Unit) [Including - Warranty Card, AC Adapter, AC Power Cord, Remote Control, Table-Top Stand, User Manual - 1U each Batterier-2U]",
        "Model Name": "KLV-32W622F",
        "Display Size": "80 cm (32 inch)",
        "Screen Type": "LED",
        "HD Technology & Resolution": "HD Ready, 1366 x 768",
        "Series": "Bravia W622F",
        "Smart Tv": "Yes",
        "Motion Sensor": "No",
        "HDMI": "2 Side",
        "USB": "2 Side",
        "Built In Wi-Fi": "Yes",
        "Launch Year": "2018",
        "LED Display Type": "Edge LED",
        "Refresh Rate": "50 Hz",
        "Number of Speakers": "3",
        "Speaker Output RMS": "30 W",
        "Supported App - Netflix": "Yes",
        "Supported App - Youtube": "Yes",
        "Supported App - Disney+Hotstar": "No",
        "Supported App - Prime Video": "Yes",
        "Operating System": "Linux based",
        "Screen Mirroring": "Yes",
        "3G Dongle Plug and Play": "Yes",
        "Ethernet (RJ45)": "1",
        "Touch Remote": "No",
        "Power Requirement": "AC 100 - 240 V, 50/60 Hz",
        "Power Consumption": "69 W, 0.5 W (Standby)",
        "Width x Height x Depth (without stand)": "731 mm x 70 mm",
        "Warranty Summary": "1 Year Manufacturer Warranty",
        "Covered in Warranty": "Warranty of the Product is Limited to Manufacturing Defects Only",
        "Not Covered in Warranty": "Warranty Does Not Cover Any External Accessories (Such as Battery, Cable, Carrying Bag), Damage Caused to the Product Due to Improper Installation by Customer, Normal Wear and Tear to Magnetic Heads, Audio, Video, Laser Pick-ups and TV Picture Tubes, Panel, Damages Caused to the Product by Accident, Lightening, Ingress of Water, Fire, Dropping or Excessive Shock, Any Damage Caused Due to Tampering of the Product by an Unauthorized Agent, Liability for Loss of Data, Recorded Images or Business Opportunity Loss.",
        "Warranty Service Type": "Offsite Service",
        "Installation & Demo Details": "We'll facilitate the installation and demo through authorized service engineer at your convenience.. The service engineer will install your new TV, either on wall mount or on table top. Installation and demo are provided free of cost. The engineer will also help you understand your new TV's features. The process generally covers: Wall-mounted or table-top installation, as requested. Physical check of all ports, including power and USB ports. Accessories also checked. Demonstration of features and settings. Quick run-through on how to operate the TV.\nPlease note that any unauthorized handling or self-installation of the product will lead to return & product warranty being void"
    },
    "product_description": {
        "Every Detail Comes to Life": "The X-Reality PRO picture-processing technology delivers exceptional clarity by upscaling every pixel. It matches each scene during the analysis of frames with Sony's special image database to refine images and reduce noise.",
        "Enjoy Thrilling Entertainment": "Enjoy your favourite games and movies in vividly detailed HDR. It supports myriad HDR formats, such as HDR10 and Hybrid Log-Gamma.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "3",
            "2",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "1",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4"
        ],
        "review": [
            "TV picture and sound quality is best for the price. The only competitor is samsung 32n4300 which is better in terms of smart tv.\nIf you want a full smart tv then go for Samsung model\nif you want best picture and sound quality with some smart tv features then go for sony tv.\nBluetooth support is not available in sony.\nalso usb teathring and smart plug and play is not compatible with all smartphones.\nViewing angles are excellent. And screen mirror function is much better compare to Samsung tv.",
            "Good tv. Picture quality is excellent for 720p. sound clarity is about average but definitely loud. Excellent viewing angles. connectivity & features are average for a normal smart tv usage. value for money score - 3.5/5. overpriced for what it brings to the table. I chose this besides the high price because it had a promising picture quality & great viewing angles & a brand value attached to it",
            "I checked the quality branded TVs like samsung, lg,panasonic and then decided to but Sony.\nIts a awesome TV with superb video and audio quality.Mirror cast works fine. If you have the budget then just go for it.\nFew apps like youtube,netflix etc are pre installed. Note that this is not a android TV and you cannot install apps.\nOnly disappointment is that there is no pre installed Hotstar(I guess since star is a rival to sony they have not included it).",
            "I've started loving FlipKart!! Beautiful product with accurate description and almost Rs 5k less than other online and physical stores. Ontime delivery with before scheduled installation made the purchase a wonderful experience. Thanks.",
            "Picture quality is good in sd channels also. Sound quality ok in sd channels. you can use extra speakers & it becomes mini theatre. Picture and sound quality awesome in hd channels or in 720 or1080 pixel video just near to full hd. youtube available . Timely delivery & installation.",
            "super sound quality, super picture quality with good connectivity! Go for it if you like Good sound and picture quality tv, and a reliable brand too!",
            "Awesome TV such Brilliant picture Quality, cinematic 3D sound Quality, and lots more features. My parents are very happy:) Flipkart delivery and installation service was just mind blowingly fast. Close ur eyes and buy it...It's more than worth of ur money ;)",
            "This TV is quite awesome. It will give you an excellent picture quality. It is also capable of providing you with a crystal clear sound with a perfect bass. The colours of the pictures are so clear that it will help you find out each & every image on the screen. It's an absolute pleasure to sit in front of Sony KLV - 622f & you will feel like keep watching through the whole day....!! If you crave for high picture & sound quality, go for this TV right now. I'm a die hard consumer of SONY. I use Sony mobiles, Sony Home Theatre and now Sony Bravia Smart TV. I connect it with Sony Xa1 ultra smartphone for surfing the net. I have attached it with the Sony SA-D40 Home Theatre for much better sound experience. Overall I'm enjoying a heaven in my room...... Thanks to flipkart for delivering it right on the exact date. 5 start from me.",
            "The telivision is so good with the picture quality.This is my first very led TV and i'm very much satisfied with it and even the screen mirroring works so fast (with some micro second delay) and accurate.",
            "Quality is ok but i think it should be better for this price, sound quality should be improved as sub woofer doesn’t work very well picture quality is good",
            "TV picture and sound quality is best for the price. The only competitor is samsung 32n4300 which is better in terms of smart tv.\nIf you want a full smart tv then go for Samsung model\nif you want best picture and sound quality with some smart tv features then go for sony tv.\nBluetooth support is not available in sony.\nalso usb teathring and smart plug and play is not compatible with all smartphones.\nViewing angles are excellent. And screen mirror function is much better compare to Samsung tv.",
            "Good tv. Picture quality is excellent for 720p. sound clarity is about average but definitely loud. Excellent viewing angles. connectivity & features are average for a normal smart tv usage. value for money score - 3.5/5. overpriced for what it brings to the table. I chose this besides the high price because it had a promising picture quality & great viewing angles & a brand value attached to it",
            "I checked the quality branded TVs like samsung, lg,panasonic and then decided to but Sony.\nIts a awesome TV with superb video and audio quality.Mirror cast works fine. If you have the budget then just go for it.\nFew apps like youtube,netflix etc are pre installed. Note that this is not a android TV and you cannot install apps.\nOnly disappointment is that there is no pre installed Hotstar(I guess since star is a rival to sony they have not included it).",
            "I've started loving FlipKart!! Beautiful product with accurate description and almost Rs 5k less than other online and physical stores. Ontime delivery with before scheduled installation made the purchase a wonderful experience. Thanks.",
            "Picture quality is good in sd channels also. Sound quality ok in sd channels. you can use extra speakers & it becomes mini theatre. Picture and sound quality awesome in hd channels or in 720 or1080 pixel video just near to full hd. youtube available . Timely delivery & installation.",
            "super sound quality, super picture quality with good connectivity! Go for it if you like Good sound and picture quality tv, and a reliable brand too!",
            "Awesome TV such Brilliant picture Quality, cinematic 3D sound Quality, and lots more features. My parents are very happy:) Flipkart delivery and installation service was just mind blowingly fast. Close ur eyes and buy it...It's more than worth of ur money ;)",
            "This TV is quite awesome. It will give you an excellent picture quality. It is also capable of providing you with a crystal clear sound with a perfect bass. The colours of the pictures are so clear that it will help you find out each & every image on the screen. It's an absolute pleasure to sit in front of Sony KLV - 622f & you will feel like keep watching through the whole day....!! If you crave for high picture & sound quality, go for this TV right now. I'm a die hard consumer of SONY. I use Sony mobiles, Sony Home Theatre and now Sony Bravia Smart TV. I connect it with Sony Xa1 ultra smartphone for surfing the net. I have attached it with the Sony SA-D40 Home Theatre for much better sound experience. Overall I'm enjoying a heaven in my room...... Thanks to flipkart for delivering it right on the exact date. 5 start from me.",
            "The telivision is so good with the picture quality.This is my first very led TV and i'm very much satisfied with it and even the screen mirroring works so fast (with some micro second delay) and accurate.",
            "Quality is ok but i think it should be better for this price, sound quality should be improved as sub woofer doesn’t work very well picture quality is good",
            "The TV is awesome, very good picture quality, very good sound. The delivery boy and the service engineer is very good. Thank you Flipkart 😊",
            "Nice product and quick delivery by Flipkart .\nsounds too good and picture quality also awesome better to choose this product if you want to buy smart TV with 32 inches",
            "No question on sound & picture quality. Sony is best in that class. You can trust blindly. bit issue in installation but flipkart support team resolve in time..great service and very good product. value for money.",
            "It is best product with such a affordable price range...and there many thing I liked abt this product....but shortly I will jst say..... it's awesome...❤️❤️💙💙...&& love shop on\n#flipcart...❤️",
            "Excellent purchase. Picture quality is awesome and have best audio functionality. Excellent connectivity d overall value for money.",
            "nic smart TV and sound cualety and beautiful 🥰\nThanks to Flipkart so nice and I so happy",
            "It's been nearly a month since we bought this TV. We are highly satisfied with all features. Picture quality is good and so is sound. Best TV for this budget.",
            "awesome tv",
            "It's awesome 😊. You will fall in love with the sound of this TV. The quality of TV will never let you down. One things missing is Hotstar. Will update the detail of picture quality once my TV set up box is upgraded to HD setup box.",
            "Almost highly satisfaction to purchase. Thanks flipkart.",
            "Superb Sound🔊 and Picture Quality. Delivery and Installation service was Excellent. Installation done in 3 days of delivery.Value for Money. Sony is The Best. Go for it without doubt. 👍",
            "Super",
            "excellent product....really happy with the product delivery, installation and quality...when installation guy called me for installation on Thursday, I asked for demo and installation on Saturday.. he called me twice to remind the installation on Saturday...",
            "No doubt that Sony is a good product.",
            "Awesome branded smart tv in this price range. But, vewd browser is a bit slow relative to my wifi speed(70/10mbps) and also I'm having problem to watch videos from usb.",
            "excellent purchase..value of money..sound picture is really awesome product..just a small complain for delivery..its take one week to delivered after given order..",
            "Good product, but too much overpriced for nothing.",
            "excellent TV",
            "Good..",
            "Good",
            "Value for money",
            "Awesome purchase. Sound Quality is immensely powerful and Nice. Sony is a Trademark . Go for it.",
            "good",
            "my insalattion not today done very very badly behave insalation man he is not reached my address I'm very very angry with sony office sankalp in patiala Punjab....",
            "Good quality worth for money",
            "picture quality sound system is good ..",
            "very good product",
            "Good",
            "Nice",
            "nice",
            "Nice product..... And in best price",
            "Good product",
            "Amazing",
            "Super Duper Product For Sony Iss Led Tv Ka Picture Aur Sound Quality Bahut Hi Lajawaab Hai",
            "Excellent product by sony. Really worth for the money we spend. Remarkable service by Flipkart with unbelievable offer.",
            "very good product best sound and pictures quality..",
            "GOOD",
            "Good product",
            "really awesome smart TV.........the picture quality is as good as the sound ......overall super👌👌",
            "Satisfied",
            "very good quality and awesome product\nsuper audio quality and also picture quality is superb....",
            "Good\nSatisfied",
            "very good tv with WiFi and you tube facilities...and same day delivery ...",
            "Go for it",
            "value for money......😃",
            "Excellent\nbest LED TV 5 star\nInstallation & Demo 5 star\nthank you Flipkart.",
            "nice tv and really fast installation,",
            "tv is best but Flipkart delivery service is bad so improve service and one more thing add on one hard copy of invoice",
            "after 1 month automatically off problem created.",
            "very nice ....",
            "Everything in this tv is awesome, sound 5/5 picture,quality, 5/5, but during screen mirror some lag in sond",
            "Worth For Money .Nice Tv",
            "Good TV",
            "Awesome picture quality.\nWonderful sound experience. 👍",
            "Sony is always good\nOn time installation done",
            "Product was good. Sounds is really awesome. Delivery was proper time. Installation was good",
            "I always trust Sony. It never fails. Once again it proves it. From picture quality to sound quality it is excellent.",
            "Very nice product",
            "good",
            "Awesome",
            "Super",
            "Its Osm😍👌",
            "very nice tv",
            "Picture quality is awesome if you use HD channels.\nsound is awesome. Go for it. It's better than MI, Samsung,LG",
            "Superbb Quality",
            "Awesome TV, just go for it!! Superb sound quality n picture!!I am loving it, only cons is no hotstar app pre-installed ☹️",
            "excellent product",
            "very good smart tv",
            "Mind blowing picture clarity... Excellent sound clarity....",
            "Its working fine..but it will not support voot. speakers quality also nice.",
            "simple tv sony",
            "good",
            "fantastic performance by leader",
            "Superb TV .... Service from Flipkart is fantastic ... Received before the date .Demo & Installation is also done very nicely",
            "good delivery and installation before timeing",
            "Very nice",
            "if you want to derive full benefits of this TV's features, then do connect it to high speed internet or to a HD settop box for a rich picture and sound experience !! value for money purchase as compared to what you get in the sony store.",
            "It is very bad",
            "Little bit disappointed because I thought it's android but it wasn't completely smart ,only your tube , Netflix and Sony liv pre-installed apps works , from outside can't install any app without an android box\n\notherwise picture ,sound quality was awesome .",
            "Nice picture quality and solid sound with two subwoofers. Got Delivered TV on right time.The delivery boy was also good...Thanks to Flipkart...Good job done ...",
            "nice",
            "sony bravia excellent quality",
            "at install ment not explained all features detailed",
            "excellent pictures and sound quality...",
            "Something special",
            "This product is best and it is a good deal",
            "DONY is SONY\nNo body can do\n\nSONY is amazing",
            "remote control is old piece",
            "Good",
            "This product make me happy without any maintenance expense even after three years. I'm experiencing best sound system and picture quality that Sony Bravia brings at my home. Kid's are loving it.",
            "Nice product from Sony TV forever!!",
            "Total value for money..I brought it fr 24k.excellent picture quality",
            "Very Good product and best Future",
            "Nice smart TV with good price rate overall good picture and sound. It was in excellent condition when we got the tv. Thanks flipkart and sony",
            "Tv us nice, but thanks to Flipkart that they had given 10,000 off on this product\nDuring bing bang festival\nReally I say again Flipkart is awesome",
            "Picture Quality & Sound Quality is good...... but very few formats of Videos are supported through Pendrives/ External Hard-disks.",
            "Good",
            "All r in best mode except price compared to other brand. Sound wise sony goes extreme.",
            "Very good",
            "nice prospect",
            "completed wad",
            "Good product for best price Tq Sony and flip cart for this Fab product",
            "Sony is best brand in led tvs but price is litbit high",
            "good",
            "Value for money good tv",
            "highly recommended go for it",
            "awesome",
            "good",
            "All the features are good. only problem faced was installation time. they have installed 4 days after delivery.",
            "picture and sound quality is superbb...",
            "good product delivered by Flipkart",
            "Awesome product. Value for money.",
            "Super",
            "awesome",
            "nice",
            "excellent product",
            "great sound and picture quality..",
            "Nice TV, Great picture & sound quality..amazing",
            "Awesome performance",
            "good tv but flipcart delivery late",
            "Great clearity and also easy to handle",
            "Very glad",
            "super",
            "Sony is always good in picture and sound quality, But few negatives are there are only 2 HDMI ports and there is no component input ,if u have an old DVD/Home theatre system, then you have to depend on AV cable .The TV is 2018 model with July 2018 manufacturing\nFlipkart delivery ,OMG ,took 12 days and finally delivered at 8pm.",
            "it is very valuable. its screen is very good.plz buy it.its very good sound is also good",
            "This TV does not have 1 remote but we need to use 2 remotes and every other cheap TV has reminder about the program but this TV does not even have such a simple feature.....but the latest technology TV",
            "Nice picture clearing & great sound effects. Sony serves the best.\nInstallation is on time as committed by Flipkart with nice service.",
            "I LOVE IT❤️",
            "Sony.... Suprb product really",
            "aawesome tv..",
            "Ok all is well",
            "Classy Quality Product\nSound Quality & Picture Quality is Very Good ,",
            "Sound quality experience super\nIt’s value for money\nGood product",
            "Sony quality brand",
            "Good Experience",
            "average",
            "osm Brand",
            "1 star less coz the installation part..",
            "very good service thanks flipkart",
            "Amazing experience.... Sony always maintains its brand value. Picture quality and dolby surround sound is exceptional.",
            "Full happy",
            "About product quality, nothing to say, it's awesome... sound quality is average, nothing special in it... flipkert delivery as per promised time and date, no issue in that. Installation and demo as per pre schedule by flipkert... If you compromise with the average sound quality, then it's is awesome in this price range.",
            "good",
            "excellent volume .....no words ....",
            "It's better to get it from Flipkart rather than spending huge amount by buying it from outside...it's such a good tv.",
            "excellent Sony product",
            "Best Tv under 25000 ...Buy it ..feel it",
            "Worth for money, nice one.",
            "Its awesome product from Sony...\nWorth of money",
            "value for money",
            "Great picture quality\nGreat sound quality\nSanjay",
            "very good",
            "super",
            "excellent product",
            "nice",
            "very pretty product I have purchased Sony bravia that sound is very nice and there pictures quality is to much good",
            "Aswome TV tnq flipkart",
            "Excellent quality from an excellent brand. Delivery fast.",
            "Good",
            "Picture, sound and design are very good...",
            "Flipkart service has been excellent, product is awesome.",
            "thanks Flipkart .... everything perfect...on time delivery.. performance great... installation on time...",
            "wrost filings ever...delivry its good..but demo installation service are not coming my home...pls solved mu problem...",
            "Nice picture quality and sound",
            "Very good product\nOn time delivery on time before installation",
            "one word... awesome perfect LED ...go for it ... thanks flipkart for immediate installation and demo...",
            "Very nice smart tv",
            "Nice looking with price."
        ],
        "likes": [
            "42",
            "10",
            "16",
            "5",
            "2",
            "4",
            "5",
            "1",
            "1",
            "1",
            "42",
            "10",
            "16",
            "5",
            "2",
            "4",
            "5",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "111",
            "15",
            "119",
            "20",
            "48",
            "45",
            "6",
            "11",
            "15",
            "19",
            "3",
            "4",
            "4",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "5",
            "3",
            "3",
            "2",
            "2",
            "2",
            "2",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "3",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "3",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "10",
            "0",
            "11",
            "2",
            "0",
            "2",
            "4",
            "0",
            "0",
            "0",
            "10",
            "0",
            "11",
            "2",
            "0",
            "2",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "23",
            "1",
            "32",
            "5",
            "20",
            "19",
            "0",
            "4",
            "6",
            "8",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "2",
            "3",
            "3",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "10",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "9",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:built in woofer and dolby sound system is available or not?",
            "Q:Is screen mirroring availabe in this tv ????????......",
            "Q:is this tv has inbuilt chromecast?",
            "Q:Does this TV is adaptable to fire tv stick ?",
            "Q:It use only for normal setup box or HD setup box",
            "Q:Can I conect my smart phone to this tv ?",
            "Q:how to do screen mirroring? I can't.plz help",
            "Q:does it have play atore or only inbuilt apps",
            "Q:what are pre install app in this sony tv? plzz name it that install app.",
            "Q:support wireless keyboard yes or no?",
            "Q:can we play freefire in it",
            "Q:is the setup box have with TV",
            "Q:Is the tv has full hd or not",
            "Q:Can I use YouTube in this tv",
            "Q:Which android os in this tv?",
            "Q:In Description box it is mentioned that it does not support Hotstart..so can we download Hotstar from play store in this smart TV?",
            "Q:can we use bluetooth connector to use headphones.",
            "Q:Is this TV has inbuilt battery ?",
            "Q:Can we connect firestick to this tv so that we can watch shows using wifi??",
            "Q:Does hotstar app support in this TV?",
            "Q:have hdmi cable in box",
            "Q:witch video formet support?, recording videos not paying in my tv",
            "Q:this tv support full hd setup box?",
            "Q:can i use it as a computer",
            "Q:which model best to buy in android one in budget range?? what difference between android and smart??",
            "Q:This tv support wireless keyboard and mouse",
            "Q:It's need stabilizer???",
            "Q:it does not read photos videos from my android phone though usb cable. why? is there any option to turn ON in tv? do i need to turn on?",
            "Q:It's turn into computer minotor?",
            "Q:Does this TV need a wired Internet connection or it has inbuilt Wi Fi",
            "Q:Is netflix and youtube are preinstalled? or if they dont how to install it?",
            "Q:can we watch prime vedio and hotstar",
            "Q:is this uses for normal setup box",
            "Q:Can I play PUBG in my phone connect with it???",
            "Q:Can it supports the wireless connectivity of mobile phone???",
            "Q:Can I install the mobile app on this TV? As it is pubg",
            "Q:can i use Facebook",
            "Q:is this tv supported normal channel",
            "Q:4k video support in this tv",
            "Q:why it doesn't support any mp3 file from pendrive/card reader?",
            "Q:Can i Connect My I Phone This TV",
            "Q:Can i Conect to My I Phone This TV",
            "Q:can I use Chromecast in this TV?",
            "Q:is airtel tv app available ??????",
            "Q:what star it is",
            "Q:Does this TV support prime video?",
            "Q:what is 4k video",
            "Q:Does this TV support 3D?",
            "Q:is it has inbuilt FM?",
            "Q:did oppo a3s got screen mirroring",
            "Q:in this tv support the video call",
            "Q:How can running the tv",
            "Q:Google cloud available",
            "Q:does this tv is made up of ips panel or not",
            "Q:Magic remote available or not",
            "Q:this tv have google play",
            "Q:dual band wifi support this tv",
            "Q:what is star rating of this tv",
            "Q:I want to know dealer name",
            "Q:Can I connect optical system??",
            "Q:Who will fit the TV on wall?",
            "Q:wall mount is available in thispack",
            "Q:Is this tv support full hd movies through pen drive ?",
            "Q:is it has Bluetooth option to connect to speakers",
            "Q:it has optical output?",
            "Q:is this suport sd chenalls",
            "Q:is there suport sd channels",
            "Q:is it smart TV",
            "Q:is it touch",
            "Q:can i install hotstar in this tv?",
            "Q:did this tv support 1920×1080 resolution",
            "Q:Does this tv has opera store (like in512d)or browsers",
            "Q:Does tv connect screen mirroring of samsung phones?",
            "Q:which type of video supported from pendrive of external drives ?",
            "Q:can we play pubg in this tv?",
            "Q:can I watch live tv programme when connect to internet by mobile like hotstar etc.",
            "Q:how many internal storage",
            "Q:Is mkv format video supported??",
            "Q:is this available tv with wall mount stand?",
            "Q:Is this tv has inbuilt & external memory ? How much MB?",
            "Q:How much ram and rom it has???",
            "Q:can i use youtube netflix in this tv",
            "Q:can it play 1080p videos?",
            "Q:Wall mount provision is there",
            "Q:Can i download any apk in this tv",
            "Q:I can play punha game",
            "Q:this tv has x reality pro engine technology",
            "Q:is casting possible from youtube?",
            "Q:can I use normal set top box",
            "Q:Can we connect the wifi....",
            "Q:it is connect to phone or not..??",
            "Q:does this tv support bluetooth",
            "Q:It support 4k video's ir not??",
            "Q:can this tv be wall mounted?",
            "Q:is it 3 star tv",
            "Q:can i connect my samsung j5 prime via usb cable and can i screen mirror ?",
            "Q:Sony support optical cable",
            "Q:is it connected to hometrater",
            "Q:Can I use Google through this Tv",
            "Q:is this product wi fi connect",
            "Q:Can i mount it on wall?",
            "Q:wifi is use",
            "Q:Is it Sony Bravia or not? It is mentioned in model that it is Sony! please ensure",
            "Q:difference between hd ready and full hd tv",
            "Q:We will get any free subscription of Netflix etc.?",
            "Q:aux available or not",
            "Q:we can attach to wall tv",
            "Q:32 inch means by",
            "Q:can we install ps4 games through ps4?",
            "Q:Is it a smart tv??? In specification it is written smart??",
            "Q:which version for this?",
            "Q:can i storage movies in this product,,??????",
            "Q:Can usb & hdmi cable fitted simultaneously",
            "Q:can i make a video call to tis tv",
            "Q:How to connect bluetooth headset",
            "Q:is this tv support hml cable??",
            "Q:What is the meaning of Full HD and HD ready...??",
            "Q:Does it have PIP optional?",
            "Q:can i use d link dongal for net connection",
            "Q:in this led anything can download",
            "Q:Hdr support yes or no",
            "Q:how to connect screen mirroring moto g3",
            "Q:pictures quality wise which is best 422f or 622f model?",
            "Q:How can i use hotstar in thi tv.",
            "Q:can i connect my mobile honor 6x smart phone screen mirror",
            "Q:this tv support to screen mirror moto g5s plus mobile.",
            "Q:is it full hd or not?",
            "Q:Can we use Hotstar or can we download Hotstar?",
            "Q:We can fix on wall or not",
            "Q:sony bravia or mi led 32 inch which is best",
            "Q:T.v is waterproof ?",
            "Q:Stabilizer is required for this tv ????",
            "Q:how to connect moblie in this tv",
            "Q:in this tv bluethoot is there",
            "Q:can i connect external speakers with this model?",
            "Q:Can i use pen drive and Card reader?",
            "Q:pc conectivity via vga cable",
            "Q:ICan keep it on the table",
            "Q:How to connect homethreter ?",
            "Q:which year model?",
            "Q:how to do screen mirror from samsung mobile as there is no screen mirror option in samsung j8",
            "Q:how is the packaging?is it totally new?",
            "Q:which is the model",
            "Q:aux pin available or not",
            "Q:can a support jio tv",
            "Q:download others app on this model?",
            "Q:tv support internet browsing or google",
            "Q:how many inch up and down",
            "Q:does this tv has Prime app?",
            "Q:how to connect to sony home theatre",
            "Q:does this tv supports hdmi arc",
            "Q:wall mount with tv or we have to buy seperately and who will place the wall mount techician or me",
            "Q:can i connect xbox console?",
            "Q:what is the view angle?",
            "Q:can we use pendrive & External Harddrive to watch videos in this TV",
            "Q:Can connect cpu",
            "Q:In tv remote voice system are available or not",
            "Q:can i connect laptops with blutoot and share loptops screen on tv",
            "Q:it is in camera",
            "Q:what is the contrast ratio?",
            "Q:In this tv we use hotstar",
            "Q:does it have app store and can i install apps?",
            "Q:isbit stabilizer required for this tv",
            "Q:Screen mirroring available in this TV",
            "Q:This TV has Dolby sound system??",
            "Q:which is best?672f or 622f",
            "Q:Is that tv have hotspot?",
            "Q:is this tv connect with cardless earphones",
            "Q:What OS does it have?",
            "Q:Is it have games",
            "Q:Is this tv wifi enabled??",
            "Q:What is screen mirroring system?",
            "Q:whatare the pre installed apps",
            "Q:is wall mounted stand with this package",
            "Q:Wall mount free ?",
            "Q:cpu connection yes",
            "Q:Do you get wall-mount stand with this TV?? If wall mount not provided with TV then do we have to purchase it seperately?",
            "Q:does it come with wall mount ?",
            "Q:is it support blue tooth",
            "Q:Support Android system"
        ],
        "answers": [
            "A:it has built in woofer.",
            "A:yes screen mirroring is available",
            "A:no , buddy .only SONY ANDROID TV RANGE have built in Chromecast.",
            "A:Yess",
            "A:uses in HD setupbox",
            "A:yes",
            "A:smart mobile open screen Smart view automatic connect screen mirroring",
            "A:Smart TV.....Inbuilt apps",
            "A:Apps are Youtube, Netflix, Amazon Prime Video, Big Flix, Sony liv",
            "A:no",
            "A:yes",
            "A:Yes",
            "A:no full hd .it is hd ready",
            "A:Yes",
            "A:it's not an Android one and cannot install any application other than pre installed",
            "A:No you can't download, and there is No play store in it. It has pre installed apps like YouTube, YouTube kids, Netflix etc..",
            "A:no ...only 3.5 jack use...no bluetooth connected",
            "A:yes remote contains with battery",
            "A:yes",
            "A:No, hotstar is not supported even in screen mirroring hotstar is not playable.",
            "A:No, the installation guy will give you with chargeable basis. Approx Rs 360.",
            "A:mp4,MKV,AVI etc",
            "A:yes",
            "A:yes using HDMI cable",
            "A:Smart Phone is the best features in operating. and Android phoneis the someone operations",
            "A:No key board, no mouse",
            "A:no",
            "A:You can use screen mirroring (chrome cast) to surf photos and videos in phone , i suggest you to turn on file transfer mode on phone to connect internal storage of mobile",
            "A:Definitely. Just plug the hdmi cable from CPU to this tv. That's it.",
            "A:this tv has built in wifi and etherner port. you can use both wired and wireless connection",
            "A:Yes, Netflix and youtube are pre-installed and also have shortcut keys for both of them in the remote.",
            "A:This will support Netflix and hotstar.",
            "A:Hd box",
            "A:No",
            "A:yes, it supports",
            "A:no you can only use pre loaded app ie. YouTube, browser etc",
            "A:yes",
            "A:yes",
            "A:yes",
            "A:I have attached my pen drive in my TV and it supported MP3 as well as Video formats",
            "A:yes",
            "A:yes you can connect your smart phone display through casting.",
            "A:no",
            "A:No...",
            "A:3 star",
            "A:no",
            "A:4K video resolution is high-definition (HD) video that has four times the resolution of 1080p HD video. 4K resolution is 4096x2160",
            "A:No",
            "A:No",
            "A:check your phone specs. if you find the 'Screen mirroring' option in your phone you can connect to this tv without any problem.",
            "A:nope",
            "A:Tv is running smoothly,performance is good",
            "A:no only pre loaded app is available and you are not able to install any oter app by any mode ie. pan drive and no play store is available",
            "A:yes..superb quality",
            "A:NO",
            "A:this is not a android tv. it's a simple smart tv, so you will n9t be getting anybapp store. there will be some preloded apps like netfpix sony live etc.",
            "A:Yes.",
            "A:3 star, 69 watts",
            "A:OminiTechRetail",
            "A:no",
            "A:Technician from the company (Sony) will do it free cost.",
            "A:Nope... You should buy separately...",
            "A:yes",
            "A:No it has not bluetooth option in built.",
            "A:yes",
            "A:Yes the television supports both SD and HD channels",
            "A:yes",
            "A:ya..it is but not fully smart",
            "A:no touch, you can operate through remote and manual buttons on TV.",
            "A:no this is not android TV , you cannot install anything on this",
            "A:No Sir",
            "A:No",
            "A:yes, very easily!",
            "A:Most of the common types are supported like mp4, mpg, mpeg, etc",
            "A:No",
            "A:no",
            "A:no storage",
            "A:yes",
            "A:Yes",
            "A:No memory its just smart TV have nly amazon prime and Sony live and some other apps",
            "A:This is not Android tv",
            "A:SURE YOU CAN USE NETFLIX AND YOUTUBE",
            "A:Yes",
            "A:Yes",
            "A:No",
            "A:No",
            "A:yes it has.",
            "A:yes",
            "A:yes",
            "A:Yes",
            "A:No",
            "A:No",
            "A:yes",
            "A:yes",
            "A:yes",
            "A:yes",
            "A:Yes",
            "A:yes",
            "A:No",
            "A:Yes",
            "A:Yes",
            "A:yes",
            "A:It's is Sony bravia",
            "A:both",
            "A:No",
            "A:Yes",
            "A:yes",
            "A:32 inch is diagonal",
            "A:yes is HDMI port any PS 4 HDMI port cable connect Dish TV",
            "A:yes",
            "A:it's last year's model, go for 622G (2019 model) at similar price",
            "A:No",
            "A:All the cables",
            "A:No",
            "A:You cannot connect Bluetooth speakers or headsets.",
            "A:yes",
            "A:High definition.... fully high definition",
            "A:No PIP is not supported",
            "A:No.Only Wireless connection is used for internet connectivity i.e Wifi",
            "A:youtube, netflix",
            "A:yes",
            "A:Not connected moto mobiles",
            "A:Same Picture Quality but the prices of both the tv are almost same.So go for 622F model which is a smart tv.",
            "A:No support.",
            "A:Yes you can. But you must have the option of screen mirroring. Because I having Motorola handset and it doesn't have that option rather it has screen sharing. so you can connect otherwise.",
            "A:It supports my Mi Y2 mobile screen mirror, if you mobile have screen mirror feature than definitely it will support.",
            "A:yes it is full HD",
            "A:use hotstar website on browser",
            "A:Yes U Can Fixed On Your Wall Very Smoothly",
            "A:Sony Bravia there is no comparison with the legend man !!!",
            "A:no..the tv is not water proof.. it's spillproof..",
            "A:NO",
            "A:Connect via Screen mirroring",
            "A:NO",
            "A:Yes You can. Sound Control can Also be Controlled with in the settings.",
            "A:Yes, you can use pen drive and card reader too. you can play mkv files with HEVC codec ×265",
            "A:Yes",
            "A:No",
            "A:with aux pin",
            "A:2019",
            "A:Go to Setting>More settings>Turn On Wireless Display> see the Tv Model Number and Connect it.",
            "A:yes",
            "A:It's W622F",
            "A:Yes",
            "A:no",
            "A:yes some of customized apps only",
            "A:Yes",
            "A:On stand-19\" & on wall-17.5\"",
            "A:Yes Sir",
            "A:Yes you can connect",
            "A:Yes",
            "A:Technician will bring and install wall mount, it's an ordinary one (non rotatable)",
            "A:yes",
            "A:below",
            "A:yes",
            "A:No",
            "A:No",
            "A:No",
            "A:No",
            "A:No",
            "A:No",
            "A:No no",
            "A:no",
            "A:yes",
            "A:It has",
            "A:both r same",
            "A:yes",
            "A:no",
            "A:no",
            "A:No",
            "A:yes",
            "A:only Samsung mobile",
            "A:No..smart TV.",
            "A:yes",
            "A:Yes",
            "A:no",
            "A:Along with the TV wall mount...no need to purchase",
            "A:Yes",
            "A:no",
            "A:no"
        ],
        "likes": [
            "1",
            "75",
            "61",
            "5",
            "7",
            "3",
            "3",
            "3",
            "4",
            "4",
            "2",
            "2",
            "2",
            "2",
            "5",
            "17",
            "5",
            "4",
            "3",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "1",
            "2",
            "0",
            "4",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "4",
            "5",
            "6",
            "6",
            "3",
            "4",
            "4",
            "2",
            "1",
            "2",
            "2",
            "1",
            "1",
            "1",
            "2",
            "2",
            "3",
            "1",
            "2",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "2",
            "26",
            "22",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "3",
            "26",
            "5",
            "4",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "2",
            "0",
            "8",
            "5",
            "2",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "0",
            "0",
            "0",
            "0",
            "1",
            "2",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "2",
            "1",
            "0",
            "1",
            "1",
            "0",
            "5",
            "1",
            "1",
            "0",
            "0",
            "0",
            "2",
            "2",
            "5",
            "1",
            "3",
            "6",
            "21",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    }
}