{
    "title": "Hisense A71F 126 cm (50 inch) Ultra HD (4K) LED Smart Android TV with Dolby Vision & ATMOS  (50A71F)",
    "product_specification": {
        "In The Box": "Accessories: Remote: 1U, Manual: 2U, Table Stand:1U, Wall Mount: 1U, Warranty Card:1U, Batteries:2U",
        "Model Name": "50A71F",
        "Color": "Black",
        "Display Size": "126 cm (50 inch)",
        "Screen Type": "LED",
        "HD Technology & Resolution": "Ultra HD (4K), 3840 x 2160",
        "Series": "A71F",
        "Smart Tv": "Yes",
        "HDMI": "3 Side",
        "USB": "2 Side",
        "Built In Wi-Fi": "Yes",
        "Launch Year": "2020",
        "Wall Mount Included": "Yes",
        "View Angle": "178 Degree",
        "Digital Noise Filter": "Yes",
        "LED Display Type": "DLED",
        "Refresh Rate": "60 Hz",
        "Other Video Features": "Dolby Vision HDR, Ultra Vivid High Contrast Panel, HDR10, HLG, Ultra Dimming, UHD AI Upscaler, Game Mode, Precision Colour, Noise Reduction",
        "Number of Speakers": "2",
        "Sound Technology": "Dolby Audio, Dolby Atmos",
        "Speaker Output RMS": "30 W",
        "Other Audio Features": "30 W Powerful Dolby Atmos Sound",
        "Supported App - Netflix": "Yes",
        "Supported App - Youtube": "Yes",
        "Supported App - Disney+Hotstar": "Yes",
        "Supported App - Prime Video": "Yes",
        "Supported App - Others": "Eros Now, Hungama, Jio Cinema, Sony LIV, Voot, Zee5, Yupp TV, Fubo TV, Tubi, Never Think",
        "Operating System": "Android",
        "Screen Mirroring": "Yes",
        "App Store Type": "Google Play Store",
        "Content Providers": "Netflix, YouTube, Google Play Movies & TV, Google Play Store, Prime Video, Hotstar",
        "Wireless LAN Adapter": "Yes",
        "Bluetooth": "Yes",
        "Ethernet (RJ45)": "1",
        "Other Internet Features": "More than 5000 plus apps and games, Chromecast, Google Play Store, Google Assistant, Unilimited content",
        "Component In (RGB Cable)": "Yes",
        "Headphone Jack": "1",
        "Other Connectivity Features": "Ethernet LAN In, AV In, Browser, HDMIx3, HDMI 2.0 (All HDMIs), CEC (HDMI1), USBx2, Digital Audio Out, Dual band WiFi",
        "Smart Remote": "Yes",
        "Color Screen": "Yes",
        "RF Capable": "Yes",
        "Internet Access": "Yes",
        "Operating Distance": "9 m",
        "Battery Type": "2 AAA Batteries",
        "Remote Charger": "No",
        "Other Remote Control Features": "Voice Control",
        "Power Requirement": "AC 100 - 240 V, 50/60 Hz",
        "Power Consumption": "0.5 W (Standby)",
        "Clock": "Yes",
        "Other Convenience Features": "Direct App Access Hotkeys, Bluetooth Voice Remote, Dolby Vision, Dolby Atmos",
        "Width x Height x Depth (without stand)": "111.6 cm x 64.7 cm x 8.5 cm",
        "Weight (without stand)": "9.8 kg",
        "Width x Height x Depth (with stand)": "111.6 cm x 70.9 cm x 22.5 cm",
        "Weight (with stand)": "10.1 kg",
        "Stand Features": "Plastic",
        "Warranty Summary": "1 Year Warranty",
        "Covered in Warranty": "Defect Arising Out of Faulty or Defective Material or Workmanship Defects Only Covered in Warranty.",
        "Not Covered in Warranty": "Warranty Does not Include Plastic Parts and Remote Control. Damage Resulting from Accidents, Misuse, Abuse, Act of God, Tempering, or Failure of the Purchaser to Follow the Normal Procedure Outlined in the User Manual. Defect of Damage Due to Spillage of Liquids or Wrong Use of Electrical Supply and Voltage. Damage Resulting from Normal Wear and Tear, Corrosion, Rusting and Stains. Damage Resulting from Breaking of LED Screen or Plastic Parts. LCD or LED Panels may have Few bad or Dead Pixels. This is Not a sign of Malfunction. Please Refer to Our Authorized Service Personnel for Clarification.",
        "Warranty Service Type": "On-site",
        "Installation & Demo Details": "Authorized Service Engineer will do the following: Repair / change the defective part. Provide replacement to the customer in case part / product not repairable (only after replacement request approved). Warranty on replacement product will be applicable upto the warranty date of the replaced / original product. Repair Services."
    },
    "product_description": {
        "Dolby Vision": "Dolby Vision makes the highlights brighter than ordinary TVs by up to 40 times, and it darkens the blacks by about 10 times. Thanks to that, you enjoy watching lifelike visuals on this TV’s screen.",
        "Dolby Atmos": "Whether you’re watching an action-packed movie or playing a game, you will find yourself in the thick of the action as Dolby Atmos delivers fuller and highly immersive surround sound that will leave you in awe.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "3",
            "4",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "4",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "3",
            "3",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "3",
            "3",
            "5",
            "5",
            "5",
            "4",
            "2",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "3",
            "3",
            "5",
            "4",
            "1",
            "5",
            "1",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "3",
            "1",
            "5",
            "5",
            "5",
            "4",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "2",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "4",
            "2",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "3",
            "4",
            "5",
            "4",
            "1",
            "2",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "1",
            "5",
            "4",
            "5",
            "5",
            "4",
            "1",
            "5",
            "2",
            "5",
            "4",
            "2",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5"
        ],
        "review": [
            "Giving this review after two days of use. Very happy with the product, flipkart quick delivery and the installation. As per the promotional offer from hisense my 55\" tv will be under warranty of coming 5yrs. Hope there won't be any issues before and after. Initially I thought of using my Sony home theater for better audio, now I realized it don't need because of Dolby Atmos. Thank you Hisense and Flipkart.",
            "First of all thank you Flipkart,Second one is Hisense.\nNow review for my 43’ led Tv. Some people say this product review wrong .But My opinion this one is awesome.Very fast connect .Picture quality is very nice 4K mode and HD both mode . Product is impressed for me and my family. Sound is very nice . All function are work very nicely and also useful .All over experience is unbelievable. Once again Thankyou Flipkart and installation team.",
            "I bought this TV with some expectation as I understood that this is an international brand. But not as expected.\n\nWhat i like:\n1) Light weight. Easy to cary. (But we don’t carry or change location all the time)\n2) Easy to setup, hope most of the TVs now a days are simple to setup.\n3) latest android and most of the apps are installable. How ever i saw still some app are not available but sufficient apps are available.\n4) Happy with the 4K quality at this price range. Sony and Samsung have excellent picture quality but we need to spend 1/3 more money than this one.\n\nWhat i don’t like:\n1) Picture clarity for HD content where colours are not bright enough (even after changing multiple setting from options). So for regular videos like 720p quality or HD quality its not so good.\n2) Black levels are badly controlled. When you see a night scene, darkness is really bad. Blackness will have lot of red dots which will definitely not give a good fell of watching it.\n3) Navigation buttons on remote are very close especially down navigation & home button and up navigation and google voice assistance. When we try to use up and down buttons one will press home and google assistance buttons. So always we have to look at remote before operating.\n4) Sound is average. I felt sound quality is same as a 6years old hd tv what i have. But little clear at high volumes. I have to check with an external out put.",
            "Superb fantastic and fabulous pictures quality This range. Connectivity is fast no lag.And Smooth mirroring cast. Thank you flipkart for super fastest delivery. I happy to buy this product 👍👍👍👍👍",
            "Picture quality is very good as compared to other budget televisions like MI. It supports all video formats like x265 and h265 Operating system is not very fast but it works smoothly. One of the major issue that I have noticed is that-\n\nTv has noticeable motion blur/judder problem while playing action movies or when camera moves little bit quickly. 4k 60 fps plays smoothly but movies/TV shows are usually coded at 24fps. So, it is bit irritating for a cinema lover. Just watch cricket highlight...\nREAD MORE",
            "Master blaster💥\n\nThis is a value for money product...must buy and experience flagship quality in a budgeted smart tv.\n\nI was bought this one on 8th of August during the offer period of 5 years of panel warranty at 12 months NCE. The size of the screen is 55 inches.\n\nRating\nPicture quality -5/5\nSound (By activating Dolby Atmos) 5/5\nWithout Dolby 5/5 however, Dolby enhances the volume.\nBuild quality- 5/5(Remote quality is also very good)\nFeatures -5/5 ( it's a feature pack..you can control eac...\nREAD MORE",
            "Superb product i must say, I wanted to go for brand like Sony, Samsung. But i gave a try to this product looking to inaugural offer of five year warranty on panel which is most costly part of Led TVs. I got almost in half price in comparison of big brand.\n\nPros\nConnectivity is awesome,\nSound is good,\nBuild quality is good\nPicture quality is also very good\nBezzleless design looks elegant\n\n\nCons\nWall Stand is quite deep\n\nPerfect buy in this price segment, its better than any brands VU, MI, Toshiba etc. Go and grab it",
            "Mind blowing purchase\n\nThnx fr Flipkart fr bringing such an awesome tv in v affordable pricing n add on to ur Discounts ( credit Card n SuperCoins n Gift voucher won in ur *Fake or not* show )\n\nHiSense is abrand to watch out fr future , expecting 75\" n 85\" Qled TV's v damm affordable pricings in future\n\nThnx fr 5years Panal guarantee service\n\nI'm only worried now about Power consumption of Tv as Power rating stars are not mentioned n given in tv",
            "Bought this TV in the inaugural sale with 5 year panel warranty, I am happy with my purchase and here are my thoughts after 4 days of usage\n\nPros:\n1)The picture quality is really amazing, Clarity is also good.\n2) HD channels look really great, SD channels look decent.(Yes only decent not great)\n3)This TV shines while using the OTT platforms, you can truly experience the quality of the 4k panel while playing content on OTT platforms\n4)Sound is also great, I don't think you require a Sound Bar even if you place the TV in the living room\n5)Connectivity is seamless(Bluetooth, Wifi, HotSpot and Casting) have not noticed any issues till now\n\nNow Cons:\n1)Color Management:\nI did not like the color management on this TV, especially Human Skin tones look a little Reddish.\nI have seen the Iffalcon TV, I like the color management on IFFalcon TVs and this might be my personal preference.\nYou will notice the color management issues while watching TV channels from your Set Top Box.\nIn terms of contrast some channels look really dull and some channels look blown out like really high contrast.\nIs this a broadcast issue or issue with the TV itself I don't know.\n2) Quality of the Remote:\nThe quality of the remote is really bad, you can hold the remote in hand and tell it is made of cheap materials. The buttons too are not very good\n3) Noticed lag in UI on the first day itself especially while using the Google assistant. I do not use Google Assistant regularly but I tried it just to\ntest and noticed significant lag.\n4) Looks: You get what you paid for, this TV doesn't look premium at all. Anybody can look at the TV and say it's a budget TV",
            "Product satisfies all the mandatory requirements one who looks to have an android TV.. Only one improvement could be in wall mounting bracket. May be one who is living in compact homes will find it bit risky of getting TV hit accidentally. Distance between TV panel and wall behind it is huge due to bracket depth is more comparatively. It should be short i guess. Leaving that its worth buying in this price range.",
            "Giving this review after two days of use. Very happy with the product, flipkart quick delivery and the installation. As per the promotional offer from hisense my 55\" tv will be under warranty of coming 5yrs. Hope there won't be any issues before and after. Initially I thought of using my Sony home theater for better audio, now I realized it don't need because of Dolby Atmos. Thank you Hisense and Flipkart.",
            "First of all thank you Flipkart,Second one is Hisense.\nNow review for my 43’ led Tv. Some people say this product review wrong .But My opinion this one is awesome.Very fast connect .Picture quality is very nice 4K mode and HD both mode . Product is impressed for me and my family. Sound is very nice . All function are work very nicely and also useful .All over experience is unbelievable. Once again Thankyou Flipkart and installation team.",
            "I bought this TV with some expectation as I understood that this is an international brand. But not as expected.\n\nWhat i like:\n1) Light weight. Easy to cary. (But we don’t carry or change location all the time)\n2) Easy to setup, hope most of the TVs now a days are simple to setup.\n3) latest android and most of the apps are installable. How ever i saw still some app are not available but sufficient apps are available.\n4) Happy with the 4K quality at this price range. Sony and Samsung have excellent picture quality but we need to spend 1/3 more money than this one.\n\nWhat i don’t like:\n1) Picture clarity for HD content where colours are not bright enough (even after changing multiple setting from options). So for regular videos like 720p quality or HD quality its not so good.\n2) Black levels are badly controlled. When you see a night scene, darkness is really bad. Blackness will have lot of red dots which will definitely not give a good fell of watching it.\n3) Navigation buttons on remote are very close especially down navigation & home button and up navigation and google voice assistance. When we try to use up and down buttons one will press home and google assistance buttons. So always we have to look at remote before operating.\n4) Sound is average. I felt sound quality is same as a 6years old hd tv what i have. But little clear at high volumes. I have to check with an external out put.",
            "Superb fantastic and fabulous pictures quality This range. Connectivity is fast no lag.And Smooth mirroring cast. Thank you flipkart for super fastest delivery. I happy to buy this product 👍👍👍👍👍",
            "Picture quality is very good as compared to other budget televisions like MI. It supports all video formats like x265 and h265 Operating system is not very fast but it works smoothly. One of the major issue that I have noticed is that-\n\nTv has noticeable motion blur/judder problem while playing action movies or when camera moves little bit quickly. 4k 60 fps plays smoothly but movies/TV shows are usually coded at 24fps. So, it is bit irritating for a cinema lover. Just watch cricket highlight...\nREAD MORE",
            "Master blaster💥\n\nThis is a value for money product...must buy and experience flagship quality in a budgeted smart tv.\n\nI was bought this one on 8th of August during the offer period of 5 years of panel warranty at 12 months NCE. The size of the screen is 55 inches.\n\nRating\nPicture quality -5/5\nSound (By activating Dolby Atmos) 5/5\nWithout Dolby 5/5 however, Dolby enhances the volume.\nBuild quality- 5/5(Remote quality is also very good)\nFeatures -5/5 ( it's a feature pack..you can control eac...\nREAD MORE",
            "Superb product i must say, I wanted to go for brand like Sony, Samsung. But i gave a try to this product looking to inaugural offer of five year warranty on panel which is most costly part of Led TVs. I got almost in half price in comparison of big brand.\n\nPros\nConnectivity is awesome,\nSound is good,\nBuild quality is good\nPicture quality is also very good\nBezzleless design looks elegant\n\n\nCons\nWall Stand is quite deep\n\nPerfect buy in this price segment, its better than any brands VU, MI, Toshiba etc. Go and grab it",
            "Mind blowing purchase\n\nThnx fr Flipkart fr bringing such an awesome tv in v affordable pricing n add on to ur Discounts ( credit Card n SuperCoins n Gift voucher won in ur *Fake or not* show )\n\nHiSense is abrand to watch out fr future , expecting 75\" n 85\" Qled TV's v damm affordable pricings in future\n\nThnx fr 5years Panal guarantee service\n\nI'm only worried now about Power consumption of Tv as Power rating stars are not mentioned n given in tv",
            "Bought this TV in the inaugural sale with 5 year panel warranty, I am happy with my purchase and here are my thoughts after 4 days of usage\n\nPros:\n1)The picture quality is really amazing, Clarity is also good.\n2) HD channels look really great, SD channels look decent.(Yes only decent not great)\n3)This TV shines while using the OTT platforms, you can truly experience the quality of the 4k panel while playing content on OTT platforms\n4)Sound is also great, I don't think you require a Sound Bar even if you place the TV in the living room\n5)Connectivity is seamless(Bluetooth, Wifi, HotSpot and Casting) have not noticed any issues till now\n\nNow Cons:\n1)Color Management:\nI did not like the color management on this TV, especially Human Skin tones look a little Reddish.\nI have seen the Iffalcon TV, I like the color management on IFFalcon TVs and this might be my personal preference.\nYou will notice the color management issues while watching TV channels from your Set Top Box.\nIn terms of contrast some channels look really dull and some channels look blown out like really high contrast.\nIs this a broadcast issue or issue with the TV itself I don't know.\n2) Quality of the Remote:\nThe quality of the remote is really bad, you can hold the remote in hand and tell it is made of cheap materials. The buttons too are not very good\n3) Noticed lag in UI on the first day itself especially while using the Google assistant. I do not use Google Assistant regularly but I tried it just to\ntest and noticed significant lag.\n4) Looks: You get what you paid for, this TV doesn't look premium at all. Anybody can look at the TV and say it's a budget TV",
            "Product satisfies all the mandatory requirements one who looks to have an android TV.. Only one improvement could be in wall mounting bracket. May be one who is living in compact homes will find it bit risky of getting TV hit accidentally. Distance between TV panel and wall behind it is huge due to bracket depth is more comparatively. It should be short i guess. Leaving that its worth buying in this price range.",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Excellent picture quality. Connectivity is ultra fast. Seamless witch between apps. Nice installation and product demonstration.Overall a worthy purchase. So...\nRead full review",
            "Very good Product. Good job installation team even",
            "Good picture quality ,value with money .. quality product & weight is very small ... handy .. I am felling love with this tv",
            "Super led tv for this range..",
            "Worth for money and good product",
            "Thanks flipkart for new toshiba tv",
            "Splendid product, nice installation system within few hours, vibrant colours filled with nature like pigments.\nThanks# Samsung India ,# Flipkart.",
            "Very good TV, great picture quality, awesome sound, surprisingly I found Tizen much better and faster than Android TV. The picture quality is so good that it...\nRead full review",
            "Worth of money.",
            "Worth of money.",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Best picture quality , best sound quality, easy use , easy remote use , fast refresh , tv not hanging, fast moving, easy connected all device , google assis...\nRead full review",
            "Sellar should check and deliver the quality of the product.",
            "This is a detailed review after 7 days. Please read this if you have problem or concern regarding sound/picture/brightness/sd channels/wifi connectivity/mira...\nRead full review",
            "Very good tv in this range",
            "This is my first Smart TV and probably first detailed review ever.\n\nI bought this TV after a long research and hesitations. I was worried about my TV experie...\nRead full review",
            "Nice quality very good 😊",
            "Worth of money.",
            "Worth of money.",
            "EXPECTED MORE BUT NOTHING SPECIAL\n\n*Picture quality is good.\nBut if you want to see the vivid colours please don't buy.\n* Hd and 4k contents are super\n*Pict...\nRead full review",
            "Very good purchase go for it. It’s work for ur money",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Good Product.\nThe TV is very good for the price range, i have used oneplus QLED Q1 and would like to compare with it.\n\n1) Picture Quality:\nQuality is excel...\nRead full review",
            "Worth buying a cinematic experience in such a minimal investment. I wouldn’t mind saying it a smart buying VU over any other brand. I replaced all LEDs of my...\nRead full review",
            "When we see a picture in angle, it is not looking as same as we see it in center.\n\nImage degrades in angel.\n\nBuild quality and audio is good\n\nThere is some l...\nRead full review",
            "Better product not a best",
            "This tv is very nice,sleek design,good picture quality and dolbydts sound.this Infinex led tv is total value of money..must buy this product.i got its instal...\nRead full review",
            "Must buy this... Ossom t v.... Better than mi",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Good one, latest model tv , impressed with the specs",
            "Good one, latest model tv , impressed with the specs",
            "It is really a value for money. This is a 4K latest Anroid Smart TV just launched, TV is working fine with very high picture quality and the USP of this smar...\nRead full review",
            "Absolutely fine and very good clarity awesome 40w sound etc...",
            "Colour production is good , motion interpolation is perfect . It is va panel for 43 inch tv viewing angle is good, not ips as in description , sound quality...\nRead full review",
            "TV don't have Android operating system and don't have magic remote. Other wise all good",
            "I have purchased this TV on the occasion of Diwali festival season. They have delivered in advance before scheduling date. Very quick service. Sound and pict...\nRead full review",
            "Installed on 03-Mar-22. Yet to get experience of viewing. Shall post after two weeks.",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "I purchased Kodak CAPro 43 inch Android TV from Flipkart. After receiving the product i watched two 4k HDR movies and found the screen quality and Sound qual...\nRead full review",
            "Good tv.\nNo lags\nSome scene modes should be more refined to feel the ultra hd 4k experience.\nSound is good.",
            "So I bought this TV last week. And I already knew the why and what of this product. Why to buy it and what to expect out of it. Actual user experience is of ...\nRead full review",
            "Overall Experience is good",
            "I'm already a user of INFINIX, I'm using infinix phone. So it wasn't hard for me to trust on this brand. Then i bought 43\" LED and was found as good as i was...\nRead full review",
            "Worst ever purchased, because tv remote not working properly, if i click on power button to switch on but it's no power on, then i use home button in tv,.",
            "Good Product.\nThe TV is very good for the price range, i have used oneplus QLED Q1 and would like to compare with it.\n\n1) Picture Quality:\nQuality is excel...\nRead full review",
            "Worth buying a cinematic experience in such a minimal investment. I wouldn’t mind saying it a smart buying VU over any other brand. I replaced all LEDs of my...\nRead full review",
            "not very nice. just ok waste of money sound is very poor",
            "not very nice. just ok waste of money sound is very poor",
            "Great product in the budget. Great picture quality with sound and connectivity. Do not go for a China product rather buy Panasonic. It's a very old brand fro...\nRead full review",
            "So many problems after usage of 6months.better to go for another brand.",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "This tv is overall good if you want a honest review then read this review\nI will discuss about good points and bad points of this tv\nWe'll begin with bad poi...\nRead full review",
            "This Nokia TV is bettee then others in this budget segments.",
            "Writing this review, after almost a month of using it, previously I have used the realme sled tv too, so I have the idea of how TV's are in this price range,...\nRead full review",
            "Amazing product in this price range. Loved it👍",
            "Very nice product worth for money",
            "Sound quality is not good.",
            "Worth it to buy. I have relied on the brand COMPAQ. I got it in 27k. More than enough and sufficient in the price range",
            "Worth it to buy. I have relied on the brand COMPAQ. I got it in 27k. More than enough and sufficient in the price range",
            "A really nice TV in this price range. The picture clarity is very good and the sound quality is incredible. Only wish that the typing could be easier on the TV.",
            "Tv is very good, as per its price\nIn the tv they have provided a simple tv stand its better if they provide the flixibale stand.",
            "It's really amazing choice...Thanks to samsung. I choose installation with samsung by help of customer care and it worked superb for me. This tv features are...\nRead full review",
            "Excellent product value for money.\nGood quality.\nGood installation experience from samsung engineers.",
            "I can purchase this Product...It is a good quality and awesome Android Tv... I'm really so happy.. Thank you very much flipkart..You know your service is ver...\nRead full review",
            "It's not working properly.\nIt's gone before a 4months",
            "TV is awesome and desire for a needful customer which demand in TV\nand I am happy to see audio jack its amazing to connect home Theatre enjoy movies and vedi...\nRead full review",
            "Excellent picture quality and sound, i am so glad.",
            "Being a Nokia fan, My honest review after one month of usage is below.\nGood things:\nPerformance is good,\nPicture Quality is good,\nSound Quality is good,\nGre...\nRead full review",
            "Damage within 5months of delivery. Si don't buy",
            "I was looking for a non chinese TV and finally, after spending some time researching bought Nokia 43 Android 11 TV and its almost 3 days , here are my observ...\nRead full review",
            "Nice product as my expectation.",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Dear All,\nThe overall review is good, but the delivery and installation was too late and almost waited for 2 weeks. The tv picture clarity and sound is good ...\nRead full review",
            "Picture and sound is amazing",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "As per price.. it's may be the best..",
            "perfect smart TV for this range... gud quality nice tv.",
            "Actual image of my Android TV from iFFALCON (TCL) 1). Picture quality very sharp & great black colour to enhance viewing angle. 2). Sound is enough loud. no ...\nRead full review",
            "Product is really good.....",
            "Very impressive picture quality .Good color balance and video presets are available unlike some tv's where colors are more defined for watching soaps and re...\nRead full review",
            "Good product but tv sound quality simple",
            "Very Nice Product. Picture Quality is good. Sound is Good. Overall is good",
            "Very Nice Product. Picture Quality is good. Sound is Good. Overall is good",
            "Good",
            "Good",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Very impressive picture quality .Good color balance and video presets are available unlike some tv's where colors are more defined for watching soaps and re...\nRead full review",
            "Good product but tv sound quality simple",
            "11 days and still no one came to install.",
            "DO NOT IGNORE MY COMMENT, IF YOU BUYING 41INCH TV PLEASE BUY WITH AT LEAST 1920*1080 resolution. Not 1366*768, never. I repeat, NEVER",
            "Good product and valve money",
            "Good product and valve money",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "You are going to love this Tv because at this price range it is almost a complete package(does not have Bluetooth connectivity) but picture mode option shoul...\nRead full review",
            "Worst customer/ installation service. Nobody turned up for installation after repetitive follow up and finally I had to return the product. Only one man hand...\nRead full review",
            "Picture quality is average, at every angle not like a qled tv. I think its panel is B grade. Picture settings needs very fine adjustment. Sound is average. H...\nRead full review",
            "very good performance. Don't go by negative reviews. I purchased it. You definitely enjoy the picture quality with the lowest cost which no brand can sell.",
            "I am a visual effects artist and spent a lot of time to pick this brand over its competitors like I falcon, Thompson, Vu and MI\n\nONE SENTENCE VERDICT-with sm...\nRead full review",
            "Totally satisfied so far in 20 months of ownership.",
            "Great LG 55 inch smart IPS LED TV. Wow... What a picture quality.... Screen mirroring works like a charm... Thanks Flipkart for this great product on your sh...\nRead full review",
            "Best TV in the budget, Overall review is 4.5 out of 5. Best picture and sound clarity. Additional USB port would have been much better.",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "coocaa 43s6g pro my frist tv is screen problems .\nbut Flipkart is Replace new tv...this tv picture quality is very good ,\nsound is average .but good .. hol ,...\nRead full review",
            "Nice quality and nice product....",
            "Stark Review :\nBeen 3 months since the purchase. Bang for buck TV it is. QLED at thir price from a reputed brand of TCL is a well made decision.\nPros :\n1....\nRead full review",
            "Stark Review :\nBeen 3 months since the purchase. Bang for buck TV it is. QLED at thir price from a reputed brand of TCL is a well made decision.\nPros :\n1....\nRead full review",
            "Very impressive picture quality .Good color balance and video presets are available unlike some tv's where colors are more defined for watching soaps and re...\nRead full review",
            "Good product but tv sound quality simple",
            "It's really amazing choice...Thanks to samsung. I choose installation with samsung by help of customer care and it worked superb for me. This tv features are...\nRead full review",
            "Excellent product value for money.\nGood quality.\nGood installation experience from samsung engineers.",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Delivery timing perfect Thank you Flipkart",
            "Delivery timing perfect Thank you Flipkart",
            "TV is good but the installation service is poor. 1. Technician doesn't know how to fish through wire into conduit to bring power wire behind the TV. 2. Te...\nRead full review",
            "Very much satisfied with the performance of the TV. But the guy who has come for installation was very rude and arogent.",
            "Very impressive picture quality .Good color balance and video presets are available unlike some tv's where colors are more defined for watching soaps and re...\nRead full review",
            "Good product but tv sound quality simple",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Very impressive picture quality .Good color balance and video presets are available unlike some tv's where colors are more defined for watching soaps and re...\nRead full review",
            "Good product but tv sound quality simple",
            "I bought this tv 1 month back. I played HDR and 4K content from Netflix. Picture quality is superb.\n\nI can strongly suggest this tv.",
            "I bought this tv 1 month back. I played HDR and 4K content from Netflix. Picture quality is superb.\n\nI can strongly suggest this tv.",
            "Fast delivery by flipkart and with very good deal.\nPurchased on 17thoct, picture quality is so good in this price range as expected from sony. But this time...\nRead full review",
            "This model is good but SONY has deliberately not provided Bluetooth connectivity to high power devices like headphones and soundbar systems that use wireless...\nRead full review",
            "Very good value for money.",
            "Very good value for money.",
            "Bought it as a secondary TV for guest room. But it became the primary choice as it does everything a TV is meant to do.\nPros:\nCosts as much as a budget smart...\nRead full review",
            "2.7yr TV gone everything else is fine 😂",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Go for this TV if you want vibrant colours. The black levels on this TV is pathetic and poor .There is no black level , it can be said as grey level. The col...\nRead full review",
            "Please go for OLED because difference is not much inbetween Nanocell and OLED. After the purchase I found OLED picture and sound quality far better than LG N...\nRead full review",
            "Very impressive picture quality .Good color balance and video presets are available unlike some tv's where colors are more defined for watching soaps and re...\nRead full review",
            "The product is superb except for the remote, the downway button on the remote is not working sometimes......",
            "NOTE : This perticular \"Vu MODEL\" is not available in any of the outlets for a reason. When all the other models of \"Vu\" are sold in stores why this perticul...\nRead full review",
            "everything works very well .",
            "Left speaker defected making so much noise 👺👺👺",
            "Left speaker defected making so much noise 👺👺👺",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Pure depth black levels, true color display. OLED stands apart with an amazing speaker config with really professional and friendly installation experience",
            "Pure depth black levels, true color display. OLED stands apart with an amazing speaker config with really professional and friendly installation experience",
            "Delivered in Good condition, quick delivery & installation. TV is working well.",
            "Delivered in Good condition, quick delivery & installation. TV is working well.",
            "Very impressive picture quality .Good color balance and video presets are available unlike some tv's where colors are more defined for watching soaps and re...\nRead full review",
            "Good product but tv sound quality simple",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Hi !\n\nA great experience on it's first appearance. The TV was ordered on 19/1/2019 during the Repulbic Day Sale, and flipkart/ekart delivered it to me on 2...\nRead full review",
            "Awesome tv go for it.. Bezels are minimal nice viewing angle",
            "Very impressive picture quality .Good color balance and video presets are available unlike some tv's where colors are more defined for watching soaps and re...\nRead full review",
            "Good product but tv sound quality simple",
            "Problem with casting.. another app have to installed to cast phone screen to tv. If ph is old then no need to install any app for cast screen.. for new m...\nRead full review",
            "It's a very nice tv, connectivity, picture quality every thing is fine,value for money",
            "Splendid product, nice installation system within few hours, vibrant colours filled with nature like pigments.\nThanks# Samsung India ,# Flipkart.",
            "Very good TV, great picture quality, awesome sound, surprisingly I found Tizen much better and faster than Android TV. The picture quality is so good that it...\nRead full review",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Dream came true.\nVery good Smart TV within budget. No need to purchase Chinese & Korean company product, Indian company much better.\nVery good price, pictu...\nRead full review",
            "Nice product good picture quality",
            "Very impressive picture quality .Good color balance and video presets are available unlike some tv's where colors are more defined for watching soaps and re...\nRead full review",
            "Good product but tv sound quality simple",
            "Buying this on the launch day was a slight risk as there were no reviews or ratings but thankfully my decision was correct.. I am so happy to buy this tv... ...\nRead full review",
            "Worst purchase ever\nIf you're looking for tv above 50k go for brands like sony\nTv isn't turning on after 13months",
            "Fully satisfied with my purchase, watching prime and you tube is ultimate experience. Although wall mount is not provided in the box.\nUI is simple and lucid....\nRead full review",
            "Fully satisfied with my purchase, watching prime and you tube is ultimate experience. Although wall mount is not provided in the box.\nUI is simple and lucid....\nRead full review",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Thanks to flipkart for offering such a gorgeous tv at such an affordable price... Got it delivered before due date & installation was also done properly by t...\nRead full review",
            "Thanks to flipkart for offering such a gorgeous tv at such an affordable price... Got it delivered before due date & installation was also done properly by t...\nRead full review",
            "Very impressive picture quality .Good color balance and video presets are available unlike some tv's where colors are more defined for watching soaps and re...\nRead full review",
            "Good product but tv sound quality simple",
            "Colour production is good , motion interpolation is perfect . It is va panel for 43 inch tv viewing angle is good, not ips as in description , sound quality...\nRead full review",
            "TV don't have Android operating system and don't have magic remote. Other wise all good",
            "Excellent picture quality and sound and awesome flipkart experience",
            "Super delivery,super installation, quality is good, sound quality good but I got issue in EMI option",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Its a year now. For 1k per inch, this is a good performer & most vfm product. All is good, TV looks beautiful & remote is slim & just efficient. UI is ok. A...\nRead full review",
            "TV LED strap gone after 12 months (just after warrantyexpired). Blake shade one side of tv. Remote too not working which needs to be replaced with in warranty.",
            "An excellent product with awesome performance ! I am a marketing person and never buy anything without, evaluating whole market !\n\nI found this to be a great...\nRead full review",
            "This product is to good for me..",
            "Very impressive picture quality .Good color balance and video presets are available unlike some tv's where colors are more defined for watching soaps and re...\nRead full review",
            "Good product but tv sound quality simple",
            "Pros:\n1. Date of manufacture may 2017\n2. Delivery and installation as promised\n3. Quality of the display is good\n4. Aux feature to add 2.1 speakers\n5. Usb v...\nRead full review",
            "Display & connectivity is good but sound quality is terrible. too expensive. better TVs come at cheaper rate than this tv..",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Picture quality is really awesome when I played 4k content, best smart TV to buy, overall sound and picture quality is good, go for it, I bought it for 53k.....\nRead full review",
            "Picture quality is really awesome when I played 4k content, best smart TV to buy, overall sound and picture quality is good, go for it, I bought it for 53k.....\nRead full review",
            "Very impressive picture quality .Good color balance and video presets are available unlike some tv's where colors are more defined for watching soaps and re...\nRead full review",
            "Good product but tv sound quality simple",
            "Tv was good, but recieved a defective product. After a Lot of hence and forthe between flipkart execs and Samsung execs, finally after much stress got it ret...\nRead full review",
            "Excellent work\nAnd poor sound",
            "Writing this review, after almost a month of using it, previously I have used the realme sled tv too, so I have the idea of how TV's are in this price range,...\nRead full review",
            "Amazing product in this price range. Loved it👍",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Very impressive picture quality .Good color balance and video presets are available unlike some tv's where colors are more defined for watching soaps and re...\nRead full review",
            "Good product but tv sound quality simple",
            "Good quality picture\nA worthy branded led tv..unless you want premium quality like sony i will suggest go for it!",
            "Good quality picture\nA worthy branded led tv..unless you want premium quality like sony i will suggest go for it!",
            "Improve sound quality & storage capacity about 20% to make best product of India.Suggest me how to improve sound & storage capacity or replace my TV with VU...\nRead full review",
            "There is no negative marking otherwise I must have chosen -5 rating for VU and its services partner Jeeves.\nFirst of all I want to convey you all don't buy ...\nRead full review",
            "One of the best Tv in this price range ..i have been using this tv from 7 months. Awesome picture quality .this is the only SUHD tv from samsung which has qu...\nRead full review",
            "One of the best Tv in this price range ..i have been using this tv from 7 months. Awesome picture quality .this is the only SUHD tv from samsung which has qu...\nRead full review",
            "TV is good but this model has light leaking problem. I bought this throughout Flipkart but later got the money refunded from Samsung.",
            "Best tv at best rate . go for it",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Nice tv picture quality good & sound is to good screen minoring is not available",
            "Picture quality is good but facing some issues with installation for one week. Present condition is okay in future we need to what's the condition or worth f...\nRead full review",
            "Superb TV with a great price. Double the money than Mi or TCL's 55 inch models, but this is totally exceptional when it comes to the core thing, Picture qual...\nRead full review",
            "Very good product from LG.\nPros:\nexcellent picture quality\nSound clarity is good, but I use Bose with optical out\nConnectivity is good. 4 HDMI ports and nav...\nRead full review",
            "Dream came true.\nVery good Smart TV within budget. No need to purchase Chinese & Korean company product, Indian company much better.\nVery good price, pictu...\nRead full review",
            "Nice product good picture quality",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Very good product and very good support customer service",
            "Excellent and Futuristic TV.",
            "Dream came true.\nVery good Smart TV within budget. No need to purchase Chinese & Korean company product, Indian company much better.\nVery good price, pictu...\nRead full review",
            "Nice product good picture quality",
            "Very impressive picture quality .Good color balance and video presets are available unlike some tv's where colors are more defined for watching soaps and re...\nRead full review",
            "Good product but tv sound quality simple",
            "Lg a1 oled is a fantastic tv with exceptional picture clarity and very good for watching movies. Of course it is not as bright as lg cx and other 2021 oled m...\nRead full review",
            "Barring the worst service by Flipkart TV is the best I have experienced. Awesome picture and sound, best display for a movie of a UHD video. 4K media looks u...\nRead full review",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "I am have with delivery and delivery boy was good attitude",
            "I am have with delivery and delivery boy was good attitude",
            "It's a very good Smart TV with in budget. Picture quality was too good. I'm satisfied with overall performance of the TV .Installation was too good. Thank yo...\nRead full review",
            "SOME FUNCTION IS NOT WORKING FROM DAY 1 LIKE WIFI AND MIRACAST",
            "Dream came true.\nVery good Smart TV within budget. No need to purchase Chinese & Korean company product, Indian company much better.\nVery good price, pictu...\nRead full review",
            "Nice product good picture quality",
            "The BEAST you can bring to your home! Sony leads any brand for it’s picture clarity! This takes audio to whole new level!! The google tv experience has been ...\nRead full review",
            "Premium product. You will enjoy watching movies. Do some sound setting according to your envoirment.",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Dream came true.\nVery good Smart TV within budget. No need to purchase Chinese & Korean company product, Indian company much better.\nVery good price, pictu...\nRead full review",
            "Nice product good picture quality",
            "Very impressive picture quality .Good color balance and video presets are available unlike some tv's where colors are more defined for watching soaps and re...\nRead full review",
            "Good product but tv sound quality simple",
            "Splendid product, nice installation system within few hours, vibrant colours filled with nature like pigments.\nThanks# Samsung India ,# Flipkart.",
            "Very good TV, great picture quality, awesome sound, surprisingly I found Tizen much better and faster than Android TV. The picture quality is so good that it...\nRead full review",
            "Very Good Picture Quality with a decent sound system. You can surely go for this product in this price range. Good delivery by Flipkart.",
            "very good product ,just amezing",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Very impressive picture quality .Good color balance and video presets are available unlike some tv's where colors are more defined for watching soaps and re...\nRead full review",
            "Good product but tv sound quality simple",
            "Splendid product, nice installation system within few hours, vibrant colours filled with nature like pigments.\nThanks# Samsung India ,# Flipkart.",
            "Very good TV, great picture quality, awesome sound, surprisingly I found Tizen much better and faster than Android TV. The picture quality is so good that it...\nRead full review",
            "Very Good Picture Quality with a decent sound system. You can surely go for this product in this price range. Good delivery by Flipkart.",
            "very good product ,just amezing",
            "Very advanced application and software has been used for candes led TV, thanks I am happy",
            "Nice feature and good quality 👍",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Amazing item within Rs. 11,500/-. Unbelievable.",
            "Product not good about 1 month issue creat in the screen and not solved problem from philip card",
            "Nice tv picture quality good & sound is to good screen minoring is not available",
            "Picture quality is good but facing some issues with installation for one week. Present condition is okay in future we need to what's the condition or worth f...\nRead full review",
            "First of all I would say this TV is a bang for the money. I thought a lot before getting this TV but I finally took a bold step. First impression was amazing...\nRead full review",
            "Review After 2 yrs of usage: overall OK\n\n\nPros: cheap rate, air mouse\nCons: poor sound quality, no android update, slow system response, app response is very...\nRead full review",
            "A complete value for money as compare to high-end brands. I checked the 4K videos on net ( all LG, Sony, Samsung), the picture quality is really good. Happy ...\nRead full review",
            "very Good and quality product, value for money, flipkart delivery and service was very awesome. pls go for it",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Dream came true.\nVery good Smart TV within budget. No need to purchase Chinese & Korean company product, Indian company much better.\nVery good price, pictu...\nRead full review",
            "Nice product good picture quality",
            "MI and flipkart has Great product @ low price\nWriting a review after 1 month of usage\n1. Mi 32 inch horizon edition android Tv is awesome at this price.\n2. ...\nRead full review",
            "Good prodact and good service",
            "Very impressive picture quality .Good color balance and video presets are available unlike some tv's where colors are more defined for watching soaps and re...\nRead full review",
            "Good product but tv sound quality simple",
            "I bought this product few days ago, Awesome product.... nice picture quality bt sound quality is average, sound quality needs to improve. Others are awesome ...\nRead full review",
            "good sound good picture quality\nand indian brand",
            "super product.. picture & sound quality is so good with joy plus features.\nfast delivery. I got the product within two days of order. I am satisfied with Sam...\nRead full review",
            "Good delivery and installation system.",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Product is very good quality",
            "Product is very good quality",
            "Its been 3 months of purchase and its working fine and quality is much clear ..in this price range its is like diamond",
            "In this price it is nice product, thank u flipkart 🤝",
            "Low price with high quality product!!!\n\n1. Good deal I bought this for 59,990.\n2. Flipkart delivered this product within 2 days of order and Samsung technic...\nRead full review",
            "Samsung TV don't buy this model",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "this product is nice by t-series",
            "Good product but wall mount not deliver with tv",
            "Very impressive picture quality .Good color balance and video presets are available unlike some tv's where colors are more defined for watching soaps and re...\nRead full review",
            "Good product but tv sound quality simple",
            "Sound quality vry low and colour not good",
            "No Bluetooth and remote catching problem and no Google assistanc no voice remote control",
            "Great picture quality and sound connectivity also good 1080 full HD, screen mirroring option is there and built in Wi-Fi Sony Bravia is wonderful TV is worki...\nRead full review",
            "If you are looking for small segment TV then this Sony model is BEST BEST buy for you.\nNote-This is purely HD TV i.e 1080p.\nCost is high but the features & ...\nRead full review",
            "I am genuinely giving my review on this product after' using it for five months. It's Nice product. Nice colours . Nice sound quality, Nice all smart tv func...\nRead full review",
            "Very good product excellent results",
            "Terrific purchase !! Sound and picture clarity are too good ..",
            "The product is really nice and worth it.\n\nI have been using it from a long time and display is really good.",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Dream came true.\nVery good Smart TV within budget. No need to purchase Chinese & Korean company product, Indian company much better.\nVery good price, pictu...\nRead full review",
            "Nice product good picture quality",
            "Very impressive picture quality .Good color balance and video presets are available unlike some tv's where colors are more defined for watching soaps and re...\nRead full review",
            "Good product but tv sound quality simple",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Market is flooded with cheaper Led's. If you are looking for a brand, best service and peace of mind..go for this.\n\nTV was delivered on time and promptly ins...\nRead full review",
            "I bought this in October 2018 and it is doing good even in the 3rd year",
            "GOOD PRODUCT",
            "GOOD PRODUCT",
            "Very Nice picture quality,slim TV in low price thanks to flip kart.",
            "Very Nice picture quality,slim TV in low price thanks to flip kart.",
            "Excellent performance. Picture quality much better than my other full HD Samsung and VU TVs. It is having DVB T2 tuner inbuilt and I am receiving 5 DD channe...\nRead full review",
            "all in one super good product",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Nice product..one of the best television at reasonable price..loved it.. packing perfectly fine..on time delivery thanks to seller and Flipkart..",
            "Value for the money. Recommended",
            "Very impressive picture quality .Good color balance and video presets are available unlike some tv's where colors are more defined for watching soaps and re...\nRead full review",
            "Good product but tv sound quality simple",
            "owsome Led very nice color",
            "owsome Led very nice color",
            "The TV built is simple and sleak in the front with a Clear Display. The picture quality is good , no issues with Pixelet. Sound quality is OK which is a know...\nRead full review",
            "Waiting this preview after using for about 3 years....definately good choice...go for it....only thing lagging is sound is bit low need speakers support....f...\nRead full review",
            "Onkya speaker are osmmm... I am feeling like home theater. And picture quality is very nicee... I hve used google assistant to speak 🗣to find my fav songs,...\nRead full review",
            "The issue is with volume. It is either high or low. There is nothing in between called medium volume. The updates wont also fix anything . But this is minima...\nRead full review",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Very impressive picture quality .Good color balance and video presets are available unlike some tv's where colors are more defined for watching soaps and re...\nRead full review",
            "Good product but tv sound quality simple",
            "Picture and sound quality is good.\n\nNot sure why LG mentioned the energy star rating as just single star while smart energy saving feature is there.\n\nInstal...\nRead full review",
            "Excellent product, Nice Display, Best function & Connectivity",
            "After months of research, I had finalized on buying LG UH750T but then I received a lot of advice from people against spending so much money for buying a 4K ...\nRead full review",
            "nice tv and songh is very nice",
            "very good as per the price of 18000 . Delivery was very fast and excellent . installation workers were also very good and cooperative and did the installatio...\nRead full review",
            "Very good product must buy it height and length is also excellent",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "i received the product on the third day i ordered and the delivery staff was so polite and the installation was done very soon after the delivery.\n\nregardin...\nRead full review",
            "This is a long term review after usage of almost 5 years. I can definitely say it is value for money. I don't know if it is still available but if you get th...\nRead full review",
            "I got this TV yesterday on 16 Jun 2019. Technician visited for demo and installation within 3 hours of delivery which is fantastic.\n\nObservations\n1. Price fo...\nRead full review",
            "Not recommended\nI purchased this 1 year before, and after that display flickering problem started, panel problem occurred. Fortunately I have taken warrant...\nRead full review",
            "I m from nepal...rgl led tv gifted from my mama....aare Vai Kya super tv...hai yarr.. Samsung lg sab ka baap hai he tv.... thank you so much RLG ❤️❤️",
            "This Tv is awesome...👍 But the company does not provide any software updates or upgrades.",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "I thought Id give a try to not so famous brabd TV.. But this turned out good Sound Quality is good and the rest features are good too",
            "Waste product, don't buy marq products",
            "This is really nice. Also, Demo and installation team came according to our convenience.",
            "Stopped working in an year. Got a black screen with sound while watching a TV show on a normal day. going to claim warranty lets see how it goes with flipkart",
            "Very impressive picture quality .Good color balance and video presets are available unlike some tv's where colors are more defined for watching soaps and re...\nRead full review",
            "Good product but tv sound quality simple",
            "TL;DR - Picture is good. Sound is insufficient. Looks ugly and the Operating system is absolutely pathetic. This Old Hag of a television has been discontinue...\nRead full review",
            "Picture quality and sound awesome. Bought this for 23k\nValue for money",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Nice tv picture quality good & sound is to good screen minoring is not available",
            "Picture quality is good but facing some issues with installation for one week. Present condition is okay in future we need to what's the condition or worth f...\nRead full review",
            "Satisfied!!!\n\nSometimes you take your decisions on your instincts rather than advices and you hit bang on. Buying Marq has been a similar experience,there we...\nRead full review",
            "Lots of issues after 1 year",
            "daiwa d26k11 Led tv is a ture led tv and picture & Sound Quality is Awesome value for money . All Over Good Only Wall Mount is Little bit weak.\nI am Satisfie...\nRead full review",
            "daiwa d26k11 Led tv is a ture led tv and picture & Sound Quality is Awesome value for money . All Over Good Only Wall Mount is Little bit weak.\nI am Satisfie...\nRead full review",
            "Probably the first review of this product and my first on Flipkart\nOrdered this on 7th dec and got delivered on 8.th dec morning 10:00!am\nInstallation wor d...\nRead full review",
            "Excellent\n\nIt is a wonderful product I like it so cause, we can headphones to it and such amaze it is\nso thats why im giving this 5 on 5 stars",
            "I am genuinely giving my review on this product after' using it for five months. It's Nice product. Nice colours . Nice sound quality, Nice all smart tv func...\nRead full review",
            "Very good product excellent results",
            "Onkya speaker are osmmm... I am feeling like home theater. And picture quality is very nicee... I hve used google assistant to speak 🗣to find my fav songs,...\nRead full review",
            "The issue is with volume. It is either high or low. There is nothing in between called medium volume. The updates wont also fix anything . But this is minima...\nRead full review",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Its been 3 months of purchase and its working fine and quality is much clear ..in this price range its is like diamond",
            "In this price it is nice product, thank u flipkart 🤝",
            "best of this price... 11400",
            "best of this price... 11400"
        ],
        "likes": [
            "353",
            "224",
            "140",
            "46",
            "48",
            "87",
            "47",
            "23",
            "30",
            "38",
            "353",
            "224",
            "140",
            "46",
            "48",
            "87",
            "47",
            "23",
            "30",
            "38"
        ],
        "dislikes": [
            "137",
            "108",
            "79",
            "17",
            "15",
            "16",
            "11",
            "4",
            "20",
            "11",
            "137",
            "108",
            "79",
            "17",
            "15",
            "16",
            "11",
            "4",
            "20",
            "11"
        ]
    },
    "qna": {
        "questions": [
            "Q:What is the ram and rom configuration?",
            "Q:Is this tv having blutooth support?",
            "Q:Does this TV come with Dolby Vision & Dolby ATMOS?",
            "Q:Does it support mkv video format ?",
            "Q:Does it supports Audio return channel ?",
            "Q:What is the installation fee?",
            "Q:What is the Processor Type?",
            "Q:Which app should i use for remote control of TV?",
            "Q:Does this tv has tune in station app?",
            "Q:What is the colour of the tv frame?",
            "Q:Is sound system provided by DOLBY?",
            "Q:Does it have upscaling technology?",
            "Q:Can we do mirroring with our android phone and play video.?",
            "Q:What's brightness nits in this TV 400 or it's 350???",
            "Q:Does it support google ?",
            "Q:Does this TV has Netflix?",
            "Q:Do we have voice remote with this TV ?",
            "Q:Can we buy that TV on EMI ?",
            "Q:Does it have a built-in stabiler?",
            "Q:Does it has HDMI ARC output available?",
            "Q:Can I run this tv on household inverter?",
            "Q:What items are included in the package, in addition to the TV and remote?",
            "Q:Does this TV has Dolby sound ?",
            "Q:What is the actual watt consumption when tv is on?",
            "Q:Does it have front facing speakers or bottom one?",
            "Q:Does it require a voltage stabilizer?",
            "Q:How to perform a Firmware / Software update on Android TVs ?",
            "Q:Can we ugrade future operating system?",
            "Q:Does it support 2TB external hard drive?",
            "Q:Does it support optical output ?",
            "Q:what is the internal memory of this product ?",
            "Q:How Can I Share My Media File Direct to Tv Wirelessly?",
            "Q:Do we have wall mounting at the same time of delivery ?",
            "Q:How can we set the screen saver on this TV?",
            "Q:Will there be a new Upgrade 10 after Android 9.0 in 43 LED 4K and dont you know about the update to the new version Android 10 ?",
            "Q:64 GB pendrive was supported in this tv",
            "Q:Can we connect this tv to desktop computer (like monitor)?",
            "Q:Is No Cost EMI available on this product ?",
            "Q:Is this made in india?",
            "Q:Can I connect my music system to this TV?",
            "Q:Can I mount it on wall ?",
            "Q:What is the viewing angle of the screen?",
            "Q:is it works with Alexa?",
            "Q:Does this TV require any home theater for enjoying Dolby audio?",
            "Q:Is there a LAN port ?",
            "Q:Can we use HDMI port for sound bar connection?",
            "Q:Can i use it as a screen for power point presentations?",
            "Q:Does it support screen mirroring from Windows 10 laptop?",
            "Q:Does it support Wifi connected cc tv camera?",
            "Q:Does this TV come with Dolby Vision?",
            "Q:What is the resolution of this TV?",
            "Q:Does it have bluetooth remote or infrared remote?",
            "Q:Can i use it as computer monitor?",
            "Q:Is there any screen bleeding issues on this tv?",
            "Q:Does this tv support Rumux quality videos with DTS Surround Sound",
            "Q:Does it have a 6 speaker 102 watt JBL sound system built in it",
            "Q:Does it support google duo?",
            "Q:Voice control remote playback",
            "Q:How to connect usb drive?",
            "Q:Android 10 update",
            "Q:what if we lose or damaged the tv remote? where we will get another one?",
            "Q:Can this TV install third-party apps?",
            "Q:Does it support mobile app download?",
            "Q:Will it work with dish tv setup box ?",
            "Q:Can I Connect this TV with my phone?",
            "Q:Does it have RCA jacks for connecting old set top boxes?",
            "Q:Can we connect to the TV Via hotspot ?",
            "Q:Can we connect Chromecast with any Android phone ?",
            "Q:What is Operating System of this TV?",
            "Q:Do we have google play store or just limited apps?",
            "Q:Does it support wifi ?",
            "Q:What is the size of memory and flash memory?",
            "Q:Can we 64 GB micro sd memory card in this TV ?",
            "Q:Which panel it uses??VA or IPS??Dows it has dual band wifi??",
            "Q:Does it support 2.4Gh and 5 Gh both?",
            "Q:Do we have Built in Alexa in this ?",
            "Q:Can we play offline videos in this TV ?",
            "Q:Can we connect external sound bar with this TV?",
            "Q:Can we use it without WiFi connection ? And can we use set up box to see channels on it ?",
            "Q:Does this TV come with Dolby ATMOS?",
            "Q:Can we connect bluetooth keyboard with this TV for typing?",
            "Q:Can we use it for video calling?",
            "Q:Does it has vga port?",
            "Q:will it support 4k content on Netflix ?",
            "Q:Does it come with Prime Video?",
            "Q:Is it suitable for ps4?",
            "Q:Can i use for sundirect DTH?",
            "Q:Does it support all streaming like amazon prime, hotstar, jio cinema?",
            "Q:Is this tv support 5.1 home theater through Avi ports(red,white, yellow colour) pins from back side ?? My tv not connecting home theater and DTH settop box through avi ports. . Please give . solution",
            "Q:how to play 4k UHD videos downloaded from YouTube and stored in USB device...No player playing these videos and getting error the file format is not supported ...is any solution? pls suggest...",
            "Q:Can i use keyboard and mouse with this TV?",
            "Q:Is there any NET Browser for Internet browsing?",
            "Q:Does it also support Miracast ?",
            "Q:Can I need to buy dongle separately to use AI feature ?",
            "Q:Is this tv has optical out port which supplies dolby digital signal?",
            "Q:Is this TV with android & full HD smart?",
            "Q:Do we need to pre-order the stand and material to wall mount ?",
            "Q:What should I do if TV is not detecting my USB?",
            "Q:Is this smart tv or android ?",
            "Q:Does it has play store or not?",
            "Q:Is this tv available with voice command?",
            "Q:What is the material of the back cover of this TV?",
            "Q:How does this TV set the picture mode?",
            "Q:What is the type of display used in this product?",
            "Q:Can i connect 64 GB memory card and play videos?",
            "Q:Can I connect Bluetooth headset?",
            "Q:Is this TV having Full array LED backlight",
            "Q:Can we play ps games in this tv",
            "Q:May USB play",
            "Q:Warranty period for LED",
            "Q:Hi, When I connect the tv with any Bluetooth device the sound distort a lot, is this issue with everyone?",
            "Q:Jio tv is play store in hisence tv",
            "Q:Does it decodes dolby atmos to soundbar through optical ouput.",
            "Q:can I connect Bluetooth keyboard & mouse with this TV?",
            "Q:Support Bluetooth version",
            "Q:Will it work in single band wifi ?",
            "Q:I need to connect my external speakers using AV out how to connect? If I connect out Via headphones Jack will the audio be still coming through TV?",
            "Q:Bluetooth not detecting other device except remote what to do",
            "Q:How Can we connect to computer CPU to TV",
            "Q:Can we connect home theatre via HDMI cable",
            "Q:Has it full motion tv mount",
            "Q:Is the wall the mount comes with tv is capable enough to hang the tv safely or we should purchase another.",
            "Q:Give you free wall mount",
            "Q:Do any OTT applications switch off on its own while in use and also is there any backlight bleeding issue?",
            "Q:Can I install play it app",
            "Q:Comparatively which one is better picture quality hisense or vu",
            "Q:Does this TV have far field mics?",
            "Q:Does this TV support 4K@60fps with HDR through HDMI port??",
            "Q:Is it provide HDMI ARC",
            "Q:Did It will get update to android 10 os right now ?",
            "Q:Is wall mount draggable to front and back and sideways?",
            "Q:NFC is there?",
            "Q:How is the picture quality while watching SD channel from Set top boxes. My main purpose is mostly watching cable tv news channels which are mostly SD so is it good to buy 43 inch 4K tv this model?",
            "Q:This TV suitable sound bar ?",
            "Q:Is Digital audio out support 5.1 music system?",
            "Q:Which better tv soney x 80 j or hisense",
            "Q:Is this tv having samsung pannel",
            "Q:This is google chrome app available or not",
            "Q:How to use internal storage",
            "Q:What is the distance between the two feet on a 50 inch model?",
            "Q:Does wall mount can be placed in wall corner? Is it possible to rotate left right?",
            "Q:IS THIS TV A CURVE TV?",
            "Q:Will this tv gives dolby Atmos output to a Dolby Atmos sound bar through its arc port",
            "Q:Does black patch clean in led screen",
            "Q:4k 43\" uhd Thomson & hisense which TV best & why?",
            "Q:Vu or hisence?",
            "Q:Does it support thoptv or oreo tv",
            "Q:Can we connect this TV to soundbar through Bluetooth?",
            "Q:WhatsApp options available",
            "Q:CCTV camera options available??? WiFi camera connection options???",
            "Q:Does this support PS4 pro",
            "Q:Can I share my Mobile screen with tv?",
            "Q:Please confirm the panel type VA OR IPS?",
            "Q:Have built in bluetooth?",
            "Q:What's the FPS for this TV",
            "Q:Manufacturing year of this product?",
            "Q:Will it support zee5?",
            "Q:In which percentage GST in this products",
            "Q:What is the manufacturing year of this tv...is it 2020 or 2021?",
            "Q:3.5 mm audio jack available??, can i connect to home theatre through that jack",
            "Q:I do have a v guard voltage stabilizer which supports for 55 inch TV can I connect to it though tv has built in smps stabilizer??",
            "Q:Does it supports HDR?",
            "Q:Need extra speakers for Dolby Atmos experience ?",
            "Q:Does it support oreo tv",
            "Q:3d tv or not",
            "Q:what is mean by open box delivery?",
            "Q:Does screen bleeding/brightness at corner issue still persists??",
            "Q:which type wifi available",
            "Q:I am unable to turn on tv with remote. I always have to use the power button under the TV. Is this expected ?",
            "Q:Is there any app go remote control this TV",
            "Q:How to play pendrive, can't see any option in Input. Every time I restart Tv to run pendrive.",
            "Q:Is this TV comes with two way bluetooth? Which i can connect Bluetooth keyboard and mouse.",
            "Q:Support sunnxt app",
            "Q:What is the model name A7 or A4?",
            "Q:This tv support thirt party app like jiotv thoptv livenettv",
            "Q:What is the difference between this model and tornado model?",
            "Q:Does it support screen mirroring from mobile to tv",
            "Q:Watch 3D movie this tv?",
            "Q:Can we use game pad?",
            "Q:Oneplus mobile remote app possible this tv mobile remote app possible?"
        ],
        "answers": [
            "A:2GB RAM, 16 GB Memory",
            "A:Yes the TV comes Bluetooth 5.0, we can connect multiple devices",
            "A:Yes. This TV comes with both Dolby Vision and Dolby ATMOS technologies, the latest and most advanced picture and sound techonologies",
            "A:Yes",
            "A:Yes, the TV comes with ARC in HDMI1",
            "A:Installation is free of cost and comes with free inpacking wall bracket as well",
            "A:Quad Core Cortex-A53*4 64bit, Mali470MP",
            "A:Android TV Remote",
            "A:Yes. App is available in google play store",
            "A:Black",
            "A:Yes. It is equipped with Dolby ATMOS",
            "A:Yes",
            "A:Yes",
            "A:400nits",
            "A:Yes. The TV comes with Android OS",
            "A:Yes, it comes with built-in netflix app",
            "A:YES",
            "A:Yes. EMI options are available for buying",
            "A:The TV operates on SMPS supply and doesn�t need an external stabiler",
            "A:Yes, the TV comes with ARC in HDMI1",
            "A:Yes It can run provided the inverter supports load of TV",
            "A:Wall Mount Bracket, remote batteries and printing materials like manual and warranty card.",
            "A:Yes. It is equipped with Dolby ATMOS",
            "A:Power consumption varies by screen size and content which is running on TV. This TVs power cosumption is approx 100W",
            "A:Bottom firing speakers",
            "A:No",
            "A:The TV can be updated over internet by accessing update section in TV settings",
            "A:The TV supports OTA (over the air) software updates",
            "A:YES",
            "A:Yes",
            "A:16GB",
            "A:You may try file sharing apps available in Google play store",
            "A:The Wall mouting bracket comes inpacking with TV",
            "A:Yes",
            "A:Not showing update",
            "A:Yes",
            "A:You can connect via HDMI port if the desktop has HDMI out.",
            "A:EMI options vary from time to time. Please check offer section for details",
            "A:Yes",
            "A:Yes. There are multiple audio out options available. You can take audio out in form of Digital (Optical) audio out, Analog (Headphone) and Bluetooth audio out as well.",
            "A:Yes. Free wall mount bracket comes inpacking with TV as well",
            "A:178�",
            "A:yes ofcourse",
            "A:NO. The TV has built-in Dolby Audio decoder.",
            "A:YES",
            "A:Yes, the TV comes with ARC in HDMI1",
            "A:yes?by connecting with HDMI",
            "A:Yes",
            "A:It depends on CCTV camera. If the app for this is available in Google Play store, it will work.",
            "A:Yes, the TV is equipped with Dolby Vision.",
            "A:4K Resolution",
            "A:It has bluetooth remote",
            "A:Yes ,you can connect with HDMI",
            "A:No",
            "A:yes...sound does work great...felt of surroung of theatre",
            "A:No",
            "A:yes it's support but for video calling you need a web cam and install in the tv.",
            "A:Yes, Voice Command works fine, make sure the remote battery are in good condition.",
            "A:Just put usb drive in the specific usb port",
            "A:Not yet updated to Android 10. Running on Android 9 right now.",
            "A:Flipkart",
            "A:Apps can be downloaded via Google Play store",
            "A:Apps can be downloaded via Google Play store",
            "A:Yes",
            "A:Yes, via screen sharing app you can do so",
            "A:Yes",
            "A:Yes , you can connect TV via hotspot",
            "A:Yes, The TV comes with chromecast built-in.",
            "A:Official Android TV 9.0 Pie",
            "A:It has official google play store",
            "A:YES",
            "A:2GB RAM, 16 GB Memory",
            "A:There is no memory card slot. However you can use a SD card to USB converter to plug it in USB slot & play your content",
            "A:It has VA panel. Viewing angles are not good. It does have dual band Wifi.",
            "A:2.4Gh and 5Gh",
            "A:It has got built-in google assistant",
            "A:Via USB you can",
            "A:Yes. There are multiple audio out options available. You can take audio out in form of Digital (Optical) audio out, Analog (Headphone) and Bluetooth audio out as well.",
            "A:Yes, you can use ethernet LAN cable. Set top box can be connected via HDMI or AV In",
            "A:Yes, the TV is equipped with Dolby ATMOS.",
            "A:Yes the TV comes comes Bluetooth 5.0, you can connect bluetooth keyboard & mouse for typing and cursor",
            "A:There is no built-in camera in TV for video calling. However you can try apps in google play store which use phone camera for video call",
            "A:VGA is not there. However you can connect PC via HDMI",
            "A:Yes",
            "A:yes",
            "A:YES,both PS4 and X-box support is there",
            "A:Yes",
            "A:Yes. Apart from this, many other streaming apps available in google play store",
            "A:yes",
            "A:Kindly check the video format you are trying to play that was downloaded from YouTube.",
            "A:Yes",
            "A:Yes, Browser can be downloaded from Google Play store",
            "A:YES, Only for Android Phone. For Iphone need download third-party APP",
            "A:The TV just needs active internet via WiFi or LAN Cable for AI functionality. No need for dongle.",
            "A:Yes",
            "A:It is Android and 4K resolution TV",
            "A:stands and wall mount is included",
            "A:Check if USB is faulty by connecting with a PC. Else try formating the USB drive and then check again with TV",
            "A:This is Smart TV with Android OS",
            "A:Yes. It has Google Play store",
            "A:Yes. The TV comes with builtin google assistant",
            "A:back cover is Plastic and back plate is metal",
            "A:you can set picture mode in setting menu or press the key �P. Mode\" on the remote",
            "A:It uses an A+ grade LED panel",
            "A:There is no memory card slot. However you can use a SD card to USB converter to plug it in USB slot & play your content",
            "A:Yes, the TV supports bluetooth audio out. You can connect bluetooth headphone, home theater and soundbars wirelessly.",
            "A:Yes",
            "A:You can connect your PlayStation to the TV.",
            "A:definately in my tv usb plays smoothly",
            "A:1 year",
            "A:nope",
            "A:No",
            "A:Yes it does.",
            "A:Yes ..you can use..you need to insert the usb bluetooth dongle that comes with the keyboard and mouse in to the TV's usb port.",
            "A:Yes",
            "A:Yes .. it will work with single band wifi 2.4 ghz alone (or) 5 ghz alone.",
            "A:Use Bluetooth options if having, else use av male female convertor and aceess the same. else use av to aux converter in speaker and connect a aux cable through headphones jack",
            "A:You can use teathering hot spot it works better.",
            "A:For this you have to contact to Hisense technical support team.",
            "A:no",
            "A:Nop, it has a fixed tv mount : You can't move your tv when it is fixed with this mount.",
            "A:its very very stronge, no need to purchase another",
            "A:yes",
            "A:no problem",
            "A:no",
            "A:its same in my opinion.",
            "A:No",
            "A:No",
            "A:Yes, 2 HDMI and 1 HDMI ARC",
            "A:no",
            "A:No, not the one that comes with the TV (free) it’s the stationary one. Of Ouse you can buy one separately of your choice with this feature.",
            "A:no",
            "A:picture quality was good while watching SD channel",
            "A:Yes to get better sound experience , surely we should connect Dolby Atmos sound bar..",
            "A:Yes",
            "A:hisense.",
            "A:no",
            "A:yes",
            "A:normal.use",
            "A:1feet",
            "A:No",
            "A:NO",
            "A:yes it does",
            "A:No I am facing the same problem.",
            "A:both are similar. always buy a brand which gives you best service after sales. aways prefer that brand which service center is near to you.",
            "A:Go for Hisense. I purchased Thomson tv then it got some issue and I had to replace that tv twice. After replacing I switched to Hisense and it’s working fine for me and it’s been 6 months now.",
            "A:it's supprts Oreo tv",
            "A:you can connect but the sound comes out irritating you",
            "A:No",
            "A:I believe you can connect with wifi",
            "A:It has hdmi port you can connect and play. It has super dynamic view for games",
            "A:yes u can, with any casting app.",
            "A:VA",
            "A:yes, Very good",
            "A:60 hz",
            "A:2020",
            "A:yes",
            "A:14%",
            "A:2020",
            "A:Yes, however you may not get 5.1 surround",
            "A:Yes",
            "A:Best TV with Superb Color. it's a VA Panel and viewing angle is not that great like IPS panel But if you viewing from straight and not > 30 Angle, its a Best TV. 4 Star for viewing angle else 5 Star.",
            "A:voice of the led hisense is good but if u need to real dolby atmos u need to extra speaker",
            "A:yes",
            "A:Not 3D",
            "A:They open tv box while delivery. They show you tv screen remote etc. if screen have any scratches or broken in transport you can decline receiving product",
            "A:no. it is okay",
            "A:both 2.4 and 5",
            "A:It's happens when the battery is low, change the the battery and it will work",
            "A:no it is so nice and wonder",
            "A:It's not in input...it's in app....select media there you will see your pendrive",
            "A:No",
            "A:All TV - support",
            "A:A7",
            "A:no",
            "A:The major difference would be the JBL 102W speaker in Tornado.",
            "A:Yes",
            "A:No",
            "A:yes",
            "A:No"
        ],
        "likes": [
            "161",
            "35",
            "198",
            "34",
            "13",
            "93",
            "19",
            "22",
            "20",
            "12",
            "21",
            "15",
            "12",
            "16",
            "10",
            "9",
            "15",
            "13",
            "19",
            "7",
            "9",
            "10",
            "12",
            "28",
            "7",
            "4",
            "4",
            "6",
            "5",
            "6",
            "5",
            "5",
            "10",
            "6",
            "2",
            "3",
            "3",
            "3",
            "18",
            "20",
            "6",
            "7",
            "3",
            "5",
            "3",
            "4",
            "5",
            "5",
            "4",
            "6",
            "4",
            "4",
            "3",
            "1",
            "1",
            "1",
            "2",
            "1",
            "2",
            "2",
            "1",
            "1",
            "2",
            "4",
            "3",
            "2",
            "1",
            "3",
            "2",
            "1",
            "1",
            "3",
            "17",
            "3",
            "4",
            "4",
            "6",
            "3",
            "5",
            "4",
            "6",
            "8",
            "3",
            "5",
            "2",
            "2",
            "2",
            "3",
            "2",
            "1",
            "1",
            "1",
            "2",
            "1",
            "2",
            "1",
            "1",
            "2",
            "1",
            "1",
            "2",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "38",
            "7",
            "80",
            "7",
            "2",
            "38",
            "3",
            "5",
            "6",
            "2",
            "9",
            "6",
            "4",
            "5",
            "3",
            "2",
            "5",
            "4",
            "8",
            "1",
            "3",
            "3",
            "8",
            "24",
            "3",
            "2",
            "2",
            "1",
            "3",
            "3",
            "2",
            "2",
            "3",
            "3",
            "0",
            "0",
            "1",
            "0",
            "19",
            "21",
            "4",
            "3",
            "1",
            "1",
            "1",
            "1",
            "2",
            "2",
            "3",
            "7",
            "2",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "31",
            "4",
            "5",
            "3",
            "3",
            "3",
            "3",
            "3",
            "13",
            "20",
            "2",
            "3",
            "2",
            "2",
            "3",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    }
}