{
    "title": "LG LJ523D 80 cm (32 inch) HD Ready LED TV  (32LJ523D)",
    "product_specification": {
        "In The Box": "TV Unit\nRemote",
        "Model Name": "32LJ523D",
        "Color": "Silver",
        "Display Size": "80 cm (32 inch)",
        "Screen Type": "LED",
        "HD Technology & Resolution": "HD Ready, 1366 x 768",
        "Series": "LJ523D",
        "Smart Tv": "No",
        "Motion Sensor": "No",
        "HDMI": "2 Rear",
        "USB": "1 Rear",
        "Built In Wi-Fi": "No",
        "Launch Year": "2017",
        "Picture Engine": "Color Master Engine",
        "Analog TV Reception": "Yes",
        "View Angle": "Wide degree",
        "Panel Type": "IPS",
        "LED Display Type": "Slim LED",
        "Aspect Ratio": "5 Modes: 16:9, Original, 4:3, Vertical Zoom, All Direction Zoom",
        "Refresh Rate": "60 Hz",
        "Other Video Features": "Dynamic Color Enhancer\nPMI 300: Clarity, Color, Contrast\nActive Noise Reduction\nPicture Mode: 8 Modes (Vivid, Standard, APS, Cinema, Cricket, Game, Expert1, Expert2)\nPicture: JPEG",
        "Number of Speakers": "2",
        "Sound Technology": "Dolby Digital, DTS Codec Support",
        "Surround Sound": "Virtual Surround Sound",
        "Speaker Output RMS": "20 W",
        "Sound Mode": "Standard, Cinema, Clear Voice, Cricket, Bollywood, Game",
        "Supported Audio Formats": "Audio Codec: AC3(Dolby Digital), EAC3, HE-AAC, AAC, MP2, MP3, PCM, DTS, WMA",
        "Other Audio Features": "Sound Optimizer: 3 Modes (Stand Type I, Stand Type II, Wall-mounted Type)\nClear Voice II\nPowerful Sound",
        "Supported App - Netflix": "No",
        "Supported App - Youtube": "No",
        "Supported App - Disney+Hotstar": "No",
        "Operating System": "Linux",
        "3G Dongle Plug and Play": "No",
        "Component In (RGB Cable)": "Component In (Y, Pb, Pr Plus Audio): 1 (Composite/Component Common)",
        "RF Connectivity Input": "1 Rear",
        "Other Connectivity Features": "Audio Out\nHeadphone Out: 1\nDivx (SD/HD): DivX HD",
        "Touch Remote": "No",
        "RF Capable": "Yes",
        "Power Requirement": "AC 100 - 240 V, 50/60 Hz",
        "Power Consumption": "35 W, 0.3 W (Standby)",
        "Other Power Features": "Smart Energy Saving",
        "Other Convenience Features": "Conventional Panel, IPS Side View, Subtitle for DivX (Language): 20 Language (Arabic, Cantonese, English, French, German, Hebrew, Hindi, Italian, Japanese, Korean, Mandarin, Maori, Persian, Russian, Spanish, Vietnamese, Chinese, Malay, Thai, Tamil), IPS Front View, OSD Language: Total 15, Indian: 3 (Hindi, Bengali, Telugu)",
        "Width x Height x Depth (without stand)": "734 mm x 438 mm x 71 mm",
        "Weight (without stand)": "4.5 kg",
        "Width x Height x Depth (with stand)": "734 mm x 474 mm x 172 mm",
        "Weight (with stand)": "4.7 kg",
        "Stand Features": "Flexi Mount: Adjust TV Viewing Angle",
        "Other Dimensions": "Min Depth (Without Stand): 66mm, Set Weight (In Carton): 6.2 Kg",
        "Warranty Summary": "1 Year LG India Comprehensive Warranty and additional 1 year Warranty is applicable on panel/module",
        "Covered in Warranty": "Defect arising out of Faulty or defective material or workmanship\nThe Warranty Extension will be done basis the date of purchase & Offer Validity\nExtended 1 Year Warranty offer is valid till 30th June 2018\nWarranty of the Product is Limited to Manufacturing Defects Only\nApplicable on purchase of all size 80cm (32) and above TV models only",
        "Not Covered in Warranty": "Warranty Does Not Cover Any External Accessories (Such as Battery, Cable, Carrying Bag), Damage Caused to the Product Due to Improper Installation by Customer, Normal Wear and Tear to Magnetic Heads, Audio, Video, Laser Pick-ups and TV Picture Tubes, Panel, Damages Caused to the Product by Accident, Lightening, Ingress of Water, Fire, Dropping or Excessive Shock, Any Damage Caused Due to Tampering of the Product by an Unauthorized Agent, Liability for Loss of Data, Recorded Images or Business Opportunity Loss.",
        "Warranty Service Type": "On-site Service, Customer needs to call the Customer Care Number, service engineer will come to the site to get the product repair",
        "Installation & Demo Details": "1. Covered Under Standard Installation - Table Mounting Using Standard Stand Supplied as Accessory with TV - Extra Charges are Applicable for Wall Mounts as, Rs. 399 for 32 inch Display Size and Rs. 499 for >32 inch Display Size - Connecting with Available Power Source (within 1 Meter) - Connecting / Setting Up Various Available Input Source for Audio Video Based on Model - Connecting with Available WiFi (for Smart TV) - Checking TV for Proper Functioning - Demonstration of the TV and its Features"
    },
    "product_description": {
        "Great Picture Quality": "You are sure to fall in love with this TV's superior IPS panel, which ensures great colour reproduction and viewing angles. Also, you get a Color Master Engine that not only enhances the colour of the content, but also adjusts the colour saturation, hue and luminance. So you see content the way it was meant to be seen.",
        "Game On": "Whether you have a kid in the house or you yourself are a kid at heart, this feature is sure to win you over. This TV comes with a bunch of games already built into the system. So you don't have to go through the hassle of buying a console and plugging it in.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "4",
            "1",
            "5",
            "5",
            "5",
            "1",
            "1",
            "1",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "1",
            "5",
            "4",
            "1",
            "5",
            "3",
            "1",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "1",
            "2",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "3",
            "5",
            "3",
            "4",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "2",
            "3",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "3",
            "4",
            "5",
            "5",
            "3",
            "4",
            "3",
            "4",
            "4",
            "5",
            "4",
            "3",
            "4",
            "3",
            "5",
            "5",
            "4",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "3",
            "2",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "2",
            "4",
            "5",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "2",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "3",
            "4",
            "4",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "1",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "2",
            "3",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "4",
            "1",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "3",
            "1",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "4",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "3",
            "5",
            "1",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "2",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "4",
            "1",
            "2",
            "4",
            "1",
            "3",
            "1",
            "5",
            "5",
            "1",
            "5",
            "5",
            "1",
            "1",
            "5",
            "4",
            "3",
            "4",
            "4",
            "1",
            "2",
            "2",
            "4",
            "4",
            "3",
            "5"
        ],
        "review": [
            "Wonderful TV, same day installation, clear and powerful sound. I am using hd set top box..... And can not differentiate that it is HD ready TV.... It's performance is like FHD TV.",
            "First of all i would like to appreciate Flipkart for their delivery service with their partner Gati Courier Services.\nOnly Flipkart is able to deliver large appliances products to several areas here in Uttar Pradesh. Full marks on this.\nProduct delivered early than promised date and with absolute care.\nComing to TV it's excellent , LG has made name for their panels. You can get same type of TV from VU and Micromax at lower price but than again when it comes to reliability and brand value i would stuck with LG, Samsung and won't mind paying extra premium.\nIt's the new 2017 model having 2 HDMI ,1 USB ports and all are easily accessible. Satisfied with the panel as it served my purpose.\nInstallation was done by Jeeves provided free by Flipkart. Installation was done in quick time and engineers were very polite.\nGood job Flipkart and OmniTechRetail 👍",
            "Excellent led tv provided by flip cart with best price of 15499/- unbeatable.\nTv is very good in this price with great picture quality. I say only one word overall\"amazing\"",
            "Purchased the product looking after review in Flip kart. Guys please do not show interest better to buy at LG or other Stores.\nCustomers will leave hope on Flip kart if delivers a product like this and has to concentrate more of product quality not on delivery time.\n\nCompared the same LG product (different model with same features which i brought in store) lot's of difference in product quality\n\n2 Star for Screen Display,Noticed the white Lines and black lines\n1 Star for Product Quality.\n0 Star for Sound System.U feel as if you hearing the running FM Radio in Traffic.\n5 Star for Flip-kart Delivery in time and Installation by LG executive.\n\nPlease do not show intrest in buying this product.",
            "Excellemt choice for somone looking to buys just a standard Led TV and not smart TV. Media player plays virtually any file format you throw at it via USB.\n\nSound quality is very good with deep bass and balanced highs. Picture quality is very sharp. Excellent job done by ekart logistics and jeeves to get TV delivered and installed withing 24hrs of ordering.\n\nOverall 5 star.",
            "I purchased a new LG TV. Product is very Nice. Delivery also Super fast, Flipkart working Very Nice and Installation work also Good\n\nI m Satisfied..\n\nThank u Flipkart..\nThank you Jeeves consumer service private limited for Fast installing.",
            "the 5* rating is for flipkart. tv delivered in two days as promised, installation done on same day, a day before the assured date. Well done flipkart!!!\n\nNow regarding the tv, i just had a day of watching...so this review is based on that.\n\npros:\n1. Picture quality is good only for HD channels, SD channels not so good. when i played HD videos thru USB (1TB hard disc) it played smoothly, no lag, awesome clarity. The colors are as good as what you see in naked eye. Even the videos of my 5mp cellphone camera look better than what it looks in my phone or PC.\n2. Sound is good, not great but you wont complain. i played some mp3 songs and the sound is really superb.\n3. The wall mount provided by flipkart (free) is adjustable, so no problem in accessing the ports which are all in the back of the tv.\n4. This is a 2017 model, so better to buy this rather than old 2015 models of samsung (in the same price range around 20k) where the sound is also not good.\n5. the Jeeves installation partner also provides 1 (tv) + 2 years of extended warranty at 1900 that is optional.\n\ncons:\nThis tv has FM radio, but the signal is really really poor in a metro like chennai , so definitely it wont be good for non-metros. One of the reasons i preferred this tv was the FM radio but i m disappointed.\n\nSo far so good, will review it again maybe after a couple of months.",
            "One of the best 32 inch LED TV.Good video and audio (IPS Panel & 20W Dolby sound and many more) for 19990 only,this is very good deal.I brought from the seller Omni tech Retail.Installation was done by Jeeves.Item is deliverd as per the schedule and delivery person opened the sealed box in front of me and checked for any damages and showed me all accessoires.but installation is delayed one day.\nInstallation guy is very professional.They(Jeeves) provide good quality free wall mount stand.Friends if you want to buy 32 inch LED TV buy this without any hesitation and try to buy from the seller Omni tech Retail.",
            "Pretty good product by LG at this price, packing was alright, reached me in two days. Display looks crisp and bright, sound is good enough.\nI think seller is genuine, so the real concern here is Flipkart, I was promised a demo and installation the next day which is today and It's been delayed after I made the payment. It's per Flipkarts convenience and not mine. It's not professionalism. 3 stars.",
            "Awesome TV\nBought @15.3k\nPicture quality awesome 5/5\nSound quality good 4/5\nLG inbuilt games 2/5\nRemote Quality as regular 3.5/5\nPower saving 5/5\nLG Logo 3/5 it can be of splendor quality\nFlipkart 5/5",
            "Wonderful TV, same day installation, clear and powerful sound. I am using hd set top box..... And can not differentiate that it is HD ready TV.... It's performance is like FHD TV.",
            "First of all i would like to appreciate Flipkart for their delivery service with their partner Gati Courier Services.\nOnly Flipkart is able to deliver large appliances products to several areas here in Uttar Pradesh. Full marks on this.\nProduct delivered early than promised date and with absolute care.\nComing to TV it's excellent , LG has made name for their panels. You can get same type of TV from VU and Micromax at lower price but than again when it comes to reliability and brand value i would stuck with LG, Samsung and won't mind paying extra premium.\nIt's the new 2017 model having 2 HDMI ,1 USB ports and all are easily accessible. Satisfied with the panel as it served my purpose.\nInstallation was done by Jeeves provided free by Flipkart. Installation was done in quick time and engineers were very polite.\nGood job Flipkart and OmniTechRetail 👍",
            "Excellent led tv provided by flip cart with best price of 15499/- unbeatable.\nTv is very good in this price with great picture quality. I say only one word overall\"amazing\"",
            "Purchased the product looking after review in Flip kart. Guys please do not show interest better to buy at LG or other Stores.\nCustomers will leave hope on Flip kart if delivers a product like this and has to concentrate more of product quality not on delivery time.\n\nCompared the same LG product (different model with same features which i brought in store) lot's of difference in product quality\n\n2 Star for Screen Display,Noticed the white Lines and black lines\n1 Star for Product Quality.\n0 Star for Sound System.U feel as if you hearing the running FM Radio in Traffic.\n5 Star for Flip-kart Delivery in time and Installation by LG executive.\n\nPlease do not show intrest in buying this product.",
            "Excellemt choice for somone looking to buys just a standard Led TV and not smart TV. Media player plays virtually any file format you throw at it via USB.\n\nSound quality is very good with deep bass and balanced highs. Picture quality is very sharp. Excellent job done by ekart logistics and jeeves to get TV delivered and installed withing 24hrs of ordering.\n\nOverall 5 star.",
            "I purchased a new LG TV. Product is very Nice. Delivery also Super fast, Flipkart working Very Nice and Installation work also Good\n\nI m Satisfied..\n\nThank u Flipkart..\nThank you Jeeves consumer service private limited for Fast installing.",
            "the 5* rating is for flipkart. tv delivered in two days as promised, installation done on same day, a day before the assured date. Well done flipkart!!!\n\nNow regarding the tv, i just had a day of watching...so this review is based on that.\n\npros:\n1. Picture quality is good only for HD channels, SD channels not so good. when i played HD videos thru USB (1TB hard disc) it played smoothly, no lag, awesome clarity. The colors are as good as what you see in naked eye. Even the videos of my 5mp cellphone camera look better than what it looks in my phone or PC.\n2. Sound is good, not great but you wont complain. i played some mp3 songs and the sound is really superb.\n3. The wall mount provided by flipkart (free) is adjustable, so no problem in accessing the ports which are all in the back of the tv.\n4. This is a 2017 model, so better to buy this rather than old 2015 models of samsung (in the same price range around 20k) where the sound is also not good.\n5. the Jeeves installation partner also provides 1 (tv) + 2 years of extended warranty at 1900 that is optional.\n\ncons:\nThis tv has FM radio, but the signal is really really poor in a metro like chennai , so definitely it wont be good for non-metros. One of the reasons i preferred this tv was the FM radio but i m disappointed.\n\nSo far so good, will review it again maybe after a couple of months.",
            "One of the best 32 inch LED TV.Good video and audio (IPS Panel & 20W Dolby sound and many more) for 19990 only,this is very good deal.I brought from the seller Omni tech Retail.Installation was done by Jeeves.Item is deliverd as per the schedule and delivery person opened the sealed box in front of me and checked for any damages and showed me all accessoires.but installation is delayed one day.\nInstallation guy is very professional.They(Jeeves) provide good quality free wall mount stand.Friends if you want to buy 32 inch LED TV buy this without any hesitation and try to buy from the seller Omni tech Retail.",
            "Pretty good product by LG at this price, packing was alright, reached me in two days. Display looks crisp and bright, sound is good enough.\nI think seller is genuine, so the real concern here is Flipkart, I was promised a demo and installation the next day which is today and It's been delayed after I made the payment. It's per Flipkarts convenience and not mine. It's not professionalism. 3 stars.",
            "Awesome TV\nBought @15.3k\nPicture quality awesome 5/5\nSound quality good 4/5\nLG inbuilt games 2/5\nRemote Quality as regular 3.5/5\nPower saving 5/5\nLG Logo 3/5 it can be of splendor quality\nFlipkart 5/5",
            "LG brand trustworthy.\nBest TV under the budget segment. Pictures look stunning and sound is matching to expectations. It can play mkv, mp4. Videos through USB. Playing Full HD videos shows its capabilities.\nFM radio will play fine if you put antenna at right places.\nNote:\n1. For best sound quality , you should have good sound system.\n2. Airtel TV, TATA sky or Dish TV are recommended companion . Local cable connection doesn't match your expectations",
            "Picture clarity is awasome.. Got it for 14.4 K..Sound quality also superb but bass is bit low... It plays almost every format through Harddisk..Over all fantastic deal.. Go for it.. Lve u LG",
            "Decent TV. Above average perfirmance, Worth the pricing @ 175499. If you are looking for plain valina TV, without any so called 'smart' features, Go for it.\nExcellent support from seller QRS and flipcart.",
            "Flipkart commited for two days but delivered and installation completed in one day. LG with this much starting price Rs.18999 is a great deal. Product clarity sound excellent at this budget. It comes with wall mount free. Installation free .Recommended with 5 star.",
            "LG is very good product using from more than one month it's a very good product picture clarity is also very nice with IPS panel and loud sound quality with surround system. the speaker is given in this tv is very good performing. highly recommended to go this product...\n\nThe delivery is also very fast by flip-cart got this product before given on schedule date. and the same day got installation with jeevs service provider. here i can say Thanks to all, and slightly got despondent with TV border colour is silver type and not accepted as slim if the colour is black and slim then the product looks will be very good. Once again Thanks flipcart.\n\nThanks and Regards,\n\nPrabhakar Desai",
            "Great choice which offers great performance at this price range. I bought it at 18799. No extra charges. Service engineer from LG has done the free installation next day. He provided wall mount (no additional cost).\nI prefer buying known and reputed brand to avoid hassles in future, So LG is my first preference in TV. Here's I rated this TV:\nSound: 10/10\nPicture: 9/10\nConnectivity: 8/10\nEasy of use: 8/10\nBuild quality: 9/10\nLook and feel: 10/10\nThough it is not a smart TV, we can connect Chromecast or Fire stick and make it completely smart :)\nI am Happy Customer!!",
            "Excellent product.! Worth buying. Prompt delivery from Flipkart (packing could have been even better). Do not hesitate to buy this product and amazing prizing from Flipkart, thanks for that... Ultimately, a must buy product in HD ready TV segment.",
            "This product is not full HD TV but they looks likes HD TV. Sound quality is very good, picture quality is good, screen size is 32\" and other body and parts is very good . There are no other connectivity sources like wifi, bluetooth, internet, and other feature. It has only usb port, hdmi port, FM . This is a simple HD TV. You can buy this item",
            "Good product. But i face 2 problems\n1 demo person do not format of usb drive.\n2. This led has divx format so youtube video firstly downloaded then convert in divx format' very time consuming .\nFLIPKART support is good. Pl strong your technical team of lg service",
            "First of all I thank to flipkart for giving offer during big billion day.. I brought this product for 15.5k..Y I rated as 4 is reason is due to late delivery.. I got this product after 14days of booking date.. Rest of the things are Good. Valuable for Money..",
            "Good picture quality..,Excellent LG customer support for installation and demo. Checked with LG care about online warranty support after I had been placed the order. Sound awesome and clear output..Really worth for money (Bought on offer 18K)",
            "product worth the price. good picture quality. sound clarity is also good. only thing I see as a con is that the input parts are behind the television which makes it difficult when we fix it on the wall or we must use a moving stand on the wall which they didn't have.",
            "Good product. Good and fast service . Very competitive price. Fantastic experience. Always recommend",
            "The delivery speed of the TV from Flipkart was amazing. Order was placed the previous night and delivery happened the next day morning.\n\nBut what’s the use of this super fast delivery if the installation date is 2 days or so later and no visibility of the progress?\n\nInstallation of a TV is no big deal especially if there is no wall mounting involved. However I was told that the warranty is void if I do it myself.\n\nIt’s 2 days since delivery. But till today, I have not received any information when the installation will happen. My time for the last 2 days and until installation is hijacked as I have to wait at home for the installation. This is not good.",
            "value for money i have purchased TV 2 months before and still date no any issue.\nafter TV purchased within 2 days I got delivery and very good support from flipkart for installation.\nbelieve flipkart is very good as compared Amazon.",
            "Outstanding delivery. Thank you flipkart. Product is also good. Terrific colour. Model look is very nice. Sound was extra ordinary. 20w speaker output so fabulous sound experience in led TV",
            "tv looks are great . But best recommended to view only with dish TV . do not view with ordinary cable service provider. USB movies looks awesome. sound is cinema mode is excellent.Tv looks classy .",
            "Good product working good happy with the purchase. Recommended for others..",
            "Excellent picture quality... good sound and looks.. value for money product from A trusted brand like LG...fast delivery by flipkart next dat installation... overall good experience..",
            "Now regarding the tv, i just had a day of watching...so this review is based on that.\n\npros:\n1. Picture quality is good only for HD channels, SD channels not so good. when i played HD videos thru USB (1TB hard disc) it played smoothly, no lag, awesome clarity. The colors are as good as what you see in naked eye. Even the videos of my 5mp cellphone camera look better than what it looks in my phone or PC.\n2. Sound is good, not great but you wont complain. i played some mp3 songs and the sound i...\nREAD MORE",
            "GREAT PICTURE QUALITY & SOUND EXCELLENT PERFORMANCE ON TIMELY DELIVERY AND INSTALATION BY FLIPKART.I AM HAPPY FROM FLIPKART.👍👍👍👍",
            "Thanks to flipcart the TV is very excellent and the service team of lg visit my house for installation. Their work is very speedy and elegant.thanks to them also",
            "TV is fine. Nice IPS display and good sound. LG is known for those good quality attributes. I was bit disappointed with the packaging alone. Two and half years before when I purchased a Samsung LED TV for the first time through online, there was a second layer of packing by the seller over the packing provided by the manufacturer. Nowadays we are not seeing that extra packing layer for LED TVs. This made me quite sceptical about the safety of the product when delivered with the packing done b...\nREAD MORE",
            "This TV is a great pleasure when you think about normal pic quality and sound system. However, refresh rate looks to be quite slow sometimes which makes the TV comparable to brands like Sanyo, VU. LG should have worked for smooth transition of pictures.",
            "The is nice product...sound and picture quality are good not bad...worth for money in this category...be clear that when people come for demo , pls get the wall mount stand at free cost...",
            "I got it for 16000 while in new pinch sale. I like LG brand tv bec of quality and price. Always go for brand. It worth in future.\nTv's worth at sale time, add in you kart and purchase while sale time. Don't go for 24inch bec its too small. A tv should be minimum 32inch\nWas afraid of online purchase of electronics but after purchasing iron box and this Lg32lg523d tv I am no more afraid. Buy online and you will get at best price and all the features will be readily availble. Thank u flipkart for safe delivery.",
            "Worth buying this TV!! If you are not looking for smart TV...go for this!\nPros:\nDisplay Modes\nClarity\nSound\nFM\nother features\n\nHighly recommended for those who wants a HD TV in minimum cost!",
            "product delivered in 2days post booking ,installation and demo was also done on same day by LG technican , wallmount also provided by them free cost .volume is excellent picture clarity is good , lookwise average .",
            "Excellent product with outstanding performance.\nNice packing, on time dilevery. Very fast installation by LG executive.\nNow coming to the product...\n720p HD display,\n20W surround sound which is more than enough in 20x30 hall.\nblur free images,\n178° viewing angle from all sides.\nbuilt in FM Radio.\nEasy Menu setup.\nNice color scheme.\nCrystal clear display and sound.\nSuperior performance.\n10 out of 10.\nLowest Price Range.",
            "Bought during Big Billion day sale for 15K+. In this price range it is excellent TV to buy. Video quality is superb and audio quality is good but low sound you will need external speakers for large room or hall. Beats samsung hands down by providing swivel wall mount.",
            "Wonderful led tv, it is ips display and music are inbuilt dolby system very nice look of model am very happy.",
            "I would have rated 5 star but the sound quality of this LED TV is average. Display is good in cinema mode.\nDisplay 4.5/5\nLooks 4.5/5\n2HDMI\nUsb support all types of format thats very awesome\nSound 3.5/5\nPicture clarity 4.5/5\nFlipkart service 5/5",
            "Pros:\n- Bought \"LG 80cm (32 inch) HD Ready LED TV\" during Diwali offer (2017) for Rs.15,248. Worth for money.\n- Delivery was done as per committed date.\n- There was no issues (physical damage) found.\n- Installation was done on the next day of delivery, by the technician assigned by the Flip-kart.\n\nCons:\nThe technician brought the Wall mount by himself, since it will not be available in the TV package.\nTechnician was asking Rs.800 for the Wall mount. As per Flip-kart, Wall mount should be given free to the customer.\nAfter my argument he gave up.\n\nSo, given 4 stars for the good thing and reducing 1 star for that bad experience.",
            "Worth buying.best best tv under 16k with free wall mount and installation.compared to others this one is the best in this price segment",
            "Really nice tv , i made order on 17th oct and they delivered it on 24th oct by next day installation n demo also done very smoothly flipkart and Lg does really a nice job .",
            "Good product and top brands LG . Pictures quality is very nice👌 very comfortable LED TV and sounds quality is very very good. Im very happy ..........!",
            "I have purchased this TV with Rs.15248/- after getting offer. Picture is good but sound to be improved. With HD set top box picture quality is far better than normal SD picture.",
            "Its very nice product sound clarity is very good picture quality is nice installation is in time",
            "Hi guys... tis product is very good and sound quality awesome good picture quality... fast delivery Thank u flipkart.",
            "Nice deal with Flipkart. Delivery was on time and installation earlier on time. Tv is really great and Lg is a trusted brand. Go for it...",
            "Timely delivery & Installation. Great deal 🤝\nI don't see any specific issues so far. . Really worth it. Value for money. Really appreciate the installation Process done by LG. No Hassel",
            "Very eye catchy product. Was not happy with the delivery. But regarding the product, worthy one. Delivery was not on the promised date. Giving 4stars because of the delay in delivery.",
            "TV is awesome. Sound quality and picture quality is good. I got it for Rs 15999 in big billion day. LG TV is better than Samsung since it has IPS panel for great viewing angles and better sound quality. My installation was done on the next day I received the TV. Go for it.",
            "Good product, best picture quality, best sound.\nOverall the product is very nice.& timely delivered.",
            "Amazing tv I love good grafice and good model slim",
            "Very much worth for this price\nLG brand is good in pic quality\nThe best in this TV us sound clarity with 20W\n...\nAs on all its a good product to buy",
            "It's a very good product also very good service by Flipkart Team. I am very thankful to Flipkart and referral to other that they should also purchased from Flipkart in future. Thanks",
            "Overall good tv in this price around 16000/- in 2017 big billion sale sound is very good, Dd, flexi mount is free n installation is also free n good",
            "Using from last 10 months, It's LED with FM, 2 hdmi, 1 usb, No mosquito repellent feature , I purchased in Rs. 15600 in September 2017, worthy to buy, 20 w speakers, Good service by flipkart and LG installers, like it.",
            "Awesome LED in affordable price. I bought it in 15499/- after discount. Great deal and thanks flipkart. Product was one day delay so I am cutting 1 star. Otw awesome sound, great picture quality.",
            "Nice picture clarity and sound worth for money around 20k flipkart service is good",
            "Economical {bought in 15.5k during big billion day}\nOn time delivery\nFree wall mount\nInstallation was on time but installed incorrectly.....Had to call flipkart to get that reinstalled...In 2 days it got reinstalled properly.\nOverall 4.5 out of 5.",
            "EXCELLENT TV SOUND SYSTEM IS VERY VERY GOOD",
            "It's gud , but it is 20w speaker",
            "good product as expected. I want to give 5star for this product but installation and demo service is very poor, They are untrained technician.",
            "Product was defective than it took 3 days to change it than i got the new one but guess its a pain for customers when they paid 19k and got defective product\n\nTv is good sound is good but if you are thinking to connect it to laptop so not good it goes till only 1300px",
            "Awesome product. Delivered on time and the installation was done professionally.",
            "Nice Display Clarity and excellent sound",
            "best tv in best price,,",
            "Nice TV.i got it for 15449 only in big billion day offer.installation and service is very good.good response from both Flipkart and LG",
            "Nice product...😘😘",
            "Good T V. Picture quality and sound quality are very nice.\nFor BENGALURU within one day delivery and next day installation done by LG person.",
            "Mast dont think buy it",
            "Good option\n\n1. Fm radio\n2. 3star power consumption\n3. With out stabilizer\n4. Pendrive hd videos any format playing\n5. Display satisfied\n6. Eye protection\n\nBad potions\n\n1 . Lg lj 525d model extra option mosquito.",
            "Good",
            "Value for Money\nGreat Sound Experience and Crystal clear pictures\nworking great with videocon d2h.....",
            "best TV in small budget ND also happy72 year independent day",
            "Picture quality is very disappointing",
            "Very very owsm product quality is very god",
            "Got this product at 15248/- during Diwali sale and at this price no one can bet this TV. Sound, picture, looks and quality awesome. Wall mount will be provided on free of cost at the time of installation, though installation was on the very next day from delivery. Truly amazing deal at Flipkart.....!!",
            "The product was too good, and your delivery to my village was the appreciatble one, where as no other ecommerce guys were ready to do that.\nThanks a ton flipkart.\nYou ppl rock.",
            "Good",
            "Best price, Easy replacement with perfect installation...",
            "Great picture quality.... Nice sound.... Just USB port is only 1....rest all fine",
            "Good tv. Great picture quality. Value for price.",
            "Nice product .tnx to flipkard",
            "Demo and installation service is pathetic. It takes 4-5 days to install after delivery.",
            "Really a good product..!!",
            "OK OK OK good good supar",
            "It has a best product ..\nVery nice performance..",
            "I have purchase this TV 17.07.2017 but this many times repair this product bad for me",
            "I've paid 4000+ rupees to repair this Television set although I purchased it only 3 years back.\nAlthough there are so many issues with this TV.\n\nI will never buy any LG product in future.",
            "Quality not good. Only one and half year Picture got damaged automatically, extended warranty team deny to give claim. Don't buy.",
            "perfect lg led tv\nbest of deal",
            "I am using this product since 25 days, it's excellent product, I had compared between retail and online, online is very low price. I am very happy. should be buy guys.",
            "excellent product by LG....\n\nNice picture quality....like full HD...\nSound quality is also vvvvv good.....\nPlaying from USB, all file formats are supported....\n\nSuch a nice product....just go ahead....",
            "FLIPKART service is very worst and GATI Courier is worst in India. You cant believe this LG TV delivered to me after 25 days. One more worst thing. I had colleted TV from GATI courier Godown which is almost 20Km from my place. So Please my request dont buy big product from online service because its difficult for courier service like GATI courier to delivered at home. They will put in their godown for a week but would delivered to your home.",
            "Nice product 10 out of 10",
            "Super",
            "My tv has gone faulty within 2.5 years of purchase . It has a blue tint in it which is making the tv unwatchable . Guys beware of LG and don't purchase its substandard product . I did some research on the internet about the same issue and its an issue due to substandard Backlight used in LG TVs . Do not purchase LG tv ever . I live in HP and there is no air pollution as well which I would have considered in city . Rubbish product .",
            "Cheap and best budget tv",
            "Worthy product. Really awesome delivery by flipcart team and the installation team came on very next day.\n\nVery nice clarity\nSounds wow\n\nQuality product\nThanks to Flipcart",
            "Defective Product Received",
            "Awesome product. On time delivery i got 16,350 (exchange and HDFC Card 10% off). Thanks Flipkart...",
            "Product and features are good. But not slim what i expected by seeing the image. I bought this for 20k after few days there is some credit card instant cash back and it went up to 18.3k :( .",
            "Bad Experience with Flipkart Customer Care. Pathetic and Very Poor Response.",
            "I bought the tv for my uncle since i found the price plus customs duty for buying it in Dubai is expensive than what flipkart offering.\nDecent pricing. Slightly disappointed because not all products are delivering to my home town.\nSo far excellent delivery timing and demo.",
            "Excellent",
            "Good product",
            "Good product",
            "Excellent product, 2017 ,I purchased ,No issues, Good Clarify",
            "best of best.buy freely",
            "Good",
            "good product",
            "One of the worst product I have seen in my entire life,\nImmediatly after one year the display is not working and the customer care is not responding properly.\n\nFlipkart is cheating with product warranty, first they said they will give additional one year warranty but they are saying it is not applicable for this product.\n\nBye Bye Flipkart this will be the last product i have ordered in your website and I will also recommend my friend to do the same.",
            "Its not full hd and does not support high resolution video quality very bad tv",
            "Excellent & working fine.",
            "Nice product from LG, Sound Quality is good.",
            "Very good",
            "nice quality",
            "good",
            "It's best because of its picture quality and Dolby sound with FM facility.",
            "Good best at price",
            "very nice",
            "super product",
            "installation took 1 month",
            "good quality",
            "good tv",
            "Super",
            "Great product.. installation was on schedule.. love u flipkart...",
            "good",
            "firstly I got defected product but after the replacement request I received a new fresh one and it is awesome.",
            "good",
            "good",
            "Quality was good",
            "Nice",
            "good",
            "Old version",
            "Must buy!",
            "1080p movie from USB port doesnt work!",
            "nice product.",
            "very very good product...I am totally satisfied from this tv.....",
            "picture quality is awesome......sound is average.....satisfied with product",
            "very good",
            "Good",
            "Better at 16500 ..price..",
            "Nice product",
            "Excellent TV. Good sound quality. Good picture quality.",
            "Nice product",
            "Very good picture quality.",
            "Good product, worth to buy.",
            "Good product",
            "Nice product.",
            "VERY NICE LG TV. WORTH BUYING.",
            "Good price on flipkart",
            "after one year my lcd display goes out",
            "Good",
            "nice TV within this price range. picture and sound quality good.",
            "nice one",
            "Very bad product and flipkart portal customers helping is very bad",
            "Delivery at schedule date by Flipkart. TV is very good. Picture quality not so bad but not too good cause it's HD ready TV also sound quality is avarage. I m understand because cost is only 16200/- ₹ from LG.",
            "five star for TV but worst delivery from Flipkart ordered on 19 July got on 31 July .\npicture quality 4 star\nsound is great 5 star",
            "Nice one Good picture quality",
            "Too good",
            "But exchange policy was not good very mis behaviour delvery boy",
            "Excellent TV for this price. Crisp, sharp and clear.",
            "nice Tv",
            "Budget product worth for money",
            "Nice Performer",
            "Nice product",
            "Sound clarity is good.Color is also gud but picture clarity is ok ok not upto d mark.",
            "nice",
            "sound & picture quality is best......no any problem.\nsound is too good.",
            "nice product...",
            "Very nice product, delivery delayed due to Gati Courier, either i'll get 5 star\nAfter delivery next day installation done\nThank you Flipkart\nThank you LG\nThank you Omni tech Retail",
            "good product picture & sound quality also good",
            "nice tv",
            "good",
            "nice one, good product....",
            "Best",
            "Excellent product as par my expectation",
            "Good TV. Good TV at this price. Flip kart & LG service is good.",
            "Excellent quality",
            "The product is average. The picture quality is not that good. What made it worse was the installation and service by LG. I have never been a fan of LG and probably after this purchase, I would not buy anything from this brand again.\nFlipkart's delivery was perfect. The 2 stars are for them. The product and installation deserves a 1.",
            "don't buy any electrical item from Flipkart because installation and demo will not done by Flipkart",
            "super TV it was wonderful to handle",
            "Product is good and service is good give by flipkart",
            "good tv and good job flipkart",
            "Great picture quality and sound 5 star ..connected fire stick and made it smart...good decision to cancel mi tv and going for LG.Thanks FK",
            "80% of the quality material spreads are good at this price, but the sound is good in this",
            "It's rocky LG always best brand in market",
            "aswm tv..",
            "good",
            "Best tv in this budget. Do not hesitate to buy",
            "Good",
            "Nice TV HD is like a full HD\nexperience for flipkart is excellent",
            "cool TV",
            "Good picture quality with Dolby digital sound Installation within one day",
            "Good product but delivery is late process",
            "its a good product",
            "Excellent picture & sound quality. Flipkart delivery & LG installation is super fast.",
            "flipkart delivery was excellent but installation service is really painful .",
            "Good Picture quality;sound is good.delivery on time.thanks flipkart",
            "Good one",
            "Good Tv. picture clarity ok, sound level Ok..",
            "Awesome.",
            "nice",
            "GOOD LG TV WOORKING AND SOUND QUALITY ALSO GOOD WORTHABLE TV IN FLIPKART",
            "Good",
            "i received this product with good package...hereafter i am satisfied flipkart customer.",
            "Very nice product at this cost",
            "Good and best result thanks flipcart for fast delivery",
            "very nice product",
            "All Good 6 month using in lg tv",
            "Good Product.",
            "Very good product!",
            "nice product",
            "display is good not excellent, sound is super , over all good at this price point",
            "It's good.",
            "Sound and picture not good",
            "good picher and sound . install with free wall moving stand . brilliant",
            "good",
            "excellent",
            "good",
            "Nice one but sounds quality very low.....",
            "Good Product but not Happy with delivery by Flipkart.\nDont rely on Flipkart for on-time delivery. They just lie.\n\nPathetic flipkart delivery",
            "good product specially when u get it for as low as 17200.",
            "Good product... LG service is also on time installation.....overall paisa vasool",
            "Nice",
            "Good product but some time picture stops",
            "Ok",
            "Nice product",
            "better",
            "Best tv i got it Rs 14250 best at this price range and quality also good",
            "A genuine deal for an absolute noteworthy product. Thanks Flipkart",
            "Good product",
            "Good picture and sound quality, I am satisfied to purchase of these product",
            "nice tv",
            "Good",
            "Really awesome experience with lg.",
            "Ok",
            "excellent",
            "nice",
            "Nice TV. Sound quality is good. Picture quality is also good. If one can add 4K more to his/her budget then Sony would be a better option. It has been 10 days when I bought it from Flipkart. Delivery was done on time but the LG guy refused to give demo any other time as asked, he said they have a fixed time. Overall a quality product.",
            "Speedy delivery. With the intended product",
            "Very good product.... Love it",
            "Display is like real, sound is crisp and good quality product. After sales service of Flipkart is very poor they didn't book for installation and demo and daily saying excuse only. After 10 days I directly book and installation done same day itself.",
            "nic tv",
            "Nice and fully clear picture",
            "Good",
            "Super",
            "Good product",
            "Not having any button if remote fails than there is no option",
            "Nice.",
            "Better display and gud sound",
            "Good",
            "Product is very awesome. No prob found till now.product deliverd on time and Installation very soon.",
            "I am happy",
            "Nice",
            "Good if you are searching for middle range led...at this price giving the best..picture n sohnd quality is also good",
            "Awesome...",
            "Gud",
            "nice product",
            "It is not a smart tv",
            "Good",
            "Nice tv",
            "Good product",
            "Still waiting for installation and demo since form last week.",
            "Picture and sound quality is avarage....... Normal tv.. But price range is OK...",
            "Nice and very good TV Thanks LG & FLIPKART",
            "Thanx Flipkart for this awesome price. Sound and picture quality is too good.",
            "Budget product",
            "Nice product.but mobile is not detecting at USB port",
            "Better",
            "tq delivery product In time demo also provided in time ..good product",
            "Good item",
            "Very good product",
            "Good super",
            "Nice product at this range.... Good picture quality and sound quality... If pannel is black... It looks awesome",
            "Sound system and screen resolution are not good.",
            "Nice",
            "Good product for the money.",
            "Good Product",
            "Awesome",
            "Installation cancelled, no reason specified for it, need to fix it by some technician and he charged over 300.",
            "Nice led",
            "Good pro\nduct",
            "Very very good looking,working awesome,purchased for 15.2k",
            "Nice suprb product",
            "Excellent very excellent installed best picture best sound",
            "Nice led",
            "Yes i feel very satisfied with that purchase,\nSound quality is good with 20w speaker\nVideo quality is also good.\n\nOnly problem which i saw is FM/RADIO is not efficient, it is not working. But that is ignorable as one can get FM in DTH set to box.",
            "Nice product",
            "Very good sound",
            "very nice",
            "Super ..it's fantastic",
            "Sound is ok. Poor picture quality even in HD.",
            "I gave 4 stars bcoz flipkart is good in service but in replacement you guys took over and above a week that was very painful time for me bcoz time and money is very important for everybody",
            "Thanks Flipkart TV quality is good and installed before time , good service",
            "Flipcart service is very good",
            "Awesome superb delivery",
            "Good delivery good product",
            "Ok good",
            "Nice product and before time delivery",
            "Value for money",
            "Good tv",
            "Very nice product and I suggested with my friend.",
            "Good service nice led",
            "So far so good. Altough installation is free one needs to shred an amount equivalent to Rs. 2k for mount clamps which otherwise is free when purchased from shops.",
            "Remote disfunctioning within 1 month.",
            "All most nice product... good sound quality... flipkart service is good... when I asked for pre installation they responded well...",
            "Nice TV, picture and sound every thing good. On time delivery and installation. Problem is with the installation, tv's bottom is above 4 feet from the floor. which make your neck painful after watching tv for couple of minutes. I called the engineers again for reinstallation, but they tried to convince and didn't agree with me. Flipkart should take care of this in future.",
            "Good product",
            "Awesome product. Nice picture quality and sound quality.",
            "Good quality",
            "Please send installation engineer tomorrownd and please send folding moving wall mount",
            "It's really good product n good service response by Flipkart",
            "Nice product",
            "Super product in reasonable price basic model",
            "Product is nice but the service from flipkart was terrible.",
            "Purchased for great price thanks flipkart and brand LG nothing new to explain about brand it's simply awesome at this price",
            "Value for money",
            "Good product",
            "Best price best tv",
            "Best led tv in this range\ndisplay and sound great....\nVery good performance... Go for it",
            "Good tv",
            "Its amazing product in this range",
            "Awesome picture quality... Thanks flipkart",
            "Old model 32LN5110 Very good tv but\nThis model number {32LJ523D} Not bad.\nPakinig is soo bad.",
            "Very nice product",
            "Happy with this product. Clarity is good",
            "All good as mentioned.",
            "Its amazing, good experience to shop on flipkart, the product is very good and fulfilled all the criteria required",
            "100% satisfaction on this LG product. Display & sound output are too great.",
            "Very nice",
            "Bad",
            "Best nice look",
            "Good quality of picture & sound. Overall nice product.",
            "Nice tv",
            "As compared to other tv..it's best tv I have purchased. Sound and picture quality is great in this price range.",
            "Awesome picture and sound quality.",
            "Nice TV....",
            "Ok ok",
            "Value for money but not satisfied with sound quality",
            "Good product tqs to Flipkart no issues so far now going on good",
            "nice product so preety",
            "Good product.... Pic quality...and sound is good... Got this product Rs.. 15999 with credit card offer...",
            "Nice",
            "Product is gud",
            "Good",
            "Good",
            "Better h but installation accha ho to me best kahunga",
            "Thank You Flipkart and Coming to LG 32LJ523D Picture Quality Awsem and Sound is Superb.",
            "Good product.",
            "Nice tv.....must buy",
            "Thanks flipkart for the ultimate delivery experience\nThe product is excellent",
            "TV is quite good..\nQuality is ok..\nSomething \"x\" factor is missing..\nBut it's ok..👍",
            "Good. Quality product.safe for eyes.but color adjustment should be done by technicians.",
            "Good working condition",
            "The product was delivered in time and in good conditon. Installation and demo was also arranged by Flipkart.",
            "excellent product to buy at this price...",
            "Excellent t.v n demo also fine .,....",
            "Good",
            "Faster delivery by flipkart. Excellent service LG.Product is really good.",
            "Good Dilevered in time.\nBut Installation date given me after 4 days of Dilevery soo i can't check the product is working or not.",
            "Am satisfied with the product. Good picture quality for the price. Sound is also good. T V was delivered within one day and install was done the very next day.",
            "Good",
            "Guys pls don't buy product from Flipkart and LG\n1) They will tell installation and demo is free of cost but they will change 450 RS for installation. The Flipkart won't have control on LG installation services. They can't tell, when they charge for installation.\n2) worst service from flipkart, it's not customer friendly\n3) We need to follow up many times.\n4) when it comes to TV Picture quality is blur, and sound is also not good.\n5) Connectivity ports also less. It won't play AVI and other formats.\n6)Pls go for Sony or Sanyo, etc. and buy from other e commenrce sites.\n7) Flipkart and LG service is not good. I am very much dissatisfied.",
            "Very nice product...",
            "Excellent product with latest features comparison to other brands.. and 8 got this in very huge discount",
            "Installation incomplete. Charging for wall mounting !",
            "really good product i enjoy a lot\n\nreally thanks to flipkart",
            "Good",
            "Gud Product",
            "This product is the best",
            "Good",
            "Working very good....",
            "Good",
            "Best",
            "Installation is nit good",
            "Sound and picture better than other led worth",
            "Good.... Price is low",
            "Go for it guys value for money",
            "Nice",
            "Good product",
            "Value for money product. Faced a confusion over installation, the representative said no wall mount for online purchase, thankfully Flipkart online page had all in details for us to show them.",
            "good",
            "gud",
            "Nyc tv...support 1 TB hard disk easily.. Sound clarty is also good...delivery and insatalation is so fast...but there is a hanging problem when connect pen drive...is this happen due to virus??? I don't know but best tv ..",
            "Very nice picture quality and installation done perfectly from LG service person. Thanks flipkart for delivery in time.",
            "Good one and well packed",
            "Good deal",
            "Nice buy .. perfect led TV for bedroom ..",
            "Nice product worth to purchase low price from flipkart",
            "Thanks for flipkart led delivery nd installation doing fast nd sound quality also picture quality good",
            "Picture clarity is good In time Delivery and Installation",
            "Nice TV worth money",
            "Nice TV and flipkart services is very good",
            "Good sound quality and display. Wide angle view. Nice build quality.value for money.",
            "Good product in this budget but sound clarity is not good.",
            "very bad product",
            "Value for money\nVery happy with product, it delivered on time thanks flipkart",
            "Good product",
            "Awesome",
            "Excellent product\nExcellent service provided by flipcart\nTotally satisfied....10/10",
            "Nice product with better price. Just there is a delay in the installation",
            "Amazing TV... Worth buying",
            "Great product thanks Flipkart",
            "Super Product but installation is horrible",
            "Very nice product. Best in this price range.",
            "Gud product for price",
            "good tv",
            "good",
            "Good",
            "replacement process is very slow, otherwise everything is nice",
            "Nice product",
            "Nice product.........",
            "Cool",
            "Best buy from my end excellent picture quality with superb sound",
            "Butter Options For Basic",
            "The pictures quality and sound quality is good and worth for this Price",
            "Television at this price is good . I purchased it for 16998 . But picture quality was not as expected . Sound is quite good . Fm is not working inside room .",
            "Good",
            "Nice product",
            "Good",
            "Awesome product for this price range... Great deal. Jus go with it",
            "Product is good.Flipkart service best but Lg service very bad.",
            "Good",
            "EXCELLENT----!!!",
            "Good product",
            "Good",
            "TV is good & service is satisfactory",
            "Fantastic item worth purchasing.",
            "Not satisfied with the installation done.",
            "Osm... picture and sound quality is best.... found worthy for the price...love it...",
            "Very nice TV in low price",
            "The quality is ok ....",
            "Good product",
            "Nice one",
            "Very nice TV for this rate. picture quality is amazing.",
            "IT IS A FULL VALUE FOR MONEY IN TERMS OF PICTURE QUALITY AND SOUND QUALITY",
            "It's good. And their installation service is very quick .",
            "It is good and fantastic..",
            "Excellent T.V in this Price... Superb Picture Quality... And Also Sound is Good...",
            "Good performance upto date. Sound quality is good . Flipkart fast delivery is great...",
            "Nice product..........",
            "Superb sound quality, Resolution is a lil bit low, but you can tweak the brightness and contrast to get what you want. Moreover best buy for 15k.",
            "very good product and picture quality ,sound quality good.",
            "excellent",
            "Good product",
            "Super",
            "Good",
            "Nice product and service of Flipkart also good.",
            "Super",
            "Its a very good product",
            "I strongly recommend........\nThe sound and picture quality is nice........",
            "I am purchasing in big billion days 17500rs super product only one usb this led overall good product",
            "Good",
            "Get it in time",
            "Overall product is good but on screen it shows 3 star that should be mention on the description page.",
            "Very good",
            "Nice product , but there is no wall mount stand with it. Flipkart say installation time wall mount provided. Any one tell me plz, surely I get wall mount stand at time of installation ?",
            "Good",
            "Product is very good but service is very bad. Installation person came after 10 days of delivery.",
            "Good",
            "Good tv",
            "Hi\nNice tv good looking picture quality is very good this brought from flipkart 15200 only",
            "Worth for the money. Thanks to flipkart.",
            "Nice product delivery and installation done in time am so happy for buying this product",
            "Steal deal at this price!!! Best buy , I'll recommend everyone who is looking in value for money, this product is the right one to go for.",
            "Quality product from lg..\nThanks flipkart and lg.\nFast delivery and fast installation",
            "Nice",
            "Good",
            "Highly recommend for this model..\nPicture and sound quality is superb. No tv in the market like this in the given price. You can go with this.thanks",
            "Simply awesome....",
            "Very good product from LG worth to buy it flipkart done little delay for delivery overall it is good",
            "Nice product value for money product....",
            "Superb sound 15250",
            "Best delivery by filpcart. tv picture quality and sound quality all so verry nice.",
            "Amazing",
            "This tv very good back not connected in smartphones",
            "Working as expected",
            "Satisfy",
            "Awesome product...... installed in the next day of delivery...... good service from Flipkart & LG. Picture & Sound quality very good.....",
            "Nice",
            "Good product nice and good sound",
            "Wonderfully",
            "great product",
            "Good picture and sound quality...i bought at 16300.. it is price worthy also",
            "ITS GOOD FOR BUDGET PRODUCT",
            "Very good tv",
            "Nice TV.Good Clarity in cable TV network. Next day installation. Everything is good.",
            "Good service and Quality by flipkart and LG.",
            "Picture quality is good and sound also good.",
            "Flipkart provide good product at your home so i love flipkart purchase.",
            "Nice TVand excellent service by Flipkart",
            "Product was good but bad courier service and engenier not came for installation",
            "Good tv",
            "Superb Tv for this price of 15300+200 extended 2years warrenty approx... Excellent LG service installation man. Properly installed... Fully Satisfied. 5 star + if possible.",
            "Value for money from LG. 1 Usb+2 Hdmi ports. Flexi wall mount makes it very easy to access the rear panel. Picture quality is good. Played full hd movies also. It can play any format like mkv, mp4 etc. Sound is also ok. Go for it....",
            "Good product",
            "Nice product\nbut sound is not that much clear when listening on high volume",
            "Best tv best sound in this price",
            "Good product",
            "Excellent picture quality, sound, connectivty, design. Overall best product at this price. Also delivered and installed fast. Thanks.",
            "Its ok. Clarity is not like sony. Very light wight and easy to instal self.",
            "Good product, renowned brand L G in television, feel satisfied at the moment, let me see the performance with time passes",
            "Nice looking",
            "Got this product during great dipawali shopping offers in 15k. Delivered product before committed date.excited for free installation and demo by LG service engineer.",
            "Already we have 2 LG TV same model and bought third product. Had great experience. Very nice no problem till date from last 3 yrs",
            "Great value for money at this price LG 32inch hd ready TV",
            "It's good",
            "Nice flipkart",
            "Very nice and classy product as expected. Always best will be delivered from LG and Flipkart. Both deserve 5 stars.",
            "Vary good tv",
            "5 Star due to\n1) delivery on time.\n2) Bought from an offer which costed for ₹14798 only using HDFC debit card.\n3) Service was free of cost and installation was pretty good.",
            "Good",
            "Good TV ,but it have some minute difference it have no woofer inbuild ,but can be connected via Aux cable, easily.",
            "Thanks a lot to flipkart for provide such fantastic tv.",
            "THENX LG......",
            "Awsum just go for it",
            "Amazing product in this price...i bought it@15500",
            "Sounds system is awesome and I'm very happy with the product",
            "Fast delivery superb TV",
            "Nice product..",
            "Flipkart's service is good, timely delivery and installation took place, TV looks nice, picture quality is good, overall I am happy with my purchase.",
            "Superb product",
            "I'm brought this product on 15248 with discount..nice HD picture quality & powerful sound...no one can beat this TV at this price..",
            "osm ..\nworth of money",
            "Excellent in all aspects....like order,delivery installation,quality.....100 out of 100 just awesome",
            "Good product",
            "Tv is good .instulation is so good .but USB not connected through mobiles.overall I happy.",
            "The brand has value but starting level product. One may not think for VGA port.",
            "Again a great experience with Flipkart really very cooperative and products are quite affordable and really good.",
            "Good",
            "Got it for 16999 the screen and sound Is good. Value for money , installed the next day after delivery. ✌\nBeen 4 months works well and Google Chrome does the job for streaming tho a wifi connection required",
            "Awesome, just loved it",
            "Good",
            "Product is well but flip kart delivery and replacement not well because not provide complete information .",
            "best from lg",
            "Week over after a purchase.Good display and sound.",
            "good television and good service of filpcart thanks.",
            "The best one I could get it in online. I got it at 16880 including three years warranty",
            "Product is good as expected.. installation was a bit delayed..overall satisfied with the product",
            "Good product",
            "Good TV low money",
            "TV quality was fantastic\nFlip cart is always grt...",
            "Good brand",
            "Purchased @15500 in big billion day offer..One Month used review Amazing Sound,picture quality TV design ..FM working fine..Cricket comment etc..",
            "Product is very good.but delivery to much late",
            "Over all performance good",
            "Very Nice Tv, Picture & Sound Nice,, I Like it",
            "Amazing tv",
            "Great.. Delivered within expected time but didn't let see whether the TV works or not.. Only could verify whether it's physically damaged or not.. Let's see and will revise the rating after the installation guys do the needful satisfactorily.",
            "GOOD",
            "Best Tv With Normal Stereo Sound",
            "Good product at low price",
            "Super\nDeliver on time & free demo within two days",
            "Very good picture clarity.flipkart delivery and services are amazing.",
            "Great product to buy...",
            "Excellent",
            "Good one",
            "Very good product",
            "Very nice product It is",
            "Great",
            "Very good 32inch tv .. I love it",
            "Pretty good .more than enough for a family's entertainment needs",
            "Nice product as well as services provided by Flipkart.",
            "A good product with quick delivery",
            "Good product",
            "Best compared to other brand and price. Other low cost 32\" HD or full HD TVs in this price use very bad UI, colour backlight management.",
            "I purchased on independence day offer, delivery was on d time..... But the engineers came for d installation ..... didn't know how to operate the TV",
            "Sound and picture quality is good.",
            "Product is good. The product got delivered before the scheduled time, the installation was carried on time.\nOverall good experience..!!\nSound quality is good for the price its been offered for.",
            "Perfectly delivered and professionally installed very good",
            "Poor picture quality....",
            "Everything is ok but installation process is not good...",
            "Good product",
            "Poor clarity. . No replacement available. . Loss of money",
            "TV is good\nGot it within 4 days of ordering & installed it on next day\nGood sound quality\n\nI've ordered the extended warranty from Jeeves but with the tv I haven't received any warranty card or paper with it. Also I haven't received the bill of the extended warranty which I've purchased.\nI've asked the installation engineer for that but didn't got any satisfactory answer from him.\n\nAlso I've called to Jeeves customer care they told me to get in touch within 48 hrs but already 4 days are over...\nREAD MORE",
            "Service from Flipkart was worst. Ordered the product on 15th Oct and got it delivered on 16th Oct. Installation was promised to be completed on or before 18th Oct. But still did not receive any call from authorized agent on installation.\n\nReached out to Flipkart customer care, but no proper response. They are just extending the ETA of installation by just saying that it will be done in 2 days.\n\nPlanning to return it back as no one is properly responding. Not willing to give a single star as well for Flipkart services.",
            "nice tv. super sound and picture quality. 100% satisfied.",
            "I am using single usb",
            "Pathetic after sale service from Flipkart. Quick delivery on 21st oct 2017. Promised installation on 24 oct 2017, but still no installation done even today . Customer care says wait for 24 hrs to 48 hrs. I want to return the Tv but Flipkart is not allowing me\nStill waiting for installation and demo of Tv on 30th oct 2017",
            "Very well response to Flipkart",
            "Very good product L.G",
            "Screen Color quality is not good.. I don't like it. VU TV quality is better than LG. I purchased LG looking at the brand. I asked customer care to send the service engineer. If problem don't solved then I will return the TV",
            "Very worst product in my life seller sent damaged product and still not replace while i ordered this product on16th of oct.2017.",
            "Satisfied and wonderful job by Flipkart team on the delivery part... Keep it up",
            "It's good product.\nGot delivery in 3 days.\nThank You Flipkart.",
            "Demo is so late....",
            "It's good. But flipkart took a long time to deliver.",
            "Very bad service by flipkart broken product delivered to me and it has been 1 month no one came to replace it",
            "picture quality is not good",
            "To let delivery & also demo installation",
            "Demo and installation is not satisfied",
            "Received product it is good.",
            "Best deal under exchange during Diwali sale.",
            "Order delay",
            "Very good service"
        ],
        "likes": [
            "149",
            "31",
            "14",
            "3",
            "6",
            "7",
            "9",
            "8",
            "1",
            "1",
            "149",
            "31",
            "14",
            "3",
            "6",
            "7",
            "9",
            "8",
            "1",
            "1",
            "1",
            "1",
            "1",
            "3",
            "2",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "515",
            "15",
            "92",
            "7",
            "8",
            "52",
            "17",
            "10",
            "4",
            "10",
            "6",
            "3",
            "2",
            "3",
            "5",
            "5",
            "4",
            "4",
            "5",
            "7",
            "2",
            "2",
            "2",
            "2",
            "2",
            "3",
            "3",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "42",
            "12",
            "2",
            "0",
            "2",
            "4",
            "12",
            "12",
            "0",
            "0",
            "42",
            "12",
            "2",
            "0",
            "2",
            "4",
            "12",
            "12",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "3",
            "1",
            "2",
            "3",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "105",
            "1",
            "31",
            "0",
            "1",
            "22",
            "5",
            "2",
            "0",
            "3",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "2",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "9",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "4",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:if it has free wall mount with it.",
            "Q:which panel is used by lg?",
            "Q:speakers are 20 watts or 40 watts?",
            "Q:It have optical output for sound?",
            "Q:It is written in specification that FM is present in TV. Does it?",
            "Q:does it support xbox one s?",
            "Q:can i connect my home theater to this tv ?",
            "Q:mobile are connect by usb or wifi ??",
            "Q:Can I connect computer?",
            "Q:can i connect my 1TB HDD?",
            "Q:Does it have built in FM?",
            "Q:Screen mirroring yes or no",
            "Q:can I connect mobile media with it",
            "Q:Is this a smart tv? Can we connect wifi",
            "Q:can it support android mobiles",
            "Q:HDMI & usb ports on back or side",
            "Q:can i seen my android phone video and photo in this tv",
            "Q:which type of wall mount will come with tv ...fix or moveable ????",
            "Q:is it a wall mount ? actually i want wall mount for my room.can you supply the wall mount?",
            "Q:IS IT HDMI(ARC) SUPPORTED ?",
            "Q:this support computer moniter",
            "Q:Is it come with flexi wall mount",
            "Q:can i use as a coputer desktop",
            "Q:can I playing 4k movies??",
            "Q:it includes a flexible wall mount ?",
            "Q:All additional accessories will be charged seperately means which type of additional accessories they will provide..",
            "Q:Aux cable point is available or not?",
            "Q:Can I use it as a computer screen?",
            "Q:is this tv support 4k",
            "Q:is it 5 star power saving",
            "Q:can I connect a ps4 slim",
            "Q:What is the model number of the tv",
            "Q:can i connect bluetooth in this tv?",
            "Q:what is the colour of TV ?",
            "Q:full hd videos is supported or not???",
            "Q:Can i play a bluray movie in mkv format and dts 5.1 codec through pendrive?",
            "Q:is it hangable?",
            "Q:it is smart TV? internet connect",
            "Q:Does this Tv has wireless display feature ????",
            "Q:which one is better lG led tv and smart lg tv",
            "Q:which one is better",
            "Q:Is there any gap present the panel and the cabinet at corners in this model",
            "Q:i need wall mount at corners can you provide FOC?",
            "Q:game remote will proved or not",
            "Q:can you supply wall mount?",
            "Q:HOW TO FIX THE STAND WHICH IS WITH THE BOX AND NUT GIVEN IN THE KIT??",
            "Q:which type of wall mount will come with this LED?fix wall mount or moveable wall mount?",
            "Q:usb port in back or in the side?",
            "Q:what about head phone jack is it available in this product",
            "Q:can we connect mobile with it",
            "Q:What is TV viewing angle?",
            "Q:can i use usb splitter and use multiple usb",
            "Q:is it required to stabiliser",
            "Q:can i use it as a monitor???",
            "Q:What is 4K?",
            "Q:Do I get wall mount with the TV?",
            "Q:is it a smart tv. we can use internet over it for youtube etc?",
            "Q:What is ideal refresh rate?",
            "Q:is it support watch movie or vedio through pen drive?",
            "Q:Is the T.V is in built stabilizer",
            "Q:WiFi attached , YouTube??",
            "Q:can i connect this tv with computer",
            "Q:which is better mi4a32 or lg32lj523d ?",
            "Q:how to install?",
            "Q:can we connect 5.1 speakers?does it have only 2 CH out?",
            "Q:Does it have VGA port?",
            "Q:How do I decide on which screen size is ideal for me?",
            "Q:along with tv unit set.. is there wall mount free",
            "Q:Can you make a regular TV smart?",
            "Q:It's can be set on wall",
            "Q:How is the video quality of 720p and 1080p movies played from usb? does it play smoothly with nice clarity?",
            "Q:does it have stabliser",
            "Q:Does it has wall mount stand is it movable or fixed",
            "Q:does this tv support dolby audio?",
            "Q:Does it supports castscreen??",
            "Q:Wi Fi connect",
            "Q:What is the manufacturing year of Product??",
            "Q:is this tv has optical output for 5.1 home theater?",
            "Q:is this tv had woofer inbult ??",
            "Q:can i connect pendrive in this tv?",
            "Q:Wi-Fi in it",
            "Q:Which is Better lg LJ523D or lg LH562A ?",
            "Q:Does it looks dark viewing from side position",
            "Q:how is the picture quality for sd channels",
            "Q:What is contrast ratio this tv",
            "Q:can i connect to youtube",
            "Q:can i get the wall mount along with tv as i intend to do the installation on my own... if so how do i mark it in my booking?",
            "Q:can I open the box before installation?",
            "Q:Is it unboxed?",
            "Q:is hdmi cable included?",
            "Q:Does it support Google chrome cast?",
            "Q:does it play 1080 p or higher videos ?",
            "Q:is it wall fitting availabale",
            "Q:its not recognizing external hard disk of any capacity fro 250 gb, 1 tb etc. ?",
            "Q:can we connect 5.1 speakers.which cable can be used?",
            "Q:is it required stabilizer for this monitor",
            "Q:wall mount stand provide in box no?",
            "Q:wall mount stand provide in box or no?",
            "Q:is golden eye technology present in this tv ?",
            "Q:Can DVD player and set up box both is connected with this device same time? Set up box is not HD set up box.",
            "Q:is it 3d supported?",
            "Q:is led smart??",
            "Q:is this tv have vga mode",
            "Q:What's body colour?",
            "Q:does it play all latest videos formats through USB.",
            "Q:is there any problem with rear HDMI and USB ports",
            "Q:I can't decide between a curved screen & a non-curved screen. What's the added benefit?",
            "Q:Do I get brand warranty?",
            "Q:Why HDMI ports are required?",
            "Q:is support screen mirroring option",
            "Q:Is it comes with wall mounting ?",
            "Q:does it support miracast??"
        ],
        "answers": [
            "A:Yes, there is a free wall mount with it.",
            "A:IPS led back light lcd panel",
            "A:AS per your Engineer Speakers are 14watts....but on bill 40watts, sound quality is not good...please check and update ASAP.",
            "A:yes, it has 3.5 mm jack for audio output..you can directly connect your speaker with single 3.5 mm jack cable.",
            "A:it comes with built-in FM radio they will install an additional receiver for FM which is included in package.",
            "A:No it doesn't mention any such possible support for xbox controller.",
            "A:YES",
            "A:you need MHL cable to connect mobile. no wifi.u can connect USB to play media. it plays virtually every possible video format be it flv, mkv, mp4 xvid DivX avi any hd content you throw at it it plays.",
            "A:yes, you can connect through the HDMI cable only",
            "A:yes by usb",
            "A:no it doesn't have fm",
            "A:no",
            "A:No",
            "A:No. It is not a smart TV",
            "A:It's not a smart TV but it supports Chromecast, using which u can stream any video.",
            "A:On the back",
            "A:This does not support MiraCast or wifi so answer is No. But still you can Pen Drive to attach and see pics and videos.",
            "A:Moveable Wall mount",
            "A:The answer is Yes. At the time of installation, the installation guy will install the TV as per your requirement.",
            "A:ofcourse",
            "A:No",
            "A:yes, the engineer will bring it. it can turn left, right angles.. if you fix it it small puller, it can turn 120 degree viewing angle.",
            "A:Yes you can but it is not suitable for monitor because of its low resolution and refresh rate. You better consider other models which have at least resolution of 1080p.",
            "A:no",
            "A:Yes",
            "A:wall mount they will provide through LG persons",
            "A:no",
            "A:Yes",
            "A:No. It's not",
            "A:No",
            "A:yes it has HDMI port.",
            "A:32LJ523D",
            "A:No you Cant connect",
            "A:black",
            "A:yes 1080p",
            "A:Yeah u can play...",
            "A:Yes it is",
            "A:no",
            "A:No..Not having wireless display future and not having screen mirroring",
            "A:LG 80cm (32 inch) HD Ready LED TV is super. Sound quality and picture clarity are very good.",
            "A:purchase this LED if you want a budget and better service in future.",
            "A:no",
            "A:yes, wall mount service will be provided free of cost once your item got delivered.",
            "A:No, this LED TV has not Game future",
            "A:yes , installation engineer has given it .",
            "A:With the help of screw drivers",
            "A:moveable mount",
            "A:In back",
            "A:No",
            "A:No",
            "A:It is the maximum angle at which a display can be viewed with acceptable visual performance",
            "A:no",
            "A:No need of any external stabilizer, the stabilizer system is inbuilt in tv itself.",
            "A:no it is just a TV",
            "A:4K, aka Ultra HD, comes with a 3840x2160 pixels resolution- (4x of full HD TV). The extra resolution adds better definition & depth to the pictures, resulting in images that look incredibly life-like",
            "A:Yes wall mount comes free with all 22 inch & above TVs",
            "A:no..this is no smart tv..",
            "A:The refresh rate is the number of frames the television can display per second. The standard rate is 60 60 Hz. Higher the rate, smoother the movements in videos- best for fast-moving sports/gaming.",
            "A:yes",
            "A:No",
            "A:no",
            "A:Yes you can connect this TV with computer using HDMI cable.",
            "A:lg32lj523d",
            "A:Call the call center they will provide good service",
            "A:yes you can connect",
            "A:no",
            "A:Your distance from the screen, most often decides the screen size required. If you're too close, you’ll see a pixelated image & if you're too far, you'll miss details. Check our buying guide for more!",
            "A:As always LG products are good. Good flipkart service and wall mount is free. But be care full there is no return option only replacement. All products of flipkart brand are totally useless.",
            "A:Yes. You can buy Google Chromecastor smart boxes, such as an Android TV Box or the Apple TV, which turn any HDMI-equipped TV into a smart TV.",
            "A:Yes, I am happy with what I bought and worth of it. But the wall mounting stand was not provided to me where the installation guy charged me 1200 for that!!",
            "A:All. the 1080 p videos plays absolutely smooth ans also have sharp clarity",
            "A:no",
            "A:Fixed",
            "A:yes",
            "A:yes ..it's working perfectly",
            "A:no",
            "A:2017",
            "A:yes it has",
            "A:No.",
            "A:yes",
            "A:No",
            "A:LG LH462A",
            "A:No never LG 32 inch HD ready LED TV is not looks dark from side position. It's a nice experience for me to buy a LG TV and good delivery and fast installation and less in cost comparing to show rooms",
            "A:Good",
            "A:90",
            "A:no",
            "A:wall mount is provided by LG free of cost",
            "A:no installation engineer do this",
            "A:Non..it was boxed and well packed",
            "A:No",
            "A:Yes, it supports. i have tried once and now using mi box on HDMI port and working fine.",
            "A:yes",
            "A:Yes. It has wall mount bracket",
            "A:Yaa it's working perfectly.I am using Seagate 1Tb hard disk.",
            "A:single output 3.5 mm jack",
            "A:nope",
            "A:Yes",
            "A:no",
            "A:No",
            "A:To connect both devices simultaneously, you need to upgrade to HD box first.",
            "A:no",
            "A:No. LED is not smart tv",
            "A:yes...",
            "A:silver",
            "A:Yes.we can play all latest video formats through USB",
            "A:No problem",
            "A:A curved screen is developed for a more immersive viewing experience, regardless of the angle the screen is viewed from, as well as offering the latest color- and depth-enhancing technology.",
            "A:All TVs come with assured brand warranty up to 3 years. You can also get extended warranty at best price on select models",
            "A:HDMI ports are required to connect cable box or Blu-ray player or a video game console or a streaming gadget, or a smartphone/tablet. You can decide the number of inputs required as per your usage.",
            "A:no it's not smart tv",
            "A:Yes but not with th tv. For wall mount u can wait for technician who will come after delivery",
            "A:Yes"
        ],
        "likes": [
            "104",
            "6",
            "20",
            "2",
            "3",
            "0",
            "2",
            "20",
            "5",
            "5",
            "3",
            "0",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "83",
            "83",
            "3",
            "0",
            "5",
            "5",
            "5",
            "13",
            "0",
            "12",
            "0",
            "0",
            "2",
            "1",
            "1",
            "1",
            "8",
            "4",
            "7",
            "4",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "39",
            "3",
            "18",
            "0",
            "1",
            "0",
            "0",
            "25",
            "3",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "1",
            "5",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "35",
            "41",
            "0",
            "1",
            "2",
            "2",
            "2",
            "11",
            "0",
            "14",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "16",
            "6",
            "17",
            "8",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "5",
            "6",
            "4",
            "0",
            "0"
        ]
    }
}