{
    "title": "Thomson 123.2 cm (49 inch) Ultra HD (4K) LED Smart Android TV with In-built soundbar & Netflix  (49 OATH 9000)",
    "product_specification": {
        "In The Box": "1 TV Unit, 2 AAA Battery, Remote, Wall Mount, Manual",
        "Model Name": "49 OATH 9000",
        "Color": "Black",
        "Display Size": "123.2 cm (49 inch)",
        "Screen Type": "LED",
        "HD Technology & Resolution": "Ultra HD (4K), 3840 x 2160",
        "Smart Tv": "Yes",
        "Motion Sensor": "No",
        "HDMI": "1 Side, 2 Rear",
        "USB": "1 Side, 1 Rear",
        "Wi-Fi Type": "802.11a/b/g/n/ac",
        "Built In Wi-Fi": "Yes",
        "Launch Year": "2019",
        "Wall Mount Included": "Yes",
        "Brightness": "550 nits",
        "Contrast Ratio": "500000:1 (Dynamic)",
        "Picture in Picture (PIP)": "No",
        "Picture And Picture (PAP)": "No",
        "Analog TV Reception": "Yes",
        "Digital TV Reception": "Yes",
        "View Angle": "178 DegreeC",
        "Panel Type": "IPS",
        "Digital Noise Filter": "Yes",
        "LED Display Type": "DLED",
        "Aspect Ratio": "16:9",
        "Refresh Rate": "60 Hz",
        "Supported Video Formats": "MPEG1, MPEG2, MPEG4, H.263, H.264, H265, MVC, WMV, VC1, VP10",
        "Number of Speakers": "2",
        "Speaker Type": "Box",
        "Surround Sound": "Yes",
        "Speaker Output RMS": "30 W",
        "Sound Mode": "Off, Rock, Pop, Live, Dance, Techno, Classic, Soft",
        "Supported Audio Formats": "MPEG 1/2, AC3, EAC3, AAC, WMA, FLAC, MPEG5",
        "Other Audio Features": "Dolby Audio, DTS Digital Surround",
        "Number of Cores": "4",
        "Processor": "Quad Core A53 CPU",
        "Graphic Processor": "MaliT860 GPU",
        "Ram Capacity": "2.5 GB",
        "Storage Memory": "16 GB",
        "Supported App - Netflix": "Yes",
        "Supported App - Youtube": "Yes",
        "Supported App - Disney+Hotstar": "Yes",
        "Supported App - Prime Video": "No",
        "Supported Mobile Operating System": "Android, iOS",
        "Operating System Present": "Yes",
        "Operating System": "Android",
        "Screen Mirroring": "Yes",
        "App Store Type": "Google Play Store",
        "Pre Installed Browser": "Yes",
        "Wireless LAN Adapter": "Yes",
        "Bluetooth": "Yes",
        "3G Dongle Plug and Play": "No",
        "Ethernet (RJ45)": "1",
        "NFC Support": "No",
        "PC Audio In": "Yes",
        "Headphone Jack": "Yes",
        "Digital Audio Output": "Yes",
        "RF Connectivity Input": "Yes",
        "RF Connectivity Output": "Yes",
        "Touch Remote": "No",
        "Smart Remote": "Yes",
        "Color Screen": "Yes",
        "RF Capable": "Yes",
        "Internet Access": "Yes",
        "Battery Type": "2 AAA Batteries",
        "Power Requirement": "AC 100 - 240 V, 50/60 Hz",
        "Power Consumption": "130 W, 0.5 W (Standby)",
        "Other Power Features": "No Signal Power Off, Environmental Condition Temperature: 5 - 45 DegreeC, Environmental Condition Humidity: 20 - 80% RH",
        "Clock": "Yes",
        "Auto Power Off": "Yes",
        "Sleep Timer": "Yes",
        "On/Off Timer": "Yes",
        "Child Lock": "No",
        "Width x Height x Depth (without stand)": "1100 mm x 110 mm",
        "Warranty Summary": "1 Year Warranty",
        "Covered in Warranty": "Defect Arising Out of Faulty or Defective Material or Workmanship, Parts and Labour Cost is Covered",
        "Not Covered in Warranty": "The Product is Not Used According to Instructions Given in the Instruction Manual. Defects Caused by Improper Use as Determined by the Company Personnel. Modification or Alteration of Any Nature is Made in the Electrical Circuitry/or Physical Construction of the Set. Installation/ Repair Work is Carried Out by Persons/Agency Other than Authorized by the Company. Site (Premises Where the Product is Kept) Conditions that Do Not Confirm to the Recommended Operating Conditions of the Machine. Original Serial Number is Removed, Obliterated or Altered from the Machine or Cabinet. Defects Due to Cause Beyond Control Like Lightning, Abnormal Voltage, Acts of God or While in Transit to Service Centre or Purchaser's Residence. The Warranty Does Not Cover Any External Accessories (Such as Battery, Cable, Carrying bag Etc.) Mentioned in the Operating Instruction Manual Supplied with this Product or Any Cosmetic Parts",
        "Warranty Service Type": "Onsite",
        "Installation & Demo Details": "Please note that any unauthorized handling or self-installation of the product will lead to return & product warranty being void\nWe'll facilitate the installation and demo through authorized service engineer .The service engineer will install your new TV, either on wall mount or on table top. Installation and demo are provided free of cost.The engineer will also help you understand your new TV's features.The process generally covers: Wall-mounted or table-top installation, as requested.Physical check of all ports, including power and USB ports. Accessories also checked.Demonstration of features and settingsQuick run-through on how to operate the TV"
    },
    "product_description": {
        "Netflix with One Click": "The TV's remote has a dedicated Netflix button which gives you easy-access to the app and customized high-quality content in the comfort of your home.",
        "Immersive Viewing Experience": "Your favourite shows will now look more lifelike, thanks to the 4K content that this TV lets you indulge in on its 108 cm (43) display.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "4",
            "3",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "2",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "4",
            "5",
            "4",
            "5",
            "1",
            "5",
            "3",
            "5",
            "1",
            "3",
            "3",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "1",
            "1",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "3",
            "2",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "1",
            "4",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "1",
            "5",
            "5",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "1",
            "3",
            "3",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "1",
            "5",
            "1",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "1",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "3",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "4",
            "2",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "4",
            "3",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "1",
            "4",
            "2",
            "5",
            "1",
            "5",
            "4",
            "4",
            "2",
            "4",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "4",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "1",
            "5",
            "1",
            "1",
            "5",
            "5",
            "1",
            "3",
            "4",
            "4",
            "1",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "4",
            "5",
            "1",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "4",
            "1",
            "5",
            "5",
            "4",
            "1",
            "5",
            "2",
            "2",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "1",
            "5",
            "1"
        ],
        "review": [
            "I got this TV yesterday on 16 Jun 2019. Technician visited for demo and installation within 3 hours of delivery which is fantastic.\n\nObservations\n1. Price for 4K UHD licensed Android TV\n2. Clarity of picture : Great picture quality with SD channels as well. Bright colors and soft on eyes (Probably Samsung A+ panel effect)\n3. Sound : Good with Dolby effect listening to music with Dolby ON is good on ears.\n4. No prime video on Gplaystore, only side load I believe\n5. If you have STB and playing on HDMI input source you need to select SOURCE everytime your TV starts.\n6. Android loads in less than 30 seconds\n7. Complex remote with no guide.\n8. Google assistant button takes you to connect or pair Bluetooth device - probably this gets fixed with sw update instead of Google Assistant.\n\nOverall I am satisfied with the packaging of this TV at this price",
            "1) delivery - on time and installation on same day. 2) picture quality - can play 4K videos very well and clean. 3) sound quality - Dolby dts and 30watt is jem 4) build quality- upto the mark and front design is also good , base look like sound bar attached to the TV 5) value for money and can be more better if they will provide after sales service in future 6) connectivity- quickly connected to any device. if you have high wifi connection, then it will really rock, YouTube, Netflix, play store connects and open quickly. 7) starting time doesn't take much time. even these is any option for fast boot in menu. 8) there are so many options in video settings , please read e manual and try them. 9) colours - colours are bright and do not hurt your eyes. 10) suitable for distance 5ft and above. 11) wall mount stand is good and you can easily connect your hdmi cable as TV set on rod instead of steady wall mount stand. 12) only thing is that when I change my channel from sd to hd , there is something high frequency sound comes out of speakers. in overall TV is amazing. my previous TV was VU. but Thomson and VU are both of same category u can say. at least cheaper than big brands for same features and size. rest is mind set of purchaser. note - always buy extended warranty as panel is most important and expensive part of TV.",
            "good tv, good picture quality , good sound quality, everything is very good",
            "The product is really good and really smart. it has all features of a smart TV, like screen mirroring, Wi-Fi connectivity etc. Display is really good and video quality is quite high. its a good competitor for other high priced TV.",
            "After 4 months use of this TV writing this review. Fisrt I want to share negative things. I have buy 49 inch OATH9000 model. But this TV has no BEE Electricity Power Star(*****) rating. In picture setting options there is no option to reduce or enhanced colour changing options directly. Only u have to choose colour temperament options cool/Standard/warm. Or u have to set the picture colours by changing \"Saturation\" settings. Where difficult to set perfect colour. In online video(Youtube/Netflix) or USB Vedio there are no option to change colour/Brightness label. Which Brightness label is very high, not soothing for ur eye. No pictures mode options like Vivid/Soft/Sport/Cinema/Custom etc. But you can control Brightness indirectly in online videos(Youtube/Netflix) by changing Gama Control Dark/Middle/Bright in pictures setting options before online everytime. To reduce Brightness in online pls keep GAMA at Dark/Midle options. If u power off ur TV then every time you have to select HDMI source to see Set Top Box/DTH connection after power on TV. But if it is in stand by mode then it will automatically choose HDMI source. In Flipcart description 49 inch TV has 30watt speaker, But in manual it is written 10+10 watt Speaker. In Thomson website also written 20 watt. So wrong information in Flipcart. Now I am coming the good things about this TV. 1st of all value for money. 49 inch cost 28000. With 3yrs warranty cost 30000 by SBI card offer. This TV panel is IPS panel and very bright and quality is excellent. Brightness and contrast label is very high. Model look is good specialy with lower bazel soundbar. Sound in very loud and clear, sufficient at label 50% for living room. By adjusting Bass/Trible you can adjust sound output as per ur choice. 4k Vedios is excellent/Vibrant and smooth, No blur issues. HD channels are very good, SD channels are OK. You can't expect excellent view in 49 inch tv of SD chanel. bcoz SD channel resulation is low. But SD is good ok/good. Jeeves service center is available in almost all big/middle town area. No service issues. My town Burdwan jeeva's has service center. Thomson is not upto sony/Sumsung/LG by internal picture settings options. But panel and sound output are good as Sony/Sumsung/LG. Remote of this TV is very user-friendly and full functional. Connentivity also good. Cost is very economical if you compare with Sony/LG/Samsung. In online video if Full HD or 4K ultra it is excellent. I think my review is best in Flipcart. Pls read it before and after purchase ur TV. Subhajit Banerjee-Burdwan.",
            "awesome TV. what a mind blowing features with less cost and very good quality. sounds like home theatre. I watched 4k hollywood movies which was so great it's like a theatre effect. Go blind and buy this TV instead of buying mi, sony, tcl, viu, Lg and samsung. the picture quality was good. what surprise installation done within same day of delivery. wifi, bluetooth and other connectivities was very fast. TV booting very fast and video clarity was awesome. hence I conclude this is going break markets of mi, sony, lg and other TV companies. this is going lead entire television market in India future. kindly go for it and encourage thomson company it is India product.",
            "I got my \"Beast\" delivered last week and has been \"Sugar\" to Eyes as well as Ears. (y)\n\nSound, Voice, Connectivity all has been nearly perfect till date and I am optimistic that this would be the same in future many many years too on basis of my past as well as current experience. Seriously and in short, Trust is taken forward with Thomson that I had from past.\n\nThanks Flipkart and above all Thanks Thomson for having me the opportunity of buying this Outstanding in every aspect\" and \"Worth every penny\" product\"from you.",
            "Excellent Purchase from Flipkart and Superb VFM product from Thomson. Delivered in a day and installed the next day. picture quality is perfect and sound quality is noteworthy for a flat TV. easy connectivity on the back side and top of all Android interface is a cakewalk to use. toggle between dth and YouTube with voice commands. control your tv with Google home.",
            "The picture quality is amazing and at par with premium brands like Sony, Panasonic ( I have been using them before this TV) and sound is so pleasant with Dolby / DTS certified speakers.The only limitation I observed is no ARC for HDMI support. Otherwise, the best TV and value for money in terms of product. Good job by Thomson and recommend this TV for everyone, instead of wasting money by paying premium for other brand TVs in the market. I am sure Thomson TVs will give tough competition to competitors in the industry. Need to see how Thomson will provide after sales support, which is key for their success.",
            "Overall product is GOOD, Sound is really too good with DTS & Dolby system. Picture quality is best at this price that too 4K. Casting works superb with Google Home app in Mobile. Voice search is add on(save time of typing). I can't tell much about this, Coz in 2 days i ve found this much. Rest comments will be upload/updated soon once i gothrough with all option. Then only i can tell the advantage & disavange of this product.",
            "I got this TV yesterday on 16 Jun 2019. Technician visited for demo and installation within 3 hours of delivery which is fantastic.\n\nObservations\n1. Price for 4K UHD licensed Android TV\n2. Clarity of picture : Great picture quality with SD channels as well. Bright colors and soft on eyes (Probably Samsung A+ panel effect)\n3. Sound : Good with Dolby effect listening to music with Dolby ON is good on ears.\n4. No prime video on Gplaystore, only side load I believe\n5. If you have STB and playing on HDMI input source you need to select SOURCE everytime your TV starts.\n6. Android loads in less than 30 seconds\n7. Complex remote with no guide.\n8. Google assistant button takes you to connect or pair Bluetooth device - probably this gets fixed with sw update instead of Google Assistant.\n\nOverall I am satisfied with the packaging of this TV at this price",
            "1) delivery - on time and installation on same day. 2) picture quality - can play 4K videos very well and clean. 3) sound quality - Dolby dts and 30watt is jem 4) build quality- upto the mark and front design is also good , base look like sound bar attached to the TV 5) value for money and can be more better if they will provide after sales service in future 6) connectivity- quickly connected to any device. if you have high wifi connection, then it will really rock, YouTube, Netflix, play store connects and open quickly. 7) starting time doesn't take much time. even these is any option for fast boot in menu. 8) there are so many options in video settings , please read e manual and try them. 9) colours - colours are bright and do not hurt your eyes. 10) suitable for distance 5ft and above. 11) wall mount stand is good and you can easily connect your hdmi cable as TV set on rod instead of steady wall mount stand. 12) only thing is that when I change my channel from sd to hd , there is something high frequency sound comes out of speakers. in overall TV is amazing. my previous TV was VU. but Thomson and VU are both of same category u can say. at least cheaper than big brands for same features and size. rest is mind set of purchaser. note - always buy extended warranty as panel is most important and expensive part of TV.",
            "good tv, good picture quality , good sound quality, everything is very good",
            "The product is really good and really smart. it has all features of a smart TV, like screen mirroring, Wi-Fi connectivity etc. Display is really good and video quality is quite high. its a good competitor for other high priced TV.",
            "After 4 months use of this TV writing this review. Fisrt I want to share negative things. I have buy 49 inch OATH9000 model. But this TV has no BEE Electricity Power Star(*****) rating. In picture setting options there is no option to reduce or enhanced colour changing options directly. Only u have to choose colour temperament options cool/Standard/warm. Or u have to set the picture colours by changing \"Saturation\" settings. Where difficult to set perfect colour. In online video(Youtube/Netflix) or USB Vedio there are no option to change colour/Brightness label. Which Brightness label is very high, not soothing for ur eye. No pictures mode options like Vivid/Soft/Sport/Cinema/Custom etc. But you can control Brightness indirectly in online videos(Youtube/Netflix) by changing Gama Control Dark/Middle/Bright in pictures setting options before online everytime. To reduce Brightness in online pls keep GAMA at Dark/Midle options. If u power off ur TV then every time you have to select HDMI source to see Set Top Box/DTH connection after power on TV. But if it is in stand by mode then it will automatically choose HDMI source. In Flipcart description 49 inch TV has 30watt speaker, But in manual it is written 10+10 watt Speaker. In Thomson website also written 20 watt. So wrong information in Flipcart. Now I am coming the good things about this TV. 1st of all value for money. 49 inch cost 28000. With 3yrs warranty cost 30000 by SBI card offer. This TV panel is IPS panel and very bright and quality is excellent. Brightness and contrast label is very high. Model look is good specialy with lower bazel soundbar. Sound in very loud and clear, sufficient at label 50% for living room. By adjusting Bass/Trible you can adjust sound output as per ur choice. 4k Vedios is excellent/Vibrant and smooth, No blur issues. HD channels are very good, SD channels are OK. You can't expect excellent view in 49 inch tv of SD chanel. bcoz SD channel resulation is low. But SD is good ok/good. Jeeves service center is available in almost all big/middle town area. No service issues. My town Burdwan jeeva's has service center. Thomson is not upto sony/Sumsung/LG by internal picture settings options. But panel and sound output are good as Sony/Sumsung/LG. Remote of this TV is very user-friendly and full functional. Connentivity also good. Cost is very economical if you compare with Sony/LG/Samsung. In online video if Full HD or 4K ultra it is excellent. I think my review is best in Flipcart. Pls read it before and after purchase ur TV. Subhajit Banerjee-Burdwan.",
            "awesome TV. what a mind blowing features with less cost and very good quality. sounds like home theatre. I watched 4k hollywood movies which was so great it's like a theatre effect. Go blind and buy this TV instead of buying mi, sony, tcl, viu, Lg and samsung. the picture quality was good. what surprise installation done within same day of delivery. wifi, bluetooth and other connectivities was very fast. TV booting very fast and video clarity was awesome. hence I conclude this is going break markets of mi, sony, lg and other TV companies. this is going lead entire television market in India future. kindly go for it and encourage thomson company it is India product.",
            "I got my \"Beast\" delivered last week and has been \"Sugar\" to Eyes as well as Ears. (y)\n\nSound, Voice, Connectivity all has been nearly perfect till date and I am optimistic that this would be the same in future many many years too on basis of my past as well as current experience. Seriously and in short, Trust is taken forward with Thomson that I had from past.\n\nThanks Flipkart and above all Thanks Thomson for having me the opportunity of buying this Outstanding in every aspect\" and \"Worth every penny\" product\"from you.",
            "Excellent Purchase from Flipkart and Superb VFM product from Thomson. Delivered in a day and installed the next day. picture quality is perfect and sound quality is noteworthy for a flat TV. easy connectivity on the back side and top of all Android interface is a cakewalk to use. toggle between dth and YouTube with voice commands. control your tv with Google home.",
            "The picture quality is amazing and at par with premium brands like Sony, Panasonic ( I have been using them before this TV) and sound is so pleasant with Dolby / DTS certified speakers.The only limitation I observed is no ARC for HDMI support. Otherwise, the best TV and value for money in terms of product. Good job by Thomson and recommend this TV for everyone, instead of wasting money by paying premium for other brand TVs in the market. I am sure Thomson TVs will give tough competition to competitors in the industry. Need to see how Thomson will provide after sales support, which is key for their success.",
            "Overall product is GOOD, Sound is really too good with DTS & Dolby system. Picture quality is best at this price that too 4K. Casting works superb with Google Home app in Mobile. Voice search is add on(save time of typing). I can't tell much about this, Coz in 2 days i ve found this much. Rest comments will be upload/updated soon once i gothrough with all option. Then only i can tell the advantage & disavange of this product.",
            "Downgrading my rating to the lowest possible due to Thomson's pathetic after sales service.\nThis is related to the Thomson after sales service which is absolutely pathetic! I had an issue with the TV and required a Tech visit for repair/support. I even paid Rs550 for Tech visit as the TV is not in Warranty, but no one turned or even cared to contact me even after two weeks. Their toll free number is also unresponsive. Only thing that works is their Chat support, who escalate the issue to the concerned team and then someone just sends a mail saying they will work on the issue. But then it is back to same waiting game. I can't understand this level of apathy to one's own business. These guys probably outsourced their after sales support totally to third parties with absolutely no control over them or their SLAs. I guess it is a mistake to try with Thomson TV. It is better to stick to high quality brands like Sony, Samsung etc even if we have to go to higher price points.\n\n-----------\nGot the TV in 2 days from the day of order and installation was done professionally on the next day. Have been using the TV for 3 days now. Picture quality is superb. So far watched some high quality YouTube videos and very happy with the picture and sound quality. I haven't yet explored much of the video and audio options but the default itself is very good. Was able to easily connect to wifi and the apps. Actually pretty impressed with the signal reception on wifi both 2.4g and 5g. Yet to explore how to use Google assistant.",
            "TV is Good. Good Colors..\nAwesome clarity when playing 4K videos from YouTube.\n\nYou can control TV With Google android TV Remote via Phone..\nIt can connect Multiple devices same time with BlueTooth..\nIt has Voice Remote .. Pretty Good.\nPure Android.. No Bloatware or Anything..\n\nI haven't faced any Problem with TV Yet in last 7 Days.\n\nFew things i miss is..\nThey are claiming it has 30 W Speaker but Manual says it has 10W + 10 W two speakers.. So its just 20 W.. There No mention about Audio on TV Box.\n\nAmazon Prime video is not Available on Google Play Store but i have side Loaded ..\nSound is average.. Picture Quality is awesome..\n\nBut One More Important Thing is That \"TV is Manufactured India By Indian Company Which Hold License of French Brand. \"",
            "i ordered 49\" 4K Android tv and next day they delivered tv. Installation was also done on same day.but due to technical issue while starting Tv , i requested replacement.. They replaced the earlier tv with New Thomson Tv same model within 4 days..Now new Thomson TV is playing good and there is no issue... Picture quality n sound quality is very good..It has connectivity options like inbuilt Chromecast. Google voice assistance works well.. Overall good 4k Android Tv within this budget.",
            "i got this tv on 26 june i really impressed with the tv quality, my main uses of tv is watching uhd content and playing ps4, it is not a 10bit its 8bit panel, no HDR option in tv,not satisfied with tv speaker no detail and clear sound in speaker. Go for vu android tv it has 10 bit and HDR TV.",
            "Review after one week.\nThe best 4K Android TV in this price range.\nGreat picture quality and decent sound. No issue with connectivity.\nIssues faced are some YouTube videos appears with motion blur, may need to change picture settings like noice reduction manually to solve that issue and sound is not clear in low volume.\nOverall I am happy with the product.\nOn other hand Jeeves delayed installation by one day.",
            "Amazing TV, with excellent picture quality.....worth every penny.... Fast and excellent service by Flipkart / Thomson....same day they done the TV installation as well.....fully satisfied with the product and service by Flipkart.",
            "my observations\n1.picture quality is good. 4k movies look real. Hd content is also clear.\n2.you can sideload prime video. It works flawlessly.\n3. Bluetooth connectivity is superb.\n4.google assistant works good but not excellent.\n5.remote requires to be paired with TV through Bluetooth. installation boy was not aware of that. He took two hours to install TV. then he made video call to his senior who guided him how to pair TV with remote.\n6. Google assistant works only after pairing remote with TV.\n7.overall good value for money product.\n8. IPS panel helps in better picture in any viewing angle.\n9. Good competition to vu premium android.\n10. sound is good but not excellent. but I have external Bluetooth stereo system. so no need to worry , as it supports Bluetooth.\n11. I can watch movies at night even my family sleeping in same room as it can be paired with Bluetooth headset.\n12. please don't waste money on Sony, Samsung, LG , they will cost 25k extra for same specifications\n13. 2.5 GB ram is highest in competition.16 GB storage is also highest in competition. No lag or hang due to powerful processed.\nYOU WILL BE HAPPY PURCHASING THIS PRODUCT.",
            "Nice TV in this price range with good connectivity options. Decent picture & sound quality. Initially had some sound cracking issues while playing youtube videos. But after changing the Wifi band to 5hz on router, things were good. Installation was good. Giving 4. as I had to request a replacement for missing accessories & it took over 10 days to get replaced. Also missing Prime video & sideloading it does not play HD quality. Please include Prime Video & also update the OS to 9.0 to be latest & greatest. Overall a nice product compared to MI & Motorola Tvs.",
            "Completely satisfied with the TV. Display quality is awesome. Sound is excellent. Connectivity is quick and fast and stable. Chromecast feature is working fine without any issue. Earlier used MI TV and I can say that Thomson TV is 100% better than MI TV in all aspects.",
            "Since last 2 days i have been experienced very good with this newly bought Thomson TV. it was installed within 2 days of delivery. quality is good. moreover we are looking forward to have good experience. Very good product with this price.",
            "Both video and audio quality is excellent. Videos watched in youtube in 4k are awesome in quality and the sound quality is at its best. Each colour has its own depth and is unique from others. Major advantage is its 2.5GB ram and 16GB rom(internal storage). Dont think too much, one of the best tv's at this price tag. If your budget is arround 30k, just go for it..",
            "Quite happy with the product and the experience regarding flipkart's delivery and installation.\nPicture quality is really good.. 4k and hd video rendering is great.. sd content is also quite decent\n\nSound quality is also quite good..\n\nTV built looks strong and durable.\n\nA good variety of apps already available and the android support makes it very easy and convenient.",
            "Really Superb, Pictures Quality is awesome, Connectivity also Fine, 2.5 GB ram really super in fast & Smooth no lacking, Sorrouding Speaker out put really Super. I think no one Issue in this TV, really High End TV in Low Cost thank you Thomson. I seen Some Channel in Old TV not in view Good, but I am Watching same Channel in this TV Picture are fine with Upscaling for Example in Cricket match live coverage. Really Worth of Money.",
            "I bought the 43 inch model (43 OATH 1000) . Here are my observations:\n\n1. Picture quality particularly on Full-HD and 4K-HD modes are excellent. Below full-hd, you better use a good DTH service rather than local-cable.\n\n2. 30 W speakers are very good with excellent sound quality.\n\n3. I bought it on 10-07-2019. The delivery was on the next day, and installation was the day after that. OK, but it could have been faster.\n\n4. The service manuals, both E-manual and booklet supplied with TV need to be improved. Many functions are not explained properly.\n\n5. For using voice on Google assistant, the remote has to be paired to TV using bluetooth, which is not at all explained in both the manuals. Even the installation technician was unaware. I found the procedure online through google search.\n\n6. If your TV uses the same google account as your android phone, then there are some advantages, including better voice-recognition, installing TV apps through your home computer, etc.\n\n7. Overall, my initial experience is very good.",
            "I purchased the TV 2 months back. Following points are my take on the product.\n1. The Sound Quality (30 W) (8/10)\n2. Picture Quality Ultra HD 4K (8/10)\n3. Non 4k Quality ( 7.5/10)\n4. Looks : Plain and Simple\n5 Power Consumption: Low and affordable (9/10)\n6. Over-the top (OTT) Apps: Netflix, HotStar, SonyLiv, Youtube, Google Play Store , (Prime Video is not available need to download .apk for installation)\n7. Heating : no such heating problem observed in past 2 months\n8. Reboot time : 8-10 secs\n9. Display Panel : As per specs is A+ ( Gives you nice viewing angle, IPS could have been better, but you will barely be able to feel any difference)\n\n\nOverall the product is worth buying taking cognizance of the Selling Price. Wont regret.",
            "Nice Product from Thomson . excellent and budget product from thomson . good picture quality and sound quality from this budget . android tv is very useful for this generation. am happy with this purchase . thank u flipkart .",
            "The Perfect TV at the best price.\nEverything you need from a Smart TV!\nNetflix, YouTube n all the apps run smooth and without issues.\nPicture quality is great if you have HD connection and speedy internet.\nSound is the best you can ask for. No need for additional speakers!",
            "Purchased this TV within few days of its launch through exchange. Flipkart guys rejected my old tv saying that it has a light horizontal line. But I think it was default with the tv. Had to pay extra amount to get this TV\n\nTv has android latest feature. Sound bar in front of the tv gives a grand look. not many apps in Google play store. But you can install external apps using fs explorer.\n\nNeed improvement of Prime tv app with this tv. Other than this very good tv at this rate.\n\npros\nGood picture quality\nGood sound",
            "It's a good tv and value for money\npicture quality is good\nconnectivity is also good\nEverything is good",
            "My review after 23 days. I purchased TV on Oct 02, 2019.\n\n1. Installation and demo done on Oct 03, which is very quick and perfect\n2. Picture quality of TV is great.\n3. Sound (30 W speaker) quality is excellent.\n4. I can connect my mobile internet to TV within a second.\n5. Thomson TV is always best, compare to other smart TV.\nOverall I am happy with Thomson (55 inch) Ultra HD (4K) LED Smart Android TV. Definitely you can go for this.",
            "Worth of money.",
            "Worth of money.",
            "EXPECTED MORE BUT NOTHING SPECIAL\n\n*Picture quality is good.\nBut if you want to see the vivid colours please don't buy.\n* Hd and 4k contents are super\n*Pict...\nRead full review",
            "Very good purchase go for it. It’s work for ur money",
            "Good Product.\nThe TV is very good for the price range, i have used oneplus QLED Q1 and would like to compare with it.\n\n1) Picture Quality:\nQuality is excel...\nRead full review",
            "Worth buying a cinematic experience in such a minimal investment. I wouldn’t mind saying it a smart buying VU over any other brand. I replaced all LEDs of my...\nRead full review",
            "Clear sound, Not as good as jbl though.\nPicture quality is good. Easy installation.\nA good value for money.\nOverall a very good experience. Must buy.",
            "Facing difficulties with TV remote",
            "10sept2021, Post review after using for 10days..\nValue for money. Light on pocket and satisfied with TV experience\nSuper picture quality comparable with LG, ...\nRead full review",
            "Very nyc product...but no arc port nd prime video",
            "At this price point, the TV is good to have with easy connectivity and setup.\nPicture quality is good for the led screen(however you can compare another tv i...\nRead full review",
            "Tv and remote pairing is bad",
            "This tv is very nice,sleek design,good picture quality and dolbydts sound.this Infinex led tv is total value of money..must buy this product.i got its instal...\nRead full review",
            "Must buy this... Ossom t v.... Better than mi",
            "Good one, latest model tv , impressed with the specs",
            "Good one, latest model tv , impressed with the specs",
            "It is really a value for money. This is a 4K latest Anroid Smart TV just launched, TV is working fine with very high picture quality and the USP of this smar...\nRead full review",
            "Absolutely fine and very good clarity awesome 40w sound etc...",
            "Colour production is good , motion interpolation is perfect . It is va panel for 43 inch tv viewing angle is good, not ips as in description , sound quality...\nRead full review",
            "TV don't have Android operating system and don't have magic remote. Other wise all good",
            "I have purchased this TV on the occasion of Diwali festival season. They have delivered in advance before scheduling date. Very quick service. Sound and pict...\nRead full review",
            "Installed on 03-Mar-22. Yet to get experience of viewing. Shall post after two weeks.",
            "So I bought this TV last week. And I already knew the why and what of this product. Why to buy it and what to expect out of it. Actual user experience is of ...\nRead full review",
            "Overall Experience is good",
            "I'm already a user of INFINIX, I'm using infinix phone. So it wasn't hard for me to trust on this brand. Then i bought 43\" LED and was found as good as i was...\nRead full review",
            "Worst ever purchased, because tv remote not working properly, if i click on power button to switch on but it's no power on, then i use home button in tv,.",
            "Lokesh from Benchmark Infotech has done successfully installation of TV.\nI am happy with his services. Good behaviour and make me understand the TV features....\nRead full review",
            "The review (edited after installation) is primarily about the installation service. I have not used the product yet since it has not been installed and the i...\nRead full review",
            "We purchased sansui product first time...justnow installed, tv looking good and all features available ...picture quality superb...purchased during big billi...\nRead full review",
            "What a terrible service is being provided from both Flipkart & Sansui . This TV was delivered on Mar 17 and same was installed by next day . From the beginni...\nRead full review",
            "not very nice. just ok waste of money sound is very poor",
            "not very nice. just ok waste of money sound is very poor",
            "Great product in the budget. Great picture quality with sound and connectivity. Do not go for a China product rather buy Panasonic. It's a very old brand fro...\nRead full review",
            "So many problems after usage of 6months.better to go for another brand.",
            "Excellent tv at this price... Just go for it.... LG has done a great job with its amazing picture quality and fabulous sound. Might need a sound bar.... If i...\nRead full review",
            "Reached in time\nGood features",
            "Worth it to buy. I have relied on the brand COMPAQ. I got it in 27k. More than enough and sufficient in the price range",
            "Worth it to buy. I have relied on the brand COMPAQ. I got it in 27k. More than enough and sufficient in the price range",
            "I m using this tv from last 8 month and my experience was not to good and toshiba promise us at the time of launched for updates ( Disney hot start, sony l...\nRead full review",
            "Product quality is very poor and does not have quality like brand product.\n\nHaving facing sensor issue and company technician is not able to solve this issue.",
            "Writing this review, after almost a month of using it, previously I have used the realme sled tv too, so I have the idea of how TV's are in this price range,...\nRead full review",
            "Amazing product in this price range. Loved it👍",
            "Very nice product worth for money",
            "Sound quality is not good.",
            "It's really amazing choice...Thanks to samsung. I choose installation with samsung by help of customer care and it worked superb for me. This tv features are...\nRead full review",
            "Excellent product value for money.\nGood quality.\nGood installation experience from samsung engineers.",
            "Over all a good tv.exept sound quality.",
            "Over all a good tv.exept sound quality.",
            "Splendid product, nice installation system within few hours, vibrant colours filled with nature like pigments.\nThanks# Samsung India ,# Flipkart.",
            "Very good TV, great picture quality, awesome sound, surprisingly I found Tizen much better and faster than Android TV. The picture quality is so good that it...\nRead full review",
            "I can purchase this Product...It is a good quality and awesome Android Tv... I'm really so happy.. Thank you very much flipkart..You know your service is ver...\nRead full review",
            "It's not working properly.\nIt's gone before a 4months",
            "TV is awesome and desire for a needful customer which demand in TV\nand I am happy to see audio jack its amazing to connect home Theatre enjoy movies and vedi...\nRead full review",
            "Excellent picture quality and sound, i am so glad.",
            "Nice tv with an elegant display,also userinterface of webos is good,just oneday,but overall valuable product",
            "Nice tv with an elegant display,also userinterface of webos is good,just oneday,but overall valuable product",
            "TV is good but the installation service is poor. 1. Technician doesn't know how to fish through wire into conduit to bring power wire behind the TV. 2. Te...\nRead full review",
            "Very much satisfied with the performance of the TV. But the guy who has come for installation was very rude and arogent.",
            "(Update : Those who have disliked my review for what I said, yes that was a fact Q90T suffers from absolute clouding and blooming and its quite noticeable if...\nRead full review",
            "Febulos and awesome 👍👌 OLED tv and highly recommend to go ahead for this LG OLED BX55TPA model.",
            "Dear All,\nThe overall review is good, but the delivery and installation was too late and almost waited for 2 weeks. The tv picture clarity and sound is good ...\nRead full review",
            "Picture and sound is amazing",
            "The TV is good.\nBut does not contain smart remote.\nHence, you can not operate Google assistant mic from the remote given with TV. You need to buy another sma...\nRead full review",
            "Exlent very good happy this 📺📺📺📺",
            "As per price.. it's may be the best..",
            "perfect smart TV for this range... gud quality nice tv.",
            "Actual image of my Android TV from iFFALCON (TCL) 1). Picture quality very sharp & great black colour to enhance viewing angle. 2). Sound is enough loud. no ...\nRead full review",
            "Product is really good.....",
            "The BEAST you can bring to your home! Sony leads any brand for it’s picture clarity! This takes audio to whole new level!! The google tv experience has been ...\nRead full review",
            "Premium product. You will enjoy watching movies. Do some sound setting according to your envoirment.",
            "Good",
            "Good",
            "11 days and still no one came to install.",
            "DO NOT IGNORE MY COMMENT, IF YOU BUYING 41INCH TV PLEASE BUY WITH AT LEAST 1920*1080 resolution. Not 1366*768, never. I repeat, NEVER",
            "Took this TV on the launch offer and got delivered on time.\nThe packing was good and the delivery boy helped in unpacking and mounting on the table. Later th...\nRead full review",
            "Picture quality, sound and connectivity is good.",
            "Lg a1 oled is a fantastic tv with exceptional picture clarity and very good for watching movies. Of course it is not as bright as lg cx and other 2021 oled m...\nRead full review",
            "Barring the worst service by Flipkart TV is the best I have experienced. Awesome picture and sound, best display for a movie of a UHD video. 4K media looks u...\nRead full review",
            "It is really a value for money. This is a 4K latest Anroid Smart TV just launched, TV is working fine with very high picture quality and the USP of this smar...\nRead full review",
            "Absolutely fine and very good clarity awesome 40w sound etc...",
            "Good product and valve money",
            "Good product and valve money",
            "Nice TV......Reasonable Price.......\n\nI ordered this TV on 21st Oct and got it delivered on 22nd morning. Thanks flipkart for great service. The installation...\nRead full review",
            "It's a great tv for 32inch fhd segment.ideal for small rooms and bedrooms.\n1.picture quality was very good.especially on full hd content,Netflix and xbox gam...\nRead full review",
            "You are going to love this Tv because at this price range it is almost a complete package(does not have Bluetooth connectivity) but picture mode option shoul...\nRead full review",
            "Worst customer/ installation service. Nobody turned up for installation after repetitive follow up and finally I had to return the product. Only one man hand...\nRead full review",
            "good product good delivery",
            "Good quick service.thanks",
            "Picture quality is average, at every angle not like a qled tv. I think its panel is B grade. Picture settings needs very fine adjustment. Sound is average. H...\nRead full review",
            "very good performance. Don't go by negative reviews. I purchased it. You definitely enjoy the picture quality with the lowest cost which no brand can sell.",
            "Great LG 55 inch smart IPS LED TV. Wow... What a picture quality.... Screen mirroring works like a charm... Thanks Flipkart for this great product on your sh...\nRead full review",
            "Best TV in the budget, Overall review is 4.5 out of 5. Best picture and sound clarity. Additional USB port would have been much better.",
            "coocaa 43s6g pro my frist tv is screen problems .\nbut Flipkart is Replace new tv...this tv picture quality is very good ,\nsound is average .but good .. hol ,...\nRead full review",
            "Nice quality and nice product....",
            "Stark Review :\nBeen 3 months since the purchase. Bang for buck TV it is. QLED at thir price from a reputed brand of TCL is a well made decision.\nPros :\n1....\nRead full review",
            "Stark Review :\nBeen 3 months since the purchase. Bang for buck TV it is. QLED at thir price from a reputed brand of TCL is a well made decision.\nPros :\n1....\nRead full review",
            "first I worried about picture clarity when I booked....... but I don't have other option with this price........ after watching the 4k content mind blowing.....\nRead full review",
            "I am not satisfied with the product although picture quality is good but is not long lasting i bought this tv in 2019 but lots of problems I am facing with t...\nRead full review",
            "Best 4k tv in this price range.\n\nPros :\n1. Excellent picture quality. 4k videos looks awesome\n2. Superb sound quality. It comes with true theatre like sound....\nRead full review",
            "The software update for the tv is not frequent, also unable to update the apps in the TV, and some New apps are also not Available",
            "It's really amazing choice...Thanks to samsung. I choose installation with samsung by help of customer care and it worked superb for me. This tv features are...\nRead full review",
            "Excellent product value for money.\nGood quality.\nGood installation experience from samsung engineers.",
            "Delivery timing perfect Thank you Flipkart",
            "Delivery timing perfect Thank you Flipkart",
            "The picture quality is good and it has problem with viewing angle, if you sit in front of tv then picture quality is great but if angle changes then it has s...\nRead full review",
            "TV is awesome and watching in that is mesmerising moment when I started my TV.\n\nPicture quality and sound is Very good",
            "TV is good but the installation service is poor. 1. Technician doesn't know how to fish through wire into conduit to bring power wire behind the TV. 2. Te...\nRead full review",
            "Very much satisfied with the performance of the TV. But the guy who has come for installation was very rude and arogent.",
            "Good Product.",
            "Good Product.",
            "I bought this tv 1 month back. I played HDR and 4K content from Netflix. Picture quality is superb.\n\nI can strongly suggest this tv.",
            "I bought this tv 1 month back. I played HDR and 4K content from Netflix. Picture quality is superb.\n\nI can strongly suggest this tv.",
            "Fast delivery by flipkart and with very good deal.\nPurchased on 17thoct, picture quality is so good in this price range as expected from sony. But this time...\nRead full review",
            "This model is good but SONY has deliberately not provided Bluetooth connectivity to high power devices like headphones and soundbar systems that use wireless...\nRead full review",
            "this is a good product",
            "this is a good product",
            "Very good value for money.",
            "Very good value for money.",
            "About the Product: LG OLED55C8PTA\n\nPros:\n1. Stunning Picture. Period.\n2. Beautiful Upscaling to 4K.\n3. Simple and Slick Interface\n4. LG Smart Share/Plex wo...\nRead full review",
            "Best TV in the market. Need to be careful with the burn-in and not watch a lot of content with static logos.",
            "Left speaker defected making so much noise 👺👺👺",
            "Left speaker defected making so much noise 👺👺👺",
            "Go for this TV if you want vibrant colours. The black levels on this TV is pathetic and poor .There is no black level , it can be said as grey level. The col...\nRead full review",
            "Please go for OLED because difference is not much inbetween Nanocell and OLED. After the purchase I found OLED picture and sound quality far better than LG N...\nRead full review",
            "NOTE : This perticular \"Vu MODEL\" is not available in any of the outlets for a reason. When all the other models of \"Vu\" are sold in stores why this perticul...\nRead full review",
            "everything works very well .",
            "Very nice picture and sounds quality, great experience with the Product!",
            "Product was delivered with up most care. Delivery was zippy, got it with in 12 hours of placing the order. Giving four stars because Installation and demo te...\nRead full review",
            "great product at unbelievable price",
            "great product at unbelievable price",
            "Pure depth black levels, true color display. OLED stands apart with an amazing speaker config with really professional and friendly installation experience",
            "Pure depth black levels, true color display. OLED stands apart with an amazing speaker config with really professional and friendly installation experience",
            "Delivered in Good condition, quick delivery & installation. TV is working well.",
            "Delivered in Good condition, quick delivery & installation. TV is working well.",
            "What a amazing tv of all it is an best tv from all i loved so i buy two tv together ✌️???",
            "I am using 3years it's good product in the price range thanku flipkart...",
            "Got it on 21st Dec and Installation was done on 22nd. Thnak you for quick and good service. Sharing my views after two days of usage.\nTv works great, loved i...\nRead full review",
            "Great product at this price",
            "Video quality is best.... sounds also",
            "Most third class TV don't buy it",
            "One of the best TV in the UHD 4K segment. Can enjoy Visuals in crystal clear display. Value for money.",
            "Samsung need to work on smoothness in low budget smart tv as well. RAM can be increased to 2 GB. Otherwise overall is best.",
            "Hi !\n\nA great experience on it's first appearance. The TV was ordered on 19/1/2019 during the Repulbic Day Sale, and flipkart/ekart delivered it to me on 2...\nRead full review",
            "Awesome tv go for it.. Bezels are minimal nice viewing angle",
            "What an amazing tv it has everything the budget tv should have . First of all thanks to flipkart for very fast delivery and installation by jeeves.Coming to ...\nRead full review",
            "Nice and good picture quality...Good processor",
            "Problem with casting.. another app have to installed to cast phone screen to tv. If ph is old then no need to install any app for cast screen.. for new m...\nRead full review",
            "It's a very nice tv, connectivity, picture quality every thing is fine,value for money",
            "Really very nice and very very good product this Compaq 43 inch tv so I'm very happy this tv also clarity picture and loud speaker and mobile hotspot very qu...\nRead full review",
            "Worst Product and worst service....don't purchase it..you will cry out...have returned this product after screen went off suddenly in few months...",
            "Buying this on the launch day was a slight risk as there were no reviews or ratings but thankfully my decision was correct.. I am so happy to buy this tv... ...\nRead full review",
            "Worst purchase ever\nIf you're looking for tv above 50k go for brands like sony\nTv isn't turning on after 13months",
            "Fully satisfied with my purchase, watching prime and you tube is ultimate experience. Although wall mount is not provided in the box.\nUI is simple and lucid....\nRead full review",
            "Fully satisfied with my purchase, watching prime and you tube is ultimate experience. Although wall mount is not provided in the box.\nUI is simple and lucid....\nRead full review",
            "Really simply superb\nSlim and sleek quality everything awesome\nBut Flipkart response poor\nBut tv was excellent\nRecommend",
            "I buyed this TV back in 2017 June 24th and still its the best TV I have seen",
            "I have purchased sony bravia 4k led. On Flipkart . Market . I goted delivery required my time period. My home is out of satation at dediyapada Rajpipda. It i...\nRead full review",
            "The product was delivered on time and installation completed before the promise date. I m very satisfied with the service of Flipkart and Sony installation t...\nRead full review",
            "Flipkart has provided false information regarding the features of this product.\nThere is no - WIFI, no Netflix, no YouTube etc.\nThis is just a normal TV with...\nRead full review",
            "Flipkart has provided false information regarding the features of this product.\nThere is no - WIFI, no Netflix, no YouTube etc.\nThis is just a normal TV with...\nRead full review",
            "Its been a month I am using this TV, I also have a Panasonic UHD 4K TV and my honest review is as below\n\nPros\nBetter than Chinese Brands and at par with lea...\nRead full review",
            "Outstanding work any time",
            "Thanks to flipkart for offering such a gorgeous tv at such an affordable price... Got it delivered before due date & installation was also done properly by t...\nRead full review",
            "Thanks to flipkart for offering such a gorgeous tv at such an affordable price... Got it delivered before due date & installation was also done properly by t...\nRead full review",
            "Nice product and design awsome .pichure quality very good",
            "Good product iam happy with this 😀",
            "Colour production is good , motion interpolation is perfect . It is va panel for 43 inch tv viewing angle is good, not ips as in description , sound quality...\nRead full review",
            "TV don't have Android operating system and don't have magic remote. Other wise all good",
            "Excellent picture quality and sound and awesome flipkart experience",
            "Super delivery,super installation, quality is good, sound quality good but I got issue in EMI option",
            "Amazing item within Rs. 11,500/-. Unbelievable.",
            "Product not good about 1 month issue creat in the screen and not solved problem from philip card",
            "Nice tv picture quality good & sound is to good screen minoring is not available",
            "Picture quality is good but facing some issues with installation for one week. Present condition is okay in future we need to what's the condition or worth f...\nRead full review",
            "First of all I would say this TV is a bang for the money. I thought a lot before getting this TV but I finally took a bold step. First impression was amazing...\nRead full review",
            "Review After 2 yrs of usage: overall OK\n\n\nPros: cheap rate, air mouse\nCons: poor sound quality, no android update, slow system response, app response is very...\nRead full review",
            "A complete value for money as compare to high-end brands. I checked the 4K videos on net ( all LG, Sony, Samsung), the picture quality is really good. Happy ...\nRead full review",
            "very Good and quality product, value for money, flipkart delivery and service was very awesome. pls go for it",
            "Overall a nice pick amongst other brands. It gives you superb colors thanks to it color gamut you can actually get the difference between different shades of...\nRead full review",
            "Nice Panasonic led TV I have to use this TV performance good to purchase now...",
            "MI and flipkart has Great product @ low price\nWriting a review after 1 month of usage\n1. Mi 32 inch horizon edition android Tv is awesome at this price.\n2. ...\nRead full review",
            "Good prodact and good service",
            "Low price with high quality product!!!\n\n1. Good deal I bought this for 59,990.\n2. Flipkart delivered this product within 2 days of order and Samsung technic...\nRead full review",
            "Samsung TV don't buy this model",
            "I bought this product few days ago, Awesome product.... nice picture quality bt sound quality is average, sound quality needs to improve. Others are awesome ...\nRead full review",
            "good sound good picture quality\nand indian brand",
            "Have been using Samsung TV over the years....this one is also pretty good 4K quality is good, sound quality is also good for 20W speakers...some may need to ...\nRead full review",
            "Have been using Samsung TV over the years....this one is also pretty good 4K quality is good, sound quality is also good for 20W speakers...some may need to ...\nRead full review",
            "Nice product good display\nAnd sound connectivity",
            "Nice product good display\nAnd sound connectivity",
            "PROs\n1) great picture quality for this price.\n2) it supports almost all formats.\n3) sound is good.\n4) borders are thin, design is simply elegant. even logo i...\nRead full review",
            "There is issue in wifi connectivity some times it's showing wifi is not connected. Please fix this issue. I face major issue is this and another one mirror s...\nRead full review",
            "Product is very good quality",
            "Product is very good quality",
            "Its been 3 months of purchase and its working fine and quality is much clear ..in this price range its is like diamond",
            "In this price it is nice product, thank u flipkart 🤝",
            "this product is nice by t-series",
            "Good product but wall mount not deliver with tv",
            "If you are under 15k budget, you want HD quality screen.. this is it (its Full HD).\nScreen looks like a computer LCD monitor pitch dark black, very good qual...\nRead full review",
            "Good product. Works well even after 4 years.",
            "I am genuinely giving my review on this product after' using it for five months. It's Nice product. Nice colours . Nice sound quality, Nice all smart tv func...\nRead full review",
            "Very good product excellent results",
            "Terrific purchase !! Sound and picture clarity are too good ..",
            "The product is really nice and worth it.\n\nI have been using it from a long time and display is really good.",
            "One of the best choices for 22 Inch TV :\n1- Its Full HD and produces lovely sharp crisp pictures many people say that small TV screens doesn't matter if its ...\nRead full review",
            "Do not buy this product. Picture quality ia not good. I bought in 2018 and now suddenly the display is blurred. Till now the tvs which I used have no issues ...\nRead full review",
            "Fast delivery by flipkart and with very good deal.\nPurchased on 17thoct, picture quality is so good in this price range as expected from sony. But this time...\nRead full review",
            "This model is good but SONY has deliberately not provided Bluetooth connectivity to high power devices like headphones and soundbar systems that use wireless...\nRead full review",
            "I m from nepal...rgl led tv gifted from my mama....aare Vai Kya super tv...hai yarr.. Samsung lg sab ka baap hai he tv.... thank you so much RLG ❤️❤️",
            "This Tv is awesome...👍 But the company does not provide any software updates or upgrades.",
            "Very good product and very good support customer service",
            "Excellent and Futuristic TV.",
            "Dream came true.\nVery good Smart TV within budget. No need to purchase Chinese & Korean company product, Indian company much better.\nVery good price, pictu...\nRead full review",
            "Nice product good picture quality",
            "Lg a1 oled is a fantastic tv with exceptional picture clarity and very good for watching movies. Of course it is not as bright as lg cx and other 2021 oled m...\nRead full review",
            "Barring the worst service by Flipkart TV is the best I have experienced. Awesome picture and sound, best display for a movie of a UHD video. 4K media looks u...\nRead full review",
            "Hi !\n\nA great experience on it's first appearance. The TV was ordered on 19/1/2019 during the Repulbic Day Sale, and flipkart/ekart delivered it to me on 2...\nRead full review",
            "Awesome tv go for it.. Bezels are minimal nice viewing angle",
            "TCL C2 US is one of the evry exceptional TV's. The follwoing attributes details regarding the TV after 4 months of usage.\n1. Picture\nThe picture is extremem...\nRead full review",
            "Well it goes bust as soon as warranty gets over",
            "I am have with delivery and delivery boy was good attitude",
            "I am have with delivery and delivery boy was good attitude",
            "It's a very good Smart TV with in budget. Picture quality was too good. I'm satisfied with overall performance of the TV .Installation was too good. Thank yo...\nRead full review",
            "SOME FUNCTION IS NOT WORKING FROM DAY 1 LIKE WIFI AND MIRACAST",
            "The BEAST you can bring to your home! Sony leads any brand for it’s picture clarity! This takes audio to whole new level!! The google tv experience has been ...\nRead full review",
            "Premium product. You will enjoy watching movies. Do some sound setting according to your envoirment.",
            "LG has a monopoly on the OLED TV market and this CX shows it why.\n\nI have been using it for around 15 days now, here's the pros and cons:\n\nPros -\n-OLED panel...\nRead full review",
            "Tv is not perfect after 6 month lining on the screen & high price tv",
            "Edit: I have received calls from Thomson asking to give a 5 star rating for 3 months extended warranty. So most reviews could be bought ones. I have tried to...\nRead full review",
            "Reviewing after 3 years.\nBiggest drawback is that it's not running on latest version of android OS nor got the OS update in 2 years, most of the OTT apps are...\nRead full review",
            "Amazing item within Rs. 11,500/-. Unbelievable.",
            "Product not good about 1 month issue creat in the screen and not solved problem from philip card",
            "Nice tv picture quality good & sound is to good screen minoring is not available",
            "Picture quality is good but facing some issues with installation for one week. Present condition is okay in future we need to what's the condition or worth f...\nRead full review",
            "First of all I would say this TV is a bang for the money. I thought a lot before getting this TV but I finally took a bold step. First impression was amazing...\nRead full review",
            "Review After 2 yrs of usage: overall OK\n\n\nPros: cheap rate, air mouse\nCons: poor sound quality, no android update, slow system response, app response is very...\nRead full review",
            "A complete value for money as compare to high-end brands. I checked the 4K videos on net ( all LG, Sony, Samsung), the picture quality is really good. Happy ...\nRead full review",
            "very Good and quality product, value for money, flipkart delivery and service was very awesome. pls go for it",
            "The TV is good.\nBut does not contain smart remote.\nHence, you can not operate Google assistant mic from the remote given with TV. You need to buy another sma...\nRead full review",
            "Exlent very good happy this 📺📺📺📺",
            "MI and flipkart has Great product @ low price\nWriting a review after 1 month of usage\n1. Mi 32 inch horizon edition android Tv is awesome at this price.\n2. ...\nRead full review",
            "Good prodact and good service",
            "I bought this product few days ago, Awesome product.... nice picture quality bt sound quality is average, sound quality needs to improve. Others are awesome ...\nRead full review",
            "good sound good picture quality\nand indian brand",
            "This is after 2 weeks of using, and comparing with 4 other TVs bought in past - Sony 4k android, Sony 4k Smart, LG Full HD, Marq by Flipkart. Since using Son...\nRead full review",
            "It's a good tv I was confuse in one plus and mi but now I am satisfied with MI",
            "Writing this review for those who willing to buy a new LED at this price.\nI am using this TV since 5 days.\n\nPicture quality- HD channels are so good and SD c...\nRead full review",
            "Very good product and the delivery was perfect.",
            "Nice product good display\nAnd sound connectivity",
            "Nice product good display\nAnd sound connectivity",
            "super product.. picture & sound quality is so good with joy plus features.\nfast delivery. I got the product within two days of order. I am satisfied with Sam...\nRead full review",
            "Good delivery and installation system.",
            "PROs\n1) great picture quality for this price.\n2) it supports almost all formats.\n3) sound is good.\n4) borders are thin, design is simply elegant. even logo i...\nRead full review",
            "Need to return it. Complete wastage of money",
            "Product is very good quality",
            "Product is very good quality",
            "Its been 3 months of purchase and its working fine and quality is much clear ..in this price range its is like diamond",
            "I have purchase on date 18-04-2022, till no body come for installed it & sending tiwari numbers but he doesn't response for call. It's a humble request to yo...\nRead full review",
            "Low price with high quality product!!!\n\n1. Good deal I bought this for 59,990.\n2. Flipkart delivered this product within 2 days of order and Samsung technic...\nRead full review",
            "Samsung TV don't buy this model",
            "Horrible remote. There's a 2 second lag between the remote key and reaction. High resolution videos often lag. Netflix stopped working after a week, had to f...\nRead full review",
            "Super..... excellent product.......worth for money",
            "very very nice Micromax Canvas 3 pro LED TV picture quality awesome and sound is very loud I am so impressed this TV YouTube very nice working and jio TV goo...\nRead full review",
            "2018 October I bought but 22nd July 21 it is not working and customer care numbers are not working.",
            "this product is nice by t-series",
            "Good product but wall mount not deliver with tv",
            "One of the best choices for 22 Inch TV :\n1- Its Full HD and produces lovely sharp crisp pictures many people say that small TV screens doesn't matter if its ...\nRead full review",
            "Do not buy this product. Picture quality ia not good. I bought in 2018 and now suddenly the display is blurred. Till now the tvs which I used have no issues ...\nRead full review",
            "i got this product on the second day after i orderd. just love the product and its great features. you wont get such best quality tv from any other brand in ...\nRead full review",
            "Definetly worth the money.. It's been 2 years and i am very happy that i chose this one",
            "I am genuinely giving my review on this product after' using it for five months. It's Nice product. Nice colours . Nice sound quality, Nice all smart tv func...\nRead full review",
            "Very good product excellent results",
            "Terrific purchase !! Sound and picture clarity are too good ..",
            "The product is really nice and worth it.\n\nI have been using it from a long time and display is really good.",
            "Giving this review after two days of use. Very happy with the product, flipkart quick delivery and the installation. As per the promotional offer from hisen...\nRead full review",
            "Good TV. Sharp and clear picture. I don't use the built-in audio system of the TV; instead have hooked the TV to my AV Receiver.\nVery satisfied with the p...\nRead full review",
            "Good choice led tv",
            "Good choice led tv",
            "Fast delivery by flipkart and with very good deal.\nPurchased on 17thoct, picture quality is so good in this price range as expected from sony. But this time...\nRead full review",
            "This model is good but SONY has deliberately not provided Bluetooth connectivity to high power devices like headphones and soundbar systems that use wireless...\nRead full review",
            "Market is flooded with cheaper Led's. If you are looking for a brand, best service and peace of mind..go for this.\n\nTV was delivered on time and promptly ins...\nRead full review",
            "I bought this in October 2018 and it is doing good even in the 3rd year",
            "GOOD PRODUCT",
            "GOOD PRODUCT",
            "best of this price... 11400",
            "best of this price... 11400",
            "Very Nice picture quality,slim TV in low price thanks to flip kart.",
            "Very Nice picture quality,slim TV in low price thanks to flip kart.",
            "Excellent performance. Picture quality much better than my other full HD Samsung and VU TVs. It is having DVB T2 tuner inbuilt and I am receiving 5 DD channe...\nRead full review",
            "all in one super good product",
            "Nice product..one of the best television at reasonable price..loved it.. packing perfectly fine..on time delivery thanks to seller and Flipkart..",
            "Value for the money. Recommended",
            "owsome Led very nice color",
            "owsome Led very nice color",
            "The TV built is simple and sleak in the front with a Clear Display. The picture quality is good , no issues with Pixelet. Sound quality is OK which is a know...\nRead full review",
            "Waiting this preview after using for about 3 years....definately good choice...go for it....only thing lagging is sound is bit low need speakers support....f...\nRead full review",
            "TV is good but the installation service is poor. 1. Technician doesn't know how to fish through wire into conduit to bring power wire behind the TV. 2. Te...\nRead full review",
            "Very much satisfied with the performance of the TV. But the guy who has come for installation was very rude and arogent.",
            "Bought this for parents, they love the TV. It was easy to use for my parents and 50' is a great size for viewing at distance. The sound however was softer co...\nRead full review",
            "Nice, But some movie formats are not supported by tv while playing through a USB Flash drive.",
            "Onkya speaker are osmmm... I am feeling like home theater. And picture quality is very nicee... I hve used google assistant to speak 🗣to find my fav songs,...\nRead full review",
            "The issue is with volume. It is either high or low. There is nothing in between called medium volume. The updates wont also fix anything . But this is minima...\nRead full review",
            "Picture and sound quality is good.\n\nNot sure why LG mentioned the energy star rating as just single star while smart energy saving feature is there.\n\nInstal...\nRead full review",
            "Excellent product, Nice Display, Best function & Connectivity",
            "After months of research, I had finalized on buying LG UH750T but then I received a lot of advice from people against spending so much money for buying a 4K ...\nRead full review",
            "nice tv and songh is very nice",
            "The LED TV is OK. It is worth for the money. The picture quality and sound is good. FlipKart service is also good.\nBut the installat...\nRead full review",
            "Stopped working within a year..got it repaired under warrenty.... in another 6 months.... half of LED is gone.................. waste product",
            "Prompt delivery and installation. Got an amazing deal thanks to Flipkart.\n\nVibrant display and good sound quality which is kind of expected from Samsung. Th...\nRead full review",
            "grateful thanks to Samsung",
            "very good as per the price of 18000 . Delivery was very fast and excellent . installation workers were also very good and cooperative and did the installatio...\nRead full review",
            "Very good product must buy it height and length is also excellent",
            "I deliberated a lot whether to go for a cheap Chinese brand or a premium brand. I had heard enough horror stories from friends\nabout the poor quality of Chin...\nRead full review",
            "It's very nice quality and sound system also thanks for Samsung Super 6 Tv",
            "i received the product on the third day i ordered and the delivery staff was so polite and the installation was done very soon after the delivery.\n\nregardin...\nRead full review",
            "This is a long term review after usage of almost 5 years. I can definitely say it is value for money. I don't know if it is still available but if you get th...\nRead full review",
            "Very nice indian tv. This tv delivered 9 days.\nThis led tv prize low and all type help cotomer care\nI am very happy thanks flipkart.",
            "very bad product can't buy it\nit's mother bord is damage\nwhen I Camplane to company\nhe gave mother bord damage\nwaste of money\ncan't buy it",
            "I got this TV yesterday on 16 Jun 2019. Technician visited for demo and installation within 3 hours of delivery which is fantastic.\n\nObservations\n1. Price fo...\nRead full review",
            "Not recommended\nI purchased this 1 year before, and after that display flickering problem started, panel problem occurred. Fortunately I have taken warrant...\nRead full review",
            "The product is awesome. Total value for money. As it is a TATA product and also made in India, it comes with grat quality and also guarantee of TATA. I am ve...\nRead full review",
            "The product is awesome. Total value for money. As it is a TATA product and also made in India, it comes with grat quality and also guarantee of TATA. I am ve...\nRead full review",
            "I thought Id give a try to not so famous brabd TV.. But this turned out good Sound Quality is good and the rest features are good too",
            "Waste product, don't buy marq products",
            "This is really nice. Also, Demo and installation team came according to our convenience.",
            "Stopped working in an year. Got a black screen with sound while watching a TV show on a normal day. going to claim warranty lets see how it goes with flipkart",
            "TL;DR - Picture is good. Sound is insufficient. Looks ugly and the Operating system is absolutely pathetic. This Old Hag of a television has been discontinue...\nRead full review",
            "Picture quality and sound awesome. Bought this for 23k\nValue for money",
            "it is a very good condition of your product",
            "Such a good product....no complaint.",
            "Nice tv picture quality good & sound is to good screen minoring is not available",
            "Picture quality is good but facing some issues with installation for one week. Present condition is okay in future we need to what's the condition or worth f...\nRead full review",
            "Satisfied!!!\n\nSometimes you take your decisions on your instincts rather than advices and you hit bang on. Buying Marq has been a similar experience,there we...\nRead full review",
            "Lots of issues after 1 year",
            "daiwa d26k11 Led tv is a ture led tv and picture & Sound Quality is Awesome value for money . All Over Good Only Wall Mount is Little bit weak.\nI am Satisfie...\nRead full review",
            "daiwa d26k11 Led tv is a ture led tv and picture & Sound Quality is Awesome value for money . All Over Good Only Wall Mount is Little bit weak.\nI am Satisfie...\nRead full review",
            "Probably the first review of this product and my first on Flipkart\nOrdered this on 7th dec and got delivered on 8.th dec morning 10:00!am\nInstallation wor d...\nRead full review",
            "Excellent\n\nIt is a wonderful product I like it so cause, we can headphones to it and such amaze it is\nso thats why im giving this 5 on 5 stars",
            "Very nice 😍😍😍😍😍",
            "Very nice 😍😍😍😍😍",
            "I am genuinely giving my review on this product after' using it for five months. It's Nice product. Nice colours . Nice sound quality, Nice all smart tv func...\nRead full review",
            "Very good product excellent results",
            "Onkya speaker are osmmm... I am feeling like home theater. And picture quality is very nicee... I hve used google assistant to speak 🗣to find my fav songs,...\nRead full review",
            "The issue is with volume. It is either high or low. There is nothing in between called medium volume. The updates wont also fix anything . But this is minima...\nRead full review",
            "i received the product on the third day i ordered and the delivery staff was so polite and the installation was done very soon after the delivery.\n\nregardin...\nRead full review",
            "This is a long term review after usage of almost 5 years. I can definitely say it is value for money. I don't know if it is still available but if you get th...\nRead full review",
            "I got this TV yesterday on 16 Jun 2019. Technician visited for demo and installation within 3 hours of delivery which is fantastic.\n\nObservations\n1. Price fo...\nRead full review",
            "Not recommended\nI purchased this 1 year before, and after that display flickering problem started, panel problem occurred. Fortunately I have taken warrant...\nRead full review",
            "Its been 3 months of purchase and its working fine and quality is much clear ..in this price range its is like diamond",
            "I have purchase on date 18-04-2022, till no body come for installed it & sending tiwari numbers but he doesn't response for call. It's a humble request to yo...\nRead full review"
        ],
        "likes": [
            "366",
            "330",
            "261",
            "116",
            "74",
            "33",
            "21",
            "24",
            "81",
            "26",
            "366",
            "330",
            "261",
            "116",
            "74",
            "33",
            "21",
            "24",
            "81",
            "26",
            "22",
            "21",
            "55",
            "68",
            "99",
            "12",
            "19",
            "5",
            "10",
            "7",
            "14",
            "12",
            "16",
            "15",
            "8",
            "8",
            "6",
            "14",
            "7",
            "7"
        ],
        "dislikes": [
            "115",
            "105",
            "81",
            "44",
            "27",
            "5",
            "5",
            "7",
            "33",
            "6",
            "115",
            "105",
            "81",
            "44",
            "27",
            "5",
            "5",
            "7",
            "33",
            "6",
            "7",
            "6",
            "40",
            "37",
            "28",
            "1",
            "4",
            "0",
            "2",
            "2",
            "5",
            "4",
            "7",
            "7",
            "2",
            "2",
            "1",
            "7",
            "1",
            "2"
        ]
    },
    "qna": {
        "questions": [
            "Q:What is the operating system in the TV & which version?",
            "Q:Can I connect Bluetooth headset as Bluetooth devices in it?",
            "Q:Can I display my mobile screen into the TV?",
            "Q:Can we install Hotstar?",
            "Q:Has anyone used this TV with a cable connection? How is the video quality with cable STB?",
            "Q:Can we connect home theater?",
            "Q:Wall mount is provided with the TV?",
            "Q:How can I use it as a computer (steps)",
            "Q:Need Electrical stabilizer?",
            "Q:Does this TV support Netflix?",
            "Q:Can I play 4k movies on YouTube?",
            "Q:Can I display my iphone screen into the TV?",
            "Q:Is chromecast built-in ?",
            "Q:Does the voice command feature works with out internet??",
            "Q:What are the dimensions of 49 inch TV?",
            "Q:Is sound system provided by DOLBY?",
            "Q:Is the Video quality of TV is same as that of Sony TV?",
            "Q:Can I download apps in this TV?",
            "Q:In this Thomson 43OATH1000 tv have used LG or SAMSUNG panel",
            "Q:how do i configure voice assistant on my remote?",
            "Q:is there any restriction on downloading the apps , means any restricted playstore apps??",
            "Q:table stand is provided in the box or only wall mounted tv",
            "Q:Does it support VLC (Original Content)",
            "Q:Does it connect to Hard Disk (Original Version)",
            "Q:can we install prime video app in the tv and watch movies?",
            "Q:Does it support all android TV application?",
            "Q:Does it support ARC port ?",
            "Q:How is the SD and HD channel quality with Tata Sky on this 43\" TV?",
            "Q:It's better than vu pixel light?",
            "Q:Is it certified Android TV?",
            "Q:Which type panel is used in this TV?",
            "Q:Can we install Amozon prime video side loading. but play the HD content",
            "Q:Does it have Google Assistant",
            "Q:is it an ips panel?",
            "Q:has it in built Bluetooth",
            "Q:Can anyone please confirm the panel type in this TV? Bcoz, according to Thomson website, it has \"A+ Grade Samsung\" panel. But in FlipKart spec, it is IPS. Please help me to verify. Thanks",
            "Q:Can i use zoom app in this tv??",
            "Q:support HDR 10",
            "Q:Netflix , Prime Video and Hotstar ? If yes then 4k ?",
            "Q:can i play prime video by login to Chrome browser",
            "Q:can we get regular updates",
            "Q:What is the result of viewing when we play SD channles on this 4K UHD tv?",
            "Q:Can we connect Google Home?",
            "Q:how to install prime video app from third party app store can one explain",
            "Q:It has audio jack",
            "Q:Do remote have hotkeys ?",
            "Q:Can we play 4k videos via USB?",
            "Q:does it have Av ports to connet my settop box?",
            "Q:Purchased new 49 inch tv and want to use voice search but not working though I have connected to tv from phone. saying no device found. can any1 know how to enable voice search.Emanual proces complete",
            "Q:what is android version in this tv",
            "Q:does this another 4k video VLC PLAYER?",
            "Q:can it be updated with Android pie ???9.0",
            "Q:can we connect PS4 to it",
            "Q:air mouse is available with this tv",
            "Q:dose sound is Audible......?",
            "Q:why prime video does not install in led.. when it is pure andriod ...",
            "Q:this tv doesn't get a update till now... there is any chance to get update.... prime etcc",
            "Q:can connect wireless display throgh laptop.if yes please provide steps.",
            "Q:Can I watch movies using pen drive like we do on laptop? Please reply! Thanks.",
            "Q:Picture setting on remote",
            "Q:the reviews say that this TV doesn't have bluetooth. it's it true?",
            "Q:can it be updated to 9......???",
            "Q:Which Android version in this product?",
            "Q:it has headphone jack or not",
            "Q:can we connet blueray player",
            "Q:Can I install and play pubg game?",
            "Q:Is Bluetooth available?",
            "Q:Can we watch prime video , alt Balaji or zee5 on this tv",
            "Q:4g dongle supported?",
            "Q:what is the energy star rating?",
            "Q:Can i share my apple iphone screen on Thomson TV ?",
            "Q:which browser this tv have? can i open website in address bar of the browser",
            "Q:does this tv have play store",
            "Q:Does it support Sun NXT",
            "Q:How many speakers are there and where it got positioned, I mean downward or Left- Right??",
            "Q:which tv is better iffalcon or thomson",
            "Q:Does it have GPS?",
            "Q:what is the process to connect Alexa with the TV",
            "Q:does it have a samsung panel?",
            "Q:Jio Tv casting from mobile is possible?",
            "Q:how is up scaling algorithm",
            "Q:which is the 55 inch ultra HD tv best VU MI IFFLOCON JVC THOMSON?",
            "Q:this tv support jio tv app",
            "Q:Thomson or VU which is best?",
            "Q:I play pubg games in this",
            "Q:can this TV ply HDR 10 content?",
            "Q:does the tv has 8 bit panel r 10 bit panel?",
            "Q:Can i browse facebook directly from this TV without casting?",
            "Q:Google chrome not able to found from play store. only few apps showing from playstore???",
            "Q:I am unable to use chromecast in my TV. Please let me know",
            "Q:pubg game work on this tv",
            "Q:Does this contain Dolby Atmos",
            "Q:Can we play games",
            "Q:Can we play mp3 in background, I mean video off and just music. If yes how?",
            "Q:Thomson 49inc tv shell we connect optical cable",
            "Q:I need a Remote for this TV since existing remote damaged please help",
            "Q:Can I update sony live app",
            "Q:There is no option in settings to adjust the TV display. color/brightness ???",
            "Q:which is best tv motorola or thomson?",
            "Q:which one is better? this one or vu premium 50?",
            "Q:Does the picture settings done when watching TV channels apply for online content too ?",
            "Q:Can we save movies or tv episodes via attaching external hardisk",
            "Q:does it have bazal less design",
            "Q:Is this tv bezel less",
            "Q:Why YouTube was not opening unless I'm updating the device everytime",
            "Q:CAN I CONNECT IT WITH WI-FI ROUTER",
            "Q:Can I connect set top box ?",
            "Q:Can i connect settopbox",
            "Q:Can I use watsapp videocall on dis TV",
            "Q:water proof tv",
            "Q:this is water proof",
            "Q:can i install prime video over play store",
            "Q:what are the steps to share the mobile screen to thomson tv",
            "Q:Can I connect wireless keyboard & mouse",
            "Q:How's the wall mount tv bracket come along with tv? tilt function available or not?",
            "Q:Is data saver mode available in the Tv. Is data saver mode available in the TV And if not then what is the substitute for data saver",
            "Q:VLC player detect hard disk,USB device but shows zero files.Can anyone help?Have any one received software update?",
            "Q:its resolution is 1920×1080",
            "Q:Can i see 3D movies",
            "Q:what panel is used in 55 inch model lg or Samsung",
            "Q:THE SPEAKERS ARE INSIDE THE TV OR OUTSIDE THE TV",
            "Q:THE SPEAKERS ARE INSIDE TJE TV OR OUTSIDE THE TV",
            "Q:how to load Prime Video app on this TV.",
            "Q:sound is very low. what is the problem, any soundbar settings. ...any body give me clarify..",
            "Q:ho can i screen mirror ing",
            "Q:can I install team/group video conference calls apps???",
            "Q:on the all specifications page it specifies hdr 10 for 43 do you provide hdr 10 for 49 inches tv please confirm?",
            "Q:is the ram is DDR3?",
            "Q:Compleate tv protection available in this model?",
            "Q:what storage will get out of 16 gb",
            "Q:How many speakers are there in 65 inch model and does it have ARC",
            "Q:operating system update version avelble ?",
            "Q:Is camara Inbuilt",
            "Q:can i connect set up?",
            "Q:can i connect Bluetooth speakers",
            "Q:which date manufacturers",
            "Q:how many speakers are come with TV",
            "Q:is it upgradable to android pie?",
            "Q:Is it certified android tv in India",
            "Q:As prime Video app is not available in play store. So Can we play prime video using chrome cast ?",
            "Q:Is there any hdmi with ARC, as some says it has and some says it doesn't has. So what's right ans",
            "Q:how i can use prime video in this tv?",
            "Q:can I play prime video thru chrome cast from mobile?",
            "Q:we have invertor at home , does this tv required additional voltage stabilizer as voltage fuctuation in our area",
            "Q:can we install any app?",
            "Q:Is this tv has ARC HDMI to connect Sony home theatre?",
            "Q:Is it support hdr 10 and what about sound quality?",
            "Q:is it play 4k like sony",
            "Q:is this tv has good contrast ratio",
            "Q:can i download a new app which is available on playstore on this tv?",
            "Q:can you I update diseny+hotstar my Thomson 55inch 0999 tv",
            "Q:how to connect same wifi?",
            "Q:can i play YouTube songs with screen off, if yes then how. This feature is available in other Thomas models",
            "Q:can it casts whole mobile like any vedio aur file without internet or it can casts only youtube hotstar netflix like as in cromecast",
            "Q:i can play netflix video in 4k",
            "Q:how can i play car racing games in it",
            "Q:It is supposed MKV file",
            "Q:how many days battery last of tv and it is rechargeable or not?",
            "Q:How much screen size does a 43-inch TV have?",
            "Q:As per the Ad , in the box wall mount,remote, battery, tv unit available.But no mention about table top stand.Is the table top stand available (included) with the 65 inch tv?",
            "Q:is it supports to sony Blu-ray home theater",
            "Q:Does it have Chroma 4:4:4?",
            "Q:For online streaming, is there settings in the TV (NOT in the app) that I can use to reduce the resolution from 4k to 1080p or 720p so as to consume less data while watching Netflix etc.",
            "Q:What is the exact height of the 43 inch tv? Including the stand etc. I need to check if it will fit in my cabinet. Thanks",
            "Q:43inch tv come with table stand",
            "Q:thomson or Samsung 50 inch 4k best",
            "Q:Does it protect against lightning?",
            "Q:after running 4 or 5 hours showing a text that power will be off and within 1 minute tv will be off,what's the solution",
            "Q:Instlation is free or not",
            "Q:can i display my redmi mobile screen into the Tv?",
            "Q:Android pie 9 yes or no?",
            "Q:Installation is free or there is charge for that?",
            "Q:Can it connects with web camera?",
            "Q:which stabilizor are thomson 43inch tv carrect voltage",
            "Q:which stabilizer is suitable for thomson television",
            "Q:3Q: Can we get update 9 pie for sure? when we will get this?",
            "Q:Does TV support dualband WiFi or Single band wifi ? It supports 5GHz?",
            "Q:How does the text look if connected with PC? Does it look blurry or pixelated? Has Chroma 4:4:4?",
            "Q:I have installed MX player but unable to play.. how to play this",
            "Q:Is This tv HDR10 nd the panel is samsung panel or any other?"
        ],
        "answers": [
            "A:Official Android 8.0",
            "A:Yes i am using Boat Bluetooth headphones.",
            "A:Yes you can. You just need to download an app \"Airscreen\" in this smart TV . Then just click cast icon in your mobile. To cast make sure TV and mobile should be connected to same WiFi. That's all .",
            "A:Yes , Official Hotstar",
            "A:Normal channels are ok as tv screen is big but HD channels are awesome,....movie experience in Hd is Amazing.",
            "A:Yes",
            "A:Yes",
            "A:via hdmi cable ...",
            "A:if there is a epectric fluctuation problem then you may need stabilizer or else no.",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:nope",
            "A:length 26.5 inch and width 43.1 inch",
            "A:Yes",
            "A:Yes",
            "A:Yes more than 5000 Apps & Games",
            "A:it has used Samsung panel",
            "A:Click left direction button and home button at same time",
            "A:no",
            "A:Both are provided",
            "A:Yes",
            "A:Yes",
            "A:Prime video came with chrome cast feature. you can cast your prime video to this TV.Good quality.",
            "A:Yes",
            "A:Yes",
            "A:SD channels also looks good thanks to better upscaling. HD and 4K are best.",
            "A:yes it is..as I have found it's sound quality is more better...as well android version is quite well in connectivity.... picture quality is awesome.",
            "A:Yes",
            "A:IPS",
            "A:Yes it works, but you will have to download the older version the app, the one with the blue color logo.",
            "A:Yes",
            "A:yes",
            "A:Yes",
            "A:ips panel. Thomson website has not updated the details correctly.As it is Flipkart exclusive, Thomson has updated details correctly on Flipkart.",
            "A:yes",
            "A:yes",
            "A:yes",
            "A:yes",
            "A:If you are asking about OTA, then most probably NO. There has not been a single update since launch. Security Patch is Feb,2019",
            "A:Recommend to use HD channels as SD channels when scaled do look good on a 55 or 65 inches. Thomson TV performance on SD channels is good",
            "A:Yes",
            "A:Install X-plore file manager from tv's Google play store. Install Amazon prime from using latest Amazon prime APK file from external device like pen drive or hard disk.",
            "A:yes 3.5 mm jack type and SPDIF Optical output",
            "A:Yes, Hotkeys for Netflix & Youtube",
            "A:Yes... we can... it is better than online 4k video",
            "A:Yes",
            "A:Home button and left arrow key press both same time and then blink green light of remote it means your remote active with Bluetooth mode. then press voice assistance key, then press ok for pair.",
            "A:8 Oreo",
            "A:yes u can play the video by the vlc player",
            "A:not till now.",
            "A:Yes You can",
            "A:No",
            "A:Yes",
            "A:because manufacturer Thomson does not provided it in their software., which is the major drawback of this company simultaneously company is really bad in providing any software updates.",
            "A:No!! Thomson will not ready to upgrade or update this model..",
            "A:Yes, if both are on the same network then you can cast your laptop screen.",
            "A:Yes",
            "A:Yes, available",
            "A:No TV have Bluetooth. And i suggest this tv is perfect size and full fechere and very very good sound and desplay quality is excellent",
            "A:No",
            "A:Google Assistant&Chromecast in built",
            "A:Yeah... 3.5mm jack available at rear side 👌",
            "A:yes",
            "A:yes you can, awsome tv",
            "A:Yes",
            "A:Yes all app , except prime video",
            "A:no",
            "A:Three",
            "A:Yes",
            "A:no can't even you can't download crom",
            "A:Yes",
            "A:Yes",
            "A:you can see a bar at the bottom. the bar has a place for speakers. there are 5 of them. front firing. the audio output is good enough. not good for music . but the audio is loud enough otherwise.",
            "A:iffalcon",
            "A:Yes",
            "A:Go to the menu and select Settings. Go to the TV & Video section, select your video or TV service provider. Select Enable Skill. Follow the on-screen instructions to connect Alexa to your TV or vid",
            "A:yes",
            "A:chromecast is there so .. you can connect any app which can Chromecast",
            "A:if you will use HD set-top box for 4K videos then its awsome & if you will use normal videos or normal set-top box then you will not be satisfy with its upscaling algorithm.",
            "A:Thomson 55 uhd (4k) led smart TV is the best TV because simply super features of other led TVs . That's it only",
            "A:yes",
            "A:Thomson tv the best tv",
            "A:yes",
            "A:yes",
            "A:10 bit panel",
            "A:No ..even playstore doesn't provide a option to download facebook but you use a app on playstore to watch facebook videos ..",
            "A:all apps which are available in google play store are been shown as it is a google certified tv. yes google chrome is not available in store. you got to download from external source",
            "A:Download Google home app from play store and then cast your mobile to your TV.",
            "A:No",
            "A:Yes",
            "A:Yes",
            "A:No, it's not possible",
            "A:Yes",
            "A:bro contact Thomson customer care but slowly respond",
            "A:Yes",
            "A:You cannot adjust display colour/brightness while playing any online content. If you are playing anything from a USB drive, press MENU on remote to change display settings. (Also with setup box)",
            "A:Thompson",
            "A:Thomson",
            "A:No, both are different.",
            "A:sss.. can see from external hardisk",
            "A:Side & Top have minimal bezels and in bottom there is built-in sound bar which looks stunning and produce great sound experience.",
            "A:yes. very small bezel",
            "A:Normally it was alright in our tv. May be it was problem in ur connectivity or anything else.",
            "A:yes",
            "A:yes, both HDMI cable and av cable-3pin supported",
            "A:yes",
            "A:Not possible.. no camera",
            "A:No",
            "A:Nop",
            "A:Yes you can",
            "A:Chromecast. A working WiFi is needed too.",
            "A:Yes you can!",
            "A:No....I dint received",
            "A:there is no data saver mode but in some apps there is a thing that what did u see last will appear and the videos can be played from where u left.",
            "A:Yes",
            "A:1920x1080 is full hd but it's 4k",
            "A:No it's not a 3D TV",
            "A:lg",
            "A:outside",
            "A:see the photo clearly , a soundbar below is outside the tv. great sound.",
            "A:Prime video app not available....",
            "A:Avarage working sound.. I have big expect so narmally.",
            "A:Yes you can but using Google Home(android app) only",
            "A:No ....I don't think so if it is android app u can....",
            "A:49",
            "A:yes",
            "A:Yes",
            "A:10gb approx",
            "A:2 Speakers. It has ARC.",
            "A:no",
            "A:no",
            "A:Yes",
            "A:Yes",
            "A:2019",
            "A:1",
            "A:no",
            "A:no",
            "A:Yes",
            "A:No. There was no HDMI cable available along with TV.",
            "A:It can be sideload.",
            "A:Yes you can. You can also download it from Aptiode store.",
            "A:yes",
            "A:Yes",
            "A:yes.. it has 3 hdmi ports. one of them is hdmi arc",
            "A:sound quality is mind blowing. surround sound.",
            "A:Yes",
            "A:yes",
            "A:Yes we can download new apps on this TV",
            "A:yes You can update",
            "A:go to settings on the right corner on the top",
            "A:No you can't play songs on YouTube with offscreen.",
            "A:It can cast any content but you need to install some app for screen casting and your tv and mobile should be connected to router/wifi - it won't consume data",
            "A:Yes",
            "A:not sure if any car games or any game supported for this TV...check playstore if any app is out there or purchase xbox or PS for external games..",
            "A:Yes ..and you can download VLC & MX player app from Google play store for other supported files in case u have any. It's Android version 8 .",
            "A:its aaa battery not rechargeable",
            "A:108 cm",
            "A:Yes, it comes with table top stand.",
            "A:Yes it is support",
            "A:yes",
            "A:No it's not possible on TV, only control is on app.",
            "A:70 cm",
            "A:Yes",
            "A:Thomson is best",
            "A:No",
            "A:check your settings the automatic power off will be activated and you can off the setting",
            "A:Free of cost but I would not suggest to buy this brand because TV display getting issue. Poor customer service.",
            "A:no",
            "A:Yes",
            "A:It is free",
            "A:yes",
            "A:No stbilozor requiried",
            "A:V-Gard",
            "A:yes I",
            "A:Yes, it support for both",
            "A:no",
            "A:Mx tv you have to install... MX player is used to see the video from pen drive or storage device",
            "A:Sony"
        ],
        "likes": [
            "50",
            "5",
            "0",
            "121",
            "1",
            "82",
            "27",
            "62",
            "0",
            "41",
            "32",
            "45",
            "30",
            "22",
            "18",
            "21",
            "37",
            "18",
            "28",
            "16",
            "7",
            "0",
            "13",
            "9",
            "4",
            "14",
            "17",
            "7",
            "45",
            "14",
            "16",
            "4",
            "14",
            "10",
            "9",
            "74",
            "1",
            "9",
            "0",
            "9",
            "4",
            "49",
            "10",
            "2",
            "6",
            "7",
            "4",
            "0",
            "15",
            "0",
            "4",
            "2",
            "2",
            "0",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "7",
            "6",
            "3",
            "2",
            "0",
            "2",
            "3",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "4",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "15",
            "1",
            "0",
            "48",
            "0",
            "31",
            "7",
            "23",
            "0",
            "14",
            "10",
            "18",
            "12",
            "8",
            "6",
            "8",
            "19",
            "9",
            "17",
            "8",
            "2",
            "0",
            "7",
            "4",
            "2",
            "9",
            "11",
            "3",
            "47",
            "10",
            "13",
            "2",
            "11",
            "7",
            "6",
            "101",
            "1",
            "7",
            "1",
            "8",
            "1",
            "82",
            "11",
            "1",
            "5",
            "7",
            "3",
            "0",
            "29",
            "0",
            "4",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "11",
            "9",
            "3",
            "2",
            "1",
            "2",
            "6",
            "3",
            "1",
            "1",
            "1",
            "1",
            "1",
            "5",
            "17",
            "0",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    }
}