{
    "title": "LG LH576T 108 cm (43 inch) Full HD LED Smart TV  (43LH576T)",
    "product_specification": {
        "In The Box": "1 TV Unit and 1 Conventional Remote",
        "Model Name": "43LH576T",
        "Color": "Black",
        "Display Size": "108 cm (43 inch)",
        "Screen Type": "LED",
        "HD Technology & Resolution": "Full HD, 1920 x 1080",
        "Series": "LH576T",
        "Smart Tv": "Yes",
        "Motion Sensor": "Yes",
        "HDMI": "1 Side, 1 Rear",
        "USB": "Location: Side",
        "Wi-Fi Type": "Wi-Fi Direct",
        "Built In Wi-Fi": "Yes",
        "Launch Year": "2016",
        "Picture Engine": "Triple XD Engine",
        "Analog TV Reception": "Yes",
        "Panel Type": "IPS",
        "LED Display Type": "Slim LED",
        "Aspect Ratio": "16:9, Just Scan, Original, 4:3, 14:9, Zoom, Cinema Zoom",
        "Other Video Features": "Dynamic Color Enhancer\nActive Noise Reduction\nPicture Mode: 5 Modes (Vivid, Standard, Cinema, Soccer, Game)",
        "Number of Speakers": "2",
        "Sound Technology": "Dolby Digital Decoder, DTS Decoder",
        "Surround Sound": "Virtual Surround Plus",
        "Speaker Output RMS": "20 W",
        "Sound Mode": "Music, Cinema, Standard, Bollywood Mode, Soccer, Game",
        "Other Audio Features": "Clear Voice III\nOptical Sound Sync\nAudio Codec: AC3 (Dolby Digital), EAC3, HE - AAC, AAC, MP2, MP3, PCM, DTS, DTS-HD, DTS Express, RA, WMA\nSound Optimizer: 3 Modes (Off, Stand Type, Wall-mounted Type)",
        "Operating System": "WebOS",
        "3G Dongle Plug and Play": "No",
        "Other Internet Features": "Premium Content (India Specific Apps), App Store, Smart Phone Remote Controller (Remote App), Network File Browser, Miracast, Netflix, Intel WiDi, You Tube",
        "Component In (RGB Cable)": "Component Input (Y, Pb, Pr + Audio): 1 Rear (Composite / Component Common)",
        "Headphone Jack": "1 Rear",
        "RF Connectivity Input": "1 Rear",
        "Other Connectivity Features": "Digital Audio Output (Optical): 1 Rear",
        "Touch Remote": "No",
        "RF Capable": "Yes",
        "Power Requirement": "AC 100 - 240 V, 50/60 Hz",
        "Power Consumption": "95 W, 0.3 W (Standby)",
        "Other Power Features": "Smart Energy Saving",
        "Other Convenience Features": "Motion Eco Sensor",
        "Width x Height x Depth (without stand)": "975.5 mm x 583 mm x 81.5 mm",
        "Weight (without stand)": "8.4 kg",
        "Width x Height x Depth (with stand)": "975.5 mm x 633 mm x 217.9 mm",
        "Weight (with stand)": "8.7 kg",
        "Warranty Summary": "1 Year LG India Comprehensive Warranty and additional 1 year Warranty is applicable on panel/module",
        "Covered in Warranty": "Defect arising out of Faulty or defective material or workmanship\nThe Warranty Extension will be done basis the date of purchase & Offer Validity\nExtended 1 Year Warranty offer is valid till 30th June 2018\nWarranty of the Product is Limited to Manufacturing Defects Only\nApplicable on purchase of all size 80cm (32) and above TV models only",
        "Not Covered in Warranty": "Warranty Does Not Cover Any External Accessories (Such as Battery, Cable, Carrying Bag), Damage Caused to the Product Due to Improper Installation by Customer, Normal Wear and Tear to Magnetic Heads, Audio, Video, Laser Pick-ups and TV Picture Tubes, Panel, Damages Caused to the Product by Accident, Lightening, Ingress of Water, Fire, Dropping or Excessive Shock, Any Damage Caused Due to Tampering of the Product by an Unauthorized Agent, Liability for Loss of Data, Recorded Images or Business Opportunity Loss.",
        "Warranty Service Type": "On-site",
        "Installation & Demo Details": "1. Covered Under Standard Installation - Table Mounting Using Standard Stand Supplied as Accessory with TV - Extra Charges are Applicable for Wall Mounts as, Rs. 399 for 32 inch Display Size and Rs. 499 for >32 inch Display Size - Connecting with Available Power Source (within 1 Meter) - Connecting / Setting Up Various Available Input Source for Audio Video Based on Model - Connecting with Available WiFi (for Smart TV) - Checking TV for Proper Functioning - Demonstration of the TV and its Features"
    },
    "product_description": {
        "Binge Watcher's Dream": "Say goodbye to your cable operator and those irritating advertisements. This LG TV can connect to the Internet using inbuilt Wi-Fi protocols, allowing you to watch your favorite shows on Netflix and YouTube.",
        "Meant for Audiophiles": "Don't you hate it when you are watching a movie and the background score makes it really difficult for you to figure out what is being said by the characters? The LG 43LH576T TV comes with Clear Voice III that can separate ambient background tones from speech, ensuring you hear the dialogues clearly.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "5",
            "4",
            "1",
            "4",
            "5",
            "4",
            "5",
            "5",
            "1",
            "4",
            "5",
            "4",
            "1",
            "4",
            "5",
            "4",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "2",
            "5",
            "4",
            "3",
            "3",
            "5",
            "4",
            "2",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "1",
            "4",
            "1",
            "4",
            "3",
            "5",
            "3",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "4",
            "1",
            "5",
            "3",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "2",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "3",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "4",
            "1",
            "3",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "3",
            "3",
            "5",
            "4",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "1",
            "5",
            "3",
            "4",
            "5",
            "3",
            "2",
            "5",
            "5",
            "5",
            "3",
            "5",
            "1",
            "5",
            "4",
            "5",
            "5",
            "3",
            "2",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "3",
            "4",
            "1",
            "4",
            "5",
            "4",
            "1",
            "5",
            "2",
            "5",
            "5",
            "5",
            "3",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "4",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "1",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "1",
            "2",
            "2",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "4",
            "1",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "1",
            "5",
            "2",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "3",
            "5",
            "3",
            "4",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "4",
            "1",
            "2",
            "4",
            "5",
            "2",
            "2",
            "5",
            "1",
            "3",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "3",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "4",
            "4",
            "5",
            "1",
            "5",
            "4",
            "5",
            "1",
            "5",
            "2",
            "5",
            "3",
            "5",
            "2",
            "3",
            "3",
            "4",
            "5",
            "4",
            "1",
            "3",
            "3",
            "5",
            "2",
            "3",
            "1",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4"
        ],
        "review": [
            "i received the product on the third day i ordered and the delivery staff was so polite and the installation was done very soon after the delivery.\n\nregarding the product:\nthere are many smart tv's available in the market. but after using them for one year, u'll find that only the youtube app is the most used one and that too only if u have kids or school goers in ur family . as all others have smart phones, only a a couple of smart apps can be used in the tv.\n\nthis has miracast, youtube and ...\nREAD MORE",
            "Good deal and Great Tv... Picture and Sound quality is good..and Lg service center are there in many cities.so no service issue later...\nBig billion day is really great time for shopping..\nGuys first check tv at ur nearest lg Shoppe and then place order on flipkart so that u get right size for ur room...\nDelivery and installation really good..\norder on 2 oct got tv on 4 oct..\ntv is manufactured on 8 sep...50500 rs mrp\nmarket price was 47000 i got it at flipkart for 33240 after making online payment through sbi debit card..\n\nOverall good tv experience I m happy with this deal",
            "Hello everyone...\nI was planning to buy this TV from last 4-6 months but I was confuse between Offline & Online purchase due to Price difference and risk factor of online purchase.\nAfter lots of thinking finally ordered this LH LH576T on flipkart with BIG DISCOUNT of Rs.8000 as compare to offline dealer. At the time of placing my order flipkart assured me for delivery on 7th April.\nOn 7th april my order tracking status was showing reached at delivery destination. I was waiting for delivery person's call but no one contacted me till 4pm. I was visited ekart office near to my home just on walking distance. The person who was on chair behind the computer was playing game on his phone, I told him about my order but he ignored.... after 2 times of repetition he said TV and other big products dose not delivered by us and we dont have any contact details or address of other delivery partner. till now everything was okay.... but when I contacted tollfree number of delivery partner \"GATI TRANSPORT\" they said it may take 24 to 48 hrs to deliver your product. I said it is allready running late and why you need 48 hrs to deliver my product when it is reached in my location?? Can I cancell the order?? he said sir it is your order and you can do anything we will not deliver this product b4 48 hrs due to other orders are pending for delivery. after that I contacted to flipkart social media CC the called me back in few min and discussed my issue. and after that within 10 min GATI person called me and assured me for instant delivery at my place on 9th April (2 days late).\n\nNow come to the product and Installation\n\nInstallation :\nOn monday morning I received SMS from Jeeves for my installation and demo appointment booking.\nEngineer called me on 5:30 PM and within 15 min reached at my home.\nWithing 15 min he done his teble top installation process.\nHe was unable to answer my technical questions due to lac of knowledge.\nInstallation & wall mount was totally free.\n\nAbout TV\nI m using this TV from last 4-5 days and Im Impressed with the sound & Picture quality.\nIf you have unlimited hi speed data access then YouTube experience will be superb.\nUniversal remote function is missing.\n1TB external HDD working fine with USB connectivity.\nOverall it is fantastic product at this price.\n\nNOTE : I GAVE THIS PRODUCT ONLY 1 STAR JUST BECAUSE OF THE #rd CLASS DELIVERY BY GATI.\nI WILL NEVER BUY ANY BIG SIZE PRODUCT FROM FLIPKART IF DELIVERY PARTNER WILL BE GATI.",
            "I am writing the review after using it for 10 days. I ordered it on 20th sep during Big Billion Day sale at an amazing price of Rs. 35732 (35499+233 for 2 years extended warranty from Jeeves). Received it on 21st sep. As always Flipkart rocks in delivery. Packing was also perfect. I got a call from LG regarding installation on 21st itself and it was installed at my home on 22 sep. As expected TV box does not contain Magic remote. The guy brought with him the swivel type wall mounting kit and everything was free of cost. Now the Pros and Cons-\n\nPros-\nPicture quality is very Good.\nSound quality is also very good. While playing Youtube volume level at 20 out of 100 is sufficient.\nPlays all common video formats like .mp4, .avi, .mkv etc.\nConnects to Wifi without any problem.\nScreen share or Miracast is also working perfectly.\nYoutube takes around 2-3 sec to start a video but then plays it without any buffering . I have 3 mbps broadband at home.\nHDMI and USB ports are working fine. I have connected 1 TB hard drive and tested. Only USB and one HDMi located at side and one HDMI at back.\n\nCons-\nTV does not come with a magic remote.\nIt does not support wireless Keyboard or mouse. (A big disappointment)\nIt does not support LG TV Plus app. If it had, We could use our mobile as magic remote.\nOnly one USB port.\nDoes not have a web browser.\n\nFinal verdict- If you don't use smart features a lot, then this TV is perfect at this amazing price. This is a semi-smart TV with basic features only. If you need all smart features you can go for the next higher model i.e. LG 43LJ554T. It supports all smart features though it does not have a magic remote. In my case I am happy with the TV except that it should have supported wireless keyboard and mouse. That is why I have reduced one star.",
            "Hi I am from Coimbatore, I am writing this review after two months of use.At first I would like to say about the picutre qulality, Picuture quality is excellent compare than others.Color reproduction is excellent an accurate, white levels are great but black level are not so great. It has 2 hdmi inputs,one with ARC, works fine. Miracast works fine, I connected my lenovo A7000 phone with my tv without any issues. The external usb is working fine, but it cannot play most of the file formats. Network file browser works fine, subtitle is not working even the subtitle file has the same of video file and both are in the same directory. Good packaging and delivery from flipkart team and the same day installation is done without any cost(Table top) from Jeevs consumer service.",
            "Superb Buy\nWorth the money, thoroughly satisfied with the product.\nI was destined to buy a smart TV from a newer brand at the same price with bigger screen, but decided not to after seeing the review of both the products.\nAnyday LG, Samsung , Sony stays ahead of other players in the market. There were review and people commenting picture, sound quality and overall experience of Panasonic,Vu,Tcl being on par if not higher with the top brands,I strongly disagree, with time you'd feel going for a reputable brand should have been your choice for it's features and service.\nHave been using it for a couple of months.\nNo regrets buying, and totally happy.\nCrystal clear picture quality, pristine sound, good connectivity with built in WiFi.\nMira cast quite slow.\nIf you're a movie or TV serial freak, you can go for it stands hevc x265 content without any external applications, since it has a built in one.\nHassle free operation with hard drive pendrive up to 2tb .\nOnly con very less connecting ports.",
            "Excellent service by flipkart. Delivered on third day from order. Installation immediately after one hour from delivery. Flipcart continuesly proving their excellence in customer service and satisfaction.\n\nRegarding TV it is better then expected. Though it is first day of use but my very first impression that picture quality and sound is good. Have not tried hd channel yet. Youtube video, screen share and netflix experience seamless. So overall am very happy to have lg brand smart tv with 34.5k after all discount offer.",
            "Lg 43,FHD smart omg in 33k like Bulls eye in the sale..\nThe delivery came on time I.e. 3 days.\nThe packing should be better rather there should be some packing above the box there was nothing .overall I got the product at unbeatable price and in right conditions.\nThe installation engineer came 2 days after the delivery and installed for free no charges.\nI am delighted.",
            "After 8 days of delivered tv , Technician visited for installation at my residence with out installation tool kit. Technician not installed tv on wall mounted cause drill m/c not available with him. We have started tv with Installation on table top. And We requested to technician for Demo. Technician not knowing mostly features of such smart Tv. He is not sound knowledge of this TV applications i.e how to share screen of smart phone with Tv , How to connect Wi-Fi Direct , wireless network connection not activated ,what is function of Netflex , Yupp Tv,My Media etc. After spent huge money to bought this product still using my Smart Tv as a normal Tv due to not proper knowledge given by supplier .",
            "1) Flipkart\nDelivery service is super fast.\nInstallation service is fast. But installation agent is not well educated about the product.\n\n2) LG\nPictures quality is excellent\nSound quality very good.\nSometimes not connecting to you tube.",
            "i received the product on the third day i ordered and the delivery staff was so polite and the installation was done very soon after the delivery.\n\nregarding the product:\nthere are many smart tv's available in the market. but after using them for one year, u'll find that only the youtube app is the most used one and that too only if u have kids or school goers in ur family . as all others have smart phones, only a a couple of smart apps can be used in the tv.\n\nthis has miracast, youtube and ...\nREAD MORE",
            "Good deal and Great Tv... Picture and Sound quality is good..and Lg service center are there in many cities.so no service issue later...\nBig billion day is really great time for shopping..\nGuys first check tv at ur nearest lg Shoppe and then place order on flipkart so that u get right size for ur room...\nDelivery and installation really good..\norder on 2 oct got tv on 4 oct..\ntv is manufactured on 8 sep...50500 rs mrp\nmarket price was 47000 i got it at flipkart for 33240 after making online payment through sbi debit card..\n\nOverall good tv experience I m happy with this deal",
            "Hello everyone...\nI was planning to buy this TV from last 4-6 months but I was confuse between Offline & Online purchase due to Price difference and risk factor of online purchase.\nAfter lots of thinking finally ordered this LH LH576T on flipkart with BIG DISCOUNT of Rs.8000 as compare to offline dealer. At the time of placing my order flipkart assured me for delivery on 7th April.\nOn 7th april my order tracking status was showing reached at delivery destination. I was waiting for delivery person's call but no one contacted me till 4pm. I was visited ekart office near to my home just on walking distance. The person who was on chair behind the computer was playing game on his phone, I told him about my order but he ignored.... after 2 times of repetition he said TV and other big products dose not delivered by us and we dont have any contact details or address of other delivery partner. till now everything was okay.... but when I contacted tollfree number of delivery partner \"GATI TRANSPORT\" they said it may take 24 to 48 hrs to deliver your product. I said it is allready running late and why you need 48 hrs to deliver my product when it is reached in my location?? Can I cancell the order?? he said sir it is your order and you can do anything we will not deliver this product b4 48 hrs due to other orders are pending for delivery. after that I contacted to flipkart social media CC the called me back in few min and discussed my issue. and after that within 10 min GATI person called me and assured me for instant delivery at my place on 9th April (2 days late).\n\nNow come to the product and Installation\n\nInstallation :\nOn monday morning I received SMS from Jeeves for my installation and demo appointment booking.\nEngineer called me on 5:30 PM and within 15 min reached at my home.\nWithing 15 min he done his teble top installation process.\nHe was unable to answer my technical questions due to lac of knowledge.\nInstallation & wall mount was totally free.\n\nAbout TV\nI m using this TV from last 4-5 days and Im Impressed with the sound & Picture quality.\nIf you have unlimited hi speed data access then YouTube experience will be superb.\nUniversal remote function is missing.\n1TB external HDD working fine with USB connectivity.\nOverall it is fantastic product at this price.\n\nNOTE : I GAVE THIS PRODUCT ONLY 1 STAR JUST BECAUSE OF THE #rd CLASS DELIVERY BY GATI.\nI WILL NEVER BUY ANY BIG SIZE PRODUCT FROM FLIPKART IF DELIVERY PARTNER WILL BE GATI.",
            "I am writing the review after using it for 10 days. I ordered it on 20th sep during Big Billion Day sale at an amazing price of Rs. 35732 (35499+233 for 2 years extended warranty from Jeeves). Received it on 21st sep. As always Flipkart rocks in delivery. Packing was also perfect. I got a call from LG regarding installation on 21st itself and it was installed at my home on 22 sep. As expected TV box does not contain Magic remote. The guy brought with him the swivel type wall mounting kit and everything was free of cost. Now the Pros and Cons-\n\nPros-\nPicture quality is very Good.\nSound quality is also very good. While playing Youtube volume level at 20 out of 100 is sufficient.\nPlays all common video formats like .mp4, .avi, .mkv etc.\nConnects to Wifi without any problem.\nScreen share or Miracast is also working perfectly.\nYoutube takes around 2-3 sec to start a video but then plays it without any buffering . I have 3 mbps broadband at home.\nHDMI and USB ports are working fine. I have connected 1 TB hard drive and tested. Only USB and one HDMi located at side and one HDMI at back.\n\nCons-\nTV does not come with a magic remote.\nIt does not support wireless Keyboard or mouse. (A big disappointment)\nIt does not support LG TV Plus app. If it had, We could use our mobile as magic remote.\nOnly one USB port.\nDoes not have a web browser.\n\nFinal verdict- If you don't use smart features a lot, then this TV is perfect at this amazing price. This is a semi-smart TV with basic features only. If you need all smart features you can go for the next higher model i.e. LG 43LJ554T. It supports all smart features though it does not have a magic remote. In my case I am happy with the TV except that it should have supported wireless keyboard and mouse. That is why I have reduced one star.",
            "Hi I am from Coimbatore, I am writing this review after two months of use.At first I would like to say about the picutre qulality, Picuture quality is excellent compare than others.Color reproduction is excellent an accurate, white levels are great but black level are not so great. It has 2 hdmi inputs,one with ARC, works fine. Miracast works fine, I connected my lenovo A7000 phone with my tv without any issues. The external usb is working fine, but it cannot play most of the file formats. Network file browser works fine, subtitle is not working even the subtitle file has the same of video file and both are in the same directory. Good packaging and delivery from flipkart team and the same day installation is done without any cost(Table top) from Jeevs consumer service.",
            "Superb Buy\nWorth the money, thoroughly satisfied with the product.\nI was destined to buy a smart TV from a newer brand at the same price with bigger screen, but decided not to after seeing the review of both the products.\nAnyday LG, Samsung , Sony stays ahead of other players in the market. There were review and people commenting picture, sound quality and overall experience of Panasonic,Vu,Tcl being on par if not higher with the top brands,I strongly disagree, with time you'd feel going for a reputable brand should have been your choice for it's features and service.\nHave been using it for a couple of months.\nNo regrets buying, and totally happy.\nCrystal clear picture quality, pristine sound, good connectivity with built in WiFi.\nMira cast quite slow.\nIf you're a movie or TV serial freak, you can go for it stands hevc x265 content without any external applications, since it has a built in one.\nHassle free operation with hard drive pendrive up to 2tb .\nOnly con very less connecting ports.",
            "Excellent service by flipkart. Delivered on third day from order. Installation immediately after one hour from delivery. Flipcart continuesly proving their excellence in customer service and satisfaction.\n\nRegarding TV it is better then expected. Though it is first day of use but my very first impression that picture quality and sound is good. Have not tried hd channel yet. Youtube video, screen share and netflix experience seamless. So overall am very happy to have lg brand smart tv with 34.5k after all discount offer.",
            "Lg 43,FHD smart omg in 33k like Bulls eye in the sale..\nThe delivery came on time I.e. 3 days.\nThe packing should be better rather there should be some packing above the box there was nothing .overall I got the product at unbeatable price and in right conditions.\nThe installation engineer came 2 days after the delivery and installed for free no charges.\nI am delighted.",
            "After 8 days of delivered tv , Technician visited for installation at my residence with out installation tool kit. Technician not installed tv on wall mounted cause drill m/c not available with him. We have started tv with Installation on table top. And We requested to technician for Demo. Technician not knowing mostly features of such smart Tv. He is not sound knowledge of this TV applications i.e how to share screen of smart phone with Tv , How to connect Wi-Fi Direct , wireless network connection not activated ,what is function of Netflex , Yupp Tv,My Media etc. After spent huge money to bought this product still using my Smart Tv as a normal Tv due to not proper knowledge given by supplier .",
            "1) Flipkart\nDelivery service is super fast.\nInstallation service is fast. But installation agent is not well educated about the product.\n\n2) LG\nPictures quality is excellent\nSound quality very good.\nSometimes not connecting to you tube.",
            "AWESOME NEXT DAY DELIVERY BY FLIPKART WHICH WAS JUST MANUFACTURED JUST 20DAYS AGO...... wsRETAIL SELLER WAS TOTALLY AWESOME\n43INCH LOOKS DAMN AWESOME AND SPEAKER IS REALLY VERY GOOD\nTHIS ISNT FULL SMART TV AND YOUCAN ONLY INSTALL AND USE APPS AND NO BROWSING THE WEB BUT IT INST A BIG NEGATIVE\nFULLY SATISFIED BY THE QUALITY AND SERVICE OF BOTH TV AND FLIPKART",
            "Absolutely fantastic Product. Thank you Flipkart for timely delivery and installation. LG Smart TV much better than any brand. Sound is excellent. Picture is crisp and clear👌👌",
            "Delivery and Installation was on time. Picture quality is good and sound is outstanding, you don't need hometheter unless you have ample living area. Felled in love with Mira cast. And Lets hope best service from LG",
            "I am deducting 1 star due to late delivery . It wasn't flipkart's fault, the courier service wasn't that good. Anyways it's only delayed by 2 days . The installation was fabulous .\n4th Nov. 7pm I got the tv. Next day 9am I got call from jeeves saying confirming and asking about the time acc to my choice . The wall mount was also free which is a plus point but due to some reasons I didn't preferred the wall mount option .\n\nNow coming to the product\n\nAs I am not an expert . These are just my revehw\n\n- TV is super big and looks very premium . With its stand/ supports it looks gorgeous.\n- Audio quality is simply great. Even only on 25% vol. My whole Hall was like a disco and the sound is pretty clear too. You won't get a bass like effect but it doesn't matter atleast to me\n- TV turn on time is 3-4 sec max.\n- Screen Casting works flawlessly and I enjoyed it the most.\n- Youtube is also pretty awesome and the quality on the videos was simply amazing .\n- It was a life like experience watching 1080p videos on TV . So the picture quality is also a plus point.\n- Can't find an issue till now . I am enjoying it....\n\n\n\n\n\n\nAnd I got it for 36k.\nSo no regrets\n.",
            "Nice and good budget tv.. i hve brought it from QRS for 38000 .. anyway its good",
            "I Received this product after 4 days of product ordered same day installed its very large screen with good clarifty and clear audio really very attractive look and simple to handle..good responce from flipkart....actually i got this product 34,499..simply worth of money...thank you flipkart",
            "SEXY LED BY LG EXCELLENT GRAPHICS\nIF YOU ARE GOING TO BUY SONY BRAVIA THAN IN COMPARE TO THIS U HAVE TO PAY ATLEAST 60000 RS",
            "I love it, simply great product. Nice pitcher, great sound and also smart with lowest price in the given segment along with big brand name LG.\nI challenge for this kind of combination. This is perfect and rational decision to buy this product. I bought it for 34K after Cashback. I strongly recommend this product.",
            "Amazing product. Got it in best offer price. Using if from 8 month .Not a full android TV but it got features what you can do on TV in day to day bases . Flipkart Delivered in given time with wall Mount Bracket. Installation from jeevas was just perfect and really fast . All features are working perfectly. Worth buying...",
            "I bought this TV during big billion sale. Picture clarity is best in the class, sound clarity is just amazing. Installation was smooth.. Installation guy himself brought a v guard stabiliser.. Slightly thicker than I imagined.. and I could not find Facebook and similar apps.. YouTube works fine..Remote is not a magic one..Otherwise a great product..",
            "ITS A VERY GOOD LED TV AS 1080P VIDEOS FROM AIRTEL HD AND OTHER HD DOWNLOADED CONTENTS LOOK SHARP AND NATURAL DUE TO IPS PANEL ALSO SMART TVS INTERNAL MEDIA PLAYER PLAYS ALL FORMATS SMOOTHLY . 2 HDMI INPUTS ALSO A OPTICAL PORT MIRCAST IS AWESOME AS IT HELPS TO CONNECT ANY MIRACAST SUPPORTED PHONE TO CONNECT THRU TELEVISION IN 40K ITS THE BEST OPTION FOR 43 INCH SMART TV I ALSO HAVE A LG 4K TV 4K IS OUTSANDING BUT FOR 1080P ITS BEST AS 4K CONTENT IS NILL AND DUE TO SIZE LIMITATIONS ITS OF NO USE TO INDIAN CUSTOMERS",
            "Best of 43\" inch led TVs\nAwesome picture quality, sound and flexible connectivity. LG gives best among all competitors like Sony Samsung Panasonic etc compromise with quality as well budget factor. Don't think much go with LG. LG Satisfies what you expect.",
            "It has been 3 months since I purchased this product. I am very much satisfied with the performance of the product and the delivery was appreciable. Regarding the product it is not a complete smart TV but a semi smart TV with inbuilt apps like you tube, hungama, Netflix, yupp me.... Considering the price range of the product, it worth the money",
            "nice HD TV\ninstallation done ontime\nbut they r not providing flexible movable stand to fix TV to wall . I again invested 2500 rupees for that .\nif use LG wall mounted set I can't use USB and HDMI ports . so I request LG people to provide moveable wall mount set in future to customers .\noverall a nice product if u r HD user",
            "This TV is such a nice experience in viewing\nI enjoy YouTube and screen mirroring on it\nGot it on best price from Flipkart",
            "Flipkart did really well, the speed of the delivery is just wow and that too free\ncoming to the product, it's just amazing product. the picture quality is top notch and crisp sound, and it's not full smart, it's hybrid smart, best 43inch tv at this price, got it for 37999.",
            "Delivery was a bit late may be due to the big billion day sales.\n\nTV performance :\n\nNice product if you are looking for a smart TV with good brand and easy accesses for servicing and also most important low price.\nSound is incredible\nNetwork connectivity is good.\nEasy to understand user interface.\nBuilt in Apps work really well and fast.\nPicture quality is good but can observe some distortion in color when watching from sides .\n\nInstallation was done quickly the next day of delivery.",
            "Poorest of poor deleivery...1 week delay in deleivery.\nComing to tv:\npros: great audio quality.\nGreat video quality . Excellent built and sleek also comes with a free wall mount.\n\n\nCons:\nPeople looking for a real smart tv must not but this tv as tech is outdated.\nThird class ordiniary outdated remote control.\nOnly collection of few apps. There is no browser app and u cant even install a new app.\nThe user interface is slow.",
            "The product has been incredibly good ... And got the best deals on Flipkart... Bought it for my parents..",
            "Product is excellent and Flipkart service is also amazing..! ordered today and next day it delivered..\n1) Video & Audio clarity is amazing ( especially you can see this with HD channels)\n2) USB Play is working fine.\n3) Miracast (Screen Mirroring) is work well from mobile & also from Laptop\n4) YouTube & Netflix works well.\n5) Overall the product is very well at this price when compare to other products with this specs.",
            "Good smart TV futures are very well but Bluetooth not there, led screen i having some problem...",
            "Awesome tv. Must go for it. As lg tv's are knows as lg sound master. It gives dollby digital sound. Its awesome for 34.5 k . Good deal for me. :) strongly recomended.",
            "One of the best tv but Flipkart did not help me to get it installed. 1500 rs Bracket not delivered to me. Service needs to be improved.\n\nSound-10 u will love it better than Samsung and panasonic samurai series\nPicture-9 better than Samsung but less than Sony.\nConnectivity-10 miracast connects my phone in a second. Get connected to my WiFi and no lag in playing video on YouTube.\nApps-7 limited apps so android TVs are better.\nHDMI-10 connect from my DVD player and play in HD mode. I feel more clear picture quality than Laptop\nMemory- 7 Not sufficient",
            "I got it during big bullion sale before diwali.\n\nIt is value for money. SD picture quality is good. Tried some HD videos using You tube but was not satisfied with picture quality. Screen sharing from mobile worked after many retries.\n\nSound is clear and loud.\n\nInstallation was quick, however guys doesn't know much about features and cannot give proper demo.\n\nCan buy it if you are getting it below 35K.",
            "Im writing u this after the use of 4 months . This performing well so far\n\nPros\nGood color reproduction\nDecent sound reproduction\nValue for money\nCons\nI bought this for ps4 and its fails me as in terms of refresh rate . Not very good for gaming especially games with fast movements that's y i gave 3 stars\n\nWhen u connect usb. Sound our is low\nWon't support HD (tried only once didn't work )\n\n\nGood tv for home use but def no for gaming",
            "Superb deal from flipkart and service from flipkart is best.\nA very good product from lg and excellent service by flipkart. I bought it only 23000 with exchange my old led tv and discount on cash payment through sbi card.\n\nThe product is very good. Screen quality is excellent. Sound is also good.\n\nAs it mention, flipkart done deleivery on mention date and also installion on the same day with demo at no cost.\n\nI love fipkart.",
            "Pros:\n1. Full HD & Ultra HD Netflix,Youtube Videos ,Movies and channels Looks great.\n\n2. Boots up quickly.\n\n3. Good Viewing angles.\n\n4. Hard drive connects instantly.Supports most video formats.\n\n5. Miracast works fine but only on supported phones.\n\n6. Good Sound quality. Volume level is high.\n\n7. Competitive pricing. Sony,Samsung tvs offering same features at a higher price.\n\nCons:\n\n1.Low quality videos/SD channels doesnot look good. Tv does nothing to enhance pic quality of such videos.\n\n2. Only usefull apps are youtube Netflix,hungama,yupp. Netflix and yupp is subsciption based.If you are looking for more smart features like browser,magic remote check out 600t.\n\n3. None of the remote control apps work. Not sure if this feature works with this TV.",
            "The product is superb for the price. It has good display with good sound. The looks are good and works perfectly without any glitch.\nOne minor problem with the device. The device is not able to remember the WiFi network or the password. Beside that the product is good\nThe service engineer installed it on the day of delivery and was friendly.",
            "Awesome TV in this budget. Picture quality is too good, but little bit disappointed with sound quality! Sound must be improve! But you have lots of options in sounds setting to improve sound quality..\nAnd one more thing Sometimes you disappointed with srceen sharing, Phone will not connected with tv.\nBut it's not a big issue, you reconnect the device by restart.\nOverall in this budget with smart function.. I'm very happy with LG smart TV",
            "One of the latest smart led product from lg,crisp clear pictures,full hd,20w sound is awesome,above all ots a smart tv,thanks lg n flipkart,delivery was done before the promised date...",
            "Product price is not clear they offer Wall mount is free is full charge of 1550 rs. So no meaning of free , person come for installation no idea about TV functionality like describe installation and demo difine in product",
            "Got this television for 37,740 rs. At 20th November 2016,\nWell the tv is fully covered and power packed by flipkart, the packaging was good and delivery also done in 2 days by the seller. And demonstrations is also excellent by Jeeves\n\nNow back to tv:\n\nPros:-\n1. HD is awesome, its support all the video files like mkv, mp4, avi and lots from pendrive or USB.\n2. The youtube inside, YouTube is working flawless and adjusts graphics quality as per our internal connection.\n3. You can easily connect your mobile screen with Miracast and wifi direct.\n4. Best part if this tv is its price and Brand, you can't take the full hd smart television at this price with brand like LG, all because of flipkart, Thank you.\n\nCons:-\n1. Its only problem is its Miracast, it is not supporting very high definition videos from mobile, but its managable....\n\nOverall classy product at this price range... Happy with product",
            "After 2 months of usage I am able to give my honest opinion on this product.\nThe only reason i have deducted one star is because flipkart charged me Rs. 1200 for the wall mount even though they had explicitly mentioned a free wall mount in an advertisement.\n\nPROS:\n- Great picture quality. Even low quality videos look great. Looks stunning with HD channels.\n- Sound quality is very good and there is absolutely no need for any kind of speaker.\n- Smart apps work fine (though I don't have much use for them).\n- Screen mirroring works nicely.\n- USB playback is smooth and lag free and can play all common formats.\n- At 32K it was a steal!\n\nCONS:\n- You cannot play 10 bit videos through usb (WHICH IS VERY IMPORTANT TO ME) so many of my high quality shows don't work.\n- LG App Store is extremely limited. Only 2-3 apps are relevant , others are useless.\n- Absence of even a simple browser.\n- Difficult to access media servers or other streaming methods.\n- Has only one usb port.\n\nThe TV is definitely worth buying if you do not require any browser etc and just need a basic smart tv.\nThe quality is remarkable and the price is quite justified.\nI would recommend people to buy this.",
            "After using the TV for about a week, I noticed that it had a bad case of Image Retention. Image Retention a.k.a. Image Sticking/Ghosting happens when an image gets imprinted on screen after being displayed for a long period. Image Retention can become an issue if it becomes permanent (Image Burn-in). I had a 40\" Samsung LED TV before this and never faced this problem with it (that TV also had big issues, but that's a tale for some other time). I told Flipkart about my predicament, and they immediately processed a replacement that I received the very next day. However, it's been 2 days since I received it and I'm still waiting for the installation to be done. I will update this review after testing the replacement TV.\nUpdate: After using the replacement TV for 3 months I am fairly satisfied with the product. I did some research online and found that certain LED TVs have retention issue if used as a monitor. Unfortunately, I am using this as a PC Home Theatre. Fortunately, I also found a solution for my problem. I have kept the screensaver on, so if the PC is unused for a few minutes it automatically starts; preventing the retention issue. Like many have already pointed out here that it is not a proper smart TV as it is missing many features, so do your research before buying it. The clarity is good. The picture setting has a lot of options to customise the display to your liking. I personally prefer the \"Game\" mode with \"High\" noise reduction. Changing my rating to 3 Stars.",
            "The LG smart TV is not so smart, actually. Although its been branded as a SMART TV it comes with pre-loaded apps most of which are of no use or are games. It does not have a BROWSER which according to me is a big minus. I have a LG 32 in smart tv of years old which has browser. This marketing of smartness but fooling buyers into buying a cheap or discounted smart tv is misleading. IT should clearly be told that it does not support browser nor a smart remote. You feel really stuck when u r typing on youtube.\n\nOverall quality of product is good as I already have LG 32 in smart tv. But if its misleading people then its not good but cheating. another model of LG which costs 10,000 more had browser support.",
            "We loved the product.. particularly the smart TV options and video eye comfort along with audio std.typeII... 43inch best fit for our living room and the clarity of tv is awesome..oveerall experience with flipkart is good and very well managed to deliver the product on time.",
            "Pros\n\n- Excellent picture quality\n- Excellent sound quality bo need if external speakers\n- one HDMI and USB port at side\n- Total of 2 HDMi\n- Looks good when wall mounted\n- Free wall mount flexi stand and installation by Flipkart partner team\n- Wifi works fine no lags at all while casting screen\n- 1 TB HDD tried and works very well\n- laptop files n folders can be used by sharing folder in public video folder on windows\n\nCons\n- For smart features Location does not support US location, so very very limited apps which can be used in smart features\n- No web browser, so no web surfing, in smart features due to very limited apps we only end up using YouTube and Netflix for all others we need to use our Mobiles and cast screen on TV\n- Android mobile remote not support, tried several apps but none of them work with this TV model, so no option but to use the remote which came with TV\n- Magic remote not supported even using Abdroid mobile remote\n- Remote is not universal\n-No other option to cast laptops screen as my laptop was not supporting WIDI",
            "Nice product at nice price but, installation and demo was pathetic. Flipkart does it by themselves not by LG and the technician what they send for demo and installation are just good enough to make drills and hang your TV and if ur TV is smart ,then are dead smart too explain even the simplest info, forget the complicated features",
            "Excellent TV !!!!!!\nAbsolute awesomeness !!!!!\nWell to start with the delivery was delayed by a day so I am retaining the last star or else it wud have definitely been full on full...I understand it was the big billion but u know u got to keep up the expectations...\nThe TV is evryting from b to y in the word \" Beauty \" it looks stunning and I don't have more words sorry :-D\nThe brochure says it's only Full HD but trust me it's almost like Ultra HD 4k. I mean u definitely will not notice the difference.\nVery sleek n very purposeful.\nHas built-in YouTube and he'll it can even stream videos from your phone without the need for chrome cast :-D\nAm completely in love with it and definitely suggest it for others ;-)",
            "Hi,\n\nOrder ID - OD407240121232300000\nProduct - LG 108cm (43) Full HD Smart LED TV\n\nThanks for writing in.\n\nWe understand that you want refund for your product.\n\nWe are sorry to know that the product you have received is defective.\n\nWe'd like to set this right and have asked the seller to initiate a refund for the product as requested by you. This will be done as soon as the pickup of the originally delivered product is confirmed by the courier service provider and you’ll receive an email w...\nREAD MORE",
            "Superb phone with beautiful back design....💗💗really a very good phone specially for pics....and videos....range wise it's little bit overprice....get charg...\nRead full review",
            "Super camera....10 times better than expected...\nGood displaay",
            "This phone is just wow, absolutely a best phone under 20k, got it for 14.5k on flipkart Diwali sale, phone and performance is just amazing no doubt, camera n...\nRead full review",
            "Its very nice phone and good",
            "Awesome phone in price range, thank you flipkart for fast and safe delivery, it's really superb phone",
            "Phone is very good....love this product",
            "I so happy ❤️😊❤️❤️ really amazing product in this price camera quality so beautiful and nice",
            "Super mobile easy handling photos good quality 👍👍",
            "Very nice feature phone. Gives 4 5 days backup on low to moderate usage, crystal clear voice calls, wireless fm radio with a good speaker. What you want in 1...\nRead full review",
            "Cannot detect signal of airtel sim",
            "Pros:\n1. The display is really good as per this price point, sharp and bright.\n2. Battery backup is very good. Will last for whole day with medium usage.\n3...\nRead full review",
            "Best Mobile In This Price Range nd Thank you Flipkart for faster delivery.... Thank you so much.",
            "Amazing product thank you Flipkart",
            "very bad product do not buy this itym",
            "I am using this phone for 2 days now. As per my opinion the battery life and the display ar quite good. Camera is also decent.\nAs I was a Redmi user before,...\nRead full review",
            "Display is not like Samsung amoled phones,\nAfter one month, phone display become whole white blank while calling.. Pathetic",
            "Good phone , Don't expect much from camera but it can take nice pics but performance is outstanding snapdragon 778 and 144hz refresh rate it's battery consum...\nRead full review",
            "Not reached my expectations",
            "Very Very Very Very Very Very Good Products Nice Mobile And Best Price Thank You So Much Flipkart...",
            "Volume of the phone is very low. Wireless FM response is not as such good.",
            "1.Fast delivery by Flipkart\n2.Delivery personal's behaviour was very good\n3.Lookwise awesome\n4. Display quality 👌\n5. Camera is also good but for clear pi...\nRead full review",
            "Very Unexpected Experience... Too Much Software Issues From Beginning and Flipkart Return Policy is Just For 7 Days... Your Phone Will Hang and Malfunction ...\nRead full review",
            "Superb phone with beautiful back design....💗💗really a very good phone specially for pics....and videos....range wise it's little bit overprice....get charg...\nRead full review",
            "Super camera....10 times better than expected...\nGood displaay",
            "Thanks flipkart so fast delivery safely delivered excellent mobile and thanks delivery boy excellent service",
            "I absolutely loved the phone ❣️ the overall performance of the phone is quite good...... If you are looking for a budget phone it's worth ....... Till now ph...\nRead full review",
            "The Best Phone for the Money\n\nThe iPhone 11 offers superb cameras, a more durable design and excellent battery life for an affordable price.\n\nCompelling ultr...\nRead full review",
            "Good phone at this price because anyhow you are gonna waste 20000 to 30000 for any other brand then why not opt for the beast like iPhone. It’s really very g...\nRead full review",
            "Best Vivo Y15s Smart Phone",
            "Super quality phone",
            "excellent feature phone with minimalist and modern look. Great Call Quality. Good textured back which is good to hold and great sound. Battery life is amazin...\nRead full review",
            "Nice keypad phone.looking nice and very comfortable.",
            "Good 👍👍👍\nValue for Money 💸💸💸",
            "Poor quality nd low valume",
            "Honest review after using it for three days.\n\n1. Look and feel - Awesome! Camo Green colour is amazing. It's very handy and comfortable in typing.\n2. Perform...\nRead full review",
            "For me it's perfect . You will feel no lagg ,smooth while using the application.\nCamera is good\n\nSound is good .\n\nBattery is superb .\n\nOverall it's totally ...\nRead full review",
            "I'm completely satisfied with the product. It is my first Samsung phone and bought only for talking purpose. I have selected golden colour snd it's looks lik...\nRead full review",
            "Poor battery backup",
            "After 3 days of use\nCamera is good but need to improve more(my personal opinion)\n\nDisplace is good and smooth and nice to use\nGaming is also good\n\nChargin...\nRead full review",
            "Very nice phone and battery and camera very good 🙂🙂👍 thank you Flipkart",
            "This phone is just wow, absolutely a best phone under 20k, got it for 14.5k on flipkart Diwali sale, phone and performance is just amazing no doubt, camera n...\nRead full review",
            "Its very nice phone and good",
            "The phone is good for the price at which it is available now. But it could have been better if the display was at least IPS LCD not TFT.\nAnd other thing that...\nRead full review",
            "good mobile good battery 🔋 👍 👌 👏 😀",
            "1.Fast delivery by Flipkart\n2.Delivery personal's behaviour was very good\n3.Lookwise awesome\n4. Display quality 👌\n5. Camera is also good but for clear pi...\nRead full review",
            "Very Unexpected Experience... Too Much Software Issues From Beginning and Flipkart Return Policy is Just For 7 Days... Your Phone Will Hang and Malfunction ...\nRead full review",
            "Great Phone at this Price point. Superb cool Design.. Good battery, display and overall performance is superb..Back camera good...Front Camera is average.",
            "Performance not up to the mark",
            "best quality battery backup, best performance, SOUND QUALITY is very good, and Bluetooth speaker and all function are best, best keypad phone for buy, 👌 👌 ...\nRead full review",
            "TotAl phone perfamence slowly and charging wrost",
            "Very good👍👍👍 phone good display good performance good battery performance design 👌👌👌camera good keep it up infinix good job",
            "It is one of the best phones in this price range. The camera coudl've been better. If you are searching for a phone with excellent performance and you are ok...\nRead full review",
            "Superb phone with beautiful back design....💗💗really a very good phone specially for pics....and videos....range wise it's little bit overprice....get charg...\nRead full review",
            "Super camera....10 times better than expected...\nGood displaay",
            "Phone looks great in hand.\nBuild quality is good and it looks premium.\nDisplay is good and it works smoothly at 120hz setting\nSound quality is better from pr...\nRead full review",
            "The device delivered fast and the packaging is awesome too!\n\n- Display is too smooth and crisp because of the Amoled 120hz.\n- Performance is awesome you can ...\nRead full review",
            "The Best Phone for the Money\n\nThe iPhone 11 offers superb cameras, a more durable design and excellent battery life for an affordable price.\n\nCompelling ultr...\nRead full review",
            "Good phone at this price because anyhow you are gonna waste 20000 to 30000 for any other brand then why not opt for the beast like iPhone. It’s really very g...\nRead full review",
            "Nice product and Worth For Money...Quality of handset Body Is very Nice and Gud quality... SPEAKER SOUND Quality is Too clear and that's so gud with High Sou...\nRead full review",
            "Waste of money, don't buy this product , it's very heavy and not wearable after buying this for my father, he wants to exchange this phone with my poco x3.",
            "Music is best in this phone\nCalling is best\nDesign is very good\nI love dizo (realms)",
            "Very lowest working in Mobile",
            "very nice salora volt 2 is then better qwality and very soft and nice mobile so my father is so happy to choose my product i always truste ekart services so ...\nRead full review",
            "Good phone.. battery 🔋 small pregnent",
            "It's a good phone if you are looking a 5g underbudget and don't wanna buy Chinese brand. Definitely go for this then . Camera is also good but front camera ...\nRead full review",
            "Very poor camera quality looks like vga came",
            "Very nice perodkt thanks",
            "Owesome phone and thanku flipkart for quick delivery..",
            "I purchased it today .. look is very good , Tahiti blue colour is also good . Camera is good .. back side of finger print digine M look is attractive .. and...\nRead full review",
            "Not good at all do not buy",
            "Exellent product, fabulous quality, best ever product comes from Samsung, Worthy product value for money.",
            "A SUPERB 5G PHONE WITH A GOOD LOOK AND PERFORMANCE.SAMSUNG HAS DONE A GOOD JOB !!I GOT MY LATEST UPDATE OF ANDROID 12 ON THE SAME DAY I RECEIVED THE PHONE FR...\nRead full review",
            "I have used samsung for many years now... But Redmi note 11s... Is excellent...\nSame features in Samsung cost me more than 30k... But redmi is ultimate..\nG...\nRead full review",
            "Very nice phone\n\nCamera quality good\nBattery life good",
            "Nice product from oppo camera quality is good and usability is also good battry life awesome 👍",
            "Best phone for lower price",
            "I did not like this mobile\nNot working properly\nThis time I bought bad mobile",
            "Vest for mobile I am so Happy",
            "It's really good Product such a good product it's amazing redmi 11t 5g thank you Flipkart",
            "Superb performance of the year",
            "mobile is good. overall design and build is nice and feel good to hold on to it. camera is above average better compere to other phones in this segment. disp...\nRead full review",
            "Not satisfied with this product",
            "excellent feature phone with minimalist and modern look. Great Call Quality. Good textured back which is good to hold and great sound. Battery life is amazin...\nRead full review",
            "Nice keypad phone.looking nice and very comfortable.",
            "I have gifted this phn to my mom and its totally worth at this price for daily use as well as camera and battery performance is awesome, can expect good perf...\nRead full review",
            "Mobile is good.camera feature mobile features best but , incoming calls lagning on this phone",
            "So cute and best for old people I gifted this to my grandfather it's too easy to use and looks great! He's very happy! Thank you flipkart",
            "Easy to access. Nice look,",
            "Good phone. Colour changing feature is unique!!\nCamera quality superb.\nBattery is ok-ish but kudos to the fast charger. It just takes 30 minutes to full char...\nRead full review",
            "Vivo v23 5G so beautiful ❤️ camera decent performance is high l love it this vivo v23 Sunshine gold",
            "mobile is good. overall design and build is nice and feel good to hold on to it. camera is above average better compere to other phones in this segment. disp...\nRead full review",
            "Not satisfied with this product",
            "This is my user experience over more than 7 months.\nThe phone is actually good for the price\nBut there are also some annoying factors about it.\n1.The caller...\nRead full review",
            "Very Bad Experience to buy this device",
            "It s a best phone. Good luck. I am unboxing man.It s a good",
            "It's too Good. I like it very much.",
            "This phone wins hands down with the boxy design and premium feel ...selfie cameras are too good ...worth the purchase...Sound quality through earphones and w...\nRead full review",
            "very nice mobile with this amount ...",
            "Looks like very nice 😍😍👌👌\n\nIn handy very good and litely 😘😘👌👌\n\nBack side style are very different other keypad phone 😍📱👍",
            "Camera not good better is very good audio very nice speakers",
            "Good mobile phone nice camera and colour thank flipkart fast service 2day",
            "Very nice phone, good camera,battery backup very very good, speaker good",
            "Display - its looks to be fine while using its moderate and intensity is okay according to outside (mainly according to sunlight).\nColour contrast and videos...\nRead full review",
            "Great if you can install a costom rom",
            "I really like this phone . I am very happy. My family is very happy. When I received the mobile the package is very beautiful. I like the colour and model. T...\nRead full review",
            "Nice body and mind blowing look",
            "Nice product from oppo camera quality is good and usability is also good battry life awesome 👍",
            "Best phone for lower price",
            "Such a awesome handset in this segment.\nPro's:- * Good display in this price segment but not compete with amoled display.\n* Helio G95 performs pretty well ,w...\nRead full review",
            "Very good picture quality",
            "I have gifted this phn to my mom and its totally worth at this price for daily use as well as camera and battery performance is awesome, can expect good perf...\nRead full review",
            "Mobile is good.camera feature mobile features best but , incoming calls lagning on this phone",
            "I will satisfied this product",
            "Nice phone but display is very small",
            "Value for money. Low budget high specifications. Good mobile. Work from home time delivery on correct time. Thanks for Flipkart. Delivery executive also grea...\nRead full review",
            "Battery backup is vey good",
            "Value of money budget mobile phone good one luv it",
            "Phone have over heat problem",
            "Honest review after using it for three days.\n\n1. Look and feel - Awesome! Camo Green colour is amazing. It's very handy and comfortable in typing.\n2. Perform...\nRead full review",
            "For me it's perfect . You will feel no lagg ,smooth while using the application.\nCamera is good\n\nSound is good .\n\nBattery is superb .\n\nOverall it's totally ...\nRead full review",
            "It's a good phone if you are looking a 5g underbudget and don't wanna buy Chinese brand. Definitely go for this then . Camera is also good but front camera ...\nRead full review",
            "Very poor camera quality looks like vga came",
            "Good battery backup\nSound is very good the back camera is superb 😍\nLook so slim beautiful mobile I love it 🥰",
            "All is ok but camera is not good very bad quality",
            "Amazing phone. True Nokia!\n\nPros: Very durable (similar to old Nokia phones). Very clean & efficient software (stock android). Lag-free software (YES! 2GB R...\nRead full review",
            "Best mobile in this budget",
            "Delivery boy was so sweet\nBut mobile is very small like a toy",
            "Overall the product is ok but very low voice could be hear on handset mode while calling even in maximum level of speaker. Battery backup is also good but co...\nRead full review",
            "Product is very nice colour is good and I like this phone and value for money etc......",
            "Great phone within this range.",
            "very nice work battery backup nice camera best all system this product very good and service thank you flipkart⭐⭐⭐⭐⭐",
            "First of all product of MI is amazing but in this redmi note 9 there is an issue with his battery. It's take so much time to get charged and during uses its ...\nRead full review",
            "best quality battery backup, best performance, SOUND QUALITY is very good, and Bluetooth speaker and all function are best, best keypad phone for buy, 👌 👌 ...\nRead full review",
            "TotAl phone perfamence slowly and charging wrost",
            "Excellent product.amazing word cant describe this phones quality. I buy two phones.amazing.camera,battery,display are well.But is processor is not well at t...\nRead full review",
            "This is a nice product in economic value",
            "If u want a compact phone, go for it!\nBattery is fine with a day’s juice.\n\nP.S - Protect your mini with a good cover 🧿",
            "If you want a small phone with powerful performance and cameras with added brand value. This is the phone to go for. Trust me Its that good. It may not justi...\nRead full review",
            "Delivery boy was so sweet\nBut mobile is very small like a toy",
            "Overall the product is ok but very low voice could be hear on handset mode while calling even in maximum level of speaker. Battery backup is also good but co...\nRead full review",
            "Lava A5 is a great Phone. Text looks bigger than usual making convenient to see. Display is very good ,also the sound of this Phone is very impressive . the ...\nRead full review",
            "Very nice product. I like this model.",
            "Nice product and Worth For Money...Quality of handset Body Is very Nice and Gud quality... SPEAKER SOUND Quality is Too clear and that's so gud with High Sou...\nRead full review",
            "Waste of money, don't buy this product , it's very heavy and not wearable after buying this for my father, he wants to exchange this phone with my poco x3.",
            "Since it's a Helio G95 powered phone, the phone heats a lot and I need to play games in a cool room. The first few minutes, I get 60 fps in battle royale gam...\nRead full review",
            "Superb phone camera is very good overall performance is very good i like it.",
            "I am using iphone 12 mini around 3 months.I got in BBD Sale. It's too handy that I expected. If you are looking for a personal phone for use you should go. S...\nRead full review",
            "Great and handy phone with powerful processor",
            "best quality battery backup, best performance, SOUND QUALITY is very good, and Bluetooth speaker and all function are best, best keypad phone for buy, 👌 👌 ...\nRead full review",
            "TotAl phone perfamence slowly and charging wrost",
            "This best phone display super and battery backup upto two days best performance and I like phone this see also a car best mobile for money",
            "I love this product thanks flipkart",
            "It's a good phone if you are looking a 5g underbudget and don't wanna buy Chinese brand. Definitely go for this then . Camera is also good but front camera ...\nRead full review",
            "Very poor camera quality looks like vga came",
            "This mobile phone is physicaly very strong and over all very good",
            "Nice phone value of money grat phone thank Flipkart",
            "Product good",
            "Product good",
            "Good Handy phone",
            "Good Handy phone",
            "Best Phone under budget segment. Its battery gives full day backup. Display is awesome. And it is perfect for gamers. Camera is too good after installing gca...\nRead full review",
            "Redmi be like (Heat heat heat...I dont like heat..but heat likes me) Heavy heating issues, even when we use normal apps.",
            "Pros:\n1. Supports 13 5G Bands\n2. Has a Dedicated Triple Card slot\n3. Supports WiFi 6 (5.8Ghz)\n4. Has the 3.5mm headphone jack\n5. Has 90Hz Amoled instead of...\nRead full review",
            "Worst device please I need a replacement or refund. Camera quality poor. Calls signal also not good.",
            "Amazing phone. True Nokia!\n\nPros: Very durable (similar to old Nokia phones). Very clean & efficient software (stock android). Lag-free software (YES! 2GB R...\nRead full review",
            "Best mobile in this budget",
            "nice mobile value for money",
            "Worst .... don't buy this product.. really disappointed",
            "After using 1 month there is no issue\n1.Performance is next level\n2.Camera is the best at that price\n3.Display is super smooth\n4.Battery is 5000mah with 33...\nRead full review",
            "The phone is too big like tab and it's get more bigger after putting case on it. At the same time, the quality of the display is not bad But the brightness i...\nRead full review",
            "Very beautiful mobile",
            "Very beautiful mobile",
            "I like the pictures it takes. Love the colors this time (I got the violet one, yay!). Finally a good processor. Display Size is good too. Value for money..",
            "Ok,battery is not good,internet speed to slow.",
            "superb mobile best camara best performance good battery 🔋 all over very very good mobile budget 5g mobile phone",
            "Battery very low capacity",
            "Have some bugs with the realme ui such as adaptive refresh rate not working, and filled with bloatware...\nother than that a great vfm flagship and recommend...\nRead full review",
            "Cameras can be fine tuned in upcoming updates, over phone is a killer",
            "So cute and best for old people I gifted this to my grandfather it's too easy to use and looks great! He's very happy! Thank you flipkart",
            "Easy to access. Nice look,",
            "Nice product for old age group of people\nHigh quality display and music...\nFor multimedia this mobile is very good\nWith amazing BATRRY backup 3000mah this B...\nRead full review",
            "Network signal poor frecvency",
            "I am using iphone 12 mini around 3 months.I got in BBD Sale. It's too handy that I expected. If you are looking for a personal phone for use you should go. S...\nRead full review",
            "Great and handy phone with powerful processor",
            "Nice phone and lightweight product\nStructur is so good\nSimply it's fine",
            "Ok very super,but.......charge back up loss than time",
            "Screen/Display : 4/5 (buttery smooth)\nPerformance : 5/5\nBattery : 5/5\n5G bands : 3/5\n(Shud have given 10+bands for the price we are paying)\nCamera : 2/5 (n...\nRead full review",
            "Cam was utter plop,charging was good, display was terrific bad, colour display was v.bad, performance is good,",
            "Great device. Let me tell the Pros..\n\n1. Superb build quality\n2. Great display.\n3. Camera is great in good lighting conditions\n4. Processing is great.\n5....\nRead full review",
            "Nice phone for the price by design is outdated",
            "This is veri good phon. Oppo is a best phone. This is a good product.",
            "Osm product really like it",
            "Great device. Let me tell the Pros..\n\n1. Superb build quality\n2. Great display.\n3. Camera is great in good lighting conditions\n4. Processing is great.\n5....\nRead full review",
            "Nice phone for the price by design is outdated",
            "Best for your Grandparents because of following reasons:\n1) Well Spaced Key Pads\n2) Rigid Body\n3) Better grip because of size\n4) Big display to see the names...\nRead full review",
            "This is a very good product, battery backup is satisfied me , touchpad is very soft and smooth .The one and only reason of good battery back up is there is n...\nRead full review",
            "Very bad performance\nDon't buy it",
            "Mobile is not good 😡😡😡",
            "Back camera very good nice photos click,front camera OK OK,disine very good nice loking",
            "Exllent phone performance Vivo",
            "Another great deal from Flipkart, mobile also good for calling purpose.. Smooth keypad and option for SD card makes it ideal for elderly people.",
            "Good quality and most importantly the sameg",
            "Nice product, even camera with flash is awesome. Very handy & give slim mob experience. On this range from top mobile companies, definitely this is the best ...\nRead full review",
            "I like it Nokia 3312 and very sexy model...",
            "Using since 100days..\ni watch this Mobile 1st foreign website look & futcher vice am very impress after only search flipkart immediate buy this mobile\n1) Ap...\nRead full review",
            "Good phone for parents...",
            "Best product, thank you for Flipkart Tim.",
            "Nice cel over all z very gud this price",
            "It is a Good product in this price range",
            "Mst mobile I like this",
            "Way to go Flipkart. You have nailed it.\n\nInitial experience -\nI was pleasantly surprised with the quick delivery of the phone.\nOn opening the package, I was...\nRead full review",
            "It is a good performance in terms of price.",
            "Good nice phone and super fast I like ram was expend wow amazing like and light weight camera was not bad ok like that phone thank u",
            "After 1 week use worst feeling because mobile switch off automatically and not start again",
            "Sound quality bad",
            "Sound quality bad",
            "Everything as per expectations, a very small and lovely mobile, good sound quality and a cute and beautiful mobile. Only drawback is its battery which couldn...\nRead full review",
            "Super ❤️💞💞💞💞💞💞💞💞💞💞",
            "Great design .. slim and light weight handy phone .. very good awesome ..",
            "Very very nice product 👍",
            "Wow superb camera phone\nVery smooth speed and no lag , iphone is the king always\nIts a beautiful product",
            "Everyone now's that iPhone it is always better than other mobile",
            "Nice",
            "Nice",
            "Thank you Flipkart it just oasm phone I am happy to buy 😘😘 performance of this phone is too good and others criteria of phone is also good.",
            "Good Product and Quality",
            "very good product in this range i m very happy i m give to my mom on mother's day.. thank u flipkart and this product give m 2 days before of delivery...",
            "Worst phone ever.My suggestions for it ,is doesn't buy it not working for a week even.",
            "Awesome Mobile far better than #samsung and #nokia. Battery backup 2 to 3 days. Call clarity good also. A budget feature phone for all grab it with no doubt..",
            "Lava ka best and sleem .....ladies use mobile...thnq lava😍",
            "Pros:\n1. The display is really good as per this price point, sharp and bright.\n2. Battery backup is very good. Will last for whole day with medium usage.\n3...\nRead full review",
            "Best Mobile In This Price Range nd Thank you Flipkart for faster delivery.... Thank you so much.",
            "I am thankful to Flipkart for providing me this latest iphone se3 2022 at good deal... I am first time iphone buyer.. I like it's user experience... It's po...\nRead full review",
            "I wanted a small compact phone with latest processor for smooth functioning. Fully satisfied ✌️",
            "Very nice and good product super",
            "Tecno Canon17 this product supar nich",
            "Pros:-\nDisplay awesome 9/10\nSpeakers awesome 10/10\nBattery backup awesome 9/10\nPerformance king 9/10\nCharging speed super 8/10\nTriggers amazing and accurate...\nRead full review",
            "Don't by this phone it is have over heating problems.. When playing bgmi it get very hot.and. Suddenly gets back from the game and torch is not going to work...\nRead full review",
            "Best battary life, best rear camera, very Nice phone, i loved it. 👍🏻👍🏻",
            "Battery is bad no fast charged",
            "Good mobile 📱 new model 🎁🎁",
            "phone quility is awesome ☺️",
            "It's not very good but it's good",
            "It's not very good but it's good",
            "Very beautiful phone impressive battery 6000 mah good display type c port this product is worth buying go for it 😀",
            "So have been using this for 4 months and to say the least it's really a great smart phone and that too an underrated one over shadowed by redmi & realmi phon...\nRead full review",
            "Excellent Mobile",
            "Excellent Mobile",
            "This model has a call quality issue.and 90hz display is really good. At this price point g85 processor with big battery and big display is really good. Stud...\nRead full review",
            "Nice product nice product",
            "Performance was very Good",
            "Performance was very Good",
            "Nice photo ❤️❤️",
            "Nice photo ❤️❤️",
            "Phone looks great in hand.\nBuild quality is good and it looks premium.\nDisplay is good and it works smoothly at 120hz setting\nSound quality is better from pr...\nRead full review",
            "The device delivered fast and the packaging is awesome too!\n\n- Display is too smooth and crisp because of the Amoled 120hz.\n- Performance is awesome you can ...\nRead full review",
            "Very good work look nice work in mobile 👍",
            "Beautiful mobile.😘",
            "Thank you Flipkart it just oasm phone I am happy to buy 😘😘 performance of this phone is too good and others criteria of phone is also good.",
            "Good Product and Quality",
            "Amazing phone. True Nokia!\n\nPros: Very durable (similar to old Nokia phones). Very clean & efficient software (stock android). Lag-free software (YES! 2GB R...\nRead full review",
            "Best mobile in this budget",
            "I am not satisfied at battery 🔋🔋🔋\nAll features are excellent without battery.\nCamera is awesome.\nRefresh rate is also excellent.\nI am very Happy with hand...\nRead full review",
            "Like model excellent piece",
            "Very nice mobile camera superb and excellent performance thank you redmi smart phone company i loved so much ☺️",
            "Amoled display must will be is better",
            "Good product at low budget but I feel that the camera is dull nd Rotation off button is not work properly After in this price it is a good product",
            "Just average phone. Camera is not that good. Have hang issues.",
            "Nice phone. Worth a money. At this price point what else can you ask for? .. Thanks Redmi.. I found some interesting features in the camera. Nice Disply and ...\nRead full review",
            "Redmi 9 power is a powerful smartphone..🤗\nPerformance is good\nBattery backup is highlight ✨ in this phone that is very powerful battery 🔥\nCamera was avera...\nRead full review",
            "Awsome Product , Value for Money ... Stereo Speaker is awesome ... Camera is pretty good but front camera is average. Processor is awesome 🤗 . You can go fo...\nRead full review",
            "Very nice batter backup you must purchase poco m3..\nIt also have nice camera quality but sometimes heat the phone normally. When charger is connected and we...\nRead full review",
            "Back camera very good nice photos click,front camera OK OK,disine very good nice loking",
            "Exllent phone performance Vivo",
            "Nice performance in this range 🙂",
            "Bad product Battery not good 1 and 30 hours raning ।low battery signal",
            "Very nice mobile camera superb and excellent performance thank you redmi smart phone company i loved so much ☺️",
            "Amoled display must will be is better",
            "Good",
            "Good",
            "This product is very very bad video quality is not good for front and rear camera.\n\nBrightness not coming well very very dim.\n\nNot satisfied with the product...\nRead full review",
            "I have ever bought these kinds of phone. Not worth for anything",
            "Mini Power House (Battery) in this price!",
            "Very nice to handle, battery backup is excellent, worth for value.",
            "Sound quality bad",
            "Sound quality bad",
            "Nice Kechaoda K116, So realistic iPhone look , The phone's thing is Very Good. I was very happy to pull up this phone.",
            "Very poor quality",
            "Good phone but not so good ok ok",
            "Good phone but not so good ok ok",
            "Excellent Phone.. great camera quality, good battery backup, good performance really worthy",
            "Camera awasome\nBattery bacup super\nNight photos very clear.\nSound is good\nBut body style average",
            "Mini Power House (Battery) in this price!",
            "Very nice to handle, battery backup is excellent, worth for value.",
            "Very nice phone but it’s performance is not smooth enough for this price and the front camera is not too good but everything is fine.",
            "Good phone with decent features. Loved the color and battery backup",
            "Great Phone at this Price point. Superb cool Design.. Good battery, display and overall performance is superb..Back camera good...Front Camera is average.",
            "Performance not up to the mark",
            "Phone is exactly same ..what as displayed.. ....\nLooking very attractive stylish & small ,very light weight,& good finishing phone...\nQuality is good .. netw...\nRead full review",
            "Very bad product.do not buy it.i bought i get broken phone.battery does not have life.",
            "It's so good with a medium size screen and much better camera. It's still worth in 2021. Go for it.",
            "Go with it !! Still worth in 2022\nPros : Performance, Security, Durability, Features better than android\ncons : a bit less battery backup (max 7 hrs)",
            "Good phone excellent working no more words",
            "I'm not using but look is good",
            "Very 👍🏻👍🏻",
            "Very 👍🏻👍🏻",
            "It's nice nd good looking phone awesome camera 📸\nFast charge it takes 70-80min for charge from 0-100%\nGood hand feel nd nice features just awesome phone",
            "It is hanging, overheating, sensor not working.",
            "I have ordered for Collouge, Performance, Android V11 n LED was good.",
            "Value for money..Good battery standby, Camera quality is reasonable. Worthy buy",
            "Best selfie on this segment\n1. Design is excellent its slim and lightweight\n2. Display is perfect amoled and 90hz is smooth brightness is good enough. Alway...\nRead full review",
            "Scam protect of Vivo ☹️ don't buy this waste of money you could not refund this worst mobile",
            "Thank you Flipkart it just oasm phone I am happy to buy 😘😘 performance of this phone is too good and others criteria of phone is also good.",
            "Good Product and Quality",
            "Awesome mobile just fantastic battery is great display is ok ok type according to me best mobile under 6k\nBattery - 10/10 ( charging is slow but backup is g...\nRead full review",
            "Don't buy this phone always hang problem.... Not that much of good quality",
            "Awesome phone..... Just go for it...\n\nIt's a allrounder phone\nCamera - above avarage\ndisplay - one of the best curve display looks premium\nLook - ultra slim...\nRead full review",
            "Software issue apps closes automatically sometimes. Also camera quality is terrible.",
            "Amazing beast....\nAs expected , didn't disappoint me,\nHad to sell hard chunk of kidneys to get it !!;p\nCamera quality is definitely a super upgrade\nBattery i...\nRead full review",
            "Very nice nice and good quality",
            "Nice budget phone.. Am a fan of Samsung and very happy to say that this time also, Samsung didn't disappoint me. A very good phone in this price range. Thank...\nRead full review",
            "Process slow 🐌 waste of money",
            "Batery totaly damage",
            "Batery totaly damage",
            "Back camera very good nice photos click,front camera OK OK,disine very good nice loking",
            "Exllent phone performance Vivo",
            "Phone is exactly same ..what as displayed.. ....\nLooking very attractive stylish & small ,very light weight,& good finishing phone...\nQuality is good .. netw...\nRead full review",
            "Very bad product.do not buy it.i bought i get broken phone.battery does not have life.",
            "Awesome 😊 Keypad mobile phone.",
            "Awesome 😊 Keypad mobile phone.",
            "Awesome phone..... Just go for it...\n\nIt's a allrounder phone\nCamera - above avarage\ndisplay - one of the best curve display looks premium\nLook - ultra slim...\nRead full review",
            "Software issue apps closes automatically sometimes. Also camera quality is terrible.",
            "The pricing at which this mobile is available , we expect more from samsung it is a trusted brand so customer expectations are high from this brand and it is...\nRead full review",
            "Even 6 gb of ram hangs,\nNot good battery pick up",
            "Amazing beast....\nAs expected , didn't disappoint me,\nHad to sell hard chunk of kidneys to get it !!;p\nCamera quality is definitely a super upgrade\nBattery i...\nRead full review",
            "Very nice nice and good quality",
            "The delivery boy who has to give the thing was very helpful.\n\nIf I had taken the RELAME company phone earlier, I would not have given the back cover and the ...\nRead full review",
            "As expected, Worth money.",
            "I am thankful to Flipkart for providing me this latest iphone se3 2022 at good deal... I am first time iphone buyer.. I like it's user experience... It's po...\nRead full review",
            "I wanted a small compact phone with latest processor for smooth functioning. Fully satisfied ✌️"
        ],
        "likes": [
            "759",
            "214",
            "139",
            "22",
            "72",
            "21",
            "70",
            "33",
            "24",
            "23",
            "759",
            "214",
            "139",
            "22",
            "72",
            "21",
            "70",
            "33",
            "24",
            "23",
            "52",
            "6",
            "4",
            "8",
            "2",
            "6",
            "5",
            "16",
            "8",
            "4",
            "5",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "9",
            "3",
            "3",
            "14",
            "4",
            "19",
            "12",
            "5",
            "2",
            "10",
            "13",
            "3",
            "9"
        ],
        "dislikes": [
            "281",
            "70",
            "195",
            "6",
            "66",
            "14",
            "20",
            "33",
            "71",
            "4",
            "281",
            "70",
            "195",
            "6",
            "66",
            "14",
            "20",
            "33",
            "71",
            "4",
            "44",
            "0",
            "0",
            "5",
            "0",
            "4",
            "3",
            "22",
            "9",
            "4",
            "6",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "16",
            "3",
            "3",
            "35",
            "6",
            "59",
            "35",
            "10",
            "2",
            "28",
            "40",
            "5",
            "28"
        ]
    },
    "qna": {
        "questions": [
            "Q:is threre any hdmi cable with this box? if not how to connect with set up box? what about wall mount..plz solve my query..Thanks",
            "Q:1) we can browse any information in this smart tv. 2).we can use social media apps in this tv. .3)this tv is hd or full hd tv. 4)we can connect home theator for this tv 5)using wifi will effect for tv",
            "Q:Is stabalizer compulsory for this Tv even if we have proper electricity management",
            "Q:I use Moto M and Moto G3 mobile. Is it possible to cast my screen to this television? And do i need any software?",
            "Q:How to connect a home theater to this",
            "Q:is it have play store?",
            "Q:how is its display quality",
            "Q:Is this Dolby sound",
            "Q:Can we install apps to the tv?",
            "Q:does it have a lg magic remote and exactly what smart features i can expect from this tv?",
            "Q:Is the wall mount bracket included in this product?",
            "Q:can i play 4K on usb and what r the supported formats?",
            "Q:do this tv support 3d",
            "Q:VGA port available or not ?",
            "Q:which pannel used in this TV",
            "Q:whether this tv supports arc",
            "Q:Does it have bluetooth?",
            "Q:Is it fully smart tv ?",
            "Q:Is wall mounting bracket free of cost or should we have to pay money for the person who is going to install tv",
            "Q:does it supports all video formats ?",
            "Q:The LED having bluetooth or not ?",
            "Q:What is the refresh rate of this product?",
            "Q:can we install hotstar app?",
            "Q:is this tv connected to phone",
            "Q:what is wall mount ?",
            "Q:what is the use of net flix on home screen in this tv",
            "Q:does this tv have youtube",
            "Q:What is webOS? And does this tv have webOS?",
            "Q:Can I play sd channels without blur in it?",
            "Q:What is motion Eco sensor??",
            "Q:Where do i get wall mount for LG LH576T 108cm? I want to buy one for my TV ?",
            "Q:How can i download android application in this TV.",
            "Q:Is games are given already in the tv",
            "Q:is it support hdmi arc",
            "Q:tv is it comes with wall mount? some persons said yes some persons said no please confirm it???",
            "Q:Usb port in which side??",
            "Q:does it support magic remote?",
            "Q:can bill received with our gst no. how we get bill with our gst no. no option of gst no.in address coloum",
            "Q:will u provide magic remote",
            "Q:How can i connect a bluetooth speaker to this tv?",
            "Q:can I get tv with it",
            "Q:is the wall mount used to hang tv at one place or we can adjust it by moving it??",
            "Q:Does this tv is having inbuilt stabilizer? and what about magic remote and does it contains 3D programming including HD?",
            "Q:can we use youtube ?",
            "Q:Is it a refurbished product?",
            "Q:what is the distance between the legs of the table top stand?",
            "Q:can i play mp4 and mkv movies having 720/1080 resolution by directly connecting usb drive",
            "Q:Can we cast fromiPhone or Non Lg phones? I tried cast screen using motorola e4 plus, but it's not working.",
            "Q:Does it provide internal memory? If yes how much it is? And what is the size of RAM? what version of Android? Can I get updates of new version?",
            "Q:will they set up?",
            "Q:how many hdmi slots in the tv?",
            "Q:payment types i don't see Bajaj finance options now?",
            "Q:can I record my favorite tv programmes to watch later?",
            "Q:is this lg oled series tv?",
            "Q:lan connection is possible or not????",
            "Q:this tv magic remote?",
            "Q:is this 4k tv",
            "Q:is the panel from lg only or from other established company asking because of very low price of the product",
            "Q:Does this tv supports dts codec?",
            "Q:can we attache USB external hard drive with this TV????",
            "Q:Is this tv will really damage after 8months",
            "Q:can we connect this tv to cpu?",
            "Q:it's really have 2 hdmi port ?",
            "Q:Does this tv has a air mouse?",
            "Q:how to connect the tv with smartphone?",
            "Q:Is it 3D supported",
            "Q:does this can be connected to cpu ? keyboard ? mouse? to use as a monitor to pc?",
            "Q:does this can be connected to cpu ? keyboard ? mouse?",
            "Q:do it include youtube??",
            "Q:whai is HDMi",
            "Q:what about RAM & Internal memory?",
            "Q:what about RAM and internal storage in this tv ?",
            "Q:Is this TV support Magic remote?",
            "Q:can i get a stand as well as a bracket?is there an additional charge",
            "Q:can u connect a digital camera to the tv",
            "Q:can we use Skype in this tv?",
            "Q:what is the refresh rate of this tv? pls give exact value no abstract reply?",
            "Q:is this satellite tv ?",
            "Q:is magic remote comes in the package",
            "Q:does miracasting is accesible to mi phones",
            "Q:internal storage of this model lg 43 576",
            "Q:Does this model have ARC HDMI por",
            "Q:Not able to locate second hdmi port in this television?",
            "Q:Which Android version does it support ?",
            "Q:what is the refresh rate of this tv model ?",
            "Q:can we get the magic remote?",
            "Q:Is screen mirror works for all smart phones",
            "Q:Why is wall mount bracket not included in the sales package?",
            "Q:is this a second hand tv?",
            "Q:In which school do you study",
            "Q:what is refresh rate for this model",
            "Q:Does the product have built in Wifi?",
            "Q:Is wall mount available with the tv?",
            "Q:How to extend the warranty of the product?",
            "Q:Will wall stand come with Sales Package Box?",
            "Q:can we use UPS instead of stabilizer??",
            "Q:Does the flexi wall mount given by the service engineer have both vertical and horizontal adjustment?",
            "Q:which brand is better sony or samsung or Lg i am confusing with these brands and i am planing to buy a smart i",
            "Q:why you guys have mentioned a incorrect details in description page for this lg 43 inch tv (43LH576T) , actually it has only 1 HDMI port , but you have mentioned has 2 HDMI port.",
            "Q:What is ideal refresh rate?",
            "Q:What is a 3D TV?",
            "Q:Can i install other app i.e. movie streamng app like stremio?",
            "Q:What is TV viewing angle?",
            "Q:Why HDMI ports are required?",
            "Q:I can't decide between a curved screen & a non-curved screen. What's the added benefit?",
            "Q:What is the difference between Full HD & HD ready?",
            "Q:Is this model support Magic remote, if we purchase magic remote outside ?",
            "Q:How do smart TVs connect to the Internet?",
            "Q:How do I decide on which screen size is ideal for me?",
            "Q:screen mirroring option",
            "Q:Can we directly plug coaxial cable into the led TV?",
            "Q:how is sound quality rate on a scale of 10",
            "Q:it has bluetooth",
            "Q:how much rating on this tv have for Power consumption? 5 or 4?",
            "Q:this tv have bluetooth or not",
            "Q:Does it support Amazon Prime video????",
            "Q:does it support magic remote",
            "Q:Does it support 1080i ??",
            "Q:43lh576t lg it comes with ips full HD led display or not..?",
            "Q:is there any way to o get amazon prime among the apps?",
            "Q:Do I get brand warranty?",
            "Q:What is 4K?",
            "Q:What is Smart TV?",
            "Q:how much rating this tv have for Power consumption? 4/5 star?",
            "Q:Does this product have ARC HDMI port ?",
            "Q:Is the chromecast is necessary for connecting our mobile to tv ?",
            "Q:what is refresh rate of this tv?",
            "Q:can we play music on the tv from phone?",
            "Q:does the tv have Chromecast feature?????",
            "Q:Does this TV has Browser?",
            "Q:is it smart tv? Will I connect my mobile with it and",
            "Q:how to connect sun direct+ to this tv",
            "Q:pls confirm hdmi arc port is available?",
            "Q:do this tv has play store",
            "Q:I have bought this 43 inches tv on 25th September 2017. But today when i measured it for something with tailor tape. It is actually 39 inches. How it is possible??",
            "Q:can we install android app .apk through usb?",
            "Q:Do we need stabilizer for this tv?",
            "Q:amoled display panel available in this model?",
            "Q:can isee my photos and videos from my mobile directly?",
            "Q:IS THIS T V HAS BUILT IN STABILIZER?",
            "Q:Is it possible to cast videos from iphone/ipad?",
            "Q:is tv has inbuilt FM radio",
            "Q:its a screen mirror working or not working. and this type tv is full Smart or basic smart download in any extra application",
            "Q:can i use watsapp in this tv",
            "Q:can we get the product Finance by Bajaj finserv ?",
            "Q:with the flexi walmount can we move the tv to change directions?",
            "Q:have it optical cable output?",
            "Q:which model is best 554T or this?",
            "Q:Will I get LG magic remote?",
            "Q:may i know launched date?",
            "Q:what is the contrast ratio of this tv?",
            "Q:Does it have an \" tv out\" connection for home theater system ?",
            "Q:what is the manufacturing year of this product",
            "Q:Will Table Stand come with Sales Package Box?",
            "Q:this TV have a head phone Jack for using a headphones",
            "Q:can we play videos using chrom cast in this.?",
            "Q:What is the model number of this led",
            "Q:Will the table top come with the product?",
            "Q:Will the table top come with the sales package???",
            "Q:if it is damaged in shipping accidentally what will do pls reply",
            "Q:Which audio mode supported...? Bcoz i seen in many TV s dual Audio movie cannot change the audio like Eng to Hindi... or Problem is Audio Mode is Not supported. plz suggest me. audio modes...",
            "Q:is wall mount an hdmi cable provide in this model?",
            "Q:how is motion sensor os activated",
            "Q:why price is up by 1000 in a day by same seller?when it come to lower i want to buy this product",
            "Q:Philips Spa8000b 5.1 Channel home theater work in it?",
            "Q:Phillips Spa8000b 5.1 channel speaker work in it properly?",
            "Q:In box HDMI cable is not ?why?",
            "Q:can we install yepp tv or hungama tv in it????",
            "Q:what is the contrast ratio in this tv?",
            "Q:Doest it play .mkv formats ?",
            "Q:this lg tv are 3d",
            "Q:What is blu-ray?",
            "Q:can i connect 5.1home theater",
            "Q:does it have ips display",
            "Q:Hi, As per description in the package we will get advance magic remote or not?",
            "Q:is wall mount free cost or charge?",
            "Q:in case of 4k do we require 4k contents or a normal channel will play in 4k quality?",
            "Q:what is tax for online purchase",
            "Q:What is the refresh rate of the led tv",
            "Q:is table top stand available with this model?"
        ],
        "answers": [
            "A:No HDMI cable available.Cable to be procure on own.Wall mount bracket brought by installation person. Regards, NRS",
            "A:No, there is no browser installed No social media app installed This is a FULL HD TV. I have no idea,because I don't have a home theater Yes, you can connect to wifi You can cast your phone",
            "A:no you don't need a stabalizer if you have proper electricity management.",
            "A:ya it s possible for all Android mobiles",
            "A:You can use the aux cable to connect your home theatre.",
            "A:No, it does not have play store and browser.",
            "A:Its simply awesome, go for it bro....",
            "A:yes.",
            "A:Yes , U can instal apps form LG store. but there is limited inbuilt sapce",
            "A:magic remote no.... smart features means you can connect it to a wifi network and see Netflix, YouTube and other installed app in there....",
            "A:No, i have been charged 1600/- for wall mount and they given warranty for that along with bill",
            "A:It's not a 4k tv. So it can't play 4k videos.By screen mirroring from your smart phone (if it support 4k) ,you can watch 4k videos.",
            "A:No",
            "A:not",
            "A:wall mounted",
            "A:Yes. This TV supports HDMI ARC",
            "A:it's not a mobile, answer is no Bluetooth",
            "A:No it does not have web browser, no magic remote, does not support wireless key board, mouse and LG web OS app.",
            "A:We have got it for free, but it doesn't come with TV, it will be brought by person who comes for TV installation from LG.",
            "A:Yes. It support almost all the video format. I am using this TV from last 3 months. I feel it is awesome. Go for it on sale day. if you have SBI card , you will get it around 35K.",
            "A:No it doesn't have bluetooth",
            "A:Good One..",
            "A:No, You can't install hotstar app. But you can connect your phone with TV using Tv Cast app from your mobile.",
            "A:yes we can connect any smartphone with this smart tv by mira casting,screen mirroring YouTube....etc",
            "A:Wall mount is the kit for mounting the TV on a wall. It also comes with a stand to placing it on a table top.",
            "A:it's app in LG apps . if we click apps from remote those apps will appear in home screen. it's a smart tv . if you have netflix account can watch tons of programs .",
            "A:Yes",
            "A:Web OS is LG's version of smart tv OS. like samsung and sony have tizen and android. this tv didnot have wb os but it has lg app store from their u can download youtube and netflix and also miracast.",
            "A:No, if you are using normal SD setup box, there will be some blur and picture quality is low. You need to upgrade it to HD Setup box to get the HD quality.",
            "A:The Eco Motion Sensor is a technology that reduces power consumption by slightly adjusting the brightness of the screen relevant to the speed of the pictures.",
            "A:any external vendor",
            "A:this TV is not supported to download any other applications other than preinstalled apps.",
            "A:yes",
            "A:Yes,it has hdmi port.",
            "A:no it does not come in pack. but TV installation person will bring it and fix it no extra cash.",
            "A:Left back side of the TV .",
            "A:no this month doesn't. the next model above this has magic remote.",
            "A:yes",
            "A:no they don't provide magic remote",
            "A:there is no inbuilt bluetooth connectivity with TV...You want to buy abluetooth adapter and try!",
            "A:yes",
            "A:you can move it slightly to insert pen drive or hard drive or other connections on the wall mount.",
            "A:It does work on a wide voltage range, I don't use an external stabilizer. It does not support 3D. Full HD is well supported. Magic Remote is not included.",
            "A:Yes.. There is a pre-installed app",
            "A:No Brand New, I purchased this on diwali.",
            "A:leave 7-8 inches from both sides. they are a bit flaring in design, so this would give you an approximation.",
            "A:YES",
            "A:You have to download the Wi-Fi display app in to your mobile and start Wi-Fi display by switching on Wi-Fi",
            "A:Its not android TV. so no RAM and custom applications like android TV box. It comes with preinstalled apps and few more app from LG app store.",
            "A:yess",
            "A:2",
            "A:yes",
            "A:no u cant record..",
            "A:not so old . It's 2016 or 2017 version. if you want latest version then you have to spend more. it's a basic smart TV. you go for as per your requirement.thank",
            "A:yes. it has lan port",
            "A:no magic remote",
            "A:No",
            "A:its purely from LG only working good",
            "A:Yes, it does",
            "A:Yes. It does have usb port to connect usb drive to watch pictures, movies and listen music",
            "A:No",
            "A:yes thru HDMI cable",
            "A:Yes.It Has",
            "A:not full smart tv means no android experience.But the picture quality and sound quality incredible and you can also get smart share option,with the help of which you can share your laptops and phones",
            "A:You can connect with wifi direct or By Screen share of miracast.It can can be connected by both way. Also LG have a smart share software to share your Android phone contents like gallery and storage .",
            "A:no",
            "A:no",
            "A:no. it doesn't",
            "A:yes. It includes and connects automatically through wifi router.",
            "A:HDMI is a advanced connectivity port and essential for transmitting HD signals. It has capabilities of transmitting 4K video, 32 Channel audio, Internet and Audio return channel.",
            "A:Internal memory is decent and RAM is good.",
            "A:There is no inbuilt storage and RAM is also not mentioned anywhere but the processing is good enough. You can play videos through external storage.",
            "A:No. Its not supporting Magic Remote properly, some keys work but pointer will not working.",
            "A:You will get wall mounting flexi stand with the TV.",
            "A:no directly you cannot but through a card reader you can",
            "A:No.Skype is not supported. You can cast your phone's screen and use your tv for the purpose",
            "A:4 star",
            "A:yes it is. It will the receive the signal from the outdoor parabolic antenna to the external set-top box and from set top box to TV.",
            "A:No this does not have a magic remote",
            "A:Yes..... I did",
            "A:1400 mb",
            "A:2 HDMI port. One at the back and another on the left side.",
            "A:Hi , one hdmi port is parallel to screen in back side and other is opposite side of screen near audio video jack. that is accessible only after unmount from wall mount.",
            "A:It has its own Web OS. Android you can connect any version using wifi. Cast feature will only be supported by few supporting mobile devices.",
            "A:1",
            "A:We get only normal remote with this TV. However you can purchase it separatrly",
            "A:yes. it works with high end smartphone, fyi there is no smartphone app to control this tv",
            "A:The technician will provide the felxi wall mount bracket during installation which is free of cost",
            "A:lol .. no , its brand new .",
            "A:Netaji Memorial 😋",
            "A:60Hz...",
            "A:The product is equipped with a built in Wi Fi chip that helps you stream unlimited video content from the Internet.",
            "A:Wall mount is not availble in the sales package.",
            "A:The product has 1 year LG domestic warranty. For extension of Warranty, Brand authorized service centres need to be contacted. Toll free number of the brand is 1800 315 9999/1800 180 9999",
            "A:Well the stand is part of deal but you wont receive the stand with delivery package, instead a jeevs installation representative will deliver the stand when he comes for installation.",
            "A:UPS and stabilizer are different purposes. You dont need satbilizer if you have a constant power supply, although if you need to protect your TV incase of any fluctuation you can really opt one.",
            "A:HORIZONTAL",
            "A:lg is good better than samsung and sony.because lg display contrast is good for eyes than other tv.and also ips disply in lg",
            "A:It has 2HDMI port. One is on side panel and one is on back",
            "A:The refresh rate is the number of frames the television can display per second. The standard rate is 60 60 Hz. Higher the rate, smoother the movements in videos- best for fast-moving sports/gaming.",
            "A:3D is an added feature in many high-end TVs. You can watch videos that are made in 3D with your 3D glasses, depending on the type of screen (Active or Passive). Do check our buying guide for details!",
            "A:You can install YouTube, Netflix, Hungama, and few other apps, but no Amazon Prime.",
            "A:It is the maximum angle at which a display can be viewed with acceptable visual performance",
            "A:HDMI ports are required to connect cable box or Blu-ray player or a video game console or a streaming gadget, or a smartphone/tablet. You can decide the number of inputs required as per your usage.",
            "A:A curved screen is developed for a more immersive viewing experience, regardless of the angle the screen is viewed from, as well as offering the latest color- and depth-enhancing technology.",
            "A:Full HD has 1920 x 1080 rsolution- ensures a higher picture quality HD ready. It essentially consists of 2Mn pixels vs a 1Mn pixels in HD Ready! Refer to our Buying Guide for more details.",
            "A:I own both 43LH576T and 49LH600T model. In 576T magic remote will not suit. This is confirmed in local LG retailer showroom itself.",
            "A:A smart TV uses either a direct, wired Ethernet connection or built-in Wi-Fi to connect to a home network for internet access. Most models today have built-in Wi-Fi.",
            "A:Your distance from the screen, most often decides the screen size required. If you're too close, you’ll see a pixelated image & if you're too far, you'll miss details. Check our buying guide for more!",
            "A:yes. its there. you can mirror phone and play .",
            "A:Yes you can connect",
            "A:9/10",
            "A:yes",
            "A:4",
            "A:not",
            "A:No it doesn't support Amazon Prime. This model does not have a web browser, so you cannot install any new apps, can install only apps provided by LG Content",
            "A:no",
            "A:yes, it plays 1080 hd",
            "A:yes it does",
            "A:you may connect it via smartphone & cast it on screen else you may use data cable & connect it via HDMI to laptop",
            "A:All TVs come with assured brand warranty up to 3 years. You can also get extended warranty at best price on select models",
            "A:4K, aka Ultra HD, comes with a 3840x2160 pixels resolution- (4x of full HD TV). The extra resolution adds better definition & depth to the pictures, resulting in images that look incredibly life-like",
            "A:A smart TV comes with built-in Internet connectivity, to access a range of online services including video on demand, social networking and may have fully featured web browser to access websites.",
            "A:5 star",
            "A:Not Sure, if it has ARC Port.",
            "A:No. Chromecast isn't required, you can connect directly using wifi direct and the super cast option on your mobile.",
            "A:550 Hz I believe",
            "A:Only specific Android phones can be casted. it doesn't support iPhone. It's not st a smart TV. I haven't tried to cast music. I tried with images and videos. it doesn't support all the formats.",
            "A:it has miracast.. connected by wifi with any device",
            "A:no it doesnt have any browser",
            "A:Yes, it is a Smart TV and you can connect your mobile with it.",
            "A:Try connecting HD out to TV or you can use AV for audio/ video also.",
            "A:yes",
            "A:no",
            "A:Hello, I think, you measured it straight length or breadth, which is not a right way. Measure the TV diagonally i.e. either from top left to bottom right or top right to bottom left, it would be 43 in",
            "A:no",
            "A:No",
            "A:flat",
            "A:yes can be seen , using only Android phones which s not loaded with stock OS. Stock OS works with only Chromecast.",
            "A:no built in stablizer.... but u dont need to worry about it",
            "A:Yes Sir",
            "A:yes, bt you also need a any dth connection with FM signal.",
            "A:yes screen mirroring is working. and the TV is basic smart TV.",
            "A:No,it is not preloaded",
            "A:Yes",
            "A:Yes but not too much. The TV can be pulled out maximum 6-7 inches away from the wall and the you can tilt the TV to Left or Right until it hits the wall.",
            "A:Yes it does have. Good product.",
            "A:This one is best",
            "A:no, it's not included",
            "A:End of 2016",
            "A:normal and actually",
            "A:Yes it has and it is an awesome product",
            "A:2017",
            "A:yes wall mount provided by company",
            "A:yes",
            "A:Yes we can.",
            "A:43LH576T",
            "A:Yes. also the service person will bring wall mount while installation.",
            "A:Only the table top stand comes with the TV. Exactly as shown in the picture.",
            "A:call to customer care and return it immediately",
            "A:there's an option to switch audio track",
            "A:only wall mount provide in this model, HDMI cable not provide. pls resend the HDMI cable",
            "A:nope",
            "A:yes awesome tv sond and quality are good and tv adjustable stand is very good",
            "A:There r various connecting mode available, sure u can connect",
            "A:I'm having Philips HTL3140B/12 2.1 CH SoundBar Speaker & it works fine with HDMI arc for this TV.",
            "A:HDMI cable is not in the scope of supply. Packing list doesn't include this item.",
            "A:yes",
            "A:4.5",
            "A:for mkv videos only video playing without audio ,I tried many videos it doesn't support audio",
            "A:No",
            "A:please check in Google you will get varieties of answers for Blu Ray",
            "A:yes",
            "A:yes",
            "A:no. it is a normal remote and not magic remote",
            "A:its free....",
            "A:require 4k channel or content to view 4K mode",
            "A:The price shown is inclusive of tax.",
            "A:it's 100hz.",
            "A:Yes, table top and flexi mount is available free of cost."
        ],
        "likes": [
            "121",
            "30",
            "7",
            "6",
            "5",
            "2",
            "3",
            "3",
            "0",
            "1",
            "0",
            "7",
            "0",
            "0",
            "1",
            "0",
            "4",
            "0",
            "2",
            "6",
            "2",
            "3",
            "3",
            "3",
            "2",
            "4",
            "1",
            "3",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "326",
            "41",
            "14",
            "29",
            "217",
            "73",
            "77",
            "11",
            "20",
            "9",
            "2",
            "2",
            "22",
            "26",
            "5",
            "5",
            "12",
            "12",
            "13",
            "16",
            "13",
            "9",
            "2",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "4",
            "6",
            "4",
            "4",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "62",
            "16",
            "2",
            "1",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "8",
            "0",
            "0",
            "0",
            "0",
            "6",
            "1",
            "2",
            "14",
            "3",
            "7",
            "8",
            "8",
            "4",
            "13",
            "1",
            "10",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "2",
            "1",
            "0",
            "0",
            "1",
            "0",
            "2",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "163",
            "21",
            "5",
            "15",
            "189",
            "56",
            "80",
            "7",
            "18",
            "6",
            "0",
            "0",
            "25",
            "32",
            "4",
            "3",
            "13",
            "14",
            "17",
            "26",
            "23",
            "15",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "5",
            "11",
            "8",
            "11",
            "1",
            "1",
            "3",
            "6",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "3",
            "0"
        ]
    }
}