{
    "title": "MarQ by Flipkart 140 cm (55) Ultra HD (4K) LED Smart Android TV  (55SAUHD)",
    "product_specification": {
        "In The Box": "Wall Mount Stand\nQSG\nPower Cord\n2 AAA Batteries\nUser Manual\n2 Remote\n2 Desktop Stand\n4 Stand Support Crews\n1 Television",
        "Model Name": "55SAUHD",
        "Color": "Grey",
        "Display Size": "140 cm (55 inch)",
        "Screen Type": "LED",
        "HD Technology & Resolution": "Ultra HD (4K), 3840 x 2160",
        "Smart Tv": "Yes",
        "Motion Sensor": "No",
        "HDMI": "1 Side, 2 Back",
        "USB": "2 Side",
        "Wi-Fi Type": "2.4 GHz&5GHz | IEEE 802.11 a/b/g/n/ac",
        "Built In Wi-Fi": "Yes",
        "Launch Year": "2018",
        "Brightness": "350 nits",
        "Contrast Ratio": "1200:01:00 (Static)",
        "Picture in Picture (PIP)": "No",
        "Analog TV Reception": "Yes",
        "Digital TV Reception": "Yes",
        "View Angle": "176 Degree",
        "Panel Type": "IPS",
        "Digital Noise Filter": "Yes",
        "LED Display Type": "LED",
        "Aspect Ratio": "16:09",
        "Refresh Rate": "60 Hz",
        "Supported Video Formats": "MPG, AVI, TS, MOV, MKV, DAT, MP4, VOB, RM, RMVB",
        "Other Video Features": "5 Picture Mode: User, Cinema, Sport, Vivid, Hi-bright\nPicture Noise Reduction\n4K Upscaler",
        "Number of Speakers": "2",
        "Speaker Type": "Box Speaker",
        "Sound Technology": "Dolby Digital with Tru-Surround Sound",
        "Surround Sound": "Yes",
        "Speaker Output RMS": "20 W",
        "Sound Mode": "Rock, Pop, Live, Dance, Techno, Classic, Soft",
        "Supported Audio Formats": "MP3, WMA, M4A, AAC, MP2, PCM, MPEG",
        "Number of Cores": "4",
        "Processor": "Quad Core",
        "Ram Capacity": "2.5 GB",
        "Storage Memory": "16 GB",
        "Supported App - Netflix": "No",
        "Supported App - Youtube": "Yes",
        "Supported App - Disney+Hotstar": "Yes",
        "Supported App - Prime Video": "No",
        "Supported App - Others": "Google Movies, Google Audio, Google Games, E-manual",
        "Supported Mobile Operating System": "Android",
        "Operating System": "Android",
        "Screen Mirroring": "Yes",
        "App Store Type": "Google Playstore",
        "Pre Installed Browser": "No",
        "Content Providers": "YouTube, Hotstar",
        "Supported Devices for Casting": "Mobile",
        "Mobile High-Definition Link": "No",
        "3G Dongle Plug and Play": "No",
        "Ethernet (RJ45)": "1",
        "Other Internet Features": "Android 8.0",
        "Component In (RGB Cable)": "0",
        "Composite In (Audio Video Cable)": "0",
        "NFC Support": "No",
        "PC Audio In": "No",
        "PC D-sub": "No",
        "Digital Audio Output": "1",
        "RF Connectivity Input": "1",
        "Analog Audio Input": "Yes",
        "Other Connectivity Features": "1RF In, 1 AV In, 2USB(2.0&3.0), 3 HDMI Port, 1LAN, 1 Digital Audio Out",
        "Touch Remote": "No",
        "Smart Remote": "Yes",
        "RF Capable": "No",
        "Internet Access": "Yes",
        "DVR Control": "No",
        "Operating Distance": "8m",
        "Battery Type": "2 AAA Batteries",
        "Other Remote Control Features": "1 Standard and 1 Voice Controlled Bluetooth Enabled",
        "Power Requirement": "AC 100 - 240 V, 50/60 Hz",
        "Power Consumption": "150 W, 0.5 W (Standby)",
        "Other Power Features": "Power off/Shut down",
        "Clock": "Yes",
        "Auto Power Off": "Yes",
        "Sleep Timer": "Yes",
        "On/Off Timer": "Yes",
        "Other Convenience Features": "NA",
        "Width x Height x Depth (without stand)": "1234.6 mm x 712.8 mm x 99.1 mm",
        "Weight (without stand)": "14.4 kg",
        "Width x Height x Depth (with stand)": "1234.6 mm x 758.6 mm x 239.1 mm",
        "Weight (with stand)": "14.8 kg",
        "Stand Type": "Wall Mount and Desktop Stand",
        "Warranty Summary": "1 Year Limited Domestic Warranty",
        "Covered in Warranty": "Warranty is Non-transferrable, Valid Only in the Territory of India and Extended Only to the First End User Customer (Customer). Warranty will be Valid Only When the Original Purchase Invoice is Presented at the Time of Service. Warranty will Cover Only Functional Parts and Software Issues Having Manufacturing Defects and Does Not Cover Damages Resulting From Un-authorised Adaptations / Adjustments / Tampering of the Product, Improper Installation of the Product, Normal Wear and Tear Caused Due to Use of Product",
        "Not Covered in Warranty": "Warranty Does Not Cover Damage Caused to the Product Due to Improper Installation by Customer, Normal Wear and Tear Caused Due to Use of Product. Warranty Does Not Cover Any External Accessories to the Product (Such as Battery, Cable, Carrying Bag Etc). All Plastic, Rubber, Glass, or Aesthetic Parts and Consumable Replacements will be on a Chargeable Basis. All Transportation and Handling Expenses Incurred While Replacing or Repairing Will be Payable by the Customer. Warranty Shall be Voids If: a) The Type or Serial No. On the Product has been Altered, Removed or Defaced. The Product is not Operated as Per the Instructions Given in the User Guide, If Any",
        "Warranty Service Type": "Installation and demo",
        "Installation & Demo Details": "Please note that any unauthorized handling or self-installation of the product will lead to return & product warranty being void\nWe'll facilitate the installation and demo through authorized service engineer at your convenience. Flipkart will communicate the day and time slot of the scheduled Installation & Demo through a SMS and the same information will also be available in your order details page. The service engineer will install your new TV, either on wall mount or on table top. Installation and demo are provided free of cost. The engineer will also help you understand your new TV's features. The process generally covers: Wall-mounted or table-top installation, as requested. Physical check of all ports, including power and USB ports. Accessories also checked. Demonstration of features and settings. Quick run-through on how to operate the TV"
    },
    "product_description": {
        "Latest Google Certified Android 8.0 Oreo": "Stay connected to your Google account even when you're phone's away. This TV lets you access almost all apps from your Google Play Store.",
        "Voice Control": "Use your voice to type and control the remote. What's more, you can also check the weather and control AI household lights with this feature.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "4",
            "5",
            "1",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "1",
            "1",
            "1",
            "1",
            "1",
            "5",
            "2",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "4",
            "1",
            "1",
            "1",
            "4",
            "5",
            "1",
            "1",
            "2",
            "2",
            "4",
            "2",
            "5",
            "1",
            "1",
            "2",
            "1",
            "1",
            "5",
            "4",
            "5",
            "4",
            "1",
            "5",
            "1",
            "1",
            "5",
            "5",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "3",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "3",
            "5",
            "1",
            "1",
            "2",
            "1",
            "1",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "1",
            "2",
            "5",
            "5",
            "5",
            "3",
            "1",
            "1",
            "5",
            "2",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "3",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "3",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "4",
            "4",
            "4",
            "5"
        ],
        "review": [
            "Satisfied!!!\n\nSometimes you take your decisions on your instincts rather than advices and you hit bang on. Buying Marq has been a similar experience,there were no reviews on this particular model as it was launched during the sale day but at 36k(includes additional warranty)it was too lucrative to be missed. Here’s my experience after 10 days of observation-\n\nDelivery-\nFaster than expected. The delivery period was 14 days , I got it on the 4th day.\n\nInstallation-\nThe Jeeves technician was really helpful as installing the TV on WALL Mount at my home was little complicated but he did a real good job on it.\n\nService-\nAgain the same technician had visited when I had requested a service visit as I had some doubts about the picture quality and he helped with the settings which improved the picture quality much better.\n\nPicture quality -\nGood but could be better. One may not find the same effects as a Sony or Samsung or Lg but I would say Marq has done a pretty good job considering the price point and other factors.\n\nSound-\nTo the mark, in-fact better than I had expected. No need to have an additional sound bar.\n\nConnectivity-\nWas pretty smooth and had no issues at all.\n\nHD and 4K content-\nOn the set top box watching HD content is really good but SD is a disappointment. HD on internet with decent speeds is just fine. Regarding UHD4K, as far my knowledge goes our we still don’t have much content on our set-top box and if you plan to watch it on internet one needs to have at-least 25 mbps speed to see the true effects. Even Netflix which has UHD content is unable to show until you have very high speed internet at home.Unfortunately I don’t have it so I cannot comment on it yet.\n\nFinal verdict-\nIf you are a common layman like me who does not go into too much integrities of picture quality,sound and other features this is just the right product. Also note that at this price this is definitely a steal and it also helpful if you plan to change your TV faster to keep up with the new technologies in the market.",
            "Pros -\n4K video and Sound is above average,\n55inch size does great job at this price\n\nCons -\nThis has flipkart based Android, not stock referred in description\nGoogle Chromecast claimed as inbuilt is also rigged, does not allow streaming from apps (Netflix etc) that Flipkart does not want to be used.\nOnly has and allow installing PAID apps from google and Hotstar ..etc\nFree apps (streaming/ storage/ sharing) does not show available to install, including Google Photos, Amazon prime.\nOnly Hoststar/ YouTube are allowed as Video streaming apps, Netflix installs but stops with error enforced by flipkart android code.\nTakes almost 2-3 min to power on as it boots like your android phone\nSlow processing of menu selections and app loading with 100Mbps Airtel Fiber network seems 2.5 GB RAM does not help much.\n\nConclusion -\nWont recommend to buy this, if you looking for a smart TV with android due to rigged code for some sites.\nLinux based normal smart TVs have no option to make changes, but you get what you see and they perform much faster and reliably.",
            "True crystal clear dolby sound, feels like in theater, screen is too good, delivered with in 2 days,next day completed installation and demo promptly manner. సూపర్ ఉంది, i have used hdfc card in payment with extension warranty programme, total additional beniifited 5k. for 55 ''' tv, TV ordered at 9th 23.30 then 11th delivered at 20:15 @ my home located in Yellandu (ఇల్లందు ),voice assistance is also working good, wifi,casting are working fine hdmi ports,RJ45 ports not not tested yet.",
            "THE BEAST --\nI buy this tv and seriously this tv is a beast of best 4k led tv in the market.Terms of Picture quality a class ,4k videos runs flawlessly and dth tv quality is fine, movies 720p and 1080p resolution superb ,sound quality superb no need to attach external sound bar or sound system thanks for dolby support.connectivity in use wifi no issue runs smoothly ,apps runs like butter with no crash,some issue in lag create in chromecast but after min use its runs fine, Bluetooth remote and google assistant is a treat very flawlessly work,the interface is user friendly,Jio tv app runs superb no need to attach dth,youtube work superb, quality and finishing of tv nice edge is clear with zero dot pictuce image.dont waste time on negative reviews,and no need compare other tv like ifallcon or mi ,this tv is allready beast, i use this tv set thanks flipkart and marq for the treat and jeeves support so gud after delivery 10 min after jeeves support call i attend and install tv same day with demo.love you flipkart with additional discount 2 thousand on tv i buy this 39999 + jeeves 2 year additional support ₹3149 so total 3 year warranty so i relax no need worry.Thanks flipkart and jeeves support.Love you.",
            "I did a fair bit of research for almost a month in search of a new TV ever since my 8 year old 40\" Sony started showing issues. I knew sooner or later I have to buy a new TV. I did market research both online and in local shops before buying this one. Here are some of my conclusions.\n\n1. Well known brands such as Sony, Lg and Samsung cost almost double or even triple the price of budget TVs\n2. Even though they cost much more, none of them are offering warranty above 1 year , which in my opinion makes no sense.\n3. Sure, the branded TVs are brighter and vivid than budget TVs, but its negligible. You have keep it side by side to see the difference.\n4. Extended warranty purchase for branded TVs are very costly.\n\nThus I concluded budget TVs made perfect sense, but the issue was I cannot verify in person the real performance of these Tvs, Since they where online only products. I had to rely on online reviews and ratings to make my decision. After two weeks of usage I don't regret my purchase. Let me explain my point.\n\n1. This TV have enough brightness to view without glares in a well lit room. (Background light is set to 100% by default).\n2. Color reproduction is good and I had no issues viewing any type of videos.\n3. Android certified Smart TV, with voice assistant is a delight to use.\n4. 10 bit HDR (1.07 B Colors) is a feature many budget TVs miss.\n5. Good inbuilt speakers (Dolby Digital).\n6. Better processor and Ram specification than competitors.\n7. DLED which is better than ELED.\n\nAlthough Flipkart have done an excellent job, I have a few minor complaints.\n\n1. Floor stands provided was not as shown in pictures, It is just a U shaped silver colored rod with mounting points which looks ugly.\n2. TV takes its own time to boot ( around 1 min), but it can be understood since its Smart TV, I think I'll get used to it.\n3. Smart TV responsiveness could have been better, Navigating through apps are not as smooth as I wished for.\n\nOverall a very good purchase, My main concern is about the after sales service, which I am yet to encounter, let's see.\n\nThank you,\nFlipkart",
            "Love the 4K picture clarity. Best TV in this price range. Apps can be sideloaded easily via USB. (NETFLIX is not supported hence doesn't work. Same goes for Amazon Prime. I already have a Firestick so no problem at all.) Speakers on the TV are good enough but if you want good home theater experience, it's a good idea to invest in a Soundbar with good bass. The TV only has optical sound output option... So 3.5mm jack or Stereo Out or HDMI ARC is NOT available, ensure if you are buying Soundbar or 5.1 speaker system, it does have an optical input option. I've tried playing 4k 2160p HDR movies by connecting my Hard Disk and the native media player does a brilliant job at that. People complaining about blacks or Dark scenes performance on the panel are just too demanding...I find no issue here... Screen quality is actually more than you can ask for (specially in this killer budget) One more aspect this TV wins at is the official YouTube app... Playing UHD content on YouTube native app is really enjoyable and easy. (on my Amazon Firestick I was using an alternate app for YouTube and the experience was not that great.) The UI is also fast and the RAM management is adequate. TV starts faster than many similar range offerings in the segment... iFFalcon, Mi etc. About the extended warranty, you should definitely TAKE the 2 years extended warranty being offered by Jeeves as it gives you peace of mind for atleast 3 years, given that Marq is a fairly newer brand. The Smart remote which is Bluetooth enabled looks & feels quite premium and is so easy to use. Well, lastly, the 55inch panel looks quite overwhelming when watching any 4k content and is simply mind blowing.",
            "If I talk about this TV so I would like to discuss some pros and cons of it.\n\nPros:\n1. Dolby sound is better and give you a surround experience.\n2. Day light images really come alive and give a nice contrast and clarity.\n3. It comes with Media player which plays most of the audio and video formats.\n4. In built YouTube app allows you to play online video contents easily.\n\nCons:\n1. Screen has the white spots which doesn't seem pretty good when TV goes complete in black Transition.\n2. Night movie scene or darker images do not go pretty well that it should be.\n3. Inbuilt media player do not play DTS surround audio and MXlayer and VLC etc. not supportable and it is certified android but not all apps you can find on it. there is very few apps you can install and always apps go into the pending mode which is really irritating.\n\nVerdict:\n\nThis the best budget 4K TV in this range. you could go for it but if you have higher budget you can consider another one if your budget allows you.",
            "awesome quality in this range...\ninstallation is good...\nsound good\nGoogle good\n2 remotes nice\nGoogle voice in remote is nice function...\nI bought it in 28500/-... the best rate with 4k quality\nactual 4k run in it",
            "Best TV manufactured by Flipkart.\nGot delivery faster in just one day with full demo and installation.\nMoreover talking about features :\n1.Sound system is awesome,pure Dolby Digital surround.\n2.Picture quality is good.\n3.Android system interface is nice with all Google apps.\n\nPure value for money,highly recommended to buy this TV in this budget.",
            "lagg noticed while playing though mobile Chrome cast, YouTube works pretty fine, unable to detect my mobile when Connected through USB port.. Coming to the installation and service quality its A+.. They responded pretty well and also has taken care in mounting the TV with good placement on wall and without any flaws. There is some distracting patches probably screen backlight bleeding on top of the screen left side mostly while the picture is black and so it is becoming difficult to enjoy the darker scenes at nigh especially..this is something which us annoying and I don't think we can enjoy watching night time and darker scenes. I would recommend the TV for this price point and I got it for 36k with 3 years of warranty so it's actly a deal breaker for me and anyone who is getting for this price I will definitely recommend considering the other good feature of the TV except the dark scene display issue.",
            "Satisfied!!!\n\nSometimes you take your decisions on your instincts rather than advices and you hit bang on. Buying Marq has been a similar experience,there were no reviews on this particular model as it was launched during the sale day but at 36k(includes additional warranty)it was too lucrative to be missed. Here’s my experience after 10 days of observation-\n\nDelivery-\nFaster than expected. The delivery period was 14 days , I got it on the 4th day.\n\nInstallation-\nThe Jeeves technician was really helpful as installing the TV on WALL Mount at my home was little complicated but he did a real good job on it.\n\nService-\nAgain the same technician had visited when I had requested a service visit as I had some doubts about the picture quality and he helped with the settings which improved the picture quality much better.\n\nPicture quality -\nGood but could be better. One may not find the same effects as a Sony or Samsung or Lg but I would say Marq has done a pretty good job considering the price point and other factors.\n\nSound-\nTo the mark, in-fact better than I had expected. No need to have an additional sound bar.\n\nConnectivity-\nWas pretty smooth and had no issues at all.\n\nHD and 4K content-\nOn the set top box watching HD content is really good but SD is a disappointment. HD on internet with decent speeds is just fine. Regarding UHD4K, as far my knowledge goes our we still don’t have much content on our set-top box and if you plan to watch it on internet one needs to have at-least 25 mbps speed to see the true effects. Even Netflix which has UHD content is unable to show until you have very high speed internet at home.Unfortunately I don’t have it so I cannot comment on it yet.\n\nFinal verdict-\nIf you are a common layman like me who does not go into too much integrities of picture quality,sound and other features this is just the right product. Also note that at this price this is definitely a steal and it also helpful if you plan to change your TV faster to keep up with the new technologies in the market.",
            "Pros -\n4K video and Sound is above average,\n55inch size does great job at this price\n\nCons -\nThis has flipkart based Android, not stock referred in description\nGoogle Chromecast claimed as inbuilt is also rigged, does not allow streaming from apps (Netflix etc) that Flipkart does not want to be used.\nOnly has and allow installing PAID apps from google and Hotstar ..etc\nFree apps (streaming/ storage/ sharing) does not show available to install, including Google Photos, Amazon prime.\nOnly Hoststar/ YouTube are allowed as Video streaming apps, Netflix installs but stops with error enforced by flipkart android code.\nTakes almost 2-3 min to power on as it boots like your android phone\nSlow processing of menu selections and app loading with 100Mbps Airtel Fiber network seems 2.5 GB RAM does not help much.\n\nConclusion -\nWont recommend to buy this, if you looking for a smart TV with android due to rigged code for some sites.\nLinux based normal smart TVs have no option to make changes, but you get what you see and they perform much faster and reliably.",
            "True crystal clear dolby sound, feels like in theater, screen is too good, delivered with in 2 days,next day completed installation and demo promptly manner. సూపర్ ఉంది, i have used hdfc card in payment with extension warranty programme, total additional beniifited 5k. for 55 ''' tv, TV ordered at 9th 23.30 then 11th delivered at 20:15 @ my home located in Yellandu (ఇల్లందు ),voice assistance is also working good, wifi,casting are working fine hdmi ports,RJ45 ports not not tested yet.",
            "THE BEAST --\nI buy this tv and seriously this tv is a beast of best 4k led tv in the market.Terms of Picture quality a class ,4k videos runs flawlessly and dth tv quality is fine, movies 720p and 1080p resolution superb ,sound quality superb no need to attach external sound bar or sound system thanks for dolby support.connectivity in use wifi no issue runs smoothly ,apps runs like butter with no crash,some issue in lag create in chromecast but after min use its runs fine, Bluetooth remote and google assistant is a treat very flawlessly work,the interface is user friendly,Jio tv app runs superb no need to attach dth,youtube work superb, quality and finishing of tv nice edge is clear with zero dot pictuce image.dont waste time on negative reviews,and no need compare other tv like ifallcon or mi ,this tv is allready beast, i use this tv set thanks flipkart and marq for the treat and jeeves support so gud after delivery 10 min after jeeves support call i attend and install tv same day with demo.love you flipkart with additional discount 2 thousand on tv i buy this 39999 + jeeves 2 year additional support ₹3149 so total 3 year warranty so i relax no need worry.Thanks flipkart and jeeves support.Love you.",
            "I did a fair bit of research for almost a month in search of a new TV ever since my 8 year old 40\" Sony started showing issues. I knew sooner or later I have to buy a new TV. I did market research both online and in local shops before buying this one. Here are some of my conclusions.\n\n1. Well known brands such as Sony, Lg and Samsung cost almost double or even triple the price of budget TVs\n2. Even though they cost much more, none of them are offering warranty above 1 year , which in my opinion makes no sense.\n3. Sure, the branded TVs are brighter and vivid than budget TVs, but its negligible. You have keep it side by side to see the difference.\n4. Extended warranty purchase for branded TVs are very costly.\n\nThus I concluded budget TVs made perfect sense, but the issue was I cannot verify in person the real performance of these Tvs, Since they where online only products. I had to rely on online reviews and ratings to make my decision. After two weeks of usage I don't regret my purchase. Let me explain my point.\n\n1. This TV have enough brightness to view without glares in a well lit room. (Background light is set to 100% by default).\n2. Color reproduction is good and I had no issues viewing any type of videos.\n3. Android certified Smart TV, with voice assistant is a delight to use.\n4. 10 bit HDR (1.07 B Colors) is a feature many budget TVs miss.\n5. Good inbuilt speakers (Dolby Digital).\n6. Better processor and Ram specification than competitors.\n7. DLED which is better than ELED.\n\nAlthough Flipkart have done an excellent job, I have a few minor complaints.\n\n1. Floor stands provided was not as shown in pictures, It is just a U shaped silver colored rod with mounting points which looks ugly.\n2. TV takes its own time to boot ( around 1 min), but it can be understood since its Smart TV, I think I'll get used to it.\n3. Smart TV responsiveness could have been better, Navigating through apps are not as smooth as I wished for.\n\nOverall a very good purchase, My main concern is about the after sales service, which I am yet to encounter, let's see.\n\nThank you,\nFlipkart",
            "Love the 4K picture clarity. Best TV in this price range. Apps can be sideloaded easily via USB. (NETFLIX is not supported hence doesn't work. Same goes for Amazon Prime. I already have a Firestick so no problem at all.) Speakers on the TV are good enough but if you want good home theater experience, it's a good idea to invest in a Soundbar with good bass. The TV only has optical sound output option... So 3.5mm jack or Stereo Out or HDMI ARC is NOT available, ensure if you are buying Soundbar or 5.1 speaker system, it does have an optical input option. I've tried playing 4k 2160p HDR movies by connecting my Hard Disk and the native media player does a brilliant job at that. People complaining about blacks or Dark scenes performance on the panel are just too demanding...I find no issue here... Screen quality is actually more than you can ask for (specially in this killer budget) One more aspect this TV wins at is the official YouTube app... Playing UHD content on YouTube native app is really enjoyable and easy. (on my Amazon Firestick I was using an alternate app for YouTube and the experience was not that great.) The UI is also fast and the RAM management is adequate. TV starts faster than many similar range offerings in the segment... iFFalcon, Mi etc. About the extended warranty, you should definitely TAKE the 2 years extended warranty being offered by Jeeves as it gives you peace of mind for atleast 3 years, given that Marq is a fairly newer brand. The Smart remote which is Bluetooth enabled looks & feels quite premium and is so easy to use. Well, lastly, the 55inch panel looks quite overwhelming when watching any 4k content and is simply mind blowing.",
            "If I talk about this TV so I would like to discuss some pros and cons of it.\n\nPros:\n1. Dolby sound is better and give you a surround experience.\n2. Day light images really come alive and give a nice contrast and clarity.\n3. It comes with Media player which plays most of the audio and video formats.\n4. In built YouTube app allows you to play online video contents easily.\n\nCons:\n1. Screen has the white spots which doesn't seem pretty good when TV goes complete in black Transition.\n2. Night movie scene or darker images do not go pretty well that it should be.\n3. Inbuilt media player do not play DTS surround audio and MXlayer and VLC etc. not supportable and it is certified android but not all apps you can find on it. there is very few apps you can install and always apps go into the pending mode which is really irritating.\n\nVerdict:\n\nThis the best budget 4K TV in this range. you could go for it but if you have higher budget you can consider another one if your budget allows you.",
            "awesome quality in this range...\ninstallation is good...\nsound good\nGoogle good\n2 remotes nice\nGoogle voice in remote is nice function...\nI bought it in 28500/-... the best rate with 4k quality\nactual 4k run in it",
            "Best TV manufactured by Flipkart.\nGot delivery faster in just one day with full demo and installation.\nMoreover talking about features :\n1.Sound system is awesome,pure Dolby Digital surround.\n2.Picture quality is good.\n3.Android system interface is nice with all Google apps.\n\nPure value for money,highly recommended to buy this TV in this budget.",
            "lagg noticed while playing though mobile Chrome cast, YouTube works pretty fine, unable to detect my mobile when Connected through USB port.. Coming to the installation and service quality its A+.. They responded pretty well and also has taken care in mounting the TV with good placement on wall and without any flaws. There is some distracting patches probably screen backlight bleeding on top of the screen left side mostly while the picture is black and so it is becoming difficult to enjoy the darker scenes at nigh especially..this is something which us annoying and I don't think we can enjoy watching night time and darker scenes. I would recommend the TV for this price point and I got it for 36k with 3 years of warranty so it's actly a deal breaker for me and anyone who is getting for this price I will definitely recommend considering the other good feature of the TV except the dark scene display issue.",
            "Let me go into positives\n\n1) Nice display for the price you pay.. uniform brightness due to DLED, decent contrast (not comparing to product priced twice as much), good colour reproduction (8 bit panel unlike Mi which is 10 bit but the cost difference justifies it)\n2) Easy to understand menu and dual remote makes thing easy to navigate (even my parents don't face much problem)\n3)Side ports makes accessing ports really easy (i dont have much space to turn tv around each time as you see in pic)\n4) Decent sound bar with loudness above expectation (dont expect Home theatre, although I have2.1 speakers I rarely need to use them)\n5) Really fast installation by jeeves and excellent product demonstration...pleased with the experience\n\nNow the cons..\n1) Slow to start even with 2gb ram. My lappie with SSD boots up faster than this TV\n2) Playstore has limited app support (I dont mind as I dont use netflix)\n3) True HDR is missing (8 bit panel just cant do it .. sorry)\n\nAll in all I recommend the product for sheer value of money... In 2-3 years anyways QLED will takeover the market. So can be purchased for the interim period.",
            "Nice TV but Netflix and Hotter not working. You can use fire stick for that. Picture quality its just awesome better than Samsung . Sound is unbeatable. Just Awesome.😍😍😍😍",
            "IM FINE WITH THE BRANDING AND INSTALLATION PROCESS.TV IS GOOD N SOUND IS WELL BALANCED.BUT THERE IS SO DEDICATED BUTTONS FOR PICTURE CHANGE MODE NOR FOR THE SOUND MODE.\nALL OVER A GOOD ONE WITH GOOD FEATURES AT PRICE POINT THAT IS Low COMPARED TO OTHER BRANDS",
            "it's very good tv , sound is great nice product from Flipkart, value for money, just go for it. tv stand is not so good it doesn't match with the system.",
            "I was little sceptical before buying and saw a lot YouTube videos about which to buy among VU and marq. But then reviews were great for both of them. though marq had a lil less as compared to VU, but I decided to take the Gamble and save around 6-7k compared to VU. I am very glad the sound is awsum, picture quality very gud. we are just waiting for more 4 k content to actually give justice to the purchase. well done marq great product and pricing",
            "This flipkart buying experience is my best ever experience. The delivery and installation of this MarQ 140 cm television was incredible!! In less than 24 hrs of placing the order, the item was was delivered and installed. So this was my best buying experience.\n\nThe product is simply awesome..at this price you cannot imagine of an ANDROID 4K SMART 55 inches LED TV. The picture quality is very distinct and sharp. MarQ digital TV is powered with a set of powerful dolby digital speakers which will give you a theater like experience. The YouTube key in the remote is also very helpful for the users to directly browse youtube videos.\nThe second remote is simple to use and good in quality.\nThis is a must buy product if you are really looking for a big screen TV at a sinfully cheap price. I strongly recommend for this product.",
            "Great television never expected this to turn out soo good. value for money , this tv is out of the box stuff. With no doubt buy this . Although this one is great there are some things to remember if ur are buying this , the android version isn’t updated unlike samsung and sony . It has much of an interface which comes with Mi android tv or some thing in those product range so Netflix and amazon prime aren’t available for download although you can download and watch them from aptioide tv app but those apps aren’t that perfect. That’s it .",
            "Good product 👍 value of money. screen and sound quality is so good. I put hd and 4k video it's like awesome experience. Worthy to buy better than sony and LG of brand items",
            "The TV is looking like a mini theatre due to it's large size, Sound Quality is pretty good and Dolby True sound Gives good effects, You tube video's, Casting, Hot star and all other features of TV works good.Happy with The Product.",
            "Thought for a longer period to try this new brand and this model is absolutely phenomenal... The picture and sound quality is excellent and way beyond our expectations... Awesome product and worth buying it..",
            "Excellent product marq 55inch android tv,sound quality is awesome & picture clarity too,but Netflix not supported ..overall go for it & recomended for everyone ..and value for money too..thanks for flipkart for quick delivery",
            "Amazing product at amazing price\ni bought it on offer for 30k\nvlc,mx player are unable to read files from external hard disk may be its the problem of fat32 or ntfs format partition\nbut quality wise the picture clarity is good",
            "okay, now I purchased it post seeing all the reviews on YouTube, comments from flipkart. ofcourse there are pros and cons. pros:1.Value for money 2.dont compare this TV with any other named companies as their price is too high and you can't afford that bcz of that you are seeing this comment. 3.High class picture quality untill you are feeling HD and 4k content 4.suberb sound quality 5.wide screen and almost bezel less. 5.it has bluetooth in such a price range, go and check for bluetooth enabled smart TV from Samsung and Sony then you gonna see the difference. etc... cons: 1.no Netflix and Amazon prime but still you see by doing some activity. 2.still not sure about the servicing 3. not that fast when comes remote and TV syncing. 4.startup time which is manageable. (for me it is a very good in this price range, caution : don't compare this TV to Samsung or Sony or LG)",
            "Well - I believe what we call the product is the physical experience of the product plus the behavior of the associated entities.\nIf I take the product alone - It is simply superb! A beautiful, well built, feature loaded TV at a very competitive price. There are some things which could be improved from the Android store - such as Prime Video, Netflix support, etc., which I believe is in progress and shall be addressed soon.\n\nPros\n- Excellent picture quality, at par with all the premium brands such as Samsung, Sony, etc.\n- Dolby Certified sound quality which would light up the room\n- 4k upscaling is one of the best in the business\n- Enough ports to fit in all your accessories\n\nCons\n- There needs a bit more training for the service engineers (Since it was my friend who came to install, which I never knew in advance, I was relieved a lot)\n- Lack of support for popular apps (This should be addressed in the future)\n- Slowness in boot up, almost 6-8 seconds\n\nOverall (due to the installation experience I had), I can give only 4/5 rating. I was planning to give 5/5.",
            "Picture& Sound quality of this TV is very good and comparable with top brands. sound volume is good enough to avoid sound bars. Netflix is not opening though it is available in play store. it us throwing an error. Prime video is also not available. ofcourse it supports APK. i tested USB port, it is working as expected. we can connect to one drive, google drive and other clouds. good enough internal space to install many apps. I left with more than 11 GB space. ofcourse this is second day. I am quite satisfied.",
            "first of all thanks to flip kart for Timly delivery, and the installation is done within same day,\nabout TV\n1.Picture quality is very good\n2. sound of the TV is very good you don't need the home theater..\n3. connectivity is depend upon the network,,, it is superb thanks jio..\n4.design is very good,\n5. value for money.",
            "Impressive Specifications,running smooth on 8.0 Oreo without any lag or problem,Stunning Picture quality for this price range,HDR does its part very well,Unbeatable sound...thanks to the makers for installing DOLBY AUDIO(no sound bar needed),Self understandable user guide and top of all great package at this price point!\nThe only con I felt was that the Customer service itself is not much informative abt their own product when I called to clarify how to operate some detailed features of the tv.\nOverall unless and until your babe malfunctions everything seems like icing on your cake!\nBuy the product having this in mind!\nIt’s an electronic gadget which can go wrong anytime due to several reasons!\nHappy purchasing your Flagship tv",
            "Excellent Tv with vivid picture quality and excellent sound... Marq Is the Begning for the End of Premium Brands priced too high. happy with the product after using for some time I have found 3 cons in the TV. 1. their is no settings option for Adjusting Brightness of the TV when Playing Android Apps like youtube or Hotstar, high brightness effects the eyes. 2. Built in Chromescast Doesn't work properly hope flipkart fixes the issue with Software update.3.Netflix doesn't work. final opinion best TV with competitive price only few bugs that need to be fixed thought OTA.. thanks flipkart team",
            "Sound quality is the best HD&UHD picture superb overall good innovation",
            "value for the money awesome tv I m very happy to purchase this smart TV sound is very very good picture quality depends on your picture resolution it is support 4K\n\n\nAfter using it I faced a problem that is related to sound system when I increase volume after 5% then volume automatically go on one level till 100% their are miner change in volume so I'm very disappointed with this.",
            "Excellent quality of sound and SD picture is also clear on this TV. Android version is also very good on this TV.\nReally sound Dolby wow Makes me feel happy. I got this product on big billion days.",
            "After 75 days of Usage.\nSingle Word AMAZING...\nPicture Quality is at par with Sony 4K TV...\nSound Quality is best ever on an LED TV...DOLBY TRUE Surround...\nPrice is UNMATCHABLE...We cannot find 55 inch LED TV with these features under Rs. 1 Lakh...\nFlipkart service for delivery n installation is at the best...",
            "its worth buying sound quality is theatre like experience picture clarity amazing thanks to flipkart",
            "I am writing this after one month buying..\n-First of all in this price budget it is the best led i have ever seen..ultra hd 4k ips panel,the display look very pleasant to eyes\n-second install mx player for playing 4k videos with audio\n-third use hd box connection for channels for better feel of 55 inch.\n-fourth audio is very loud bcz of 20w so make sure play in low volume is better\n- worth led tv in this price budget\n-Go for it,dont think",
            "Nice product from flipkart. On usage of 5 five days its superb. Only draw back is it's not hdr10. My x box work on 4k but not HDR. But it's not a problem in this price range its superb. Picture quality is good. Sound is also and smart features are also nice.",
            "I exchanged my one year old 55 inch 4k cloudwalker TV for this MARQ model. I can say, MARQ is the best TV I have ever seen in its or above price range. I am very happy to watch anything on my MARQ TV. Must buy MARQ TV.",
            "Worst Product I have ever bought .. First time i bought unbranded product and suffering . Total waste of money , with in 6 months, Mother board changed.. Panel need to be changed, regardless of talking about changing remote.. My suggestion to all viewers .. never ever trust unbranded things, they come cheap.. but actually the money one spends on these goes waste. Better to add few thousand and buy better quality product. At least you have peace of mind and you are proud of your buy.",
            "I was debating to buy either this TV or Mi 55 inch TV. It was put on sale on the 10th of October and I ordered it. Flipkart kept the word and delivered on time. Installation was done as promised. TV is good especially the sound quality, which is amazing. Picture quality is good and I was able to quickly configure.\n\nLooking forward to using it with inbuilt chromecast.",
            "1. display is excellent for 4k videos\n2. audio is good\n3. android OS is no use. It's very restricted and limited APP is available. streaming video hotstar and sunnxt. better use Amazon firestick.\n4. 48 second to power on the TV.\n5. fixed stand comes with box but problem for physical connectivity as points are backside of the TV. so needs to buy tilt wall stand costing 2500 in Flipkart. support 32 to 55 inch TV.\n6. video clarity is not good for normal video. always recommend for 4K video or HD.\n7. Bluetooth remote is good.\n8. built-in in Chrome cast is good and can mirror mobile and YouTube. didn't checked other apps.\n9. lagging and slow problem is there for watching video post mirroring the phone\n\nmy recommendation is TV is worth for value of as compared to branded 4k TV like Sony, LG, etc.\n\nI bought it for 39K + 2.5K for tilt stand + 4K for Amazon firestick. can use ups if voltage fluctuation are there which will cost 2.7K\n\noverall cost will become 50K is worth.",
            "It one year since i bought this one. Working really good . As usual flipkart delivered in advance and as per our expectation it was installed within 2 hours of delivery. The picture quality and sound - really good.\nAbove all trouble free inspite of children handling as they wish\nReally satisfied with this product inspite of buying out of sudden rush of blood.",
            "Super LED TV marQ by Flipkart great picture and sound. Fantastic service by Flipkart installation done within one hour of delivery",
            "Good 4K Panel TV with excellent color reproduction.\nThe TV is one of the best products with 4K under INR 40,000/- and one can go for it without any doubt. The Android 8.0 gives immense mobility experience and the smart remote truly adds to the ease. The TV only supports 2.4 GHZ Wifi which restricts internet speed. Overall a good purchase under 35K.",
            "Buy it blindly without any doubt. Best picture quality and above that the amazing dolby digital sound effect. Really mind blowing. I had marq 32 inch led tv but this 55 inch one is really amazing. After so many hurdles to choose between so many brand, I assure you that you will never regret..\nBut just after 1 year, the display is gone. And neither marq company or flipkart or jeeves is responding since last 5 days. Very pathetic condition.",
            "nice product by flipkart...very good picture quality with dolby digital sound...quiet happy with the product...only thing that disappointed me is Netflix and prime vedio not supported by this TV.....and that's make a lot of difference...though it's an Android TV but only few useful apps you will find in play store like YouTube , Jio cinema ,voot etc. Hopefully Netflix and prime vedio updates come soon",
            "over all it's good tv with digital Dolby at this price but it's interface is not up the mark , yes it's good to enjoy Dolby picture quality is also good very poorl",
            "Marq TV is beautiful Superb product ..... best quality ....clearity is Good . Full satisfied",
            "I have been using this TV for the past 6 months and it is an awesome TV at this price....big TV, crisp and clear picture, Dolby surround sound..everything is superb.",
            "good picture quality...4k works fine.. sound is simply amazing and user interface is working superb..value for money.. installation done on perfect time and done neatly..great one for jeevas..",
            "awsome!!! nothing is better than Marq 4k in this price range. Flipkart is going to geta big name and fame due to this product. well done Flipkart",
            "Worth buying. I am impressed with the picture quality and sound. Also Youtube connects very fast easy handling. voice command is awesome for YouTube is excellent. Nice machine Flipkart. Thanks for making this costly dream affordable.",
            "Picture quality was Good But when We See On Dark Black it ll b Little Bright and on my tv white spot on few places I called for coustomer Support but they told its Normal But in my point of view Not Satisfying. But otherwise good picture quality on day time if v watch movies on n8 time it ll b not good sometimes , Sound Quality Not That much Good for my opinion Because i use old Samsung tv (box type) b4 buying this tv That tv is very loud compared to this tv (new) 😔 . But good look and sleek design. And after fixing tv on the wall very difficult to plug pendrive and other inputs.... But this is first time am buying big tv 55 inch android. Main advantage all apps working good am really enjoying watching online movies without lag on My ACT Fiber net . For coustomer Support verry Good and verry responsive Till now this all am using 10 days of tv use thank u Flipkart for Customer Support . From Coimbatore",
            "awesome experience ... seriously ul start loving this TV such a wonderful picture quality and solid Dolby digital sound ul really experience lot more ... bliendly go for it .. thank u Flipkart",
            "For this money product is awesome. Haven't found any issue so far using it from 12 days. Got OTA on very first day. I'm happy it's receiving security patches. I have connected it to dual band router and TV has 5Ghz wifi band too. You can't compare the blacks with Oled TV but in this price it's satisfactory. SD upscaling of cable is good. Sound is superb. i loved the sound of this TV. 4K movies work flawlessly. Don't go for this TV if you expect Oled quality blacks because you won't get...\nREAD MORE",
            "Value for money, extremely good product considering the price.\nConnectivity is not that great considering it won't connect to apps like Netflix. But otherwise a great product.",
            "MarQ 55 inch TV is fine best price for middle class people clear image full sound effects totally best other brands\nNow I used marQ tv it is best quality picture using method very simple but instalation engineer is unknown person he is not good",
            "YouTube typing can't be done as the Bluetooth remote does not show cursor ....whenever you try to use internet cursor and mouse problem ocuurs...no air mouse movement provided in the remote which could be easily provided by software update ...you have to move through whole screen with up down buttons ....Google Play have restricted so many apps infact all the useful apps are restricted . no built-in web browser is provided nor you can download from app Store ...why does TV advertisment states that it is certified android when we can not use seamless android ....it's like other non android smart TVs ...worst purchase ever ...will not recommend any one to buy this TV .....and all the above stated problems can be resolved by software update if flipkart wants to resolve . I am very dissatisfied with this purchase . hoping that this problem will be highlighted somewhere and update will be provided ....then only it is useful buy otherwise don't buy ....one more thing... Netflix is not supported.... CCleaner is not supported.... very few apps in Google Play which are useful ....",
            "TV is awesome...... Happy to have this TV.....4k is pretty good and sound is amazing......UI is very fast and easy updates.....very satisfying.....Thank you Flipkart",
            "its was delivered the very next day... the picture quality is quite well perhaps i have probem connecting my hdd however it works pretty well on ixpand pendrive the picture quality is great on 4k and full hd videos. the only reasin to take one star out is thw wall mount i would suggest them to work on the move able one other wise its just fantastic... good job flipkart.",
            "This TV is not supporting vivo and honor mobile for chrome cast function which is not good.... Sony and Samsung TV get connected with chrome cast with any mobile... I am very much disappointed with this, marq has to improve on it. Bluetooth remote also not getting Google Voice command all the time... need to factory reset all the time.... so please help me out of this....",
            "I was in search for a big smart TV from last few days , did lots of research and comparison etc. and finally select this one . Although some cheaper option were also available but I finalized the same. Delivery was well within time as committed, demo & installation was done a day prior. Hazel free installation and demo . My family is using this set from alst 4-5 days & following are my views.\nTV Set- Very good built, nice look , On the wall appears really very premium even on table mount...\nREAD MORE",
            "Great Product with amazing picture and sound quality. It's worth a buy as there is a lot MarQ is providing with this budget range of amount. I have been using this product for almost a month and I am satisfied enough with this TV experience.",
            "I LOVE MarQ TV\nSuperior video quality\nexcellent sound\nI Love MarQ TV\nscreen cast operating super I not expected I like this feature",
            "Excellent Product and True value for money!!! Best in picture clarity and Dolby sound is amazing!!! Would recommend to buy Android based Marq for better picture clarity!!!",
            "after 7 days used of Marq 55 inches TV I am very satisfied with this product awesome picture quality very good sound smart remote also work perfectly before time and quick installation nice and knowledge full installation engg nice internal storage and antroied 8.0 os value for money product by Flikcart then other brand thank you flipcart",
            "I would not use the phrase great value for the money. That would not be fair. It is a very good tv as good as it gets . Up there with the Sony and Samsung with one third the price.",
            "picture good,\nsound damn good,\nwith ample ports for usb, HDMI and Bluetooth, connectivity is good but sound output to home theatre etc.. there is only digital port and good thing is you don't need any home theatre for this TV, sound is that awesome\nsetting picture config I found it bit tricky, need to figure out\ninstallation and demo done was not upto the mark, I knew better on features than the guy who came for installation",
            "good packing clear sound nice picture 4k was a very good",
            "I can say best 4k TV within the budget\nblindly you can buy this 4k TV\nstill if you have a doubts watch some videos on YouTube for review purpose\nDam should definitely will love it\nsound quality is simply superb this 4k TV have enough sound",
            "Giving a review after 10 day of usage.will review it again after long term usage.\n\npros:\n\n1) nice picture quality.\n2) superb sound quality\n3) certified android TV so regularly updated.\n4) Sound search feature awesome.\n5) the best is value for your money, with such a price and features, it's definitely value for your money.\n\ncons:\n\n1) all the apps not available, but can be easily installed through other tricks.\n2) little difficult to configure the sound search. initially I thought like it is not working but that was not the case\n\nyet to explore: any service issue, I hope I do not get any problems with this TV 😊",
            "A good buy and value for money product .\nAndroid OS on TV is very good.\nExcellent support for Installation , They did it within 8 hours , Good job by Jeeves team . engineer was very polite and knowledgeable .",
            "Recieved the TV on 9th Dec 2018. The sound and picture quality is really good.\n\nBut I am completely unsatisfied with the product.\n\n1. The USB port is not working from the first day\n2. TV is getting shutdown automatically after random intervals (1, 1.5, 3 hours)\n3. The service person visited, inform one software needs to be installed. He got the software in a pendrive, when he realised the pendrive is not working didn't install the software and told he has changed some settings to fix the problem, which he refused to explain.\n4. Service person inform my family members this TV can function only for 3 hours in one streach and then need 1 hour of cooling period.\n5. Expecting some good service from flipkart, if you give replacement option that will be really helpful.",
            "I like it ...best quality in price",
            "Good product in this price range. I am satisfied.",
            "After one year TV speaker had issues and parts is not available to replace.",
            "within 1.5 month my screen is blank. only sound is coming no pictures. i raised a complaint more than 20 days over still issue not resloved. After that one executive called told that your issue is closed. inthis brand only with out doing any thing over a phone issue will close. pathetic response. dont buy this brand.",
            "This is real Junk..You will have a painful experience with this TV and let me tell you why:\n1. There is a light bleed from top left corner and it is really disturbing once you notice it. The technician who came to inspect it did not notice it and they asked me to send a video.\n2. The customer service never works.\n3. You cant adjust the video settings(brightness, contrast etc) while watching youtube or sonyliv etc.. you have to go the one of the inputs, select menu and change video settings and comeback home, open the app and check if the settings are correct for you.\nIf they are not good you have to repeat the process. This is endless nonsense (What kind of engineers made this TV?)\n4. A lot of people mentioned that sound is great. Its loud and its surround effect is good but believe me this is not clean sound (bass sucks).\n5. Be careful, TV does not come with return policy. It is replacement policy. They will not refund, only replace and that too with in 10 days. Altougth it is my fault not to notice this, Frankly this is hypocrisy as Flipkart now owned by Walmart definitely has different returns policy in US.\n6. Media player other than what is preinstalled will not play the content (ex: movies on your hard drive, if you try to play it with VLC player or MX player etc..)\n7. NO sound for files with DTS.\n8. Motion rate seems too fast to me ( Like LGs true motion) while playing stored content. You cannot change it.\n\nIf you want to get a headache everytime you watch, go ahead with this junk.",
            "guys sound was good, but display quality very poor, its not support jio tv, netflix, home theater speaker 2pin red and white wire not working, remote failed in 2 days, i compliant customer care still they are not send the any body, worst customer service dont go with these product....",
            "Initially it worked well but after 2 days,it got switched off automatically and its google voice assistance remote was not working properly.Then,Flipkart approved its return request.But,see the worst thing,they have uninstalled the TV 10 days before the proposed pick up date.\nI suggest flipkart,why are you wasting your money and time? At the same time,you are also disturbing customers.Its my suggestion,uninstall the TV during pickup, because it takes only few minutes.",
            "Wi Fi connection is very bad. It’s always showing Wi Fi not connected. My other devices are connected but that TV not. I start restarted many times but no benefit. Customer care number, I tried a lot but not able to connect.",
            "Got this in a great deal but it's disappointing that staple apps like Netflix don't work. It also seems like this is an issue that has been there for a while without any view on when it will become Netflix certified. Note that Google cast ended up taking uqite a while to setup, with updates required for more than a few core services. Lets hope that MarQ corrects their Netflix error soon.",
            "Excellent Product\n\n1.Unbeatable sound performance Dolby digital Surround- 10/10\n2. picture quality is good 4k working fine. 8/10\n3. Connectivity 8/10\n4. build quality 7/10",
            "after the usage of 6 to 7 months black spots on top right corner and centre are visible resulting the poor picture quality due to low quality of LED panel.\nTV was replaced by flipkat , but after 4 to 5 month's usage gain black patches are observed. LCD panel quality used in Mar Q tv is worst and resulting black patches issue\nI don't recomond to buy MarQ TV.",
            "Just Put Samsung Logo on It & U can easily sell it For 1 to 1.5 Lac Rupees, 5 Star For Everything, Go Blindly For it",
            "Awesome... Trust me Buy it..!! value of money with so many features at this price",
            "1 year and no issues so far",
            "Exllent product.i brought 45days back.",
            "Yes Without Any doubt Go and Buy this Tv\nBest In This Price(34k)\nOnly Negative Is Jeeves Technical team . Too Late\nEasy To Download Side Load apps also Like Prime, Jio Tv, Netflix too\nvery Bad For Sd Channels",
            "great tv thanks flipkart but i didn't get my extended warranty slip or card and i didn't get bill of my tv",
            "I bought this tv in oct .Picture quality is good sound also good .But the problem is after using continuously for 10 or 11 hours it automatically shutting down.Again we have to power on.Don't know why.over all its a nice product. value fo\nr money.",
            "TV is not functioning. no picture and no support from Flipkart..",
            "Pros : Picture quality and sound effects looks good. Able to connect digital output, HDMI, usb well\nCons : boot time slow and app response time is little slow. Not able to control picture brightness or colour. No picture mode or sound effect mode.",
            "stop working after 4 hours use and no service for last 25 days. still from 25 days no one attended. not expected such a worst product from flipkart",
            "TV yesterday delivered...today installation &demo done.overall good delivery good product in this money..iam observed display light leaking patches. pls replay",
            "First tv deliver and install in this tv sound fluctuate problem and Google assistance not working. The flipkart replaced this tv then second tv same sound fluctuate problem and Google assistance not working and this time Bluetooth problem also. This tv i connect to my sony blu ray home theatre system and paired successfully but no sound in home theater. Don't buy this marq tv otherwise waste your money",
            "The product is good, but as I was reading in some reviews before buying this TV, there are some issues with the Internet (Wifi) connectivity. TV doesn't explores the available wifi connections very easily, and even if it does, it gets disconnected quite often. The person who came for the demo had very little knowledge about the product and features and was facing the issues while the initial setup. The demo given was just a formality. Overall keeping the price in mind, the product is good but if you (flipkart) can take the buyers review seriously and resolve the issues, this product can be way better than the high priced branded TVs.",
            "TV is good",
            "Contrast ratio is very less compared to VU TV I have and other tvs ,because of this less contrast ratio no clarity for dark scenes ,I am seeing lines of ash in dark scenes in movies,\nYouTube 4k videos doesn't play smooth\nNo voice recognition working for this TV",
            "Worst product. In just 15 months tv screen panel gone. Do not purchase this marq tv. If I asked new panel they says 80% of tv cost. I lost 37000.don't use marq",
            "I have purchased the product on Oct 2018, but unfortunately In Jan 2020 the TV has blacked out n will be into repairs.",
            "dont buy this product this is very bad product n service also very poor",
            "Value for money",
            "Good Sound and Picture for hd content only...Non channels plays like 3 gp videos , Nothing installs through play store...forget about Netflix ,Amazon prime... Flipkart is only letting Google apps play on it's tv...a Nexus product between Google and Flipkart",
            "Ultimate tv. With superb sound quality and picture quality. But google voice search need to be improved and some provision for easy typing.",
            "Utterly disappointed with the after-sales service provided by Jeeves which apparently is partner for Flipkart. I had a pretty disappointing experience. My Television I purchased it 2 years ago and suddenly it showed some sort of issues with the screen. The screen had got dull all of a sudden. Since at the time of purchase we bought an extended warranty of 2 years, I contacted Jeeves to get my television repaired. To my surprise, the technician who came to attend my television ended up damaging my product even more. Since my issue wasn’t resolved, Jeeves personnel came and took my tv claiming they’re taking it for repairs of the product. To point out some facts, the number which they mention on the extended warranty section of Jeeves website is legit a scam since they redirect you back to Flipkart and not answer you properly. To sum up my experience, I did not get my TV yet, and also I don’t expect fraudsters like Jeeves to even return my product anytime soon. So the product will last you for couple of years, depending on your luck. Since these brands aren’t reputed and backed up by Flipkart, doesn’t give them the right to cheat consumers. So it’s totally on your risk that you buy this product. Hope my review will help some innocent buyer who intends to spend their hard earned money on such a cheap, low class brand and product.",
            "TV got Patches on the screen just within 1 year. Another tv which i gifted to sister got full panel bad.",
            "Dabba. Product. Please. Dong buy it. . its a waste product",
            "dont buy",
            "I am facing screen burning issue from the sixth month after the purchase. flipkart was not ready to resolve my problem. after many mail exchange among me,flipkart and consumer forum they replace my tv with new one. but after four months this replaced tv also facing same burning problem. I am feeling cheated by flipkart. so my recommendation is not to purchase this tv.",
            "Supb picture.. great sound.. highly recommended... all features are really awesome...",
            "The best TV among these prices. The sound is great. Thanks Flipkart.",
            "great finished product by Flipkart with explosive sound....",
            "product is delivered and installed, Wi-Fi not working, hdmi two ports are not working... seems risky to buy such huge items online",
            "I am very upset for flipkart marq product this item sound,s good picture quality good but tv,s right top and bottom corner extra light visible every time and google voice connectivity is very poor ...\n\n\nthis is very bad for installtion this time the jeevas partner tell don't know about your product.",
            "not good andriod tv.",
            "very poor products I laughed complaints in Aug 11 but still pending not resolved so it very poor product the service of marq products is very adverse so i suggest not buy this brand products. the issue is not resolve till date.",
            "Don't waste your money--- Sound vanished just 10 days after buying this TV. Several visits have been made by Technicians incl. change of parts but still after one month the problem has not been resolved. Horrible first time experience with Marq, no reasons for recommending it. My hard earned money has been wasted.",
            "Fabulous TV for such an ultimate price. Full HD and sound quality is good. Flipkart deserves a good job. Satisfactory.",
            "Good Product. Real Value for Money. happy to this product ,",
            "Within 15 months the panel is damaged. And they want 80% of TV price ie: 36000 for repair. So many same complaint regarding the panel issue. If you can't manufacture a tv to even last a year why are selling it. How dare you. How dare you cheat us. Who even gave you a license to sell. I will see through it that this is not an end to this.",
            "True review after 8 months, TV have dead pixel issue. replaced by company after long struggle.",
            "very poor quality getting problem in 8 months and made complain on 13 July but after 20 days don't get the any solution bakwas don't even think of the product waste of money",
            "one of the worst decision is to buy this useless TV except for size nothing good about this.My mobile network rarely connect to this TV,in span of a month it got connect thrice.am using this as normal TV,worst thing is when I try to login YouTube the font is worst which doesn't allow to login.when I type a it doesn't take a,it gives a in 3 fonts which are not related, finally YouTube reject it.please don't buy this TV",
            "the Bluetooth remote isn't working at all and also the google assistant is working when i speak to the remote... i guess thats the reason there is a price drop currently. please do check negative reviews aswell before buying the productbas i ignored the negative reviews and am paying for it now...",
            "Buy a branded TV , dont get into this. Since the time i have bought it, it is not working properly. And when you try to complain to Flipkart they ask you to call some other number and when you call at the other number they tell you that they are not able to trace the order number. I am in a mess and do not know whom to approach and how",
            "Update :\nNetflix doesn't work with this particular TV.\nThe tv is a bit slow.\nThe helpline for MarQ is not good.\nTv keeps restarting after the new update.",
            "TV works flawless ,crisp audio and video, only downside I found is that there is no brightness settings anywhere, gives you headache under 30 mins of watching continuously",
            "after making soo much research and watching reviews, I bought this Tv.\nand I am happy with this tv.\nas well I get all app on Google.\nwe can also install app using Google app either third party apps.",
            "Value for Money , Smart buy, No of competative features with current market trends at very low price (10-20% lower than any other similar product ) . 55 Inch, Dolby sound is added advantage with IPS Panel.",
            "Good picture quality and awesome sound",
            "TV is very good in all aspects from day one but was having 2 issues. Installation and Wifi. Though installation was bottle neck for me, I resolved it personally but Wifi issue taken high priority by technical team and resolved it. Thanks for technical team for their effort and support and be customer centric. Thanks to Ramakrishna from tech team for followups.\n\nIgnoring my installation problem, all 5 stars is for TV as a product and Tech Team effort/support.",
            "a true 4k experience in budget, I got best offer, buy it without even thinking twice, you won't be disappointed",
            "good product compaire to Sony LG Samusang",
            "don't buy this TV... worst experience ever...TV get automatically shutdown frequently... service man can't identify the problem.... even after replacement the new one also has the same problem...I don't know what can I do....",
            "I have successfully run Netflix & Jio Tv on this tv, excellent picture and Sound quality.",
            "All good except there is no option for picture setting in settings to adjust the brightness etc. most of the reviewer complaining about Netflix and Prime video. Yes these are not supported directly but guys do some research. both apps are running on my TV and I am enjoying online content. prime is running without any issue however Netflix needs wireless mouse.",
            "I am writing this review after using it for 15 days.My wife woke up in the night and saw he TV was ON and was freighttened. AFTERWARDS WE NOTICED THE GOOGLE CHROME CAST STARTS/switches on SUDDENLY automatically. I am expecting the technician.FLIPCART NEVER BOTHERS ABOUT CUSTOMER CARE. EVEN AFTER SENDING A MAIL, THEY REPLIED THAT WITHIN 48 HRS, TECHNICIAN WILL ATTEND.SO,ANY COMPLAINT WILL TAKE 6 DAYS.I THOUGHT AS WALL MART HAS TAKEN OVER FLIPkART, the products and service will be good. BUT IT IS WORST. I HAVE ASKED FOR RETURN OF PRODUCT AND REFUND. DO NOT BUY ANY MARQ PRODUCTS.",
            "Lots of issues after 1 year",
            "Changing ratings from five. Though the tv is good but not at all durable. The display has stopped working all of sudden and its not easily serviceable. The cost of repairing quoted by flipkart is almost 60% of buying price.",
            "I am writing this review after using this TV for 1 year.\n\nI got issue in screen and Jeeves says parts are not available so they can't repair. I feel cheated.",
            "Television is not at all working after two years and even though I have extended warranty from Jeeves the repair process is progressing nowhere because of incompatible spare parts and defective spare parts by MarQ.\n\nThis means the lifetime of this TV depends on your luck if you believe in that. You can't rely on the brand or manufacturer or the warranty provider.",
            "Gift of Flipcart excellent than leading Co product!",
            "good picture quality finer adjustments\nsound is loud. spdif output available\nDTS sound is not decodable and is unrecognisable format from the TV so any downloaded movie may not decode DTS\nexfat file system is again not recognised. left with fat32 and NTFS if the files are larger file size.\nspdif delays are difficult to tame even with controls in the TV",
            "Really awesome",
            "Simply Awesome",
            "very good picture quality..\nbut prime videos not supporting very very disappointed\ndear Flipkart kindly update prime videos in TV play store..\neveryone watching prime videos..\nbut now we feeling disappointed of purchasing marqtv..\nkindly update prime videos as soon as possible",
            "Television is awesome sound quality is good picture quality is also best over all The Television rating will be 8 out of 10",
            "Go blindly. Awesome sound quality excellent product.",
            "Excellent viewing experience value for money.But little disappointed with playstore NETFLIX NOT SUPPORTED",
            "Over all it is very good. Picture quality, sound, connectivity. Bluetooth remote is very useful.\nGave 4 star since the normal remote will work only when we point it to the sensor.",
            "awesome",
            "very very good product\nvery valuable.",
            "Decent enough for the price, display is top notch, but slight issue with the sound, while playing movies through external device the pitch of the sound increases suddenly( during bgm) which is slightly disturbing and pushes to adjust volume frequently, rest is perfect",
            "Nice product",
            "good",
            "this tv is awesome, thank god didnt bought MI tv, the picture and sound quality is awesome. what else do you need in a tv 9=",
            "nice tv in this price range",
            "Perfect product for this price ,sound is great (bass is not that good),clarity is awesome in real world you'll not see any negatives in display\n\nNo speaker out😡",
            "i used this TV from last 15 days, till now it perform very good and i think it is value for money.",
            "good product",
            "With great sound and awesome picture quality this TV is a velue for money product.",
            "Best",
            "worth for money!!!! good one picture and sound quality",
            "connectivity issue only",
            "so far so good....no problems..installation also before time....",
            "Good tv and price and good luck ing",
            "good value of money",
            "Tv is good.",
            "Awasome products",
            "good tv",
            "unable to install any app. and unable to connect to hdmi also. and it is not dolby. please dont waste money on smart tv.. this is worst tv. my sincere suggestion dont buy this TV",
            "White spot at left top area accept all things good",
            "best tv in 28.5k. only all ok in all performance",
            "Awesome android TV in verrryyyy low price...Thnakkkk you MarQ by flipcart",
            "Very good",
            "Excellent TV made by marq.",
            "Amazing picture quality at this price range.",
            "nice product",
            "Great picture and sound Quality\nMust buy in this price",
            "Awesome experience if you are looking for 4k it’s definitely best choice amongst this category",
            "good product.. but 3 tb hard-disk not support.",
            "after fit in wall not using USB pin",
            "super quality product, efficient & equivalent to Sony & other brands.",
            "Poor product quality\nNetflix doesn't work\nLow sound from speakers\n- loud pitch sound while changing channel on setup box\n\nUpdate after 1 yr\nStopped working\n\nSave your money stay away from marq",
            "After using for around 2 months it is safe to say that it's really a great budget tv in this segments. Even some other brands who claim to be no. 1 lacks transparency in terms of specifications , this was one of the main reason to go for this. And during sale period I purchased with drop dead price. There was little bit connectivity issue while using cast option from few phones but it's fine for a tv in this range. Don't wait grab a piece of entertainment ASAP.",
            "exhalent &very nice...",
            "Nice product at great price compare to any other brand.",
            "One can not expect such a great quality product on such a low price.",
            "wonderful TV with amazing features!",
            "value for money product..",
            "The blacks are very bad On this I dont think this is best tv n picture quality after one year use I feel that picture quality is important. and it fail in this\nbest part is inbuilt surround sound was so amazing the speakers was loud and clear No need of Soundbar, bootup time is slightly slow as compare to mi tv i think this tv",
            "the product (marq tv 55 inch) is working fantastic. I want to exchange this tv with a 65 inch tv. how much extra money i have to pay for this exchange",
            "awesome product...thanks Flipkart",
            "Connectivity issues some time very quick and some time trouble to connect",
            "sound clarity not good",
            "very good tv",
            "worst product",
            "awesome tv",
            "sounds effect is bed",
            "voice connectivity not functioning",
            "very good product",
            "It's a very good deal....",
            "good tv",
            "Great value of money made by flipcart",
            "good tv",
            "West tv. Money waste, time waste, bad product,",
            "Excellent TV till now...",
            "Screen mirroring is not functioning with any mobile after the latest update.",
            "Value for Money",
            "Voice remote is not at all good. Voice feature doesn't work",
            "always super Marq",
            "i wonder what will be the product support. tv quality of picture is nice",
            "Very nice product. Awesome picture and sound quality",
            "super pitcher quality",
            "I am unable to connectivity to Netflix. Customer care is not very helpful. I am still awaiting a call back from them and to find a resolution to my issue with Netflix.",
            "Very Good product nd dilevary Awesome Thank you flipkart installetion vary surprise",
            "nice tv",
            "price and sound good",
            "very good",
            "high quality in less price perfect video experience",
            "Thanks to flipkart",
            "super tv",
            "Good picture and sounds and value for money so far ... need to see how long this will go..\n\nBiggest challenge is it is not allowing Amz prime to be installed",
            "beautiful and worked only for 11months .before warranty it failed",
            "Love from Hyderabad. Awesome purchase",
            "smart tv is very smart",
            "demo was good Marq TV is Value for money",
            "Installation not done even after 5days from delivery.",
            "Excellent tv at this price! Just loving it..",
            "Its a best tv awesome picture quality sound quality",
            "Excellent product and its worth for money ....must experience high quality product in very minimal cost",
            "Fabulous indeed ossum just keep your heart cool and buy this.it showers happyness all the way in your family. geeting all to gether in all the way.",
            "Netflix is not working if you want to adjust the picture mode then you only have option in their inbuilt media player.",
            "Audio quality is good but picture quality is average. Also netflix is not working . App store having limited apps only.",
            "Great service by Flipkart.\nFast delivery and easy installation.\nAwesome sound with crystal clear picture.\nGo for it !\nThanks to Flipkart!",
            "good tv",
            "Very nice product in this price.",
            "supper",
            "nice tv . it works very nice",
            "Very nice product. I wan't expecting this good quality for the price I paid",
            "Excellent product in Movie resolution aspect. Getting some issues in connectivity sometimes. otherwise a nice product.",
            "value for money",
            "Complete value for money, wound quality is really impressive it has actually beaten my 60k sound system. Picture quality and other stuff is also good not at all bad for 40k",
            "good TV. installation and demo was successful. it's good if prime and Netflix pre-installed or allow us to install.",
            "experience engineer",
            "good pictures quality sound was super",
            "Just Wow.....Amazing sound Quality, Picture quality is also good. Worth for money.",
            "Excellent quality",
            "In one word 1 no.",
            "fullfilled mt expectations ❤️❤️❤️... marq the best i bought marq soundbar too great experience....best for rate...",
            "Very good product .only issue I faced was to install Netflix . Hopefully they release a software update to take care of that . Happy with the purchase . Video quality is upto 4K standards and audio is excellent compared to other bigger brands .",
            "t.v is fantastic but Google play store some limited apps and net connectivity is o.k and how to download movies and music file",
            "single word OSM👌",
            "Good",
            "good deal flipkart",
            "Awesome picture and sound. Must buy.",
            "pendrive not accepted",
            "Awesome picture quality n sound",
            "No any 4k in 55 inch can compete this Awesome model ... loved too much ....",
            "I can trust to online shopping NOW...",
            "Excellent television. Picture clarity is excellent so is the sound clarity. A loud television. No connectivity issues yet. So for me, a five star television.",
            "Disappointed with sound quality.",
            "awesome sound",
            "picture quality is awesome, value of money....",
            "the best product at the given price.",
            "great service by flipkart",
            "Nice product for price",
            "excellent product from Flipkart true value for Money..",
            "nice product.. well satisfied",
            "super 👌",
            "no second thought , more than Sony awesome really , sound was simply superb , please purchase this marq by flipkart wow",
            "Having good experience with marq products.",
            "good product",
            "superb, very fast installation I.e., in a couple of hours T.V. was installed by the engineer. value for money.",
            "nice demo,excelant tv.i given money worth.i got very excited."
        ],
        "likes": [
            "196",
            "348",
            "34",
            "10",
            "9",
            "3",
            "11",
            "3",
            "6",
            "8",
            "196",
            "348",
            "34",
            "10",
            "9",
            "3",
            "11",
            "3",
            "6",
            "8",
            "6",
            "2",
            "2",
            "2",
            "2",
            "5",
            "2",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "4",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "89",
            "74",
            "8",
            "52",
            "35",
            "17",
            "19",
            "21",
            "5",
            "8",
            "11",
            "4",
            "4",
            "4",
            "2",
            "2",
            "2",
            "2",
            "2",
            "7",
            "3",
            "3",
            "7",
            "2",
            "3",
            "3",
            "4",
            "1",
            "2",
            "2",
            "2",
            "2",
            "2",
            "1",
            "0",
            "1",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "3",
            "3",
            "2",
            "2",
            "2",
            "2",
            "0",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "33",
            "164",
            "13",
            "0",
            "0",
            "0",
            "5",
            "0",
            "2",
            "5",
            "33",
            "164",
            "13",
            "0",
            "0",
            "0",
            "5",
            "0",
            "2",
            "5",
            "3",
            "0",
            "0",
            "0",
            "0",
            "3",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "5",
            "2",
            "4",
            "0",
            "1",
            "1",
            "2",
            "2",
            "4",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "16",
            "14",
            "0",
            "14",
            "15",
            "5",
            "9",
            "13",
            "1",
            "4",
            "7",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "5",
            "1",
            "2",
            "7",
            "2",
            "2",
            "2",
            "4",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "4",
            "2",
            "2",
            "2",
            "4",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "2",
            "2",
            "5",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1"
        ]
    },
    "qna": {
        "questions": [
            "Q:does this tv had blue tooth to connect to other devices like sound systems with Bluetooth",
            "Q:How Google certified Android TV is different from normal Smart TV?",
            "Q:Can I play games on this TV? Does it have pre-loaded games?",
            "Q:does it support ARC?",
            "Q:Is it DLED or ELED?",
            "Q:its available screen mirror option to connect through mobile and wireless key board can use for typing anything",
            "Q:How to perform a Firmware / Software update on Android TVs ?",
            "Q:is this an android tv?",
            "Q:brightness is how many nits",
            "Q:Have they included Netflix support which was missing before ?",
            "Q:Do I get wall mount with the TV?",
            "Q:How to Pair the Bluetooth Remote with your TV?",
            "Q:hdr support or not support",
            "Q:I have downloaded Netflix but it shows error when I try to launch it. How can I fix this?",
            "Q:Which V-Guard stabilizer is best suitable for this 55inch LED TV?",
            "Q:I want vewd App Store how to download vewd App Store in marq 55 inch led TV",
            "Q:how much internet speed is sufficient for smooth performance ?",
            "Q:what is the difference between in 55 inch both model? 39999 and 34999? Does Rs 39999 ,55 inch have metalic silver frame or its having black color ?",
            "Q:Google cast works via WiFi-direct?",
            "Q:How to install APK files through USB?",
            "Q:Does the TV have any pre-loaded Apps?",
            "Q:does the screen goes inside while pressing with the fingers and does it have a gap between the screen and the outer panel?",
            "Q:How to change picture and sound settings?",
            "Q:Can I use phone as remote?",
            "Q:Can I cast my mobile screen without wifi router ?",
            "Q:its tv have blutooth",
            "Q:is it a smart tv",
            "Q:Can I play beach buggy game ?",
            "Q:Will this TV get updated to Android Pie?",
            "Q:air mouce included or not?",
            "Q:What is the difference between the MarQ 55inch model costing for 40k and MarQ 55inch model costing for 36k?",
            "Q:I can't see the youtube, google movies on home page",
            "Q:Does it support hdr 10?",
            "Q:Does it have web browser?",
            "Q:does fireTV stick wotk well with 55inch Marq",
            "Q:can you tell me whether the brand is completely Indian or not because the way you've said in the 'country of origin' section is confusing.",
            "Q:how to play movie from pendrive",
            "Q:can i play netflix on mobile and mirror cast on this tv?",
            "Q:Does this TV support Netflix?",
            "Q:Can we install netflix from play store?",
            "Q:when we connect sd box how is picture qualuty..some buddy tell in review...very bad or blur picture.",
            "Q:How do I login into Google App store?",
            "Q:Can google chrome app be downloaded in this tv",
            "Q:does it have multiaudio output..means can i play tv speakers along with bluetooth speaker at same time..??help me out please..",
            "Q:It have hdr10",
            "Q:I am not been able to connect the Bluetooth speakers... only Bluetooth remote od TV is connected... can anyone help...",
            "Q:Its play all videos in smooth format like 60fps",
            "Q:extra remote aveleblle?",
            "Q:Dear all please tell me can this tv have feature of IR set box cable support. In this feature we don't need any extra set top box remote we can use only TV remote to operate set to box.. Please tell",
            "Q:Does it have Patchwall..?",
            "Q:Will marq android tv get android 9 pie update in future?",
            "Q:it is support home theater ,is there ARC.",
            "Q:Will it get Android 9 support ?",
            "Q:Will my WD passport 2TB external hard drive work? Appreciate answer from the seller. because in Q&A section tere is mixed response of YES/NO",
            "Q:can i install third party apps through usb",
            "Q:does thistv need 1 hour rest after 3 hours view",
            "Q:Does this support fire tv 4k which requires HDCP2.2?",
            "Q:How much weight ?",
            "Q:Why 55 inch model is cheaper than 49 inch model? 55 inch model is inr 33999 whereas 49 inch model is 34999 on June 6 2019",
            "Q:netflix app can be download in this tv",
            "Q:is the Tv have liquid pannel?",
            "Q:will i get only the remote control for marq tv",
            "Q:Mobile mirroring option is avaliable or not in this tv",
            "Q:does this tv support dish tv sd box ?",
            "Q:Does This Tv Support SD Dish Box ?",
            "Q:3 TB external Hard disc support this tv",
            "Q:How to change audio output to home theatre",
            "Q:How to pair the Bluetooth speaker with your tv?",
            "Q:Is display faces looks whitish in certain view angle of 130 and above?",
            "Q:This TV heated or not",
            "Q:can i connect wireless gamepad for playing game",
            "Q:how many ram and rom adapted this marq 40k 55inch tv?",
            "Q:can I add extra subwoofer with audio output ?",
            "Q:does this tv supports webcam for video calling like whats app google duo etc",
            "Q:TV's optical out is damaged, is there any other option to connect Sony HT-RT3 home theatre to TV? Bluetooth connectivity gives voice & motion/picture mismatch.",
            "Q:Bluetooth have this tv indide",
            "Q:How to on blue tooth remotr",
            "Q:We go to home page then we how will go live tv",
            "Q:Is this TV has Picture in Picture (PIP) feature",
            "Q:is this tv support Bluetooth",
            "Q:why the tv is offing by its own..?",
            "Q:can i install apk like mobdro etc",
            "Q:Hi tv installation has done but i am unable to increse and decrese volume fro tata DTH Channels any suggeations ???",
            "Q:How To install vewd App Store in marq 55inch led TV",
            "Q:You're gonna connect remote using Bluetooth. At the same time you can not connect with a Bluetooth speaker I believe as 2 Bluetooth devices are not going to connect with TV with exact same time.",
            "Q:this TV is DLED TV ?",
            "Q:is it play 4k player movi",
            "Q:What is the Wall Mount Dimensions?",
            "Q:how is the purchase feedback in Kerala.?",
            "Q:does it have voice search remote",
            "Q:How does SD channel feels?? Share picsn does it provides upscale pictures with smooth motions??",
            "Q:what about the recording feature?",
            "Q:Does any of the hdmi port supports hdcp 2.2 content protection standards?",
            "Q:HDMI version?? Can it play 4k vedios in 60 FPS via HDMI?",
            "Q:64gb pen drive accepted this television",
            "Q:What technology is used in this TV to avoid motion blur?",
            "Q:What is box size of 55 inch tv? i want to transfer it later?",
            "Q:Is there any bleeding light issue while watching dark content from four corner of the display??",
            "Q:is this tv support Mkv format??",
            "Q:Is this work with my samsung HT-J5550K home Theatre System",
            "Q:Sony vs this?",
            "Q:can we connect pc",
            "Q:Does it supports what's app?",
            "Q:what's is the stand size for marq 55inch tv?",
            "Q:how much ram it have actually? ?",
            "Q:Can we expect Netflix access in future and also can we install Prime Video and play",
            "Q:Whats the HDMI port version in this TV?",
            "Q:Can it support Jio TV?",
            "Q:this tv support hdmi arc",
            "Q:This LED is a Hangging or Not?",
            "Q:Can I play PS4 Pro? Does it supports ?",
            "Q:how much ram and storage capacity?",
            "Q:Contrast Ratio,How many nits?How is the picture quality compared to lg or samsung?",
            "Q:What is the contrast ratio?",
            "Q:Does it support HDCP. If yes, what version?",
            "Q:It has a 10 bit panel or 8 bit + FRC panel?",
            "Q:What is actual contrast ratio of this tv? (you have shown 4000:1 in product image & 1200:1 in product details.)",
            "Q:Does it has an IPS panel?",
            "Q:Can I use Skype or hangouts or Duo by connecting to web cam?",
            "Q:Does it support netflix and prime video",
            "Q:hdr or not hdr??",
            "Q:Is this tv HDR 10",
            "Q:Install jio tv app and hotstar app",
            "Q:how to connect sony dz350 home theatre",
            "Q:Does it have a magic remote? Like you can navigate through guesture?",
            "Q:Heavy Games Like PUBG.. ASPHALT 9 .. Handle smoothly On this Tv. ?",
            "Q:can i use keyboard and in this tv",
            "Q:can u play 4k videos on YouTube on thie TV",
            "Q:I read in description that Netflix and Prime are not supported. Most smart TVs have netflix and prime pre-installed, why this TV doesn't support these apps?",
            "Q:As this tv does not have HDMI(ARC) port , Can I connect its S/PDIF optical out port to digital home theatre? Is TV S/PDIF Optical port compatible with 5.1 dolby digital sound output? Please tell me.",
            "Q:Does this have any ARC(HDMI) PORT?",
            "Q:Does this TV have S/PDIF port?",
            "Q:which App support screen share through mobile",
            "Q:Is it google home mini compatible",
            "Q:Can it have headphone 3.5 mm jack",
            "Q:Does the TV have optical out for connecting sound bars?",
            "Q:does this tv support prime video?",
            "Q:Does this TV play ps4 pro on full 4k",
            "Q:1TB external hard disc supported this tv",
            "Q:does it connect with sony home theatre ht iv 300",
            "Q:wether this tv supports ultra smooth motion technology? i.e memc, trumotion, motionflow",
            "Q:when Netflix issue will be resolve ,i m interested to buy this tv",
            "Q:In the images 2 types of remotes are shown, which one will we get ?",
            "Q:Netflix and Prime working with new update?",
            "Q:Can I cast videos or anything from my phone without wifi connection",
            "Q:which stabilizer is suitable for marQ 55 led",
            "Q:dpes it work via hotspot",
            "Q:how to change sound modes and picture modes in this MARQ tv?",
            "Q:does TV support HDR10 ?",
            "Q:what is the difference between dled & Oled",
            "Q:Is Netflix and amazonprime not supporting issue is solved or not with update? I'm planning to buy one.",
            "Q:Who's better tv marq 55saugd and onida 58uic",
            "Q:is this LED r LCD TV",
            "Q:This TV is supported 4K video via USB playing and ota update",
            "Q:which one is best mi 4xpro or marq in 55inch?",
            "Q:none of the apps r being installed or updated from playstore , what do i do ?",
            "Q:will we get support for Netflix in future with an update?",
            "Q:this tv support sun nxt ??",
            "Q:can i install PowerPoint app from playstore will it run?",
            "Q:Netflix connection error",
            "Q:how to perform hard reset on this tv",
            "Q:marq tv front screen fiber or glass",
            "Q:does it support card reader",
            "Q:can I connect this tv directly to Mobile without router?",
            "Q:is this is a google android TV with google louncher , google search and ASSISTANT also or just searching by voice and displayed on screen and thwn we have to play ?",
            "Q:this tv have mouse and google vioce are not",
            "Q:How does it not have a 3.5mm jack ? how can i connect my logitech speakers ?",
            "Q:Anyone has any idea if this product will be upgraded to android pie or 10?",
            "Q:Is Apple TV compatible? Also can this tv be wall mounted?",
            "Q:When can we have primevideo and netflix avilable for this TV its really shamefull that it does not support key application like next flix and primevideo",
            "Q:Does its HDMI support HDCP 2.2?",
            "Q:Does it support HDCP 2.2",
            "Q:does it support hdcp2.2",
            "Q:how to connect android tv app to marq tv ?",
            "Q:Can I watch 4K Blu-ray movies which are around 60 - 70 GB on 2 TB external HDD via USB?",
            "Q:can i watch tv on inverter",
            "Q:yesterday i odered MarQ 55SAUHD tv, but i need extra pair of remote. how can i get thos.?",
            "Q:is it 3D TV ?",
            "Q:tv side thickness",
            "Q:I could see many disappointed buyer reviews with netflix issues and not enough apps in playstore coz of Non availability of OS update. any changes in this ???"
        ],
        "answers": [
            "A:Yes",
            "A:MarQ Official Google Android TV has Google TV Launcher, Google Search & Assistant, Unrestricted access to Google Playstore. But normal smart TV don't have access to these Google apps",
            "A:Yes, Many google games can be downloaded from google playstore.",
            "A:No",
            "A:It is DLED",
            "A:screen mirring is not working even it connected with WiFi router. very bad software please update it service boys are not fixings.",
            "A:Whenever a new version is available a notification will pop-up on the screen or you can also check in settings for system updates.",
            "A:Yes. Google Certified V8.0 Oreo",
            "A:450",
            "A:netflix version 4.16-200217 is working perfectly for me.",
            "A:Yes wall mount comes free with all TVs",
            "A:Go to \"Add accessories\" in Home page. press and hold home+left navigation key on Bluetooth remote. Press OK key for address of the remote. Your blue-tooth remote will be successfully paired",
            "A:It supports HDR",
            "A:Netflix version 4.16-200217 and Amazon Prime version 4.12.7 is working perfectly on this TV",
            "A:Yes, use V-Guard Digi 200 supreme stabilizer",
            "A:android doesn't have it.",
            "A:min. 10 MBPS Speed is sufficient",
            "A:both are same in model but different between features and software",
            "A:No, It works only when TV and phone are connected to same Wi-Fi router",
            "A:Install one �file manager� app, for example- �ES File Explorer File Manager�. While installing, pop up may come for security warning or software installation authority, please enable it & install.",
            "A:MarQ Android TV comes with pre-loaded official apps like Youtube, Google Playstore, Google movie, Google Music, Google Game, etc .",
            "A:no the screen doesn't go inside and there Is a small gap b/w screen and outer cover",
            "A:Go to live TV in home page. Press menu key on remote, You can see menu OSD on TV. Then, press OK key. You can see the picture and sound settings.",
            "A:Yes. Install Android TV app to use phone as remote",
            "A:yes u can cast it.",
            "A:Yes bro..you could even connectultiple devises simultaneously.",
            "A:Yes this is Smart tv",
            "A:yes definitely",
            "A:no till date 10 dec.18",
            "A:No",
            "A:android tv with Google Voice control remote",
            "A:When you switch ON the TV first time you need to follow the process of sign in with your Google accounts. And after that you can access all Google apps.",
            "A:no. no support. dont buy. its a waste. siMple google chrome also cannit be installed. waiting for a replacement due to screen blurring",
            "A:it doesnt come preinstalled but you can easily side-load it or download via Google play store. Puff-in is familiar web browser.",
            "A:It definitely works with firesstick, though you would not need a firestick if you are using Marq TV",
            "A:it's a flipkart brand and manufactured in india. ie., by dixon technologies as per research made by me. it may even be a different one. plz rely on your own research. thankyou.",
            "A:Install a file explorer app on the TV to view folders in the pen drive and you can play the music or movies or see pictures from the pen drive using the explorer.",
            "A:Yes down load goggle home app & through this app u can mirror cast every thing on to TV",
            "A:No it doesn't support Netflix.",
            "A:Yes, we can install. But,Netflix is not supported",
            "A:Only 4k videos are good . don't buy this TV . this one has back light bleeding issue and the corners are dull quality ..",
            "A:When you switch ON the TV first time you need to follow the process of sign in with your Google accounts. And after that you can access all Google apps.",
            "A:You wont require to download the google Chrome seperately as it comes Pre Installed (Built In) in the TV. You May however, require to update it time to time as per the notifications.",
            "A:Nope u can't",
            "A:No",
            "A:not work voice command",
            "A:Yes. All videos playing smoothly.",
            "A:There r total 2 remote. 1 with Bluetooth and other without Bluetooth.",
            "A:U will need to install a set top box to use view tv channels. The remote for set top box are usually configurable and can be assigned functions like volume up and down and powering on the tv.",
            "A:No.. Only android",
            "A:yes .",
            "A:yes, but it's not supporting Amazon prime videos, really I am not satisfied.",
            "A:No, no such update is available so far.",
            "A:Yas",
            "A:yes, Netflix also working",
            "A:No. You can use it for long hrs & there is no problem in using it.",
            "A:No",
            "A:14.8 kg",
            "A:Extra feature in 49 inch 49SAHD In 55 inch poor quality tv stand",
            "A:Yes",
            "A:yes",
            "A:Yes",
            "A:it's available",
            "A:yes.",
            "A:I believe you are asking about standard channels. If yes, then it does. Lots of ports have been provided to cover all connections. Just want to add..picture quality is awesome at this price range.",
            "A:YES, it supports 3TB.",
            "A:I have connected TV optical out to home theater in. it is working fine. But TV volume control cannot be used. we have to use home theater Volume control only. If any one has Better solution, pls post",
            "A:First put your speaker in Bluetooth pairing mode then go in settings in your TV to add accessory option, you will find your speaker here so just add it.",
            "A:no..not at all",
            "A:Not at all",
            "A:No",
            "A:2.5 gb",
            "A:Yes i am added extra subwoofer",
            "A:YOU CAN DO CROMOCAST WITH YOUR PHONE . SO BY THAT WHATS APPS CAN WORK BY THIS WAY. WEB CAM I DIDN'T TRY IT.",
            "A:use Bluetooth connection and connect to Sony speaker but there will be a one second time lag both in optical and Bluetooth output that Flipkart marq team has to fix",
            "A:Yes, 1 remote is bluetooth remote. U can also use ur bluetooth headphones or bluetooth subwoofer.",
            "A:put in pencil cells than remote is default on. you have to go to settings of TV and pair Bluetooth remote like we pair Bluetooth mobile that's it.",
            "A:Press Source button on your remote control and select from the options",
            "A:no",
            "A:yup.",
            "A:No",
            "A:yes they gives 16 gb storage so you can installed apk apps like mobile. i installed jio tv and other apps.",
            "A:CONNECT SET TOP BOX WITH HDMI CABLE TO TV TO AVOID THIS PROBLEM",
            "A:there's a inbuilt Playstore where u can download all apps that supports smart TV.",
            "A:Yes two devices can be connected at the same time.I have connected the remote and my Bluetooth headset together . Both works well",
            "A:yes",
            "A:YES",
            "A:S",
            "A:superb!👍 excellent experience with my MarQ TV.",
            "A:yes",
            "A:Thunder",
            "A:YES Really good",
            "A:NO",
            "A:Of course it does",
            "A:I have connected my 320 gb hard drive in USB... Working fine",
            "A:thr refresh rate is 60 hz",
            "A:15CM extra at all the sides",
            "A:nothing like that",
            "A:Yes",
            "A:Yea it will work",
            "A:Marq tv is nice this budget your budget is higher obviously Sony",
            "A:yes, it has vga port as well as hdmi",
            "A:yes",
            "A:about 2.5 feet",
            "A:2.5gb",
            "A:Not able to access Netflix",
            "A:2.0a",
            "A:yes it support Jiotv but application is not available in it's play store so you have to externally install jiotv app in the tv (via sideload / usb)",
            "A:yup..every smarttv in this price supports it",
            "A:not.",
            "A:yes",
            "A:2.5gb ram and 16 GB internal",
            "A:compare apple to Apple and not apple to oranges.",
            "A:display is very bright..dont exactly know the max NITS it gives out!",
            "A:Yes. 2018",
            "A:8bit panel",
            "A:install aida 64. should clarify all your issues.",
            "A:Yeah, it has an IPS panel.",
            "A:No cam support.",
            "A:no",
            "A:hdr",
            "A:yeah, it's supported HDR 10.",
            "A:cannot instal jiotv and Netflix.",
            "A:Connect the Fibre Optic cable to your home theater system and select TV Output. It should work. Keep the voice of the TV to Zero and only operate the home theatre.",
            "A:Yes",
            "A:its runs smoothly when you cast them. but i have not installed them on the TV as i think pubg & Asphalt 9 takes almost 2 gb of storage and i am sure no one is going to play it on tv.",
            "A:Yes, you can. You need a separate BT dongle both for keyboard and mouse or directly can use usb mouse\\keyboard through usb port.",
            "A:Yes. Very easily. As the TV has the original official Youtube App that plays flawless 4k Videos. All you need is a really fast internet connection. (150mbps ideally)",
            "A:Netflix version 4.16-200217 and Amazon Prime version 4.12.7 is working perfectly on this TV",
            "A:Yes! you can connect your S/PDIF optical out port to your Home theater and it is compatible with 5.1.",
            "A:it's not having the ARC port.",
            "A:Yes",
            "A:just go throw in your mobile apps screen cast will directly shows your mobile screen in tv.",
            "A:no it's not.",
            "A:No",
            "A:Yes it has an optical input for connecting sound bars.",
            "A:Netflix version 4.16-200217 and Amazon Prime version 4.12.7 is working perfectly on this TV",
            "A:Yes Support really very good",
            "A:yes",
            "A:yes it connects. The sound effect is superb.",
            "A:No",
            "A:Netflix version 4.16-200217 and Amazon Prime version 4.12.7 is working perfectly on this TV",
            "A:you get both the remotes",
            "A:no both are not working",
            "A:no, you can't. wifi router is compulsory to cast vedio from phone.",
            "A:2 kWA STABILIZER",
            "A:Wifi can work via hotspot but considering that will be through your mobile phone, speed will be an issue. Invest in a Broadband or Fiber connection with minimum speed of 100mbps for enjoying 4k.",
            "A:just click menu button on tv remote then click ok and you will find picture & sound mode and other settings",
            "A:Yeah, it's supporting.",
            "A:DLED direct LED. It used for back lighting. OLED Organic LED. It has no need of back light. And OLED is far better than DLED. But price defferance is also huge.",
            "A:No. It still has the issue. We could still use the Amazon fire stick and it works perfectly.",
            "A:MarQ is the best with all factors",
            "A:LED",
            "A:4K video playback is supported via USB and I did receive an ota update just after the initial boot, though, it was only a minor update.",
            "A:Without doubt I would go for marq 55 inch, the best in its segment truely. The picture quality with the colors is truely amazing.",
            "A:check ur internet speed, Amazon will not get installed, which app do u want to install, I installed mx player, ES file manager, I my TV,",
            "A:yes It's support",
            "A:yes",
            "A:sorry buddy ..it doesn't support those kind if apps..as its just a tv with smart apps in terms of getting media content and connectivity",
            "A:May be Marq gave any update. Till wait.",
            "A:it's easy to reset .",
            "A:fiber",
            "A:yes it support",
            "A:yesbu can connect it.",
            "A:You just download app and send into tv and installed it in tv. It's very good tv. I recommend for purchase .",
            "A:It don't have air mouse. It has Google voice.",
            "A:The AUHD version has a 3.5mm headphone jack. If you're so particular, go for it for your LOGITECH speakers!",
            "A:I've bought this TV in May, working fantastic so far, on Android 8. no updates will be provided",
            "A:yes wall mounted, you have to Download Apple TV app first.",
            "A:Update your TV from update center after that you able to download netflix",
            "A:yes it will support",
            "A:yes",
            "A:no",
            "A:pair Bluetooth of your mobile and tv and then you used this aap .",
            "A:Yes. and its look Awesome.",
            "A:Of course if you have a good capacity inverter. The power consumption of the product under reference is merely 60w. Better to use Sine wave inverter being a standard input power requirement for most.",
            "A:There are two remotes already with the TV",
            "A:No, It's not a 3D TV. But the product is justifying more than its price. If anyone is not a brand conscious, than one can buy this product.",
            "A:variable from behind ,top side 4cm , at centre 8cm and bottom side 10cm",
            "A:At present we are using the YouTube, jio movies, alt bajali and Netflix we hasn't seen any issues till today. So it's worthy to buy MarQ tv"
        ],
        "likes": [
            "58",
            "131",
            "45",
            "13",
            "9",
            "1",
            "38",
            "7",
            "3",
            "0",
            "6",
            "26",
            "4",
            "1",
            "2",
            "2",
            "5",
            "0",
            "8",
            "22",
            "20",
            "3",
            "14",
            "5",
            "1",
            "1",
            "0",
            "1",
            "1",
            "0",
            "1",
            "15",
            "4",
            "10",
            "2",
            "3",
            "1",
            "1",
            "7",
            "3",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "18",
            "5",
            "18",
            "2",
            "2",
            "1",
            "1",
            "0",
            "1",
            "1",
            "0",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "15",
            "56",
            "19",
            "4",
            "2",
            "0",
            "27",
            "2",
            "0",
            "1",
            "2",
            "25",
            "1",
            "0",
            "0",
            "0",
            "3",
            "0",
            "7",
            "34",
            "35",
            "2",
            "25",
            "6",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "37",
            "9",
            "37",
            "3",
            "8",
            "1",
            "1",
            "31",
            "14",
            "3",
            "27",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "0",
            "0",
            "0",
            "0",
            "7",
            "1",
            "16",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "2",
            "0",
            "2",
            "2",
            "3",
            "3",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0"
        ]
    }
}