{
    "title": "Vu Pixelight 163 cm (65 inch) Ultra HD (4K) LED Smart TV  (65 QDV / 65 QDV -V1)",
    "product_specification": {
        "In The Box": "powercable,remote control battery manual,table stand ,wall mount bracket",
        "Model Name": "65 QDV / 65 QDV -V1",
        "Color": "Rear: Black, Stand: Grey, Front Bezel: Titanium Grey",
        "Display Size": "163 cm (65 inch)",
        "Screen Type": "LED",
        "HD Technology & Resolution": "Ultra HD (4K), 3840 x 2160",
        "Series": "Pixelight",
        "Smart Tv": "Yes",
        "Motion Sensor": "No",
        "HDMI": "1 Rear, 2 Side",
        "USB": "1 Side, 1 Back",
        "Wi-Fi Type": "802.11 b, g, n",
        "Built In Wi-Fi": "Yes",
        "Launch Year": "2019",
        "Wall Mount Included": "Yes",
        "Brightness": "450 nits",
        "Contrast Ratio": "1000000:1 (Static)\n1000000:1 (Dynamic)",
        "Picture Engine": "Hi End Dual Core Processor",
        "Picture in Picture (PIP)": "No",
        "Picture And Picture (PAP)": "No",
        "Analog TV Reception": "Color-Sound Systems in VHF and UHF Band: PAL-D/K, B/G",
        "Digital TV Reception": "Television Standard in VHF Band / UHF Band: DVB - T / T2",
        "View Angle": "178 Degree",
        "Panel Type": "High Bright A+ Grade UHD Panel",
        "Digital Noise Filter": "Yes",
        "LED Display Type": "Direct LED",
        "Aspect Ratio": "16:09",
        "Refresh Rate": "60 Hz",
        "Supported Video Formats": "MPEG1, MPEG2, MPEG4, H.263, H.264, H.265, AVS, MVC, VP8, VP9",
        "Number of Speakers": "2",
        "Speaker Type": "Box Speaker",
        "Sound Technology": "Dolby Digital and DTS True Sound",
        "Surround Sound": "DTS Truebass, DTS TruSurround, DTS Dialog Clarity",
        "Speaker Output RMS": "30 W",
        "Sound Mode": "Standard, Speech, Late Night, Music, Theater",
        "Supported Audio Formats": "MP3, PCM, AC3, AAC, COOK, MP2",
        "Number of Cores": "2",
        "Processor": "Dual Core",
        "Graphic Processor": "Dual Core",
        "Graphic User Interface": "Linear Home UI",
        "Ram Capacity": "1 GB",
        "Storage Memory": "4 GB",
        "Supported App - Netflix": "Yes",
        "Supported App - Youtube": "Yes",
        "Supported App - Disney+Hotstar": "No",
        "Supported App - Prime Video": "Yes",
        "Supported Mobile Operating System": "Android, iOS",
        "Operating System Present": "Yes",
        "Operating System": "Linux",
        "Screen Mirroring": "Yes",
        "Pre Installed Browser": "Yes",
        "Content Providers": "Netflix, Prime Video, YouTube, Hungama Play, Yupp TV, Daily Motion, AccuWeather, Game Center, Wow TV, icflix, TED, Toon Goggles, Viaway, Plex, TV Browser, VEWD App Store, etc",
        "Supported Devices for Casting": "Mobile",
        "Content Languages": "English",
        "System Languages": "English",
        "Wireless LAN Adapter": "Yes",
        "Teletext": "Yes",
        "Mobile High-Definition Link": "No",
        "3G Dongle Plug and Play": "No",
        "Ethernet (RJ45)": "1",
        "NFC Support": "No",
        "Headphone Jack": "No",
        "Audio Out": "Optical, ARC",
        "Analog Audio Input": "Composite In",
        "Touch Remote": "No",
        "Smart Remote": "Yes",
        "Color Screen": "Yes",
        "RF Capable": "Yes",
        "Internet Access": "Yes",
        "LED Backlit Buttons": "No",
        "Battery Type": "2 AAA Batteries",
        "Remote Charger": "No",
        "Power Requirement": "AC 100 - 240 V, 50/60 Hz",
        "Power Consumption": "160 W, 0.5 W (Standby)",
        "Clock": "Yes",
        "Auto Power Off": "Yes",
        "Sleep Timer": "Yes",
        "On/Off Timer": "Yes",
        "Child Lock": "Yes",
        "Other Convenience Features": "Premium Licensed Apps on Remote Hotkeys, Elite Picture with HDR10, Adaptive Contrast, Vu AnyView Cast, Remote on Smartphone, Software Version OSD Indication, Favorite Channels List, Power Off if No Signal, Program Lock, Time Shift",
        "Parental Control": "Yes",
        "Width x Height x Depth (without stand)": "1460 mm x 847 mm x 76 mm",
        "Weight (without stand)": "19.6 Kg",
        "Width x Height x Depth (with stand)": "1460 mm x 916 mm x 311 mm",
        "Weight (with stand)": "20.2 Kg",
        "Stand Type": "Wall Mount and Table Top Stand",
        "Warranty Summary": "1 Year Vu Domestic Warranty",
        "Covered in Warranty": "Warranty of the Product is limited to manufacturing defects only. Parts and Labor Costs are Covered",
        "Not Covered in Warranty": "Defects caused by improper use as determined by the company personnel\nModification or alteration of any nature is made in the electrical circuitry/or physical construction of the set\nInstallation/ repair work is carried out by persons/agency other than authorized by the company\nThe warranty does not cover any external accessories (such as battery, cable, carrying bag etc.)\nDefects due to cause beyond control like lightning, abnormal voltage, acts of god or while in transit to service centre or purchaser's residence\nMentioned in the operating instruction manual supplied with this product or any cosmetic parts.\nOriginal serial number is removed, obliterated or altered from the machine or cabinet\nThe product is not used according to instructions given in the instruction manual\nSite (premises where the product is kept) conditions that do not confirm to the recommended operating conditions of the machine",
        "Warranty Service Type": "On-site",
        "Width x Height x Depth": "47 mm x 205 mm x 20 mm",
        "Weight": "70 gm",
        "Installation & Demo Details": "Please note that any unauthorized handling or self-installation of the product will lead to return & product warranty being void\nWe'll facilitate the installation and demo through authorized service engineer at your convenience.. The service engineer will install your new TV, either on wall mount or on table top. Installation and demo are provided free of cost. The engineer will also help you understand your new TV's features. The process generally covers: Wall-mounted or table-top installation, as requested. Physical check of all ports, including power and USB ports. Accessories also checked. Demonstration of features and settings Quick run-through on how to operate the TV"
    },
    "product_description": {
        "Elite Experience with Licensed Apps on Remote Hotkeys": "With Vu’s 4-hotkeys feature on your remote, accessing your favourite apps and entertainment has never been this easy. With just a click of a button, you can activate your app list that comprises Netflix, Prime Video, YouTube and much more.",
        "HDR10, High Bright 4K Panel, Adaptive Contrast and Digital MPEG Noise Reduction": "Thanks to the Pixelight 4K HDR10 feature, everything looks clear on the screen. The Adaptive Contrast feature keeps the content incredibly detailed. The Digital MPEG Noise Reduction feature reduces the visual noise and offers brilliant clarity. With Day and Night Modes, you can choose the best setting for a light or a dark environment. The Dynamic Mode gives your pictures an extra vivid boost.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "4",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "1",
            "1",
            "5",
            "5",
            "1",
            "5",
            "1",
            "5",
            "4",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "2",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "1",
            "1",
            "2",
            "4",
            "5",
            "4",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "1",
            "3",
            "5",
            "3",
            "5",
            "5",
            "1",
            "5",
            "1",
            "1",
            "1",
            "1",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "1",
            "1",
            "1",
            "1",
            "5",
            "5",
            "5",
            "2",
            "4",
            "5",
            "4",
            "4",
            "1",
            "5",
            "5",
            "3",
            "4",
            "1",
            "5",
            "2",
            "5",
            "5",
            "4",
            "4",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "2",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "3",
            "5",
            "4",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "2",
            "5",
            "5",
            "5",
            "4",
            "4",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "3",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "2",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "3"
        ],
        "review": [
            "BEST LED TV AT THIS PRICE BETTER THAN OTHER ALL RIVALS LED TV IN INDIA AT THIS PRICE .SECOND LED TV I HAVE PURCHASED FROM FLIPKART .FAST DELIVERY AND SAME DAY INSTALLATION THANK VU AND FLIPKART",
            "Excellent product at this budget. The picture quality is much better than other brands offering 55\" LED televisions at similar pricing. The brand VU being an American brand adds to consumer's inclination towards the product as most other television in this price range are wither made in China or India and their sustainability is a question mark. I have been using VU since last 3 years. All my bedrooms are equipped with 32 inch VU television and this 55 inch I purchaed for my living room. I think VU could add more accessories such as HDMI cable and multiple USB connectors or at least offer the same upon request by paying requisite amount. But that's not a big thing to bother as the price and quality describes the product in one phrase 'Value for Money'. More precisely, if you were to compare with Samsung and Panasonic LED TVs, VU is just one step on the staircase behind them but not to forget that Samsung and Panasonic LED TV of 55 inches would cost 20,000 more at least.",
            "The TV is an excellent piece of work from the company as I just used it one day only so not goin' to say too much I'll give full feedback later but yes it sucks too much electricity so be ready for the increased electricity expenses, it's an ultra hd TV so it's sucking data like blood.",
            "wonderful sound system. screen clarity also very good just purchased week back.\ninstallation done very quick in just one day. but still now not received extended warranty card from flip kart..",
            "picture quality is not much sharp n smooth I expected some smooth motion but its not there ,playing 30fps videos only when it plays 60fps videos then only you can expect some smooth motion n blur free picture n video quality...I didn't see 60fps videos on YouTube not there's no option to play the video with slow n fast modes you can see that options in laptops n computer. ...will check all types of features new let you know it's my one day usage review only",
            "After using the TV for 10 days, following is my review:\n- Delivery & Installation (5/5): Delivered as promised with open box inspection, and installed on same day. No problems here.\n- Picture Quality (5/5): Excellent picture quality with vivid but natural colors. Very bright picture, the kind seen only in high end TVs. Excellent viewing angles with very little color/contract loss even at 45-deg.\n- Upscaling (4/5): 4K is superlative. Full HD is excellent. HD is very good. SD is acceptable. The TV strives to put up good upscaling to make even 360p YouTube videos watchable.\n- Audio (3.5/5): For all the fancy tech (24W output, Dolby Digital, DTS TruSurround, TruBass, TruDialog, blah blah), the sound is average. There is very little bass even with Bass Boost on and tweaking the Equalizer. That said, the audio is loud and clear even at high volume. However, this is not an issue for me as I hook it to my Home Theater. The output through Optical Digital port is excellent.\n- Smartness (4/5): The interface is a bit slow (what you expect with 1 GB RAM and 4 GB Storage?) but once connected, there is very little lag. Dedicated buttons for Netflix, Prime Video and YouTube are a bonus. Many Apps are missing, but remember, this is not an Android TV. Mobile casting works flawlessly.\n- Connectivity (4.5/5): Except Bluetooth, you have everything you need.\nThings to consider for potential buyers: No doubt, this is an excellent choice at this price with great picture, good sound, very good picture upscaling, excellent connectivity and reasonable smartness. However, to complement the huge screen, you need better sound, so may have to invest in a soundbar. Not being an Android TV, you will miss many Apps and most importantly, voice control. With just 1GB Ram and 4GB Storage, it is not future proof. Also, there is no Bluetooth. But remember, this is also cheaper by atleast 4K as compared to Premium Android version. If you are OK with these small cons, this is the best choice.",
            "#. It is NOT ANDROID OS. The OS present in TV is LINUX. You Cannot install play store android apps. You can install apps from pre installed app present in TV VEWD Store only.\n\n# It does not support .mkv 4k video format files from YOUTUBE.\n\n#. Good Picture quality.\n\n# Good Sound quality.\n\n# Reasonable price. Value for money",
            "Really valuable for both money and quality, picture and sound amazing\n\nInstallation and demo was perfect\n\nAll excellent thank you flip kart for providing service and bringing high quality products to customers",
            "worth for money with nice clarity and faster delivery.. delivery scheduled on time..",
            "My biggest concern while buying this tv was color reproduction. I had bought a 39\" VU tv before for my parents but the color reproduction in that wasn't good. However this one has pretty good quality colors. Coming to the sound quality, you won't need an external speaker for a moderately big hall. Connectivity wise it has sufficient (3) hdmi ports. I don't use the inbuilt OS, I pretty much use the fire tv stick. The tv also has the CEC option by which you can control the fire stick with TV remote itself however there is noticeable lag if you compare the response with native remote. Also has the the direct optical port for connecting external speakers. The remote is sturdy. I do miss lack of buttons on the tv, so if you misplace the remote you are out of luck. :) I am completely happy with the purchase. I did read review saying it consumes a lot of power, but it actually doesn't.",
            "BEST LED TV AT THIS PRICE BETTER THAN OTHER ALL RIVALS LED TV IN INDIA AT THIS PRICE .SECOND LED TV I HAVE PURCHASED FROM FLIPKART .FAST DELIVERY AND SAME DAY INSTALLATION THANK VU AND FLIPKART",
            "Excellent product at this budget. The picture quality is much better than other brands offering 55\" LED televisions at similar pricing. The brand VU being an American brand adds to consumer's inclination towards the product as most other television in this price range are wither made in China or India and their sustainability is a question mark. I have been using VU since last 3 years. All my bedrooms are equipped with 32 inch VU television and this 55 inch I purchaed for my living room. I think VU could add more accessories such as HDMI cable and multiple USB connectors or at least offer the same upon request by paying requisite amount. But that's not a big thing to bother as the price and quality describes the product in one phrase 'Value for Money'. More precisely, if you were to compare with Samsung and Panasonic LED TVs, VU is just one step on the staircase behind them but not to forget that Samsung and Panasonic LED TV of 55 inches would cost 20,000 more at least.",
            "The TV is an excellent piece of work from the company as I just used it one day only so not goin' to say too much I'll give full feedback later but yes it sucks too much electricity so be ready for the increased electricity expenses, it's an ultra hd TV so it's sucking data like blood.",
            "wonderful sound system. screen clarity also very good just purchased week back.\ninstallation done very quick in just one day. but still now not received extended warranty card from flip kart..",
            "picture quality is not much sharp n smooth I expected some smooth motion but its not there ,playing 30fps videos only when it plays 60fps videos then only you can expect some smooth motion n blur free picture n video quality...I didn't see 60fps videos on YouTube not there's no option to play the video with slow n fast modes you can see that options in laptops n computer. ...will check all types of features new let you know it's my one day usage review only",
            "After using the TV for 10 days, following is my review:\n- Delivery & Installation (5/5): Delivered as promised with open box inspection, and installed on same day. No problems here.\n- Picture Quality (5/5): Excellent picture quality with vivid but natural colors. Very bright picture, the kind seen only in high end TVs. Excellent viewing angles with very little color/contract loss even at 45-deg.\n- Upscaling (4/5): 4K is superlative. Full HD is excellent. HD is very good. SD is acceptable. The TV strives to put up good upscaling to make even 360p YouTube videos watchable.\n- Audio (3.5/5): For all the fancy tech (24W output, Dolby Digital, DTS TruSurround, TruBass, TruDialog, blah blah), the sound is average. There is very little bass even with Bass Boost on and tweaking the Equalizer. That said, the audio is loud and clear even at high volume. However, this is not an issue for me as I hook it to my Home Theater. The output through Optical Digital port is excellent.\n- Smartness (4/5): The interface is a bit slow (what you expect with 1 GB RAM and 4 GB Storage?) but once connected, there is very little lag. Dedicated buttons for Netflix, Prime Video and YouTube are a bonus. Many Apps are missing, but remember, this is not an Android TV. Mobile casting works flawlessly.\n- Connectivity (4.5/5): Except Bluetooth, you have everything you need.\nThings to consider for potential buyers: No doubt, this is an excellent choice at this price with great picture, good sound, very good picture upscaling, excellent connectivity and reasonable smartness. However, to complement the huge screen, you need better sound, so may have to invest in a soundbar. Not being an Android TV, you will miss many Apps and most importantly, voice control. With just 1GB Ram and 4GB Storage, it is not future proof. Also, there is no Bluetooth. But remember, this is also cheaper by atleast 4K as compared to Premium Android version. If you are OK with these small cons, this is the best choice.",
            "#. It is NOT ANDROID OS. The OS present in TV is LINUX. You Cannot install play store android apps. You can install apps from pre installed app present in TV VEWD Store only.\n\n# It does not support .mkv 4k video format files from YOUTUBE.\n\n#. Good Picture quality.\n\n# Good Sound quality.\n\n# Reasonable price. Value for money",
            "Really valuable for both money and quality, picture and sound amazing\n\nInstallation and demo was perfect\n\nAll excellent thank you flip kart for providing service and bringing high quality products to customers",
            "worth for money with nice clarity and faster delivery.. delivery scheduled on time..",
            "My biggest concern while buying this tv was color reproduction. I had bought a 39\" VU tv before for my parents but the color reproduction in that wasn't good. However this one has pretty good quality colors. Coming to the sound quality, you won't need an external speaker for a moderately big hall. Connectivity wise it has sufficient (3) hdmi ports. I don't use the inbuilt OS, I pretty much use the fire tv stick. The tv also has the CEC option by which you can control the fire stick with TV remote itself however there is noticeable lag if you compare the response with native remote. Also has the the direct optical port for connecting external speakers. The remote is sturdy. I do miss lack of buttons on the tv, so if you misplace the remote you are out of luck. :) I am completely happy with the purchase. I did read review saying it consumes a lot of power, but it actually doesn't.",
            "nice led smart tv on this price point.. awesome picture quality as well as surround sound. Gopal K sharma, Bareilly, U.P.",
            "Picture Quality is sharp & clear, comparable with any other good reputed brand even ones selling for 90k to a Lakh rupee for 50inch UHD\n\nSound with 24W Dolby Speakers is pretty clear and again comparable with more famous & reputed brands.\n\nthat's what you expect from a basic TV\n\nThe looks & design is good with really thin uniform bezel. Sufficient HDMI & USB ports for connecting multiple devices\n\nNow moving to the smart part.... preload You Tube, Amazon Prime & Netflix with HotKeys for easy a...\nREAD MORE",
            "Got this TV as part of sale.. As uswal great delivery service provided by Flipkart. The TV is outstanding in terms of sound and connectivity. Picture quality can be little better. However it is worth every penny that I paid.",
            "this is amazing product .sound is very good good feel for dolby sound lovers, brightness is very good,colours are so rich and very beautiful blacks,50 inch size is also to good,body with silver border looks so stuning,ports are sufficient,processing is so fast, and last and very important nobody can give this quality of picture and sound and feature at this price so please dont die for brands like lg.sony you can now fulfill your dreams to have big screen tv at your home by buying vu tv.we all middle class family people are very thankful to the manufacturer of vu tv for giving us such a beautiful product at this cheap price.thanks team vu. (vishal dutt sharma)",
            "comparing to LG/Samsung/Sony the display is not vibrant and bright. for the price it gives good TV, but people who used SONY and LG will not like the display and Sound.\nAlso there is no AUX output from the TV. Very less options to connect to external 5.1 home theatre.",
            "worth for money.. delivery and installation faster than expectation... picture quality is good.. totally satisfied .. happy with the product",
            "superb awesome TV super clarity Dolby digital sounds... best price.... thanks for flipcart....",
            "I am more satisfied with Vu 65 inch pixilight 4k TV.\nFirst I must be thankful to Flipkart for selling such good TVs at reasonable prices.\npicture clarity ,sound and 4k videos very super.\nI am happy with buy back guarantee for exchanging at highest value.i must be thankful to Flipkart for buyback guarantee given this TV.\nI got it at Rs 44999/-. When we compare with price and features it is really a great purchase.",
            "NICE PRODUCTS FEELING LIKE A HOME THEATRE\nSOUND VERY NICE FLIPKART DELIVERY SERVICE GOOD BUT INSTALLATION AND DEMO SERVICE POOR BUT I CAN MANAGE AFTER COMPLETE DEMO NO MORE WORD BUT EVERY BODY ITS A PAISA WASOOL PRODUCT",
            "I used to have a Vu LED TV and exchanged with this as I wanted to upgrade for HDMI ARC for connecting my home theater. I have initially picked up iffalcon Android as the price was really competitive but it was returned as the HDMI ARC was not working properly.\n\nLater gone for this and I believe that I made the right choice again. As I have a fire stick, I was not really Keen at the apps they have. I must say, this is best suited for those who have an Android TV box or fire stick and it has ve...\nREAD MORE",
            "I must say its worth buying this product. Superb display and clarity. Smooth functioning, only I can see the sound system inbuild with this OLED if they can improve. Flipkart has delivered this product on time as promised - June 17, 2019 and has been installed on the same day. I really like the process which is implemented. The delivery boys and installation person have handled the product very carefully. The installation person is experienced one came up with all his requirements to mount the TV on wall. I didnt have to spare anything extra from my pocket.\n\nI only have one suggestion that flipkart or vendor should arrange to take away the television boxes, thermocols from customers, now days its difficult to dispose off such things because of environmental issues.\n\nOverall, satisfactory product and recommended to others.",
            "Brought after watching lot of reviews and videos on YouTube... This is my second vu tv before this I was using vus 49 inch full hd tv... I had no problem with that.. And hence I ordered this tv with 3 yrs warranty.\nHappy with the tv I brought it for 36 k including 2 yr warranty....\nThis tv is best for hd and 4k video formats picture quality is far better..\nIf anyone want to watch sd channels then you should not go for 4 k pannel... ( rather it may be sony, Samsung lg or any other companies tv)\nYes the pannel is good and the sound is also clear audible... u may require soundbar for bigger room for better sound ?\nOs is good I don't see any lags...\nNetflix and YouTube works flawless...\nMiracast also works with my redmi note 5 pro.\n\nOverall Very good option... You can attach Android box if you require the best Android experience.",
            "Excellent TV, picture quality is awesome and sound quality is also good, but need to update the software with more apps like hotstar etc.\nThere is no Bluetooth connectivity.",
            "Great buy & value for money, if we get the Android model in same price. This will be a definite competitor for all leading brands in the market. Good buying experience through flipkart.",
            "Pitcher quality was tooooo good value for money dolby sound was really superb thank you soooooooooooo much for flipkart for great offer for the product 👍👍👍👍😀😀😀",
            "I am giving this review after 06 months of use of VU 4K (50 Inch) TV. Initially I was little bit worried, if the picture or build quality of VU tv is good or bad... but after using it for 06 months I have found that the pictures are awsome, specially HD and 4k and till now running very smoothly. The sound quality is also above average. Previously I considered that Branded TVs like, Sumsung, LG, Sony are only good, but after using Vu Tv I am convinced that even if the price is much lesser comparing to Samsung or LG etc. branded Tv, VU is exceptionally well in performance despite low in pocket. Hence, who are thinking to buy a new TV, can definitely consider VU Tv....I will give it 4.5 out of 5",
            "The product is definitely awesome in al departments except for it's sound. It is installed in a 160sq ft. room and the sound seems a bit low according to it. Sometimes the sound is very low but when I restart the TV, it goes back to normal. It is very rare but it is there. Other than that, there is no better TV at this price.",
            "HD clear picture. Sound quality is good although I connected it with Sony hometheater.\nIt comes within budget. YouTube Netflix Primevideo are directly connected through remote.\nIt's a good deal compare to other branded similar categories.\nAwesome purchase.",
            "Awesome fantastic Smart TV. Good Decision to buy",
            "Trustworthy TV, picture quality is super 4k is there. M enjoying this TV quality.in my views Vu is very good brand. Only two problems are there one is not android TV but still can use other apps by browser then google and another bad thing is remote is ordinary not smart so it take lots of time for typing write any search item",
            "Review post usage after 2 months:\nMy City of Delivery: Baroda, Gujarat\nReason to buy: Recently bought new house\n\nReview: One of the Best Buy I ever had for my new home\n\nPros:\n1. Whatever you can best imagine in your smart tv\n2. Refer to point 1.\n\nCons:\n1. As it’s not android tv, the apps are limited in VU STORE. But if you are satisfied with Amazon Prime, Netflix and\nIf you are fan of Hotstar or other apps, I would prefer you to additional buy amazon firestick with it.\n\nOnly reason of not buying is if you are a way toooo unlucky to receive a faulty product from the seller.",
            "Picture and sound quality is too good .... Best paisa vasoool . awesome tv for best price ...",
            "packing, Delivery super and especially TV I was using since last month it's totally super it's sound quality, picture Quality awesome and value for money totally I satisfied with the all",
            "It is awesome in quality , it is one the best option in affordable price range with all desired specifications. Our experience is excellent with quality of this TV ,it is meeting with all of our expectations of smart TV , but installations service is very poor , even they did not reach to install after more than 20 calls ,ultimately I had to call in customer care after this, installation could done .",
            "This smart TV actual means smart TV, nice picture quality with best sound, Thanks VU.",
            "The 65 inch is worth buying, The screen is awesome. viewed some 4k content online and it blows up your mind. The normal HD channels also looks very good.\nPlease make sure that you wait until the installation team comes before you open the box. The first delivery of TV had some issues with the display and it was replaced without any fuss in a day as the installation person himself found it after opening the box infront of me.\nYoutube, netfix, prime works very well. ensure you have a good internet connection. Wifi works just fine but if the speed is low, the display quality suffers. It happened to me one day but later realized it was due to the internet bandwidth and not because of the tv.",
            "I've got my VU 50inch 4K tv today..One of the best 4k TV in recent times, dont go for any other higher ranges like Samsung,LG and Sony..the picture quality is awesome even SD channels and best sound quality.\nClarity and display better than Samsung tvs..and sound quality is better than Sony TVs..This tv has Dolby Digital and DTS True Sound so no home theater needed..\nOne of the best best choice for this price range...i've bought this after 3 days of big analysis.",
            "excellent product 👌👏 happy with vu...\nbut I was little disappointed with Jeeves that they didn't inform there engineer to fix up my television and he came after one week..when I asked him he said he was not updated but the engineer Shiva did excellent job... bravo",
            "best budget brand along with tcl , excellent customer service also, just take the extended service package so that there is nothing to worry about, the picture quality is outstanding when comparing in the led segment and 4 k plays without any fuzz , the upscsler tech is really good as even 720p appears like a full HD image ,",
            "wow super tv is performance is good display is very very good ultra HD 4k vision is super sound is dolby atmos is very very very good",
            "Awsome product with very less price... Thank you Vu and Support team for the installation .. Kudos :)",
            "It's grt at first i am afraid of buying it online. But now i am very happy. Its sound, connectivity, picture clarity is very good. Further its will be awesome after HD installation which will be done today by tata sky. Overall its grt buy. And price range is also very good",
            "using it for 2-3 weeks now. quality wise you wouldn't notice any difference unless you are also using a premium product too in another room. Visually sound and picture quality is great. 8-bit HDR not 10, but again the price is just right. If you are planning to use in a bright room then you may find brightness on the lower side and don't use right against a light source it would fall in to the screen and destroy viewing experience, this isn't a premium product.\n\nVewd app store for this TV, so limited apps, if you want full Android experience then add in a 4k fire stick. I added a Bluetooth transmitter for another 500 and have gotten myself a very decent package in terms of value for money",
            "I had been using LG 3D Full HD 49 TV, since then I was very pleasures with that TV. Now that I have got this, it’s taking time for me to adjust as many features are missing in this TV like Auto bright energy saver balancing colours etc. but best for web videos and app videos.",
            "its an excellent tv equipped with almost all things required in it.\nonly problem is about bluetooth connectivity. Except this it is wonderful tv. 4k picture quality is great and at par with other well known brands like lg and samsung. Sound quality is good. Overall value for money.",
            "Supper clarity 4k Hd nice sound nice Vu smart TV 55 iam so full happy super delevary flipkart",
            "Good product. Worth of money .Good choice and best choice for smart tv",
            "i have purchased this TV after viewing 120 reviews, trust me it's super awesome. value for money.\n\nat this price it's just a penuts. I mean same configuration of other company start from 39k to 45k\n\none must buy with out n e worry.\n\n\nfull Paisa wasool.\n\nVU is super awesome.\n\n5stars together.",
            "This television is one of the best budget tv that money can buy. It’s OS is solid and the apps runs smoothly. Connectivity is good but I am not sure how to mirror iPhone on Anycast.",
            "I am very happy with the 65 inch VU Smart LED TV. All the features which I expect in the TV are there\nPRABHAKAR, ANANTAPUR",
            "the picture quality of this TV is amazing .\nupscaling is good non hd channel also look good on Tata sky for best sound quality set sound setting as speech",
            "Pros:\nPicture quality is amazing for this budget. 4K content play well. HD upscaling is decent.\nSmart TV functionalities are good and practical.\nAmazing remote with hotkeys for Netflix, Prime and Youtube. Remote works with FireTV if connected to HDMI CEC which is super awesome! No need for an expensive smart TV!\nHeadphone jack.\n\nCons:\n4K videos have flickering in high detailed moving frames with multiple black pixels, although not frequent. This is the primary difference between the expensive Sony or Samsung TV.",
            "😘its great clearity is awesome i like it excellent vu",
            "Value for money. Excellent picture and sound quality. Delivery was quick. Installation guy came day after the given date but was quick and did a good job. Overall a very good product.",
            "After following with after sales service, at last installation & demo complete.\nPicture quality good. Connectivity some time problem, need to analysis reason behind it.\nSound quality good, but as per Dolby , expected more clear sound. Value for money.\nRecommended to buy, as in this price you won't get best product. This is best with all features.",
            "I bought this TV after going through all the reviews and comparison on YouTube and other sites and they are all right that this is the best TV you can buy on a Budget. Though i regret that i didn't bought the android version of this tv as there are no indian apps in vu store. Netflix, prime and youtube are there but if you want all the other apps as well then go for android version.\n\nOverall - truly amazing picture quality at this price and better than many TV's much higher than this price.\n\nConnectivity - enough options are there\n\nInterface - a bit slow but not a deal breaker (obviously they can't put the best processors and memory at this price)\n\nIf you just care about the picture and build quality then go for this if you want more features then go for the android one.",
            "What an amazing Led 4K TV , It's has clear and good quality picture, i brought at 30,990 , in this budget with 4k smart TV is worth it.",
            "Product is good. Delivered safely. Only issue with tv is Browser does not support video play. Like if you want to watch match on hotstar then we can't download application like hotstar because pixelight model operating on linux OS. so it has its ow\nn app store. also you can not watch video on hotstar. No response from support.\n\ncons:\ntv browser application have limitation and it does not support video. you can't play video on website like hotstar, voot.\n\nreturn is not acceptable by Flipkart. replacement karte rahenge.\n\ncheck smart TV some where at your friend then buy",
            "Beautiful TV.. Nice sound and Picture quality is great.. Thank u Flipkart for such product and installation also done at right time within 10 hours.. Thank you once again.",
            "This tv has offered more than what I expected... Nice picture and sound quality, fast connectivity, simple interface and overall comparing the prices with LG and SAMSUNG this is easy on my pocket...\nMy only concern is how many year will this product last....Only time will tell....",
            "excellent excellent excellent... up till now",
            "Good product and value for money.",
            "Excellent picture quality. I bought this Pixelight series only for panel. I coupled it with Mi Box. Best value for money.",
            "The TV clarity in hd is superrr",
            "TV is good when we are viewing the straight view above 5ft . But when we are viewing the TV in side angle 3ft- 4ft distance, exact colors are not showing.\nI Purchased this 50 QDV on 30 May 2019, but recently new Picture mode - Cricket mode was launched, under company warranty if i get the Cricket Mode update version to my Existing QDV? If company can provide this update to existing model, it is very much helpful to Pixelight product in this competition market.",
            "picture quality, sound clarity awsome....suffered allott with the instalaltion team of Jeeves...after three calls to Jeeves custoner care...then only came for installation....overalll..... most eonomical TV...most valuable for moneyyyy..go for it\n\nBuy after usage of 3 weeks..i have noticed one thing. While playing videos from Pendrive..not a single video..plays fully...evry video skips to next video automically..after some time.. i have not seen a single movie. fully...till datee",
            "Dam good go for value for money",
            "Worth every penny! I have concern with only one thing that is speakers. While playing Netflix/ Prime the sound is automatically reduced i dont know why that happens. But youtube works totally fine. So there may be some issue with app integration.\n\nOverall a good buy within the given price range.\n\nThank you flipkart and VU!",
            "Dear VU team, While playing movies through Pendrive , after some time it automatically skips to next movie, which is a major issue. Please take a look on it.\nedit after 3 months of usage: still the problem is not resolved. i think it's the problem of the TV.",
            "Best quality.",
            "Brillinat piece of work by VU. Best product in the price range",
            "Guys if you have budget plz go with another Brand like Samsung, LG, this TV is not giving you pure 4k pictures and even in dark pictures this TV fails to give clear pictures.",
            "Nice product. HD quality perfect Tv but lees fir sound quality",
            "Very good... Value for money and sound is very good...nice picture quality.... Vu is better brand than all other brands",
            "Best smart tv",
            "Nothing can beat this TV in this Range. Bought This on Flipkart Sale. UHD display is looking so natural. Sound is also very pleasant. 65 inch display gives life like picture. HDR is also give boost to picture.",
            "not worth it at all. worst picture quality, as soon as you connect anything in HDMI port, there's a line that's comes on the Panel and keeps flickering which is so damn irritating to see all the time. really really bad.",
            "Just go for it :) it's awesome ,the picture quality the sound the connectivity all are just mind blowing under this price tag.",
            "There are no much apps compared to other android TV’s... VU Should update as many apps as possible in their VEWD store",
            "Simply superb...value for money...Picture quality is very good for HD channels and sound quality is not that great but not bad...My special thanks to Flipkart team for Early delivery , installation ...Package handling is very good..",
            "Best tv in this category price range. Very much recommended and there installation and demo service is quite swift.",
            "Excellent product. And amazing delivery. Received in two days of ordering and then in another two days, it was installed. Picture quality is too good. Netflix and Amazon Prime is there. Hotstar isn’t supported.",
            "Extraordinary product in this budget.picture quality is awesome.sound very good.connectivity is also very good.",
            "Nice and value for money",
            "Pros:\n-price\n-build quality\n-picture quality\n-connectivity options\n\nCons:\n-lacks bluetooth connectivity\n-picture customization screen fills the screen, hence one cannot know what actually happens when you change various settings.\n-lack of 4k content (not the TV's fault though)\n\nPros > Cons. A good purchase. Not sure about power consumption. I use a soundbar, so not sure if the TV's audio output is good or bad.",
            "Always go for Vu Tv's they have very good panel compare to Mi tv, I have both Mi tv & Vu I can easily say Vu Tv are better than Mi in both quality & service",
            "excellent picture quality.\nWorth every penny.",
            "I am unable to Tag my phone to TV, My phone is Samsung J7 Max",
            "My Verdict about this product is very simple. I will iterate in points\n\n1. Just go it, please please don't have a second thought !\n2. As mentioned above",
            "awesome TV i seen in my life with best price",
            "Nice TV",
            "Good picture quality and sound. Value for money .",
            "excellent picture quality.. 4k videos awesome..",
            "I have bought two TV as the quality is topmost and it is very lucrative deal considering the price! Thanks VU for producing such nice product...",
            "worst experience..but thank God I got my refund..",
            "Any view cast(screen mirroring) for JIO TV is not supported by this model. Pls do not buy if you want to watch live streaming of JIO TV/Hotstar etc through mobile only. It is supporting only audio but not video streaming. Also note that product details on flipkart site is also missing related to above issue.",
            "This is my 6th VU TV.... i think its the best TV in the country... go for it without even thinking twice, only once on one of my TVs the display went bad, VU replaced the TV in a week as it was within warranty...",
            "Awesome ... Performance",
            "useless product as far picture quality is concerned. sound is just ok. so called settings is just for name sake. response to the features is very poor. it's a costly toy . not as per the advertisment. requested the company to rectify / adjust the complaint, there has been no response to my request till 17june . the installation was done on 05june and the complaint was raised within an hour.but got calls time and again to improve the rating. which I did as agreed but again now I would say their policies are very bad and deserve minus point overall very bad experience.",
            "Excellent product and very much appreciated Flipkart service...",
            "ok",
            "I bought a 65” tv. It is awesome. Worth for money.",
            "Writing this review after using the TV for couple of months.\n\nPros\n1. The build quality is satisfactory.\n2. Picture quality with a HD STB is amazing.\n3. Pretty decent value for money.\n4. Quick delivery and Installation, 2019 manufactured product.\n\nCons\n1. The browser is more or less useless. Is slow and it is a pain to type and search as the remote lacks IR pointer.\n2. The sound from the TV speakers are just about ok. There seems to be a software issue as the sound in not consistent across channels or even on the same channel. It suddenly gets loud during commercials or if there is some dance sequence and once it is over it will get very low. I have read other reviews complaining about this same issue so it’s not just me.\n3. No option to side load any other app or browser.\n4. Could not get it to record live content on to a pen drive.\n5. Netflix and Prime apps keep forgetting the home WiFi network, need to reconnect each time.\n\nVerdict\n\nIf you can ignore the poor sound management and don’t mind spending few extra minutes typing and searching content, this TV is good value for money. The picture quality is good and provides a nice viewing experience. So it does the basic job decently but other than that nothing much.",
            "Overall good experience so far. On offer price I bought for Rs: 44,999 for 65 inches screen.\n\nPicture: 5\nSound: 4\nUI: 4 (Some time lags)\nDesign & Built Quality: 4\nConnectivity: 4.5\nFlipkart Delivery: 5\nInstallation and demo: 4\nRemote: 5\nPackaging: 4\nValue for money: 5\nWill I recommend Vu Brand: 5\n\nDurability is the only concern...",
            "the t v was delivered as promised. the delivery was quite good. the person was very courteous.\nthe t v is very good in watching. though sound needs an improvement. but overall it's definitely value for money...",
            "apps quality 3rd class, never bay this TV",
            "Defeating other brands , Quality and Value for money.",
            "good product good picture quality good sound quality. pixelight vision perfect.",
            "Excellent tv used for a week got it for 42+K under exchange",
            "Quality not good",
            "perfect 4k budget tv video,auido,connectivity over all super ..one and only issue very worst response of installation services . today I made own installation otherwise over all good.",
            "Tv picture is good. sound is decent. remote is not so user friendly while typing. Mirror cast dont work with all mobiles.",
            "It's good. It's been only 2 weeks so can't say enough.bt I have been watching YouTube, prime and netlfix without any issues.\n\nOnly problem was I couldn't figure out how to install apps like hotstar as it is not in Vu app store",
            "Brilliant TV in this price range. Picture clarity is awesome. Sound quality needs some improvement.",
            "nicd",
            "Lovely product ....Value for money. Love it ;)",
            "Nice picture Nd sound quality..",
            "Overall its best for this price. The performance is good and fast. The interface could have been better.",
            "Good One...",
            "Nice product",
            "value for money, branded one costs rs 20 k more only for brandname otherwise the quality is same",
            "nice and good picture and sound",
            "value for money. Expect coaxial input..",
            "picture quality is very good even in sd channel.Mirror cast video is slow little bit not smooth actually.Connectivity is good.over all value for money.",
            "TV is good with smart one",
            "It’s value for money . Great picture quality n sound quality.best in class . Awesome perching..",
            "superb TV. must buy in this price tag.",
            "product is very excellent\nNo any problems\nused more than 1 year no any problems\nNice product",
            "Wost filpkart service and they not required customer satisfaction from 6 years this time Horrible experience with filpkart please don't believe in filpkart never",
            "After 3 days of use, TV screen goes black.",
            "Sound System is not Good.This problem is there VU Product it self irrespective of model.",
            "ok ok ok",
            "Excllent product from VU. Bought it 3 weeks back. Installation done on next day of arrival. No issues so far. Sound quality is superb and picture quality is great in all aspects SD, HD and 4K. Good to go...",
            "its budget tv k go to vu andriod tv compare to pixel light its average tv sound is nice",
            "Excellent choice. really great TV. I ordered it on 13th, delivered on 14th and installed on 15th. great job flipkart.",
            "This TV misses some very important apps like Hotstar, SonyLiv, etc. The sound and picture quality is OK types.\nCons: One definately needs a fire stick to run some more famous apps.",
            "Great Picture quality.\n\nvalue for money, we are belongs from judicial family and the installation guy do not know how to talk . poor service from jives and nice service from vu t.v.",
            "Very good",
            "The display clearity is amazing with Hdr 10 thus making it jaw dropping value for money. Hats off to Vu.",
            "Best on time delivery and same day installation",
            "You can’t install apps don’t buy this VU is cheating",
            "Tv is ok ok.. i assume pucture quality of previous model were much better as i have 50 inch which i bought 2yrs back has better picture wuality compare to this pixelight. Ok tv. 2.5/5 from my side as overall.",
            "super tv",
            "No hotstar,you can't install other android app.otherwise it's good choice.transition are very slow.",
            "fantastic picture quality",
            "VALUE FOR MONEY... AWESOME PRODUCT",
            "Hopeless TV no OTT apps can be used except inbuilt prime and Netflix.\n\nNo flexibility",
            "It really worth for investment on this TV model. Even after 2 years it is working very good.",
            "Don't buy this brand TV at all.\nThis is very cheap quality tv not even spares are available for 2 years old.\nFor my 2 years old Vu led tv iam waiting since 30 days still not rectified.\nNot even responding properly.\nIam begging not to buy this brand at all.\nI don't want to give even 1 star.",
            "Poor",
            "Writing this review after 2.5 years of purching this TV. Beware of purchasing VU TV. Company provides 2 years warranty & it will work fine for 2 years. As soon as 2 years are over, the TV will break down ( Has happened to 3 more ppl whom I know who had purchased). Then comes the biggest scam of extended warranty through Jeeves (Total waste of money). On a scale of 1-10 in service , I would rate them -10. Have been chasing them for 1.5 months now through mails, customer care yet have got assurances only but no resolution. The local ground team of service & customer care are in different orbits altogether with no communication. It took alomst 20 days to arrange for TV pick up after lot of hassle, post repair also TV was showing same problem. Again pick up done , Has been 18 days since last pick up yet no resolution. As per their policy if repair is not done in 30 days then they process for refund, but now they are even refuting that claim. Even after multiple calls & mails to initiate the refund since we no longer have faith in their service, they are reverting that order is under repair only. It has been such a pathetic/harrowing experience with the Jeeves team that I seriously don't want to purchase anything from them. I just want to get refund so that I am done with this scam.\n\nSo basically I am left with no TV, no refund till now & a long mail thread of customer care assurances that my query will be responded in next 2 business working days :|\n\nFlipkart Team - Hope this review will find the right decision maker who can actually help out. Claim ID CLJPV01082100290",
            "Wosrt TV.. Within a year picture tube is corrupted.. Don't buy",
            "Good tv",
            "Best tv superb quality.",
            "The TV worked fine till 15 months\nHowever the screen display problem has occurred\nNot expected as per reviews",
            "Excellent tv",
            "Good",
            "Good worth for money",
            "Super TV",
            "I bought a 50 inch television on June 3, 2019 and the television became compliant in September 2020. One thing I felt was that this is a very cheap product, Please nobody dont purchase this. This is a product with no quality at all",
            "its very poor quality and so many wifi problems facing after 6 months and now till wifi is not working and no bady help",
            "very bad products purchased by flipkart. Iam not recommend any product purchase by flipkart.. beacouse Iam phasing warrenty issue after August 2020.but did not solve my problem... Iam very unhappy this site.",
            "Please don't buy it....it has a very short shelf life....within a year it doesn't power and is dead and gone in standby mode...i now realize the difference.to pay up a bit mor for a Samsung or LG TV...the company engineer said there is some part which has been damaged and I'll have to shell out 4k to 5k... disgusting stuff guys stay away of you can...",
            "A viewing pleasure and a very good picture quality. Pricing of the product is also reasonable. After sales service is commendable.",
            "Good product budget savy and good discounted offered product",
            "The Product is very nice and good in picture quality.",
            "Voice and sound frequency huge mismatch",
            "Have been using this model for a year! I don't know how many years it will work...but till now no issues!",
            "Excellent",
            "Nice product..",
            "Every Thing Is Good Except Aspect Ratio While Playing 4K content is Fast That You feel It like Watching a Shooting Video. And Youtube App interface Is Not User friendly(Typing For Search) Rest all Fantastic",
            "TV display not working",
            "Awesome except that it doesn’t support hotstar",
            "This is the best TV i have come across. I was a bot skeptic to order 65 inch as usually there are lags in display with large size tvs. But, this piece is good no such bad effects. Before buing i visited nearest showroom compared mi, sharp, reconnect, TCL, lg samsung and sony I was not convinced with the display vs price range of their models. Then I went to see VU at the dealer he showed the display of 55 inch, I was impressed and directly went for 65 inch in flipkart! This display has the close performance to sony!!! Go for it. It is okay to buy linux version instead of android, you can save the money.\n\nPros\nDisplay\nSound\nPrice\nConnectivity\n\n\nCons\nI do not find.\n\nHappy.",
            "It is good but connectivity very bad",
            "If you are more into watching cricket, this TV is not for you. You will not enjoy cricket at all on this TV even with HD channels. But good for watching movies and serials.",
            "Wast",
            "Awesome Product",
            "Service of the TV is not that so goodd.\nIt should be improved sometimes audio also flickers.",
            "Excellent products...",
            "Best",
            "Thanks to Filpkart for providing such kind of blast offers and it is really good price to go for it. VU 65'' Ultra HD 4K is really amazing but I am having bad experience with USB port and AUX connectivity where I can not able to connect.\n\nCons:\n\nPicture quality\nSound quality\nSmart features\n\nPros:\n\nUSB connectivity",
            "Good buy at this price. Working fine. Using for the last 2 months. Service also gud. Only problem is connectivity from mobile to TV.",
            "Super",
            "after 9 days using the tv automatically switched off",
            "Impressive in the price range with lot of value",
            "nice must buy",
            "The TV is great and very much value for money.\n\nonly negative point is that it DOES NOT HAVE A BLUETOOTH CONNECT OPTION to pair speakers",
            "awesome tv",
            "superb",
            "best tv I have ever seen",
            "Best Picture Quality at this price at this range... 5/5 rating 👍👍👍",
            "Good product, Worth of money , satisfied",
            "everything good and sometimes it is lag.",
            "Seems good till now",
            "Best 65inch smart tv in the price range",
            "awesome",
            "Bought the 65 inch monster size for only 46000, for this price it has amazing picture and sound quality the only drawback this tv has is that it doesn't have a headphone jack, i called up vu customer care because in the manual it was mentioned that its there but it isn't and they said its not there in the 65 inch model, now i have to buy digital audio to aux converter so that i can connect my speakers, otherwise I'm totally satisfied",
            "I found some issue in TV due to our fault. VU company replaced it without asking any question.\n\nGood response and service.\n\nMUST BUY AT THIS PRICE.",
            "No comments on products",
            "must see and consider before buying big brands with very higher price tags",
            "excellent product.Worth for money. Working nice, picture,sound Internet etc. I give 5 star rating\nFantastic",
            "nice tv",
            "picture quality not as expected.\n4k video not able to play.\n\ndon't buy big TV",
            "Product was too good. love this product",
            "Within six months two complaints have arisen. Netflix got stuck and I had to talk to the customer care to get it sorted. Thereafter, there was no audio. I have been after the customer care, but of no use. Till today no one came to repair the tv.\n\nUpdate after 10 days - Till now problem not solved. horrible service. Quality of TV is also deteriorating slowly.",
            "awesome",
            "Good tv..value for money.good picture quality...i am expecting extra warranty from vu..i think vu team helps me in this",
            "Excellent product.",
            "Excellent product.very good picture quality.worth for your money...",
            "the product is good. But the person who had come for the installation of the tv was not good. He handled the tv roughly and kept throwing things down. The tv is not mounted properly as well. Disappointed with the Installation",
            "superb",
            "This product is the best value for money in the segment and probably a notch above. Although it's not as snappy as the latest Android OS systems, it gets the job done with ease.",
            "Tv is missing the original transmission plate internet channel are struck in the middle of movie",
            "Picture & Sound clarity & quality is awesome..\nworth buying at this price",
            "good",
            "Super Tv",
            "very good product",
            "amazing gift by Vu",
            "excellent image quality and fast operating system.",
            "Picture Quality is good . Sound quality need to improve. Value for Money.\nService was good.",
            "Awesome",
            "good",
            "Value for Money Product, Just need some improvement in Sound quality",
            "very good product......",
            "it's super awesome....what a value for money and quality delivery....I am in love with it ...go without fear..",
            "good as value of money",
            "Fully satisfied with the performance of this TV. Only drawback is that the TV have only 4GB internal memory.",
            "Best buy in this price. I am loving it. Highly recommended",
            "awesome price worth product",
            "I received defective television. It has horizontal line of dead pixels",
            "Good picture quality and good sound , jeeva install is on time but technician have poor knowledge",
            "Picture quality awesome\nBut while connecting with Bluetooth speaker having trouble speaker area connecting but voice is not good\nSpeakers working fine on other devices",
            "VFM super",
            "Nice picture quality,, comparatively with mi it's far best in the picture quality",
            "Before purchase was confused, nice quality satisfied 👍",
            "Best TV in this budget range. Just go for it..!",
            "nice tv",
            "good product",
            "great",
            "At this price worth buying, excellent picture quality and sound...",
            "the product is very good and must buy",
            "very good product",
            "Sound system is not good. Can't experience the sterio system. Is having bit more base. Coming to picture quality is great worth full but other backlock is we can't install required Apps from app store, bit difficulty in that",
            "Just one Line..\nSUPER VALUABLE,SUPER QUALITY, SUPER SOUND, SUPER DELIVERY",
            "best in the budget",
            "delivery was fast. TV is ok. sound ok. installation service by jeeves was pathetic. guy who came for installation never listened to what we said. he fixed the TV at very height. took away our scissors. tried to fix the stand with some old rusty screw which he brought with him but we opposed and argued a lot and then he used the new screw which came with TV. over all bad experience.",
            "very good performance",
            "Excellent TV. Really happy with the quality.",
            "unbelievable quality product in this rate",
            "Superb quality, worth every paisa you spent on this TV.",
            "nice picture quality",
            "I like this tv.. bcoz the pic quality n sound quality... but the os is little lagy... bluetooth is not there.. huge disappointed😟",
            "Great buy at the price. However, picture quality could have been better compared to other VU models",
            "But app not working properly",
            "picture quality is not upto mark.",
            "very nice tv",
            "excellent product & value for money....",
            "Great product.\n\nValue for Money..",
            "Excellent..Just buy it..",
            "Good product 👍",
            "worth for money",
            "Value for money",
            "TV is great. Full Paisa vasul. Installation took 13 days after delivery. Just talking no action to resolve the matter.",
            "wooow",
            "Its nice value of your money",
            "Updated Review after usage\n\nPros :\n\n1. Picture quality is great.\n2. Sound quality is good in terms of built-in speaker.\n3. Netflix, Prime and You tube works perfectly.\n\nCons:\n\n1. No Bluetooth.\n2. Very less built-in app compared to other TV at this price range.\n\nOverall:\n\nValue for money",
            "excellent at this price range. only thing is to check the durability",
            "superb picture quality and sound,worthful for this price",
            "Till now value for Money.\nonly Bluetooth features is missing.",
            "The TV does not seems to be Ultra HD as HD channels are not HD type in this TV.",
            "very fantastic",
            "Washout pictures",
            "An excellent product....",
            "Excellent performance and clarity. Worth for money !!!",
            "Since 2 months we are using. No problem created so far. Best choice at this price tag. Installation service was too good",
            "Nice 👌 Good quality",
            "good TV on this range",
            "Cricket mode not available and no update if ur you purchased before june-19.",
            "Bang for the bucks, can't expect anything better for price and value proposition",
            "Nice product",
            "Worth to buy and 100% satisfaction",
            "Overall superb. Its good in connectivity, picture and sound",
            "Instillation not up to mark ..",
            "Tv doesn't last more than a year.\nAnd the service provider are worst people to deal with.\nMy tv is shut from last one month and service provider still giving lame excuses.\nDO NOT BUY IT.\nBetter to spend on some good branded one.\nDo not fall for price.\nWorst worst worst experience... And thanks to service provider for it.\nDo not buy.",
            "very good",
            "Great TV in this budget fast delivery by flipkart",
            "Perfect product",
            "Considering the price range and features you get, this product is a must buy. However i felt the volume to be a bit on lower side.",
            "best TV in this price bought @29k\nvu rocks\nclarity superb",
            "Very nice tv with a great audio visual effects.",
            "I am now using this for last 15 days it's worth the cost. There is a slight lag when I screen mirror from my phone on audio and video but I don't mirror to watch HD movies from my phone. Hope this helps",
            "sound quality in not upto point",
            "Very good led TV",
            "good picture and sound quality",
            "Best Tv at less price. I would re",
            "I am delighted to have this tv with awesome picture and sound quality. go for this without any hesitation.",
            "excellent picture quality and ssound good value for money",
            "good quality tv",
            "Good product",
            "worthy product",
            "Very Good quality at this price",
            "the TV is good but Everytime I login to something like Netflix I have to give the tv a full restart cause it doesn't connect to the wifi at first",
            "Good",
            "Awesome product, i brought it after much comparison, must go for this. best budget Tv...",
            "Picture quality of this TV is excellent..\nsound quality also good.",
            "worrh for what u pay",
            "value for money . Flipkart customer care very excellent . satisfied",
            "Best option is Android one as you can download various app.",
            "best in herd",
            "Nice TV Really Super",
            "nice tv ...suprb",
            "Very good product..",
            "Very very nice picture quality super sound quality is also very good",
            "awesome 👌👌👌",
            "The product is good but sound is not good",
            "Only backdrop can’t connect extra sound system",
            "Nice product",
            "VU 4k smart tv very nice , njoy",
            "It is so awesome ..Just go for it",
            "M 1000%happy with this,actually I wanna give 10 stars",
            "i really love this product very nice.and worth buying it",
            "The picture quality is not very good as compared to samsung and sony.",
            "Superb very nice excellent pictures....",
            "5 star TV but the only draw back is it does not have Hotstar application and you cannot download it.",
            "i forgot to check this model has no Bluetooth option and now thinking how do i connect my home theatre... vocals are on a lower side for sound.. user interface is a bit laggy, miss the air mouse option.. 6/10",
            "good one",
            "awesome TV @ this price range, no doubt good panel easy installation and adjustable. preloaded with lots of feature, i played online game through mobile easily connected internet.",
            "Awesome TV",
            "very good tv at this price",
            "I am happy to buy Vu TV .Good experience.picture quality so Good. Best price.👍👍👍👍",
            "Good product.value of money",
            "Good for its cost.",
            "Very Good Product.. This is the second VU TV purchased by me..Excellent Buy. Just Go for it and enjoy high quality picture",
            "best in the price range",
            "Value for money",
            "good",
            "Awsome product worth for money.I will suggest people to go with Vu instead of spending more money on ( Sony , Samsung ) which serves the same .",
            "Good Product.",
            "great product Good feeling",
            "4 stars because of the default apps. A lot of Indian Media Apps like Hotstar,Sony, Zee5 are not there in the App Store.",
            "ultimate picture quality! pro features...",
            "I opted for two years extended warranty but I could not get any communication along with the product.",
            "Excellent product ...",
            "Good picture quality and sound",
            "very nice product....gud picture and sound quality",
            "Simply awesome, great product",
            "Best in picture quality, upscaling of videos was flawless. But, Connectivity and os was bit laggy. Not recommended for smart Tv lovers.",
            "Just installed today.. after 7 days will understand its performance... look is good installation done as per schedule.. performance seems to be ok....",
            "wonderful",
            "anyview cast not working properly.",
            "Flipkart displaying NO COST EMI..iam eagarly booked vu tv through my hdfc crefit card...by three emi...but hdfc 13%interst claiming .....what is this..",
            "Fantastic tv. Giving a run for their money to all established brands. Keep it up VU.",
            "it's awesome.. and very reasonable price.. go for it. vu is no. 1 brand and flipkart service is also very gud",
            "Upscaling is excellent\nEven SD connection looks good\nonly issue in connectivity\nwill update later",
            "good tv 👌",
            "nice",
            "Very good picture quality and user experience. Sound is a bit less but that's fine..",
            "It's been 10days... going good. Within budget",
            "EXCELLENT TV @THIS PRICE.4K VIDEOS ARE VERY NICE",
            "ok",
            "Decent TV. Need some improvements, but at this rate it's really a nice TV. Only problem is with Connectivity. Mirroring is the worst thing. Audio and video sync problem when you mirror you mobile phone with TV.",
            "T.V is very good but installation they get 8 days simply i waiting for 8days after proper complaint , not installed within 48 hours",
            "Excellent Tv at this price",
            "Generally in a tv we have to look for the best screen.\nAnd in this screen the picture quality is equal to sony.\njust one word....great value for money and..... blindely go for it.",
            "Good product",
            "good result with HD channels,Sound quality is not so good",
            "Good picture quality",
            "VU TV is best as per description mention in Flipkart. I am having a good time with the product. Installation is done before the schedule.",
            "very nice",
            "Very good clarity. Value for money. Delivery and installation was awesome. Worth every penny. 😇",
            "the product delivered is of value to the money.",
            "Good picture quality, and sound. Must to buy. Highly recommend. But internal memory and ran need to extend",
            "Good",
            "Very Good product with in the budget.",
            "super image clarity and sound. got delivered and installed on same day. Using for more than one year...no issues till date",
            "Superb thanks to flipkart",
            "nice smart t.v. i give 5 stars",
            "it's working fine, value of money,",
            "very bad product",
            "One of best Television in 30k.Picture clarity was very nice with Airtel dth.",
            "Nice and good sounds",
            "Picture quality",
            "Not all required apps in TV",
            "Overall value for money.Nice picture quality, sound is also good.Good product to buy from flipkart.Will recommend to my near & dear once.Will request flipkart team to provide installation from their end instead of giving to 3rd party.",
            "best product",
            "All good, please advise how to connect Sony5.1 channel home theatre, tried with arc but unable",
            "Best 4K TV..for this price.Picture quality and sound effects are very well. Most of the latest technology also available HDMI ARC..,DOLBY DIGITAL SOUND AND ALL THE NET APPS ..",
            "Value of money and ultimate fast service\n\nI am soo happy happy 🥰🥰🥰🥰😘😘😘😍",
            "nice tv,",
            "Excellent TV at this price.. must buy.. on-time delivered and same day installation.. kudos to Flipkart. 😊",
            "Osm Tv",
            "viewing angel isn't 178 degree."
        ],
        "likes": [
            "203",
            "31",
            "71",
            "6",
            "11",
            "5",
            "6",
            "3",
            "4",
            "2",
            "203",
            "31",
            "71",
            "6",
            "11",
            "5",
            "6",
            "3",
            "4",
            "2",
            "2",
            "4",
            "4",
            "5",
            "3",
            "2",
            "2",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "61",
            "33",
            "12",
            "118",
            "59",
            "35",
            "95",
            "7",
            "37",
            "40",
            "6",
            "14",
            "17",
            "7",
            "18",
            "14",
            "4",
            "53",
            "12",
            "12",
            "6",
            "3",
            "5",
            "11",
            "13",
            "4",
            "6",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "6",
            "37",
            "3",
            "4",
            "4",
            "3",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "9",
            "3",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "56",
            "38",
            "49",
            "1",
            "6",
            "1",
            "2",
            "1",
            "1",
            "0",
            "56",
            "38",
            "49",
            "1",
            "6",
            "1",
            "2",
            "1",
            "1",
            "0",
            "0",
            "1",
            "1",
            "4",
            "2",
            "2",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "5",
            "2",
            "0",
            "26",
            "15",
            "9",
            "35",
            "0",
            "11",
            "13",
            "0",
            "3",
            "6",
            "1",
            "7",
            "5",
            "0",
            "35",
            "5",
            "5",
            "2",
            "0",
            "1",
            "7",
            "8",
            "1",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "56",
            "1",
            "2",
            "3",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "18",
            "4",
            "2",
            "2",
            "4",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "2",
            "2",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:what is the maximum pendrive storage will work with this TV",
            "Q:Which panel is this?",
            "Q:it has screen mirroring?",
            "Q:is it 5star energy saving",
            "Q:Does this TV support HDR?",
            "Q:which tv is better - VU Pixel light126cm or MI 49 inch 4a pro?",
            "Q:Is there Wall Mount available in box for TV",
            "Q:Does this TV support the 4K streaming?",
            "Q:it is not playing movies through Pendrive properly. of we play movies through Pendrive after some time it automatically skips to next movie. i have not seen a single movie fully till now in this tv.",
            "Q:Does it have chrome cast",
            "Q:Which all apps work on this TV?",
            "Q:Can I download apps in this TV?",
            "Q:what is the difference in vu pixelight 50inch and vu android 43 inch?",
            "Q:This TV support Android?",
            "Q:Does this TV support Netflix and Amazon Prime?",
            "Q:This TV Support Surround Sound",
            "Q:does it has preinstalled browser",
            "Q:Does it have Bluetooth? Can I connect my bluetooth headphones?",
            "Q:Can we connect home theater?",
            "Q:Can I use this TV as a sound bar?",
            "Q:Can we see youtube on this TV & can we connect mobile with it?",
            "Q:Does this TV support cast?",
            "Q:How to Clear cache and cookies",
            "Q:in the time using online app , movie all play without buffring.",
            "Q:can it support hotstar any way like if i can download it or something ?",
            "Q:does Google assistant is available or not",
            "Q:Does this tv have Google voice search and Google play store ?",
            "Q:Best mi 4x and vu 55",
            "Q:can i use Bluetooth transmitter and connect Bluetooth headset with this TV?",
            "Q:Can I control the TV from my mobile phone?",
            "Q:Is sound system provided by DOLBY?",
            "Q:Can I play games on this TV",
            "Q:can we see hot star",
            "Q:is there auxiliary port available to connect speakers?",
            "Q:it has 10 bit or 8bit ? vu premium has 8bit?",
            "Q:i bought vu pixelight and sony Xa-40 home system.i am unable to connect via aux cable.is there any other medium to connect tv with soud system",
            "Q:Direct led or edge led type?",
            "Q:Can it read external hard drive?",
            "Q:Could you please specify the file formats which works on the tv. does mkv format works on this?",
            "Q:Does it stream 4k content from apps like netflix and youtube ? And does it support Hotstar app",
            "Q:can we install apps throw apk file",
            "Q:How to connect this TV to Creative 5.1 speaker system which has 5.1 analog input only ?",
            "Q:Can i use jio tv ?",
            "Q:As there is no VGA Port how can we connect laptop to play a 4K Movie or video game via laptop?",
            "Q:does it sd Chanel upscaling to 4k",
            "Q:can i use browser and login to hotstar website to view movies",
            "Q:Can I connect this TV with MI Sound bar?",
            "Q:is it required tegular maintenance? (costly maintenance)",
            "Q:How to install apps like hotstar, Jio Cinema etc. in this TV? Plz guide.",
            "Q:WE CAN ATTACH HDMI CABLE WE CAN CLICK YOUTUBE BUTTON IN REMOTE AUTOMATICALLY HDMI CONNECTED YOUTUBE CANT OPENED",
            "Q:can we connect a keyboard via dongle or is there anyother option to connect a keyboard",
            "Q:metal frame or plastic",
            "Q:How to install app in this TV? Kindly share me the procedure to install app in this TV.",
            "Q:which tv is better - vu pixellight 50 inches or lg 7290 50 inches",
            "Q:3d movie watch ?",
            "Q:What is the exact dimensions of this 65' tv? Please tell me i want to buy this tv ...!",
            "Q:Does this model support dolby vision",
            "Q:this tv Required stabilizer compulsory??",
            "Q:how many gb pen drive supoorted this tv maximum.",
            "Q:can i used my phone application by using cast",
            "Q:we can see movies",
            "Q:is it have HDR 10 And 4K UHD Quantum Luminit Smart LED TV",
            "Q:can we download udmey application??",
            "Q:Does Spotify and Hotstar work on this TV?",
            "Q:What is \"California\" means in Vu TV's?",
            "Q:is this support dual/multiple audio file format ; if yes then how can change audio1 to audio2; like :-The Darkest Minds (2018) 4k BluRay x265 10Bit HEVC ESubs Dual Audio[Hindi DD5.1 +English 5.1]",
            "Q:is this support video format of x265 HEVC 10BIT LIKE :- Avengers Endgame (2019) (4K BluRay x265 HEVC TrueHD 10bit )",
            "Q:hoes it have 5 ghz wifi band?",
            "Q:give full dimensions please including width and specifically the distance between the legs",
            "Q:Is the smart view option available..?",
            "Q:Does 65 inch model have cricket mode?",
            "Q:If no bluetooth, can we connect speakers with AUX cable?",
            "Q:where this tv is manufactured?",
            "Q:why my tv pixel light cannot showing folders in my usb pendrive",
            "Q:Is HOT STAR app available / can be installed on this TV? This question was raised previously as well but the response is divided between Yes and No. Can someone pls confirm ?",
            "Q:is the hdmi 1.0 or 2.0a and is it hdcp 2.2 ready?",
            "Q:Is vu tv can be wall mounted option?",
            "Q:I am not able to play 1080p movie and video via usb port need help what should i do",
            "Q:can we install hot star in this tv?",
            "Q:Can we install or view hotstar on this TV?",
            "Q:does it has wifi",
            "Q:My home theatre has mp3 link (3.5mm) and coaxial in. How to connect the tv with any is this?",
            "Q:Does this tv have cricket mode",
            "Q:what is the clock speed",
            "Q:is VU pixelight TV contains Dolby vision plus technology?",
            "Q:cricket mode available in this model",
            "Q:is Dish tv connection is necessary to view channels?",
            "Q:anybody facing movie skipping issue when playing through pendrive?",
            "Q:does it has any browser pre installed",
            "Q:can I connect wireless keyboard and mouse?",
            "Q:Is this tv supoorts bluetooth connectivity i yes then one way or two way ?",
            "Q:does this tv support 4K video file plyed through USB",
            "Q:Is the Wall Mount stand Rotating or fixed?",
            "Q:any way to stream hotstar on vu pixelight tv",
            "Q:it's fully HD",
            "Q:will i be able to connect 2tb hard disk an watch movies",
            "Q:Do we require additional stabilizer for this TV....?",
            "Q:how many seconds it takes to start the tv after the power switch is on?",
            "Q:Does this TV support SD channels?",
            "Q:Can i watch 4K videos directly from USB",
            "Q:its compatible to connect iphone for mirror casting?",
            "Q:Can hotstar be installed ? sun nxt ?",
            "Q:is it Android base tv. google play store is available ?",
            "Q:Does this TV supports HDR?",
            "Q:does app store type is google play store?",
            "Q:Does this support PS4 pro?",
            "Q:does it support chromecast?",
            "Q:can i connect wirelesss speaker with this tc ??",
            "Q:Hot star app available",
            "Q:is it a 10bit or 8 bit panel?",
            "Q:Does it better than Thomson 55 inch tv?",
            "Q:which one is better vu andriod or pixilight..?what extra features we will get in andriod t.v in display?",
            "Q:ips display in this tv",
            "Q:Does it support jio cinema?",
            "Q:What is the difference between premium Android and this model?",
            "Q:Does it support jio cinema of jio TV?",
            "Q:can we connect to iphone",
            "Q:Is this IPS Or VA panel.?",
            "Q:Is this voice control?",
            "Q:Is this an Android tv?",
            "Q:What are the differennces between this tv and 30999 rs vu 55 inch tv?",
            "Q:what about hotstar?? is this a android tv?",
            "Q:What's the difference between VU premium 4k vs VU pixelight 4k apart from official play store. Is this worth the 6k difference for 50 inch model?",
            "Q:Display is IPS or not?",
            "Q:this is android tv or not",
            "Q:how much time does it take to start after switching on.",
            "Q:Panel for this TV is same as 2017 VU pixelight model?",
            "Q:does this TV has inbuilt stabilizer...??",
            "Q:does this TV support video file plyed through USB like mkv, mp4, avi etc",
            "Q:Is this televisions mounted cross between the two walls with its inbuilt wall mount stand. Means can this television be mounted cross (between the two walls) so as to see movies by sitting diagonally",
            "Q:this tv have playstore?",
            "Q:Can i connet Computer CPU direct to TV instead of monitor ?",
            "Q:Does it have Hotstar? if yes, does it play in 1080p which is the maximum resolution for this streaming platform.",
            "Q:Dish TV MKV format is supporting",
            "Q:can we Play pabg game",
            "Q:does it support HDCP , display port 1.4, WCG .... is it full LED panel ???",
            "Q:its remote support voice assistance",
            "Q:Does it support Hotstar?",
            "Q:Does it have Bluetooth?",
            "Q:How many watts it consumes? I mean what is the power consumption of this TV?",
            "Q:what is the dimension of the tv",
            "Q:which digital or dish tv setup box is supported by this ?? asking in terms of SD or HD set top box",
            "Q:does the TV have Google assistant",
            "Q:can i connect ps4?",
            "Q:How to update the Software/OS? My TV does not have Cricket Mode, so how to get it?",
            "Q:Is 3.5mm jack present?",
            "Q:Can i install third-party applications on this tv like temple run, zee 5,jio music.",
            "Q:is it imported make",
            "Q:is it better than vu premium model?",
            "Q:which type of Android? official Android or anything else",
            "Q:Can i connect sound system via bluetooth ?",
            "Q:is screen mirroring is available in this tv",
            "Q:In what way it is different from premium android tv 55 OA. Which is more advanced and better tv.",
            "Q:What is difference between model (65 QDV / 65 QDV -V1) this and Vu Pixelight 65BPX ?",
            "Q:does it work with local cable ?",
            "Q:does this have chrome cast(can we project cell phone screen on it?)",
            "Q:does the tv support webm 4k video format playback ?",
            "Q:does the product use for games",
            "Q:usb 2.0 or 3.0",
            "Q:How and what we should use to clean the screen when it has fingerprints or dust ? Need instructions.",
            "Q:can I install apps with usb",
            "Q:Does this tv support crome?",
            "Q:We should keep stablizer for this tv",
            "Q:which one best 55\" _Vu pixelight or iffalcon k31?i want to buy in this ofr",
            "Q:Can I connect JBL SB150 or JBL SB350 soundbar to this TV?",
            "Q:is this model support AI & elexa",
            "Q:It support facebook or instagram",
            "Q:can we watvh 3D movies ?",
            "Q:is it really 50 inch tv ?",
            "Q:v guard (500)mini steblizer enough for this 55 inch vu pixlight tv?",
            "Q:Does it support english subtitles?",
            "Q:Is this model has wifi ???? NASIR HUSSAIN",
            "Q:How comes that VU TVs dont have Bluetooth which is needed for so many reasons? Most other TVs do have it.",
            "Q:How to use hotstar and zee5 on this device... do we need any external storage or any other source to access these apps ???",
            "Q:Can i connect external bluetooth transmitter to connect wireless bluetooth head set and sound bar?",
            "Q:My TV flickers in high density areas even in slow moving scenes. Happens frequently in 4k and in HD formats as well. anyone else facing the same issue?",
            "Q:does 50\" vu 4k pixelight tv have cricket mode",
            "Q:Does it Support HEVC?",
            "Q:Can it download Hotstar?",
            "Q:2019 still 60Hz refresh rate ?"
        ],
        "answers": [
            "A:I’ve been using a 1TB Hard disk which is working fine.",
            "A:A+ Grade High Bright 4K HDR10 Panel",
            "A:Anycast view can we connect with Jio tv app",
            "A:yes",
            "A:Yes, This TV support HDR and HDR10 format",
            "A:vu pixelight",
            "A:Yes, wall mount and table top both mounting options are available inside the TV packing box",
            "A:Yes, This TV support the 4K streaming from different VOD apps like Netflix, Amazon Prime, YouTube etc.",
            "A:Honestly, i have not tried using a pendrive for viewing a video. check the type of pendrive.is it USB 3 or 2. i will try on my TV and give you a feedback. try using Vu helpline, they are quite ok",
            "A:Yes",
            "A:Netflix, Amazon Prime, YouTube, ZEE5, Eros Now, Hungama Play, YuppTV, Daily Motion, AccuWeather, icflix, TED, Toon Goggles, Viaway, Plex etc",
            "A:Yes, this TV comes with a pre-loaded VEWD Store from where you can download the apps available on VEWD store.",
            "A:Pixelight only Internet Tv Not Download Extra Apps . 43 Android Tv in which 16 GB internal Rom and You can Download Extra apps",
            "A:No, Android Series Only OA Series",
            "A:Yes, This TV comes with preloaded Licensed Netflix and Amazon Prime Apps, even Hotkeys of these apps are availabe on Remote Control",
            "A:Yes, This TV comes with DTS TruBass, DTS TrueSurround Sound & DTS Dialog Clarity to enhance the sound ecperiance",
            "A:yes",
            "A:No.",
            "A:Yes, This TV has Optical Audio and HDMI ARC support to connect your external Home Theater.",
            "A:Yes, This TV has built in feature of Audi Mode, were you can turn off the TV Display by selecting the Audio mode to listen to music on your apps or USB.",
            "A:Yes, You can see the Youtube from YouTube app or directly press an hotkey on remote. You can connect Android mobile using anyview cast.",
            "A:Yes, You can connect Android mobile using anyview cast or Android and iOS mobile using Remote now app",
            "A:Clearing out your cache is easy. Your Vu television comes with a built in function to clear out your cache, cookies",
            "A:no",
            "A:No support as of now.. lets see in the coming updates..",
            "A:No",
            "A:Nopes But it can be installed through the external devices and the best part is you can cast you android phone on the TV and watch whatever you want you watch",
            "A:VU 55",
            "A:not connected",
            "A:Yes, Remote Now mobile app allows you to use your smartphone like a smart remote. Your Android or iOs device can control your TV and even share content from your phone to the screen",
            "A:Yes, TV support all new generation of Dolby Audio codec like Dolby Digital, Dolby Digital Plus.",
            "A:Yes, With our builtin Arcade, you�ll be here to play, Play Card and board games or solve puzzles. You can also connect external playstation to HDMI input.",
            "A:No.",
            "A:yes",
            "A:It has 8 Bit Only.",
            "A:the TV comes with HDMI and optical support as other mediums to connect. if your sound system supports the same you should be able to connect.",
            "A:its DLED",
            "A:Yes it reads them flawlessly but bit slow to open and search and all.. playback is fine",
            "A:Hi, we tested the same thing and mkv format works. It also plays mp4, avi, mov, etc.",
            "A:Yes",
            "A:No",
            "A:Through HDMI ARC or Optical coaxial cable There will be a port labelled HDMI ARC behind your TV. Insert one end of your HDMI cable in this port and other end into the Home theatre.",
            "A:No you can not use Jio TV or Airtel TV in this there are specific apps only which you can use",
            "A:You can use HDMI since most of the laptops have an HDMI out, or else you will need to use a vga to hdmi converter.",
            "A:yes. the upscaling is on par with most of the branded TVs",
            "A:can be done .. but the experience wont be smooth and good .. the browser does not work that good...",
            "A:yes",
            "A:No",
            "A:It's not possible to install them",
            "A:you have connected a Wi-Fi network to it",
            "A:actually u dont require to connect keyboard as keypad is inbuilt",
            "A:plastic only",
            "A:You need to vising VEWD app store in the TV menu and search for the apps. You may not be able to find most of the popular apps like Hotstar, Zee5, Sun NXT etc",
            "A:I am a vu customer, it's picture quality at this Price is Appreciatable. smart enough, 4k quality is more than good, Sound quality is good but not loud enough. Over all good purchase.",
            "A:no its not 3d tv",
            "A:65 inches diognally",
            "A:Yas",
            "A:No requirement",
            "A:I am using a 1tb external hard disk connected vis usb and it works fine.",
            "A:Yes,if the app supports screen mirroring then you can.",
            "A:yes you can",
            "A:yes HDR 10",
            "A:No. It's not Official Android TV. It's a custom VU smart TV. You have to buy android tv box like Amazon fire stick or Act 4k box",
            "A:Yes",
            "A:It's us based brand",
            "A:There is a option occur while you are playing a video.",
            "A:Yes..",
            "A:Yes ofcourse , else how will you strean 4K content.",
            "A:Minimum 10feet distance required to watch the tv",
            "A:No",
            "A:Unsure what do you mean by Cricket mode, but no, there is no such mode available",
            "A:yes. through headphone jack",
            "A:Japan",
            "A:Check for the version of USB Drive you are using. This TV doesn't support large size and few formats like NTFS",
            "A:No it is not available. However you can cast the mobile screen and watch it. Another option is to buy Amazon fire stick.",
            "A:Hdmi 2.0 it’s not hdcp ready",
            "A:Yes u can",
            "A:you can try screen mirroring it can plan any video from any device",
            "A:Yes.",
            "A:nop. I got Amazon fire stick separately.its not an android TV so not sure when they will launch hotstar in there play store.",
            "A:you can connect yyour vu tv to the wifi",
            "A:You can connect using 3.5mm. For 3.5mm jack you can set Volume Separately and for TV speakers separately . coaxial output for this model is not available. HDMI (ARC) output is available.",
            "A:yes",
            "A:60",
            "A:Yes",
            "A:No.. this option is not available..",
            "A:It's an Android TV. So, dish is not mandatory if you have internet connectivity with Wi-Fi. You can browse and watch from online.",
            "A:I'm not facing any this type of issue.",
            "A:Yes",
            "A:NO",
            "A:no it don't support Bluetooth connectivity",
            "A:yes",
            "A:it is fixed",
            "A:No",
            "A:Yes,But it supports 4K too",
            "A:no",
            "A:This doesn't require an additional stabilizer. The technical specification takes care of the voltage fluctuation although if there is frequent fluctuations in your area then a stabilizer is required.",
            "A:instantly ur tv is on as soon as u press on button",
            "A:Yes, this will support",
            "A:Yes",
            "A:NO",
            "A:Ya hotstar, sun nxt, zee5, voots installed in the vu tv",
            "A:Yes",
            "A:Yes, This TV support the HDR10 high dynamic range",
            "A:No",
            "A:yes",
            "A:it has VU cast that can be used for casting. I did not try using Chromecast thoigh",
            "A:No",
            "A:Yes. And you can install other apps from the appstore as well.",
            "A:8",
            "A:Yes",
            "A:VU Android Tv in which Dolby Vision + HDR10",
            "A:No",
            "A:No",
            "A:Picture clearity is too good",
            "A:No",
            "A:No",
            "A:VA",
            "A:No",
            "A:No",
            "A:Easy access to Netflix, Prime Video & YouTube",
            "A:No",
            "A:Not worth 3k difference ok",
            "A:No",
            "A:Not",
            "A:2-3 seconds",
            "A:Yes Panel Is Same A+ Grade",
            "A:no",
            "A:Yes All Video Format Support",
            "A:No, the wall mount provided won't support that facility. you may either buy a different mount, or build a flat surface between two walls",
            "A:No , this tv have Not playstore",
            "A:yes you can",
            "A:no hotstar",
            "A:Yes , All Format Supporting",
            "A:No",
            "A:yeah",
            "A:No, its remote is not coming with Voice support.",
            "A:No",
            "A:No",
            "A:As per specs, it is 130W.",
            "A:25.2* 49.2 inches",
            "A:Anydish will support",
            "A:No",
            "A:Yes, you Can Connect Ps4 Palystaion",
            "A:The cricket mode is present in q different model...this one does not come with it. and there is no definite way of updating the OS.",
            "A:Yes it is there but use good quality cable if u want to use it for external speaker.",
            "A:Zee 5 is already Installed in this TV , and the Other applications like some games and more apps can be download by vu s app downloader which is inside the tv Default.",
            "A:Yes it Is imported make",
            "A:Yes , It is better than vu premium model",
            "A:Its Google Certify Official Android",
            "A:No there is no Bluetooth option with this model tv I also tried to connect sound bar with so many options but no possible",
            "A:Yes available.",
            "A:The Panel quality is very advance and picture clearity too good",
            "A:Only difference is TV remote only",
            "A:Yes it will",
            "A:Yes we can do that",
            "A:Yes",
            "A:Its a smart TV but can be used for gaming as a screen.",
            "A:3.0",
            "A:With dry cotton cloth.",
            "A:no",
            "A:Yes",
            "A:yes it will be safe",
            "A:Vu is better",
            "A:Yes it can be connected through USB option",
            "A:no",
            "A:no it doesn't.",
            "A:No.. Not Possible",
            "A:Yes",
            "A:yes , but really not needed",
            "A:yes",
            "A:Yes Built in wifi",
            "A:no",
            "A:you can not download any other app. hence hotstar can not be used. you have to subscribe to zee5 I believe to use it.. Thanks..",
            "A:Yes",
            "A:Nope. No flickering at all.",
            "A:yes",
            "A:Still now I am not used but it should support",
            "A:No you can't download",
            "A:Yes"
        ],
        "likes": [
            "28",
            "101",
            "0",
            "5",
            "40",
            "15",
            "23",
            "62",
            "55",
            "7",
            "65",
            "46",
            "28",
            "6",
            "35",
            "23",
            "2",
            "9",
            "9",
            "27",
            "4",
            "13",
            "14",
            "2",
            "2",
            "2",
            "1",
            "0",
            "1",
            "11",
            "4",
            "5",
            "3",
            "2",
            "2",
            "2",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "48",
            "6",
            "0",
            "12",
            "30",
            "8",
            "6",
            "13",
            "5",
            "2",
            "3",
            "3",
            "4",
            "3",
            "2",
            "1",
            "1",
            "1",
            "1",
            "2",
            "2",
            "4",
            "1",
            "2",
            "2",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "3",
            "43",
            "0",
            "0",
            "18",
            "5",
            "10",
            "43",
            "39",
            "2",
            "58",
            "52",
            "28",
            "3",
            "41",
            "25",
            "0",
            "7",
            "7",
            "43",
            "3",
            "20",
            "26",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "22",
            "5",
            "9",
            "4",
            "2",
            "3",
            "4",
            "0",
            "1",
            "1",
            "1",
            "1",
            "2",
            "2",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "2",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "10",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "9",
            "0",
            "1",
            "5",
            "21",
            "3",
            "2",
            "8",
            "2",
            "0",
            "1",
            "1",
            "3",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "2",
            "2",
            "10",
            "1",
            "5",
            "7",
            "2",
            "3",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    }
}