{
    "title": "Nokia 109 cm (43 inch) Ultra HD 4K LED Smart Android TV with Sound by JBL and Powered by Harman AudioEFX  (43UHDADNDT52X)",
    "product_specification": {
        "In The Box": "1 Television Set, Remote Control, User Manual, Mini AV Cable, 2 AAA Batteries, 2 TV Stand, 4 Stand Support Screws, Wallmount Stand, 4 Wallmount Stand Screws, Power Cord",
        "Model Name": "43UHDADNDT52X",
        "Color": "Black",
        "Display Size": "109 cm (43 inch)",
        "Screen Type": "LED",
        "HD Technology & Resolution": "Ultra HD (4K), 3840 x 2160",
        "Smart Tv": "Yes",
        "Motion Sensor": "No",
        "HDMI": "3 Side",
        "USB": "2 side",
        "Wi-Fi Type": "2.4 GHz / 5 GHz",
        "Built In Wi-Fi": "Yes",
        "Launch Year": "2021",
        "Wall Mount Included": "Yes",
        "Brightness": "350 nits",
        "Contrast Ratio": "5000:1 (Static)",
        "Picture And Picture (PAP)": "No",
        "Analog TV Reception": "Yes",
        "Digital TV Reception": "Yes",
        "View Angle": "178 Degree",
        "Panel Type": "VA Panel",
        "Digital Noise Filter": "Yes",
        "LED Display Type": "LED",
        "Aspect Ratio": "16:9",
        "Refresh Rate": "60 Hz",
        "Supported Video Formats": "MPG, AVI, TS, MOV, MKV, DAT, MP4, VOB",
        "Other Video Features": "Sports, Standard, Movie, Music, News",
        "Number of Speakers": "2",
        "Speaker Type": "Twin Speaker + Tweeter Setup",
        "Sound Technology": "Sound by JBL | Harman AudioEFX | Dolby Atmos | 60W Sound power | Integrated high end bass reflex tube",
        "Surround Sound": "Dolby Atmos",
        "Speaker Output RMS": "60 W",
        "Supported Audio Formats": "MP3, WMA, M4A, AAC, MP2",
        "Other Audio Features": "Auto Volume Function, Volume Offset",
        "Number of Cores": "4",
        "Processor": "1.1 GHz Realtek Quad Core Processor",
        "Graphic Processor": "700 MHz G31 GPU",
        "Ram Capacity": "2 GB",
        "Storage Memory": "16 GB",
        "Supported App - Netflix": "Yes",
        "Supported App - Youtube": "Yes",
        "Supported App - Disney+Hotstar": "Yes",
        "Supported App - Prime Video": "Yes",
        "Supported App - Others": "Netflix, Prime, Disney+hotstar, Zee5, Voot, Spotify, SonyLiv, YouTube, Google Suite of Apps and Others Downloadable from Playstore etc.",
        "Operating System Present": "Yes",
        "Operating System": "Android",
        "Screen Mirroring": "Yes",
        "App Store Type": "Google App Store",
        "Content Providers": "Netflix, Prime Video, YouTube",
        "Supported Devices for Casting": "Laptop, Mobile",
        "System Languages": "English",
        "Bluetooth": "Yes",
        "Other Internet Features": "Latest Android 11, Google Assistant, Chromecast Built-in, Google Home, Compatible with Gamepad",
        "Headphone Jack": "Yes",
        "Analog Audio Input": "Yes",
        "Touch Remote": "No",
        "Smart Remote": "Yes",
        "Color Screen": "Yes",
        "RF Capable": "No",
        "Operating Distance": "5 m",
        "Battery Type": "2 AAA Batteries",
        "Other Remote Control Features": "Google Assistant with Netflix, Prime Video and YouTube Hotkeys, Minimalistic Design",
        "Power Requirement": "AC 110 - 240 V, 50/60 Hz",
        "Power Consumption": "100 W, 0.5 W (Standby)",
        "Auto Power Off": "Yes",
        "Sleep Timer": "Yes",
        "On/Off Timer": "Yes",
        "Width x Height x Depth (without stand)": "965.5 mm x 570.8 mm x 107.7 mm",
        "Weight (without stand)": "7.8 kg",
        "Width x Height x Depth (with stand)": "965.5 mm x 627 mm x 219.5 mm",
        "Weight (with stand)": "8.06 kg",
        "Warranty Summary": "1 Year Warranty on Product",
        "Covered in Warranty": "Defect Arising Out of Faulty or Defective Material or Workmanship. Parts and Labour Costs are Covered",
        "Not Covered in Warranty": "Warranty Does Not Cover Any External Accessories (Such as Battery, Cable, Carrying Bag, plastic parts), Damage Caused to the Product Due to Improper Installation by Customer, Normal Wear and Tear to Magnetic Heads, Audio, Video, Laser Pick-ups, Panel damages caused to the Product by Accident, Lightening, Ingress of Water, Fire, Dropping or Excessive Shock, Any Damage Caused Due to Tampering of the Product by an Unauthorized Agent, Liability for Loss of Data, Recorded Images or Business Opportunity Loss.",
        "Warranty Service Type": "Technician Visit",
        "Installation & Demo Details": "Please note that any unauthorized handling or self-installation of the product will lead to return & product warranty being void. We'll facilitate the installation and demo through authorized service engineer at your convenience. Flipkart will communicate the day and time slot of the scheduled Installation & Demo through a SMS and the same information will also be available in your order details page. The service engineer will install your new TV, either on wall mount or on table top. Installation and demo are provided free of cost. The engineer will also help you understand your new TV's features. The process generally covers: Wall-mounted or table-top installation, as requested. Physical check of all ports, including power and USB ports. Accessories also checked. Demonstration of features and settings. Quick run-through on how to operate the TV"
    },
    "product_description": {
        "Sound by JBL": "Experience stellar audio with the technologically advanced sound architect-designed and curated by JBL. Through Dynamic amplification technology, it captures the energy and dynamism contained in an audio signal, reproducing it without any quality loss. Experience crystal clear sound characteristics with zero feedback and minimal distortions along with up to 150% more sound clarity.",
        "Powered by Dolby Vision and Dolby Atmos": "Dolby Vision HDR transforms your TV experience with ultra-vivid picture that brings entertainment to life. Dolby Atmos creates powerful, moving audio that seems to flow all around you.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "4",
            "4",
            "5",
            "3",
            "4",
            "4",
            "2",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "4",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "4",
            "1",
            "4",
            "3",
            "5",
            "2",
            "1",
            "5",
            "4",
            "4",
            "4",
            "1",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "4",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "3",
            "4",
            "3",
            "1",
            "3",
            "5",
            "1",
            "1",
            "1",
            "4",
            "4",
            "1",
            "4",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "4",
            "3",
            "4",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "3",
            "2",
            "5",
            "1",
            "1",
            "4",
            "3",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "2",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "2",
            "5",
            "3",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "1",
            "1",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "4",
            "3",
            "4",
            "3",
            "5",
            "5",
            "4",
            "3",
            "2",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5"
        ],
        "review": [
            "EXPECTED MORE BUT NOTHING SPECIAL\n\n*Picture quality is good.\nBut if you want to see the vivid colours please don't buy.\n* Hd and 4k contents are super\n*Picture upscaling is good. But color saturation not as expected\n* Only 4 color modes\n\n* Display panel is good. Blacks are super\n\n* Really very good for pendrive contents. Dolby audio also supports in pendrive video\n\n\n* Sound quality is good but Don't expect the sorround sound...\n\n* Chromecast working without internet. But so much of laggy when screenmirror video. No lags with internet\n\nBuild quality is good.. remote Control also quick and clicky\n\nInstallation done on time",
            "It’s been a week since the installation was done, here’s my simple & honest review\nBright side\n1. Sound output is a delight\n2. Application support is good\n3. Phone like features are handy, eg-TV booster, it clears cache and frees up memory for better functionality\n4. Google assistant works fine\nDown side\n1. Picture quality isn’t great but it the does the job concerning the price bracket\n2. Lag noticed every time you turn on (Highly recommended for software upgrade) Nokia we are counting ...\nREAD MORE",
            "Great value for money at this price range for a quality product..👍\nI am sharing my review experience after using the product for 25 days !!\n\nExcellent product by NOKIA in this segment !\n\nBoth audio & video quality are Awesome.\nConnectivity is Great., comparing to other available LED TVs.\n\nPROs :\n1) Ultra Slim Bezel is there with Great picture quality.\n2) It supports almost all formats of multimedia files.\n3) Sound Quality is AWESOME....with 60 Watt JBL inbuilt Speakers which is Powered by ...\nREAD MORE",
            "Boasts big, but deliver less.\n\nHad ordered the TV on launch date with great expectations.\n\nPros :-\n1) Picture Quality is fine. High brightness\n2) Audio is just fine not very great.\n3) Delivery happened soon, that is before time\n4) Packaging etc were fine\n\nCons :-\n1) No much quick control options through remote. for Picture settings, Sound settings etc, we need to go through the menu which is not feasible everytime.\n2) Audio is good, but comes with a Huge down facing sound bar, which occupies a lots of space.\n3) The TV projects almost 15-20 cms from the wall\n4) Surround options are not effective because of sound bar placement.\n5) had to make a couple of followups for installation and as usual Jeeves is not reachable.\n6) However installation happened on the promised date, and the person who came for installation looked very tired.\nHe wanted to finish off the setup soon to move to next customer, may be the company has put a lot of load on them.\n7) Andriod 11 doesnt seem to make much difference.\n8) Have to add the bluetooth option for remote everytime we power on\n9) Could have provided an mobile App, to manage TV, which most TVs has nowadays.\n10) Plastic Build, doesnt seem to be strong.\n\nOverall, not a great option but just does the job.\n\nThanks to useless Flipkart Customer support.",
            "Overall good tv value for money best class sound quality amazing pictures quality great work Nokia best thing about this TV made in india.😊",
            "Received TV on 7 Oct but the instalation was scheduled on 14 Oct, after so much follow up I got instalation on 13 Oct, Over all TV is good , good picture quality, sound and taking some time to on. over all good",
            "When power on.. that talking so much time..",
            "My 4k led 43 inch TV delivery date will be oct 17, I have requested to flipkart support team to arrange delivery slot as earliest as. I am very happy to mention here I have received 4 days before my delivery date,\n\nI really appreciate it his delivery and support!\n\nKeep it up!",
            "Undoubtedly a very good decision for this purchase. Wonderful, decent look. Picture quality not so good for SD but fabulous for HD and 4K. And the more than paisa wasool for sound. Just wooow...! Crystal clear. Difference of sound delivering from speakers and tweeters are quite remarkable. Dolby ATMOS is absolutely mind blowing. Feeling the every dimension of sound as intended. Wifi connectivity is good.\n\nSome downs..\nStartup delay.\nResponse time of any action is a bit delayed. (Any function you press it on remote will take a pause before it appears on screen)\nSD upscaling in not good or I would say it poor. (But anyways this kind of TVs are not intended to be focused on SD's)\n\nIf you are a Bass lover, there is always an option for additional home theatre or sound bar.\nBut the actual requirement for this TV is only an additional ideal woofer only(without any speakers or sound bar) from brands like Sony or JBL but this kind of customized requirements are not possible.\n\nBut anyways..! Loved it. Go for it.",
            "If you plan to buy a new android TV with all smart features then this Nokia JBL 2021 tv is the best option.\nThe sound is awesome; Connectivity, Picture quality, Build quality, Design are also the best at this price.🔥🔥🔥\nGood work NOKIA and FLIPKART team👌👍",
            "Best tv I have received very happy superb sound and picture is so crisp and natural colour.",
            "Absolutely one of the best TV.\nSound quality is super you don’t require external speakers.\nPicture quality is awsome. 4k video clarity is superb.\nOverall its a gud deal.",
            "I am writing this review after 1 day use, sound is fantastic, picture is satisfactory, this Nokia TV is better than any other TV in this price. Blindly go for purchase. It's a value for money product, delivery and installation was on time. Very happy with this purchase. Reliable brand with good customer care.",
            "Great Product in this price👍🏻😀\nIt's been a week since the installation was done, here's\nmy honest review\nBright side\n1. Sound output is a Awesome\n2. Application support is good\n3. Phone like features are handy, eg-TV booster, it\nclears cache and frees up memory for better\nfunctionality\n4. Google assistant works fine\nDown side\n1. Lag noticed every time you turn on (Highly\nrecommended for software upgrade) Nokia we are\ncounting on this\n2. Everytime u need to configure remote via bluetooth which is not appreciable (it should be auto connected)\n\nOverall a good product. If you're looking at cost\neffective TV with decent picture and great features!\nYou got this:)\nInstallation - Does the work fine but needs a lot of\nimprovement on knowledge related to demo of technician\nDelivery - Done within the promised date, delivery\nexecutive was courteous",
            "Ohh thank God and thank you flipkart for the big billion day deal. With the deal I got the 55 inches for 39999\nReview based on the usage after one week. Best in Class.\n\nPros\n\nOn Product\n-----------------\n1. Brightness. Extraordinary brightness with 400 nits\n2. Excellent Audio quality. No need of buying sound bar. Hats off to Nokia for choosing JBL speakers.\n3. Upscaling normal (even SD contents) video contents.\n4. Sleek and smart remote. Can be operable on both IR and Bluetooth.\n\nOn Flipkart:\n-------------------\n1. Great deals\n• 2000 instant deduction for flipkart plus members against 200 coins\n• 3000 SBI card deal\n• 1500 offer on no cost EMI.\n• Got the excellent bigger screen TV at final price 39499\n2. Excellent delivery on next day as committed.\n3. Perfect on time installation by technician from Jeeves.\n4. Technician has clearly explained about the product features, operation and warrenty\n\nCons :\n1. Bit lagging on audio video synchronization\n2. Could have improved more on the color saturation.\n3. Taking more time on booting after power on.\n4. Android home screen is bit irritating whenever booting. We need to choose the input channel manually every time whenever boots.\n5. Could have provisioned far field mic for voice assistant similar to Mi/xiami and oneplus.\n6. I cant get the sound from tv speakers, if connected external speakers with 3.5mm audio jack unless manually disconnect the audio jack.",
            "Good sound qualify connectivity is good everything is good I liked.",
            "I have been using Nokia 43 inch sound by JBL and Powered by Harman AudioEFX (43UHDADNDT52X) TV for last 9 days.\nPicture quality is Superb, no over saturation of colors. Colors are very natural. Blacks are perfect. no need of any casting devices like firestick. Dolby vision & 4k video's runs effortlessly with great picture quality.\nSound is awesome no need for additional sound bar. Sound is very clear even at low levels. For a room size of 14 /14 Feet you will never require to increase volume more than 45%.\n\nI purchased Nokia Tv after returning VU Premium Ultra HD TV twice. both the times i had issue with night or very dark scenes.\nVU premium Tv was displaying those black scenes as patchy spots. In Nokia TV very dark scenes run flawlessly .\n\nService provided by Flipkart was excellent , they replaced the VU Premium Ultra HD TV initially and when issue still persisted they refunded the money.\nJeeves also provided excellent & timely service on installation. . I even took extended warranty from them. My previous VU 55 inch TV had mother board issue and extended warrant helped me replace it without any cost.",
            "In my view the best UHD LED TV in this price band. Perfectness in terms of sound and display content. No other brand can provide you this sound experience. TV means TV never consider it a subwoofer based music system. I am bass lover and I have other systems for that. I have purchased this 43 inch Nokia tv in addition to 50 inch of same UHD TV within 2 months. You can understand that faith. I am satisfied with both the Nokia TVs.",
            "Best in quality\nAudio quality is good not soo good\nPicture quality is awesome 350 nits 😍\nBest i buy this product rs. 30999",
            "1. Picture Quality is good for the price point\n2. Sound is amazing , lot of fun if you like to enjoy loud cinematic experience. Prefer to use it on stand than wall mount as the JBL speakers are down firing and give better response while on stand , for wall mount cannot for onkyo version of same which has fron firing speakers.\nOver all a very good experience.",
            "Review of Nokia 50 inch Ultra HD 4K LED Smart TV after using one week. This is a value for money product. Overall experience is very good. Highly recommended and giving review in points to make it easy.\n\n1. Do not compare with premium products ( Sony, Samsung or LG). Understand it is a value for money product.\n\n2. Picture is very good with good brightness and sharp colors. I think best in its price range. Much better than Chinese. Again do not compare with premium products and against rest it is the best .\n\n3. In picture I liked eye protect plus feature. Most features work as claimed and not for namesake. This tv also enhances the picture quality which is also very impressive. Play any low quality video and this tv will enhance its picture quality. Very Nice.\n\n4. Sound by JBL is very impressive. So many people complaining about low sound. I would like to tell them that loud is not good at all. Clear is what matters. Buy any Bose sound system and see how loud it is. It is not loud but clear which is how it should be. Also at this price JBL will provide a basic set up not a higher end setup. Sound is enough and no need to add extra speakers for most. We buy TV for picture, not for its sound. If u get decent sound than it is better which is how it is.\n\n5. Buy it's Qled model if you can spend 10k more. Qled picture is better than this one and this is the only difference between these models.\n\n6. Dual band wifi is a charm. No buffering if you have a decent net speed. Mine is around 50 Mbps. If you connect tv with wired net connection instead of wifi, it will be much better. Recommended for people with low net speed.\n\n7. I could not find much to complain. We need to attach remote with tv by bluetooth every time you start it. This is one major flaw In my view. If you will not add via bluetooth, you need to use the remote directing towards tv. By bluetooth it will work in all directions inside the range. Not a deal breaker at all.\n\n8. A little bit lag but nothing major.\n\n9. Google Assistant work smoothly but again will depend on your net speed.\n\n10. One feature I loved is you can activate auto sound adjustment. Once you activate it, tv will automatically adjust sound on all channels. No need to adjust sound again if you change the channel or if any ad. Comes in between.\n\n11. Design is vey good and it looks premium.\n\nThanks for reading a long review. I hope my review will help you guys in selecting your tv.",
            "Awesomeness to the price range, best in class segment and JBL system just nailed it the sound performance\n\nLoving visual and artistic sound quality\n\nGreat deal on festive shopping\n\nThanks Nokia n Flipkart",
            "Pic quality super\nSound is nice",
            "Value for money.\n\nThis is about 50 inch UHD TV.\nPicture quality is very good considering the budget. One must choose the right picture settings for excellent results . For this TV dynamic picture mode is too good, you can adjust as per your interest.\nSound is excellent , the proper seating of equaliser is important with movie mode of sound.\n\nOverall value for money product",
            "I m writing this review after 12 days of use.\nTV is awesome picture quality is insane sound is also good i dnt knw how does 20watt speaker's sound is & 60 watt's sound But sound is good and we dnt purchase TV for sound quality we can upgrade as we need it to good soundbar too.\nIf u are just looking at the brand name if u are thinking that nokia is new in TV sector then leave it because they are doing best just close ur eyes & go for it.",
            "1) Best android TV i can say\n2) Worth buying it\n3) Can enjoy alot while watching it\n4) Don't think before ordering it, jus go for it!\n5) NOKIA 1st launched a phone it worked very well and now launched a TV I'm sure it will sound very good in market so all the best NOKIA team",
            "Pros:\n1) Stock/Pure Android OS - Very much a delight for stock android lovers.\n2) Strong build - Plastic body and Aluminium Tabketop stand.\n3) TV comes with a free simple wall mountable stand and a very short RCA cable\n4) Very prompt and quick \"next day\" TV installation. Jeeves's takes care of the Authorized service support for Nokia(along with many others). They seem to know what they are doing.\n5) Vibrant display - compared with Samsung/OnePlus, Motorola, Mi abd VU TV, this is a very good option. Dolby vision available.\n6) Great and crystal clear Audio - You've downfiring Harmon speakers - Wofer as well as Tweeter set and JBL Sound along with Dolby Atmos!\n7) Data saver is automatic - No seperate option available.\n8) A simple remote(be careful it costs 2.5K it lost) with 4 hot keys.\n9) Very quick casting from Laptop, Mobile or Tablet.\n\n\nCons:\n1) You gotta take the complete protection plan from Jeeves if you want to ensure/insure the TV. This is a Pro, but for a first tim buyer, it seems costly - alost 4000/-, but very much worth it. Everyone knows - Smart TVs dont literally last the same as non-Smart TV. So blindly take this full protection plan from Jeeves(who is the ASP for Nokia).\n2) The startup is slow - takes about a minute or two - well your nokia TV is just a big gigantic android phone - so this is fine ;)",
            "After using for around a month i would say \"sound is the best you can get in this price range. Picture quality could be improved but not bad with the price segment. Have good handy features like only sound mode, using the tv as a Bluetooth speaker are some of the really good features, games like Beach buggy racing, real racing works just fine. Controller connectivity is awesome, not enough points to complain about\"\n\nLastly one thing i would like to say if you are planning to wall mount, then the one with Onkyo soundbar will be better as it has front firing speakers and can give you dolby atmos feel. If you are planning to keep it on stand, then go for the JBL one.\n\nHappy shopping 🛍 ☺️",
            "Picture quality is not good as expected. Too much halo & blooming effects. Old nokia product was better than this. Sound quality is not good as jbl performs. Overall 3 star. Rather to buy sony lg samsung. Also tv size43 inch is small compared to previous one.",
            "good product to view , and 1st day experience is shared , after 10 15 days new review will be posted , hope the same will be maintained. very good display and sound system for 14 x 20 Ft room , no sound bar is required for any sound enhancement due to JBL speakers capability , display is friendly with remote and settings .",
            "Product consumer support is good very quickly to resolve my problem tv display resolution is good, sound quality ok, my suggestion is improving the product quality, screen saver mode,screen mirroring, screen shot, product specifications mention tv back side, and additional features add ok google option by using with out remote",
            "Awesome...sound quality super...",
            "Recommended",
            "Flawless TV. Happy with the performance",
            "Remote is not working and the service isn't helpful yet.\nTrying to reach for assistance and not received any update\nAnd twice promised and not happened till date\n\nWhat is necessary if you can't make it on committed things\nService isn't good and annoying",
            "Superb tv I love it just go for it 👍👍👍",
            "Hi , super tv you must go for it",
            "This TV has JBL sound system that provide crystal creal and crisp sound. Sound is loud enough for theater like experience. Picture quality is also very good. Build quality of TV could be better.",
            "Awesome TV",
            "Does not supporting UHD HDR on Prime Video",
            "Best QLED in the market as per the price.\nGreat speaker JBL branding",
            "Good",
            "Best tv in this segment. Amazing quality, immense speed , so many apps and features",
            "Excellent product !!! Simply wow with this price range the panel has really good display and 60w JBL speakers has nailed it considering this price .",
            "Delivered 10 days back... No one called for installation... Very frustrating... If flipkart is not getting this installation done.. pls take back the product and give back money.... Waste of buying the product...",
            "Worst tv flipkart is a cheater",
            "HD and 4k vedio quality is outstanding and sd upscaling is not good.\n\nSound is mind blowing.",
            "Processor working very slow .....it will hang so many times and when we are connecting every time it's asking a options ,... software issue is there ...",
            "Very good Sound and picture quality. Installation done on same date.Worth for money...",
            "-Picture quality is average just opposite as boasted.\n-Sound quality is also average which is very exaggerated in the name of JBL, HARMAN.\n-Hanging issue is there every now and then.. processor not that capable.\n-60W Sound bar increased the TV thickness which makes it look like older generation TVs.\n-Google assistant never works on one go..remote bluetooth everytime need to pair with TV which is annoying af.",
            "It is asking to pair the remove every time after a powered off & on to use Google assistance. I have replaced with new tv, however, it's the issue with replaced unit. I assume this is the same issue with every TV with this model.",
            "Nice JBL sound speakers",
            "Good\nProduct",
            "Need more of proper updates to fix the bugs and patches",
            "Nice picture quality\nNice sound quality\nNice build quality\nConnectivity is ok\nThough its android 11 but Still its a bit slow during start up which could be fixed with an update in future release i hope and no proper shutdown.\nOverall its good product at this price range.",
            "Item is not working after one week. Even flipkart customer care is le",
            "Excessive problem occurs in Bluetooth and wi-Fi.\n\nWhen you turn on the TV, the remote has to be connected to Bluetooth.",
            "It is latest tv with good specs.\nPicture and sound quality is awesome\nWorking good. Worth it. Go for it",
            "Product is delivered fast.. .... this range the Nokia 4k UHD smart and android TV is valuable compare to other TVs ....perfect jbl sound..high brightness..go for it....fabulous product buy at big billion days ....after two months use no issues on TV....good product",
            "Fully satisfied with this product. Mind blowing tv. Go for it 😍",
            "All of good experience.. Picture quality is awesome. Sound quality is 100% theater experience all wonderful...... By it",
            "Just a perfect tv for a budget home",
            "Most irresponsible company i have ever seen\nMy TV IS NOT GETTING REPLACED\nDESPITE COMPANY ENGINEERS CLAIM IT WIL GET REPLACED WITHIN A DAY\nI FEEL HUMILIATED\nCOMPANY WILL HAVE TO COMPENSATE",
            "TV too slow running don't buy",
            "I have been using this TV for around 10 days. Here is what I feel about this TV.\n\n1. Takes around 1 minute to start\n2. The software (android 11) is slow ( don't know why due to hardware might be). However this is only for 10-15 minutes after starting the TV\n3. Sometimes remote disconnects from the Tv and so I have to pair it again\n4. Picture quality is great at this price point\n5. Sound is great no issues regarding that\n6. Installation was done just a day after I received the product\n\nYou can go for it !\nWill edit the review after 1 month of usage.",
            "Working good worth for money.",
            "Good Quality..\nSound...\nClearity...\nPicutrization.",
            "Excellent",
            "Sound quality is fabulous.\n4k videos superb. Value for money.\nThanks flipkart",
            "Overall performance is excellent. Sound clarity is 👌.\nBut installation took 5 days after receiving product. Multiple follow ups with backend team 🤯.",
            "Side view is not good....Not happy with picture viewing ....You need to seat front of TV to watch .... Sound is fine .....",
            "It's great, sound bar is not required if you are dont doing a big party with heavy bass, I have been using it, without connecting to the woofer.\nPicture are so naturally, colour saturation is balanced so well, Don't have to adjust.\nDon't see any lagging. Delivery in 2 days and installation next day.\nI have compared and check all the budget android TV's, finally chose it. And so satisfied.",
            "Good TV at this price point. You get JBL speakers.\nSound quality is super and picture quality is good.\nRemote need to be connected every time for Bluetooth use. This may get fix with update",
            "Very good in quality and sound is very awesome with JBL",
            "Don't buy this product. Not working properly too much hanging.",
            "Awesome tv",
            "Super TV value for money",
            "Sound is superb but speaker is not 60w its 30w speaker & 30 w twiter",
            "Over All point of u Good tv Good sound Good Picture quality\nOne Drawback every time we have to pair remote when we start tv",
            "Nice product",
            "Really good product",
            "After 3 months using review oral good sound picture quality",
            "Happy with the Product. Picture quality is much better when compare to other TV's in this price range.\nAudio and sound quality is MIND-BLOWING !!!",
            "Very Nice! Audio you will love it",
            "Very good picture quality & sound.",
            "Not able and back button work only on remote control not other mouse or keyboard and not replying about questions from tv brand and no suggestions about support of keyboard and mouse and game pad ect and update and Google home in build croma cast",
            "Pixels break up at 4k.. Dont go for this if u want to watch 4k. Else this is beast",
            "The TV gets slow for no reason while turn it on. And the picture quality is good, not best. It does not need a soundbar seperately. The updates and interface could be made better and fast",
            "Picture quality is not good\nSound is good because of JBL\n\nNokia service is very poor.\nNeed improvement",
            "Ok Tv Cost is bit High",
            "Such a osm TV great sound with great bass...and osm picture quality....Totally worth it...🔥",
            "Don't not buy",
            "Video gone for good under 10 days.... Only sound is on... I think i opted a wrong choice... Fell for the name.. Nokia",
            "Not good",
            "Brilliant TV, affordable price. Highly recommended",
            "Good",
            "Worst manufacturing product\nFinishing and completion on outer pannel is not up to the mark.\n\nNokia need to take care of pannel and product finishing\nCustomer care service also not accepting if anything changes.\nPicture quality is not good\nContrast and color also not natural\nUnhappy with the product\nI would not recommend Nokia tv brand to anyone\nBetter is SONY / MI / LG",
            "Good tv",
            "I am very satisfied with picture quality and sound quality of this product combination with jbl 80wt sound system it gives more than the price of tv but i don't know the after sell services of nokia soo currently i am fully satisfied",
            "Sound and pictures quality too good",
            "Good tv",
            "Sound quality is awesome.... Clarity is good.... Installation service is commendable",
            "Nice one, specially for sounds",
            "This product is Awesome and JBL Sound Quality is mind-blowing",
            "Using the TV since last 3 weeks.\nThis is a budget TV and hence the performance will be based on such.\nPicture and sound quality is quite good.\nThere is no lagging issue so far.\nPlease do not compare it with High end products like Sony / LG / Samsung.\n\nOverall this is a good TV and so far I have not faced any issue regarding picture / sound / Internet.\n\nWill again submit a review after few months.",
            "Used almost for a month now, very happy with the picture quality, JBL sound and the overall performance, built quality. I will recommend highly.",
            "Best TV and delivery, installation",
            "TV is good in budget range but initially lag observed during boot, request Nokia to resolve the issue. Once resolved, it is a 5 star rating TV",
            "Best.....",
            "Picture quality is not bad as depicted by others here...you need to go to settings > picture > keep Standard with Live Color On...You will get better picture quality.\n\nNokia needs to provide regular software updates for better customer's satisfaction.\n\nLatest update has solved issue of connecting Remote Control every time you switch on the TV",
            "Super",
            "Great sound impressive picture quality bin HD.",
            "Remote connection are getting disconnected on daily basis.",
            "Nokia lover....",
            "Awesome TV in budget",
            "Nice picture quality.\nAudio superb\nBass average good",
            "Picture quality is average, sound is ok but not as good as being advertised and boasted as JBL sound quality.. It takes longer time to boot up. Also, there is a noticeable lag. A few times also noticed that the screen goes completely blank and changes color in every seconds. Not sure it's a system/application bug for all or its with my tv only. Overall an average performance budget tv. Could have been way better in terms of picture and apps performance. Little disappointed and worried of the lag and blank color changing screen.",
            "Good TV at this price",
            "50\" NokiaTv Great pictures, Sound Quality JBL Sound is really Too Good, Value For money, Great Installation and on time",
            "Incredible quality 🤩 of sound and picture quality.....",
            "Picture clarity super but Wi-Fi not connected",
            "Dont buy dont waste money dont waste your time very bad product\nPicture 3/5\nSound 3/5\nConnectivity 1/5\nBluetooth 1/5 ( horrible 😢 Remote always\ndisconnected and connected )\nWifi 3/5\nUsb 1/5 ( only pen drive only connect other 1 tab or 2tb\nnot connected)\nRemote control 0/5 ( horrible 😫)\nVoice control 0/5 ( horrible 😫)\nMoney 2/5 ( go for other brands for u r safety )\n\nIf you want connect 1 tb or 2 tb external hard disk dnt buy this product i tried my 2 tb external hard its always showing formate hard disk use as a back storage to tv its horrible\n\nInstallation jeevan ( he just came to turn on u r tv and\nrun to others )\nFinally its horrible experience to me with nokia 4k tv purchased but i satisfied one thing only delivery and Installation happened in time only my suggestion to tv lovers go other brands like MI, ONE PLUS, VU, if you have money go sony 😀 👍 bye",
            "Great sound and clarity, but lousy attitude of installation personnel.",
            "It was worst experience",
            "Dont go with the JBL version, it just a fraud from flipkart, this TV dont have JBL sound and it has very poor picture quality, it have some issues with the display.\nSo dont go with JBL model of Nokia instead of this buy Onkyo model if you love Nokia.",
            "Very good product, coming to sound is perfect but less bass.\nScreen resolution is good, 4k is extremely good.\nValue of money for 55inch TV.\nBeginning setup connectivity is slow. Once we restarts the TV. Working in good.\n\nInstallation is done after 3days once we get the product.\n\nOverall product and picture is good.",
            "Not bad ..processer is slow compare with mi tvs",
            "After close look there is slight lag of milliseconds between video and sound which is can be clearly visible & which I feel is a big problem in this TV",
            "Iam using this TV for last 3 weeks . Picture quality and sound quality is very good. This product from Nokia is worth buying. I will suggest to go for it",
            "Very fine product",
            "Overall performance is good however it takes more time to boot up and load the operating system.",
            "Loved this product, writting after 2 months… amazing amazing super sound",
            "Value of money",
            "Not good ok",
            "best android tv",
            "Good quality",
            "Excellent tv, worth to have\n\nSuper picture and audio.\n\nGo for it",
            "Audio and picture quality is good, 4k streaming is awesome. Could improve in build quality of tabletop stand. It looked and fits like some cheap rated stand.",
            "Nice product\nUsing last 6 months\nSound quality and picture quality are so good 👍",
            "Brilliant picture quality with amazing sound of JBL twin speakers. Easy to operate. Connectivity (Bluetooth+Wifi) is smooth. No lagging issues. Go for it.",
            "Good",
            "Picture quality - good😃😃\nSound quality - extreme 🔥🔥 just love it\nBest tv in this segment.....❤️❤️❤️",
            "The Product is good ..\nDelivery and package very good\nTV is good .. picture quality is nice and good JBL sound systems. If don’t have sound bar we can manage with this sound. Operating system is not upto the mark . It’s android 11 and TV have 2GB . 16 GB RAM and Storage but sometimes it’s laggy and taking little time to load the apps .\nRemote control also average not much responsive",
            "Excellent product",
            "Very good product as expected\nValue worth for it",
            "Good Quality",
            "Great product must buy",
            "Unsatisfied",
            "Superb",
            "After one day use the tv got repair and power is not generating into tv no activity is showing . I have complained to filpkart abut my tv issue they done good job they have replaced new tv with in the one week now it is good but still I should wait and see how the performance is if same issue",
            "JBL sound is awesome and very good picture quality.",
            "Got the device on exact delivery date. Have been using for a few weeks.\nVery good picture and audio quality.\nApps like Prime and Hotstar with 4k shows you the real screen experience.\nThe 5.1 audio support too is really well.\nBlends in well with home.\n\nIf you want a feature rich android tv, i would suggest Nokia",
            "Nice product.....value for money",
            "Wow darun",
            "Nokia connecting the people ,👍👍👍",
            "Good tv",
            "Good TV",
            "Picture quality is awesome, value for money, budget friendly tv, best performance in all format",
            "Awsm sound",
            "Picture and sound is good. But sound need to improve.",
            "Very good product. Connectivity, picture quality and sound is suprev",
            "Nokia tv are really best i love it\n38999 of 55 inch jbl 60 watt 🙂",
            "On the first day, the speaker made some weird sounds and it needed to restarted to make it off. Other than this, the tv is fine.",
            "A perfect tv at this price range,\nGood picture quality & best sound.",
            "Very good product",
            "Good picture quality annd sound",
            "Excellent product value for money 💰",
            "Best tv in budget range",
            "Osum prouduct",
            "Best qualities",
            "I order Nokia 43 inch Tv on 18 feb 22 and rec on time on 21 feb, Thanks to filpcart doing good job, Tv picture quality is very good and sound is also good I'm happy with all.",
            "Good",
            "I recommend, this is good product and go ahead, if you are willing to purchase.\n\nWorth buying and value for money",
            "Nokia TV is very good and super sound quality is very nice 👍👍👍👍👍👍👍",
            "Nice sound",
            "Nice TV, JBL sound system is awesome",
            "All things",
            "Overall good quality. Sound quality very good",
            "Good",
            "Excellent product. Expected a little more from 60W JBL",
            "Sound quality is awesome",
            "Quality good",
            "It's a very good product.",
            "Super tv",
            "Sound and picture quality very good\nNo need xtra sound system.",
            "Amazing sound and picture quality",
            "Everything is good, Brightness, Audio... fully satisfied. will update in the future.",
            "Good product, go for it",
            "Not worththy",
            "Picture Quality is Average, Sound is best.\nI have connected my 1 TB harddisk but tv is getting hanged while playing contents.\nOverall average performance.",
            "Value for money the sound is very good compared to other tv's jbl speaker rocks..",
            "Tv is picture & sound is good. Remote is also good. Wall mounting cannot be adjusted. Overall decent.",
            "Excellent performance. Display and Sound quality both are perfect.",
            "Best at the moment in the market",
            "Very good display with great sound JBL harman. Sound is sufficient for most of the room sizes. Sufficient build quality.",
            "Overall liked it and satisfied in this amount",
            "Sound is good but display average...",
            "Good picture quality and sound quality is amazing. Worth buying it",
            "Nice products\nSound quality osoum yar",
            "Very nice product",
            "Super sound and video quality was just amazing. Worth it",
            "Overall good",
            "Good picture and sound quality!\nExcellent service by Flipkart!!\nOnly if one can save audio settings as user defined options allowing to quickly toggle for Music, Movies etc.",
            "A good purchase",
            "Very good product on this price range. Wait for sale for discount and get it by lower price.\nAwesome picture quality.\nFabulous sound output vary clear. No requirement of external sound system.",
            "Nice",
            "Very bad picture and sound quality, not even 10% of brands like Samsung & Sony.",
            "so far it is good. no problem till this review, if night mode function added, then it is wonderful for night viewing",
            "Just ok k.",
            "Worth for money\nPicture and sound Quality is Excellent.",
            "Super",
            "Very Nice Product. Sound is the USP of the TV.\nValue for money in the price range",
            "External Pen drive videos not supported,",
            "Good",
            "Best TV in this price segment. Kudos to Inbuilt JBL audio you feel like in theater. So loud and true surround sound.\nPicture quality is also exceptional",
            "Like the product",
            "Good at this price",
            "Pretty good with overall experience. Better than other brands.",
            "TV is okay and having connectivity issue. I feel price is high for this TV, I would suggest better spend 10K extra and go for LG r SS. I'm having LG as well when compare both LG is classy and always branded quality is great...",
            "Awesome",
            "Worst and software is not working properly\nMovie running in prime but suggestions only visible\nDoesn’t recommend this tv from my experience",
            "It’s bad don’t buy",
            "Valued product",
            "Nice liked it",
            "Simply Superb 😉",
            "Everything about this tv is good, picture quality is good, viewing angles are good, sound is awesome. You can hear the bass also. The only downside is the tv is coming out. I mean when wall mounted, it looks like a LCD because it is coming out of wall like 5-6 inches. I have to use my sony's tv wall mount just to decrease one inch from it.",
            "Nice one in nokia for the budget go for it for any doubt",
            "TV is gud in budget segment with very impressive sound and if any want to save money of extra sound bar purchase go for it .....very nice sound quality",
            "It's Nokia TV good interest watch in drama, picture and moving ......",
            "TV is too good... And the installation was really good too 🌟",
            "Nokia smart LED TV ultra HD 4K.\nExcellent product. Picture and sound quality is good. Installation was good. Really Nice product.\nDelightful. Worth every penny.\nOverall Good Choice.",
            "I got this Nokia TV recently and overall experience is amazing. Thanks.",
            "Good 📺TV",
            "Good product from Nokia.\n\nI have purchased this tv in Dec 21\nWorking fine sound quality was very good.",
            "Nic tv. Very good picture quality.",
            "Awesome sound experience and display",
            "I can say, simply the best... JBL sound and awesome picture quality...!!",
            "Bass level should more.",
            "Picture quality and sound is awesome, it gives a feel like soundbar",
            "Good voice and pictures quality",
            "Sound so byad",
            "Good display.. worth for price compared other tv in this price comparison.",
            "This is the best tv i have ever purchased.\nI love the sound specially which is useful for me not to spend on Soundbars.\n\nPicture quality is super awesome because of Brightness 380 nits.\n\nOnly Con i found is Bluetooth range. When connected to Samsung Buds Bluetooth headphones, i should sit very near to tv around 5m range which is burning my eyes when seeing the tv that close. Don't know whether it is the headset issue or TV Bluetooth range.",
            "Decent product ... After lot of research I bought this product and I must say it is amazing... I am using this gor 2 months now and feeling so happy.\nJust go fot it.",
            "Good in such price...",
            "Worth to buy 4k tv at this price, Good picture quality in used till now, beast for using",
            "Best tv in this range\nI got it in 30k\nIt sounds like beast\nAnd picture quality is also great in this price bracket\nOver all a super tv in this price bracket",
            "Good value for money",
            "Sound is best but in case of colour - picture quality is not good but at this price it’s very good offer",
            "Wifi connectivity is very bad",
            "quality is good but some times app behaviour abnormali",
            "Nice TV Nokia",
            "Very nice tv",
            "Nokia TV very nice TV sounds great and I like this TV",
            "Best sound.. Best picture quality and best TV",
            "Decent display. Sound is good. Do not expect home theater like experience. The software performance is not that good. Tv became bit laggy in less than a month. Clearning the memory using the Ram booster app pre installed helps to some extend.",
            "Super Sound and picture quality",
            "Good picture and audio quality. OS seems like heavy. But rest are awesome.",
            "Picture quality and sound quality not good",
            "Only problem is 2gb ram and Android 11. If it were Android 10 or 9 it would have been one of the best or otherwise ram should have been 3gb if they wanted Android 11",
            "Very nice pics and soud",
            "Good",
            "Sound very good...",
            "Sound is super.. picture quality not upto mark some time flicker issue coming.. audio quality is very good",
            "Excellent product",
            "Good tv not bed",
            "excellent",
            "Worth of every penny... excellent tv under 32k...must go for it without any second thought",
            "No point in spending money on brands. This TV provides all what you need specially it has Android 11 and 16 gb internal memory, Herman /JBL sound system. You will not get this even at double price from known Brands. Also it is not Chinese",
            "💯 awesome 👌",
            "Good",
            "This products is best",
            "Good Sound and picture Very good Tv",
            "Good tv in this prize",
            "Good picture quality. Sound quality super",
            "Sound and picture quality is awesome.\nInternet connectivity is also very good. So go for it.",
            "Worth 👍",
            "Good product\nAnd customer support is very helping ,& good\nSpecially Anuja mam",
            "Superb....value of money....\nSound wow",
            "So far performance is good hope this continues sound quality is good but not the best picture quality is satisfactory no lag time remote working perfect.",
            "Best product",
            "Nice product. Nokia new launch tv is good. Picture quality superb. Sound is inbuilt very awesome.",
            "Best value for money 4k Led Tv with such an amazing sound. Must buy if anyone is planning to. Investment in this product will not be an disappointment.",
            "Overall good product from nokia tvs",
            "Value fr mny picture nd sound gud",
            "Value for money",
            "Excellent",
            "one of finest tv in this range and sound output is awsum....mindblowing",
            "Good product",
            "a very satisfying product for the given price . all worth.",
            "Picture quality & sound both are good.\nConnectivity supper",
            "Outstanding",
            "Awesome product with best price.one drop,startup is lagging.Audio - harman and JBL is mind blowing in maximum volume.picture quality - excellent with online and hd connectivity and not so bad with sd.I used and rewiew after 45days.proper shutdown is must required.",
            "Good product",
            "It was awesome !! Delivery and installation is on time as agreed. Thank you Flipkart Team !",
            "The best part is sound, picture and build quality",
            "Very good picture quality",
            "It's a great Smart tv....sound is one of the best. Software sometimes stuck, it's may be because of apps. Rest all is superb",
            "Satisfied",
            "Nice product",
            "nice quality product",
            "Super tv at this price. Very good sound. You can say jabardst sound. Good picture quality but not perfect. But very good compare to samsung mi or realmi etc. Good connectivty. Screen cast mirroring in video is slow and not play continuously speedy. But i am satisfied at this price. Thanks fliipkart. Good customer care staff and good instalation man very cooperative",
            "Awesome tv",
            "If you willing to buy simply go for it.\nI am using from 4 days and felt awesome.\nUndoubtedly don't waste time go for it.\nPicture quality and sound are excellent.",
            "Super product",
            "Best",
            "Valuable Product for Money. Awesome sound effects with extremely Wooow Picture quality.",
            "Picture quality is good and looks premium.\nDelivery in time .\nSound quality is superb.....go for it.",
            "Good quality",
            "Product is okay. Picture quality and sound quality is awesome. Software is little bit lagging. Need to connect remote every time switching on the tv.",
            "Product is good . picture quality is superb...",
            "sound is very good but picture quality is not very good...",
            "Good experience",
            "Verey nice",
            "Sound is awesome 😘. HD picture quality is more Cristal clear.",
            "It's a great picture quality and pixels in HDR\nThe sound quality is amazing with bass\nWorth for money",
            "Super, Go for it",
            "A value for money product. Picture and sound is good. Remote should improve. In movie mode sound is loud in songs but less in dialogue. Needs improvement. Rest all better.",
            "Video and audio are good. Due to good base sometimes dialogues aren't that clear, u have to adjust. And i feel it lags and it may be due to heavy android 11. Aspect ratio can't be changed that's also an issue. Although biggest -ve for me is lagging performance.",
            "Excellent TV, value for money but installation person did not fit the TV properly. He did not explain proper in demo.",
            "Good picture and sound but only. We face bluetooth connectivity issue",
            "- Not satisfied with Video quality (extra whitish and yellowish)\n- Chromecast is not well supported with all applications (may be fixed with software update by nokia)\n\nRest all good.",
            "Good TV for the price",
            "It's fine budget TV\nIt's picture quality is just fine moderate\nAnd it's sound is also good but not best\nIt's sometimes lags on the home page\nBut it's home page is user friendly\nIt's connectivity was out of the box\nInstallation was also very easy and installation team is also costumer friendly\nNokia customer care is awesome\n\nMy overall review is that it's better TV than the all TV in this budget but if you can extent your budget than I would recommend to go with Samsung's and LG TV's",
            "After viewing for two weeks I am writing the review. Grt specifications with latest operating system Android 11. Grt picture quality. 4k videos just awesome. Sound effect is just awesome sound bar not required. One issue that I had faced is that the USB ports r not detected the contents of Pen Drive . Request Flipkart to resolve the issue.",
            "BEST TV EVER\nPERIOD",
            "Very good picture quality and sound is awesome..\nRemote is IR so you have to point it straight to the TV. It's not working if you close the IR lid.\n\nCould see a lag between remote button press and response in tv.\n\nClear visible mm of gap between the panel and the screen. So should be handled carefully.",
            "Bluetooth speaker connecting very bad. Software hanging out with Ads.",
            "Audio and video out of sync while watching dth HD channels.",
            "Worth every single penny, just go for it",
            "Low brightness if using in hall where sunlight comes.\nBrightness is good for eyes.\nGood picture quality.\nLate installation after a week of delivery.\nMay be due to big billion sale.\nNice tv satisfied after using around one month.\n\nRemote is Little unresponsive.\n\nSwitch on/off button doesn't work most of the time.",
            "I think it has everything what I was looking for, Thank you Flipkart and Nokia",
            "Overall good quality picture and Sound. Some connectivity lagging on remote",
            "Best in class",
            "Sound is excellent on this tv",
            "Actually the tv quality is matching to the brand name very good product from nokia",
            "Overall its good in the budget segment",
            "Sound quality is awesome.. Picture quality is also good.I feel some problem with USB drive.May be corrected with service.",
            "Nice product in this range...",
            "Display and sound quality is very good",
            "In my initial opinion tv needs a software update because Everytime Remote and tv Bluetooth pairing is a issue for me. Otherwise it has Good picture and awesome sound quality.",
            "Excellent product & adio quality very good",
            "If u want best speakers and 4k tv then go fr it.",
            "best value for money tv. a trusted brand like nokia have really delivered a well designed tv at a budget friendly rate.",
            "Worth to buy",
            "Best tv in this price segment.\n\nDisplay: 9/10\nAudio: 10/10\nUI: 7/10\nRemote/Google Assistant: 9/10\nConnectivity:10/10",
            "Best TV 2021\nBest sound system",
            "Awesome product, amazing picture quality and sound both.",
            "Good tv 🙂",
            "Picture 9/10\nSound 10/10",
            "Very nice TV",
            "Tv is very good value for money but the installation is on the late day of date of tv devilvery",
            "Best value for money",
            "Sound best, display good",
            "Awesome jbl sound and tv",
            "Good one go for ts...at this price range..",
            "Good product compare to others brands.",
            "very good tv brightness picture quality sound also good but best tv in budget range",
            "Value for money tv. Sound is good. Picture quality not bad. Overall good experience",
            "Installation is very good",
            "picture and sound quality is very good build quality is wow 😊 happy to buy",
            "Delayed in installation but value for money TV. Best picture and sound experience.",
            "Best TV"
        ],
        "likes": [
            "153",
            "225",
            "40",
            "98",
            "48",
            "38",
            "3",
            "14",
            "15",
            "10",
            "2",
            "2",
            "16",
            "2",
            "2",
            "0",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "2",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "5",
            "16",
            "24",
            "18",
            "18",
            "23",
            "31",
            "9",
            "7",
            "7",
            "12",
            "6",
            "4",
            "5",
            "10",
            "7",
            "11",
            "4",
            "2",
            "12",
            "15",
            "8",
            "3",
            "3",
            "3",
            "3",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "2",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "2",
            "2",
            "2",
            "1",
            "1",
            "2",
            "1",
            "2",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "3",
            "2",
            "6",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "58",
            "152",
            "8",
            "65",
            "12",
            "17",
            "0",
            "0",
            "1",
            "2",
            "0",
            "0",
            "16",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "1",
            "1",
            "1",
            "3",
            "3",
            "0",
            "2",
            "1",
            "0",
            "2",
            "5",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "3",
            "0",
            "0",
            "3",
            "6",
            "2",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "1",
            "18",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Does the 43 inch model have 60 watt jbl speakers too, and why there is no video of this model in youtube",
            "Q:What's the difference between JBL model and Onkyo model besides the said difference? Why two versions?",
            "Q:Nokia claim 400 nits brightness How accurate brightness in this tv",
            "Q:Does this tv support dolby vision + dolby atoms ?",
            "Q:Do we have AV input to connect old DVD players with out hdmi port",
            "Q:Is it possible to have sound from tv and connected bluetooth soundbar togeather?",
            "Q:Does it support 5Ghz wifi internet connection?",
            "Q:Can someone confirm if the TV has HDMI 2.1? I cannot find the information anywhere. It's very important",
            "Q:It's ips panel or va panel",
            "Q:Can this TV play all type of video formats? Like mkv,avi,mp4 etc..",
            "Q:Hdmi 2.1 or 2.0 in this tv",
            "Q:How many years does this tv get android updates",
            "Q:It's comes in 65 inch in 60 Watt JBL speaker ??",
            "Q:How is the quality of sd channel",
            "Q:Does it support AirPlay 2?",
            "Q:What is the actual frame rate for videos?",
            "Q:Can I connect Bluetooth headphone with this TV..?",
            "Q:Nokia LED tv comes with JBL sound bar or built-in speaker",
            "Q:Can I connect tv to a web can for video call on zoom or google deo etc ??",
            "Q:Gcmob application r installed playstore in this tv?",
            "Q:Can I contact pc like a monitor?",
            "Q:Is this tv support normal set top box or i have to take hd set top box ?",
            "Q:Does this TV Support android Mobile.?",
            "Q:Ethernet is available in this tv",
            "Q:Can we operate nokia tv with Android mobile.?",
            "Q:Is this a qled tv, is this qled tv",
            "Q:Does This TV support Airplay?",
            "Q:How is the WiFi connectivity of the TV?. does it get ON OFF constantly while in operation?",
            "Q:Does this TV has picture UPSCALING feature? Thanks.",
            "Q:It has eARC port or not",
            "Q:is there any lag issues on audio and video synchronisation?",
            "Q:What is the RAM size available?",
            "Q:Can i play high end games through as pc monitor on 60fps?",
            "Q:Can I get dolby sound effect after connecting external dolby soundbar?",
            "Q:Additional Sound barr is there?",
            "Q:Is there any heating issues.. after using",
            "Q:Can we attach wireless keyboard",
            "Q:Does this tv support Apple Airplay ?",
            "Q:Does TV have a combi remote?",
            "Q:Do I get a wall mount with the TV?",
            "Q:Does Google cast work via WiFi-direct?",
            "Q:What is the viewing angle for VA panel?",
            "Q:What is ROM size?",
            "Q:How to perform a Firmware / Software update on Android TVs ?",
            "Q:Can I use my mobile hotspot to connect to Nokia Smart TV?",
            "Q:Does the TV have any pre-loaded Apps?",
            "Q:TV is not detecting my USB. What should I do?",
            "Q:How do I login into Google App store?",
            "Q:Can we install Netflix from the play store ?",
            "Q:Dolby Atmos lagging via bluetooth in stereo speakers sound box.. lagging in earphone also via bluetooth..any manufacturing defect?",
            "Q:How Google certified Android TV is different from a normal Smart TV?",
            "Q:My TV has become slow. What would be the reason?",
            "Q:Is there any app available on Google play store to recognize manufacturer and system specifications?",
            "Q:How much internet speed is sufficient for smooth performance?",
            "Q:Are both technologies Miracast and Chromecast available on this TV?",
            "Q:Does it have a web browser?",
            "Q:Does this TV support Netflix, prime video, Disney+hotstar, Zee5, Voot, AltBalaji, Sonyliv, Erosnow, Spotify?",
            "Q:Is it having DLED or ELED?",
            "Q:Onkyo model of nokia have good picture quality or not as compared to new model 2021 of nokia Does there is any significant benefits in new model except jbl sound bar coz i have one",
            "Q:Is there any light bleeding issues ??",
            "Q:Is this TV come with eARC?",
            "Q:What is the TV start up time?",
            "Q:Can I cast iPhone using Google Chromecast or any other cast option?",
            "Q:Does it have a VA panel?",
            "Q:Does this TV support eARC?",
            "Q:How to bring application on main screen tv?",
            "Q:Is this tv inbult stabilizer??",
            "Q:Does this tv require stabilizer?",
            "Q:2020 & 2021 model have a difference of dolby vision does dolby vision worth to spend 4k more on new model",
            "Q:Is the remote universal and does it work with a set top box?",
            "Q:Does it support multi tasking?",
            "Q:Can I play games on this TV? Does it have pre-loaded games?",
            "Q:This tv display touchscreen?",
            "Q:Does it support SD channels?",
            "Q:Does this tv has headphone jack?",
            "Q:Why power button doesn't work most of the times?",
            "Q:Which TV best hisense tornado vs Nokia",
            "Q:Onkyo model &Jbl model led tv which is better tv...??",
            "Q:Far field mic is there",
            "Q:Have this screen mirroring in this TV?",
            "Q:TV has wifi or not",
            "Q:Can I use mouse and keyboard with USB for better experience???",
            "Q:This tv support computer",
            "Q:Is it QLED OR OLED ?",
            "Q:Which type of wall mount comes with this TV ? And what is the VESA range?",
            "Q:It is DTH support or not",
            "Q:Can we change aspect ratio of a video on this TV?",
            "Q:Can we operate this nokia tv with Android mobile.?",
            "Q:Nokia 4k ultra hd vs Samsung crystal 4k hd tv which one is bettar??",
            "Q:It has EARC or not",
            "Q:Does the tv has hotspot ??",
            "Q:It has Alexa voice control",
            "Q:It has earc hdmi port",
            "Q:Is screen sharing from mobile is available ?",
            "Q:Does the tv have all 3 hdmi pots with 2.1?",
            "Q:Does this TV support 10 bit pannel/1.07 Billion colors?",
            "Q:Is it 5 start or 4 star in power consumption.",
            "Q:Does it have voice search remote?",
            "Q:Does it support hard disk ?",
            "Q:Does it have Optical audio",
            "Q:Manufacturing year of it?",
            "Q:This Tv Support e ARC",
            "Q:Do I get a wall mount with the TV?",
            "Q:Does the tv has hotspot ??",
            "Q:Does Google cast work via WiFi-direct?",
            "Q:What is ROM size?",
            "Q:Is there any app available on Google play store to recognize manufacturer and system specifications?",
            "Q:How to perform a Firmware / Software update on Android TVs ?",
            "Q:Are both technologies Miracast and Chromecast available on this TV?",
            "Q:Does it support multi tasking?",
            "Q:Can we install Netflix from the play store ?",
            "Q:Can I cast iPhone using Google Chromecast or any other cast option?",
            "Q:Does TV have a combi remote?",
            "Q:What is the TV start up time?",
            "Q:How much internet speed is sufficient for smooth performance?",
            "Q:Is the remote universal and does it work with a set top box?",
            "Q:Does it have a web browser?",
            "Q:Does this TV support Netflix, prime video, Disney+hotstar, Zee5, Voot, AltBalaji, Sonyliv, Erosnow, Spotify?",
            "Q:Does it have a VA panel?",
            "Q:Can I use my mobile hotspot to connect to Nokia Smart TV?",
            "Q:What is the viewing angle for VA panel?",
            "Q:My TV has become slow. What would be the reason?",
            "Q:TV is not detecting my USB. What should I do?",
            "Q:Does the TV have any pre-loaded Apps?",
            "Q:Does this TV support eARC?",
            "Q:Can I play games on this TV? Does it have pre-loaded games?",
            "Q:Is it having DLED or ELED?",
            "Q:What is ROM size?",
            "Q:Are both technologies Miracast and Chromecast available on this TV?",
            "Q:Do I get a wall mount with the TV?",
            "Q:Does it have a web browser?",
            "Q:Does it support multi tasking?",
            "Q:What is the TV start up time?",
            "Q:Is there any app available on Google play store to recognize manufacturer and system specifications?",
            "Q:How to perform a Firmware / Software update on Android TVs ?",
            "Q:How much internet speed is sufficient for smooth performance?",
            "Q:Is the remote universal and does it work with a set top box?",
            "Q:Does Google cast work via WiFi-direct?",
            "Q:Can I cast iPhone using Google Chromecast or any other cast option?",
            "Q:My TV has become slow. What would be the reason?",
            "Q:Can I use my mobile hotspot to connect to Nokia Smart TV?",
            "Q:Does this TV support eARC?",
            "Q:Does the TV have any pre-loaded Apps?",
            "Q:Can I play games on this TV? Does it have pre-loaded games?",
            "Q:Does TV have a combi remote?",
            "Q:Can we install Netflix from the play store ?",
            "Q:TV is not detecting my USB. What should I do?",
            "Q:Does it have a VA panel?",
            "Q:What is the viewing angle for VA panel?",
            "Q:How to perform a Firmware / Software update on Android TVs ?",
            "Q:How much internet speed is sufficient for smooth performance?",
            "Q:Does Google cast work via WiFi-direct?",
            "Q:Does it have a web browser?",
            "Q:What is the TV start up time?",
            "Q:Is there any app available on Google play store to recognize manufacturer and system specifications?",
            "Q:Do I get a wall mount with the TV?",
            "Q:What is ROM size?",
            "Q:Does this TV support Netflix, prime video, Disney+hotstar, Zee5, Voot, AltBalaji, Sonyliv, Erosnow, Spotify?",
            "Q:Is it having DLED or ELED?",
            "Q:Can we install Netflix from the play store ?",
            "Q:Is the remote universal and does it work with a set top box?",
            "Q:Are both technologies Miracast and Chromecast available on this TV?",
            "Q:TV is not detecting my USB. What should I do?",
            "Q:Does it have a VA panel?",
            "Q:Can I cast iPhone using Google Chromecast or any other cast option?",
            "Q:Does TV have a combi remote?",
            "Q:Does it support multi tasking?",
            "Q:What is the viewing angle for VA panel?",
            "Q:Can I use my mobile hotspot to connect to Nokia Smart TV?",
            "Q:Does this TV support eARC?",
            "Q:Does the TV have any pre-loaded Apps?",
            "Q:Is it having DLED or ELED?",
            "Q:Can I play games on this TV? Does it have pre-loaded games?",
            "Q:Does this TV support Netflix, prime video, Disney+hotstar, Zee5, Voot, AltBalaji, Sonyliv, Erosnow, Spotify?",
            "Q:My TV has become slow. What would be the reason?"
        ],
        "answers": [
            "A:yes",
            "A:Apart from being leaders in there respective catagory regarding sound quality the only difference in pricing is of the wattage difference being JBL has higher wattage compared to onkyo",
            "A:No",
            "A:Yes and no need to add any other sound system because it's have inbuilt sound bar and sound it's awesome like theatre",
            "A:Yes it has",
            "A:Yes I have connected my home theatre via bluetooth and its playing good no isse go with it..",
            "A:Yes it does.",
            "A:yes it has 2.1HDMi port",
            "A:va",
            "A:Yes, very good tv",
            "A:Both are available HDMI port 1 is 2.1",
            "A:3years",
            "A:yes",
            "A:Sd upscaling is good overall good Tv not exceptionally well as expected being 4K tv",
            "A:no. only Chromecast.",
            "A:24fps.30fps",
            "A:yes. but the blutooth function is not good. connection keeps on breaking. hope it betters with update.",
            "A:its a built in speaker powered by jbl and Harman. sound is better than other tvs.",
            "A:Yes",
            "A:No",
            "A:Yes. You can connect your PC with any HDMI cable to your TV and it will work as a monitor for you.",
            "A:If you want to utilise 4k resolution, HD settop box is needed.",
            "A:Yes",
            "A:no",
            "A:Yes",
            "A:No.",
            "A:yes",
            "A:no. it's working seemlessly",
            "A:yes",
            "A:Yes",
            "A:around 1 minute booting time everytime otherwise everything awesome",
            "A:2gb",
            "A:no",
            "A:Yes it should,",
            "A:Not sound bar, but it's good, if you don't need a heavy bass music, but it depend on why type of sound you listen to. if you really want sound bar very good on not just loudness, unless you need",
            "A:No",
            "A:I tried but can't able to connect.",
            "A:will check and confirm you",
            "A:Yes, the TV remote is IR+Bluetooth",
            "A:Yes, wall mount comes free with Nokia Smart TV. Apart from the wall mount, the stylish metal stand will also come for free.",
            "A:No, It works only when TV and phone are connected to the same Wi-Fi router",
            "A:VA panel has 178 degree viewing angle.",
            "A:ROM size is 16GB, but around 11GB is available to install the apps, as the rest of the ROM used for Operating System usage.",
            "A:Whenever a new version is available, a notification will pop-up on your TV screen or you can also check in settings for system updates for available OTA updates.",
            "A:Yes, you can use your mobile hotspot to connect to Nokia Smart TV but it should have a good network speed to function smoothly.",
            "A:Nokia Smart TV comes with preloaded official apps like Netflix, Prime Video, Youtube, Google Playstore, Google Movie, Google Music, Google Game etc.",
            "A:Please download ES file explorer/other file manager and explore your USB files through mentioned application.",
            "A:When you switch ON the TV for the first time, you need to follow the process of sign in with your Google account and after that you can access all Google apps.",
            "A:Netflix is already pre-installed on the TV",
            "A:Looks like it works perfectly if the bluetooth audio device is placed close to the TV. I faced intermittent disconnection with the bluetooth earphone when placed more than 2 meters from TV.",
            "A:Official Google Android TV has Google TV Launcher, Google Search and Google Assistant, unrestricted access to Google Play store and many other features.",
            "A:This TV works like any other Android device such as Android mobile phones. Please check the memory consumption and number of downloaded apps & clear cache memory timely to improve system performance.",
            "A:No app can detect TV�s system specifications. No access is given to external app developers.",
            "A:Minimum 40 MBPS Speed is sufficient for smooth performance.",
            "A:Only Chromecast is available on this TV. TV won't support Miracast.",
            "A:It doesn�t come with any pre installed web browser but you can download via Google play store.",
            "A:Yes, it supports all of the aforementioned applications.",
            "A:Yes, this TV has DLED.",
            "A:The sound output is 60w in the latest version compared to 48w in the earlier version. Also, it comes with Android 11 and dual band WiFi.",
            "A:As of now not saw something related ..",
            "A:Yes, this TV comes with eARC",
            "A:First boot up time takes around 1-2 mins. If it is not switched off from main power then it will just take 30s to start.",
            "A:Yes, this TV comes with an in-built app called Fastcast through which you can cast iphone/ipad",
            "A:Yes, It has a VA panel.",
            "A:Yes, this TV supports eARC.",
            "A:long press on app and add to homescreen",
            "A:No, but it doesn't require one. You can connect it to a inverter to be on safeside. We all have inverters in india except buildings on diesel powered generators backup.",
            "A:Yes",
            "A:yes ...",
            "A:No, it is not a universal remote and unfortunately it won't work with a set top box. You need to use a separate remote for a set top box.",
            "A:No, it doesn�t support multi tasking.",
            "A:No, it doesn�t have any preloaded games. Although, you can download games from �Google Play Games� and then you can play them.",
            "A:No",
            "A:Yes",
            "A:No",
            "A:it works but battery position in remote is a problem. keep sponge inside remote .",
            "A:i can't say about hisen, but I am using Nokia 50 ultra 4k. it requires good network connection or else we can't feel real picture quality. Sound system is vmgood. picture quality ok ok type.",
            "A:JBL",
            "A:No just the Mic of remote",
            "A:Yes",
            "A:yes",
            "A:Yes",
            "A:yes",
            "A:Oled",
            "A:Stady type of wall mount not moving one and vesa range 400*400",
            "A:only hd",
            "A:Yes",
            "A:yes",
            "A:It's Nokia, Android unlimited apps, Samsung is not Android, limited to Samsung selected apps only. So I bought Nokia, it's good Plus JBL sound is good.",
            "A:Yes it does support EARC.",
            "A:No... Tv has WIFI ...",
            "A:No Google assistant.",
            "A:Yes",
            "A:yes",
            "A:yes",
            "A:Yes, it pop up natural colours,",
            "A:5 star",
            "A:Yes",
            "A:yes it do",
            "A:Yes",
            "A:October 2021",
            "A:yes, and from setting u need to on it",
            "A:Yes, wall mount comes free with Nokia Smart TV. Apart from the wall mount, the stylish metal stand will also come for free.",
            "A:Yes",
            "A:No, It works only when TV and phone are connected to the same Wi-Fi router",
            "A:ROM size is 16GB, but around 11GB is available to install the apps, as the rest of the ROM used for Operating System usage.",
            "A:No app can detect TV�s system specifications. No access is given to external app developers.",
            "A:Whenever a new version is available, a notification will pop-up on your TV screen or you can also check in settings for system updates for available OTA updates.",
            "A:Only Chromecast is available on this TV. TV won't support Miracast.",
            "A:No, it doesn�t support multi tasking.",
            "A:Netflix is already pre-installed on the TV",
            "A:Yes, this TV comes with an in-built app called Fastcast through which you can cast iphone/ipad",
            "A:Yes, the TV remote is IR+Bluetooth",
            "A:First boot up time takes around 1-2 mins. If it is not switched off from main power then it will just take 30s to start.",
            "A:Minimum 40 MBPS Speed is sufficient for smooth performance.",
            "A:No, it is not a universal remote and unfortunately it won't work with a set top box. You need to use a separate remote for a set top box.",
            "A:It doesn�t come with any pre installed web browser but you can download via Google play store.",
            "A:Yes, it supports all of the aforementioned applications.",
            "A:Yes, It has a VA panel.",
            "A:Yes, you can use your mobile hotspot to connect to Nokia Smart TV but it should have a good network speed to function smoothly.",
            "A:VA panel has 178 degree viewing angle.",
            "A:This TV works like any other Android device such as Android mobile phones. Please check the memory consumption and number of downloaded apps & clear cache memory timely to improve system performance.",
            "A:Please download ES file explorer/other file manager and explore your USB files through mentioned application.",
            "A:Nokia Smart TV comes with preloaded official apps like Netflix, Prime Video, Youtube, Google Playstore, Google Movie, Google Music, Google Game etc.",
            "A:Yes, this TV supports eARC.",
            "A:No, it doesn�t have any preloaded games. Although, you can download games from �Google Play Games� and then you can play them.",
            "A:Yes, this TV has DLED.",
            "A:ROM size is 16GB, but around 11GB is available to install the apps, as the rest of the ROM used for Operating System usage.",
            "A:Only Chromecast is available on this TV. TV won't support Miracast.",
            "A:Yes, wall mount comes free with Nokia Smart TV. Apart from the wall mount, the stylish metal stand will also come for free.",
            "A:It doesn�t come with any pre installed web browser but you can download via Google play store.",
            "A:No, it doesn�t support multi tasking.",
            "A:First boot up time takes around 1-2 mins. If it is not switched off from main power then it will just take 30s to start.",
            "A:No app can detect TV�s system specifications. No access is given to external app developers.",
            "A:Whenever a new version is available, a notification will pop-up on your TV screen or you can also check in settings for system updates for available OTA updates.",
            "A:Minimum 40 MBPS Speed is sufficient for smooth performance.",
            "A:No, it is not a universal remote and unfortunately it won't work with a set top box. You need to use a separate remote for a set top box.",
            "A:No, It works only when TV and phone are connected to the same Wi-Fi router",
            "A:Yes, this TV comes with an in-built app called Fastcast through which you can cast iphone/ipad",
            "A:This TV works like any other Android device such as Android mobile phones. Please check the memory consumption and number of downloaded apps & clear cache memory timely to improve system performance.",
            "A:Yes, you can use your mobile hotspot to connect to Nokia Smart TV but it should have a good network speed to function smoothly.",
            "A:Yes, this TV supports eARC.",
            "A:Nokia Smart TV comes with preloaded official apps like Netflix, Prime Video, Youtube, Google Playstore, Google Movie, Google Music, Google Game etc.",
            "A:No, it doesn�t have any preloaded games. Although, you can download games from �Google Play Games� and then you can play them.",
            "A:Yes, the TV remote is IR+Bluetooth",
            "A:Netflix is already pre-installed on the TV",
            "A:Please download ES file explorer/other file manager and explore your USB files through mentioned application.",
            "A:Yes, It has a VA panel.",
            "A:VA panel has 178 degree viewing angle.",
            "A:Whenever a new version is available, a notification will pop-up on your TV screen or you can also check in settings for system updates for available OTA updates.",
            "A:Minimum 40 MBPS Speed is sufficient for smooth performance.",
            "A:No, It works only when TV and phone are connected to the same Wi-Fi router",
            "A:It doesn�t come with any pre installed web browser but you can download via Google play store.",
            "A:First boot up time takes around 1-2 mins. If it is not switched off from main power then it will just take 30s to start.",
            "A:No app can detect TV�s system specifications. No access is given to external app developers.",
            "A:Yes, wall mount comes free with Nokia Smart TV. Apart from the wall mount, the stylish metal stand will also come for free.",
            "A:ROM size is 16GB, but around 11GB is available to install the apps, as the rest of the ROM used for Operating System usage.",
            "A:Yes, it supports all of the aforementioned applications.",
            "A:Yes, this TV has DLED.",
            "A:Netflix is already pre-installed on the TV",
            "A:No, it is not a universal remote and unfortunately it won't work with a set top box. You need to use a separate remote for a set top box.",
            "A:Only Chromecast is available on this TV. TV won't support Miracast.",
            "A:Please download ES file explorer/other file manager and explore your USB files through mentioned application.",
            "A:Yes, It has a VA panel.",
            "A:Yes, this TV comes with an in-built app called Fastcast through which you can cast iphone/ipad",
            "A:Yes, the TV remote is IR+Bluetooth",
            "A:No, it doesn�t support multi tasking.",
            "A:VA panel has 178 degree viewing angle.",
            "A:Yes, you can use your mobile hotspot to connect to Nokia Smart TV but it should have a good network speed to function smoothly.",
            "A:Yes, this TV supports eARC.",
            "A:Nokia Smart TV comes with preloaded official apps like Netflix, Prime Video, Youtube, Google Playstore, Google Movie, Google Music, Google Game etc.",
            "A:Yes, this TV has DLED.",
            "A:No, it doesn�t have any preloaded games. Although, you can download games from �Google Play Games� and then you can play them.",
            "A:Yes, it supports all of the aforementioned applications.",
            "A:This TV works like any other Android device such as Android mobile phones. Please check the memory consumption and number of downloaded apps & clear cache memory timely to improve system performance."
        ],
        "likes": [
            "17",
            "11",
            "12",
            "3",
            "2",
            "3",
            "1",
            "2",
            "1",
            "2",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "12",
            "56",
            "26",
            "8",
            "35",
            "6",
            "6",
            "6",
            "11",
            "9",
            "8",
            "4",
            "7",
            "5",
            "3",
            "4",
            "3",
            "3",
            "3",
            "7",
            "4",
            "1",
            "3",
            "5",
            "5",
            "3",
            "5",
            "1",
            "1",
            "2",
            "1",
            "2",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "3",
            "4",
            "9",
            "1",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "2",
            "19",
            "9",
            "3",
            "17",
            "0",
            "1",
            "1",
            "3",
            "3",
            "2",
            "0",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    }
}