{
    "title": "Moto G71 5G (Arctic Blue, 128 GB)  (6 GB RAM)",
    "product_specification": {
        "In The Box": "Handset, Charger, USB Cable, Guides, Sim Tool, Protective Cover",
        "Model Number": "PAS20001IN",
        "Model Name": "G71 5G",
        "Color": "Arctic Blue",
        "Browse Type": "Smartphones",
        "SIM Type": "Dual Sim",
        "Hybrid Sim Slot": "No",
        "Touchscreen": "Yes",
        "OTG Compatible": "Yes",
        "Sound Enhancements": "Dolby Atmos",
        "SAR Value": "Head: 1.03 W/kg at 1g, Body: 1.16 W/kg at 1g",
        "Display Size": "16.26 cm (6.4 inch)",
        "Resolution": "2400 x 1080 Pixels",
        "Resolution Type": "Full HD+ AMOLED Display",
        "GPU": "Qualcomm Adreno 619",
        "Display Type": "Full HD+ AMOLED Display",
        "Other Display Features": "60 Hz Refresh Rate, 20:9 Aspect Ratio, Screen-to-Body Ratio (Active Area-Touch Panel (AA-TP)): 88.8%",
        "Operating System": "Android 11",
        "Processor Type": "Qualcomm Snapdragon 695",
        "Processor Core": "Octa Core",
        "Primary Clock Speed": "2.2 GHz",
        "Operating Frequency": "5G NR: n1/n3/n5/n7/n8/n20/n28/n38/n40/n41/n66/n77/n78, 4G LTE: B1/B2/B3/B4/B5/B7/B8/B12/B13/B17/B18/B19/B20/B26/B28/B32/B38/B40/B41/B42/B43/B66, 3G WCDMA: B1/B2/B5/B8, 2G GSM: B2/B3/B5/B8",
        "Internal Storage": "128 GB",
        "RAM": "6 GB",
        "Primary Camera Available": "Yes",
        "Primary Camera": "50MP + 8MP + 2MP",
        "Primary Camera Features": "Triple Camera Setup: 50 MP (f/1.8 Aperture, 1.28um Pixel Size, Quad Pixel Technology, PDAF) + 8 MP Depth Camera (f/2.2 Aperture, 1.12um Pixel Size, 118 Degree Ultra-Wide Angle) + 2 MP Macro Camera (f/2.4 Aperture, 1.75um Pixel Size), Camera Feature: Dual Capture, Spot Color, Night Vision, Macro Vision, Cinemagraph, Portrait, Cutout, Live Filter, Panorama, AR Stickers, Pro Mode (W/ Long Exposure), Smart Composition, Shot Optimization, Auto Smile Capture, Google Lens Integration, High-Res Digital Zoom (Upto 8x), RAW Photo Output, HDR, Timer, Active Photos, Burst Shot, Assistive Grid, Leveler, Watermark, Barcode Scanner, Video Features: Dual Capture, Spot Color, Timelapse (W/ Hyperlapse), Macro, Slow Motion, Video Stabilization, Video Snapshot",
        "Secondary Camera Available": "Yes",
        "Secondary Camera": "16MP Front Camera",
        "Secondary Camera Features": "16 MP Camera Setup: (f/2.2 Aperture, 1.0um Pixel Size), Camera Feature: Dual Capture, Spot Color, Night Vision, Cinemagraph, Portrait, Live Filter, Group Selfie, Pro Mode (W/ Long Exposure), Low Light AI Selfie, Shot Optimization, Auto Smile Capture, Gesture Capture, Selfie Animation, Face Beauty, RAW Photo Output, HDR, Timer, Active Photos, Assistive Grid, Leveler, Watermark, Burst shot, Video Feature: Dual Capture, Spot Color, Timelapse (W/ Hyperlapse), Slow Motion, Video Stabilization, Face Beauty, Video Snapshot",
        "Flash": "Rear - Single LED Flash",
        "HD Recording": "Yes",
        "Full HD Recording": "Yes",
        "Video Recording Resolution": "Rear Camera: Rear Main Camera: 1080p (at 60 fps/ 30 fps), Rear Ultra-Wide Angle Camera: 1080p (at 30 fps), Rear Macro Camera: 720p (at 30 fps)| Front Camera: 1080p (at 30 fps)",
        "Digital Zoom": "8x",
        "Frame Rate": "30 fps, 60 fps",
        "Dual Camera Lens": "Primary Camera",
        "Network Type": "5G, 4G, 3G, 2G",
        "Supported Networks": "5G, 4G LTE, WCDMA, GSM",
        "Internet Connectivity": "5G, 4G, 3G, EDGE, Wi-Fi",
        "Bluetooth Support": "Yes",
        "Bluetooth Version": "v5.0",
        "Wi-Fi": "Yes",
        "Wi-Fi Version": "802.11 a/b/g/n/ac (2.4 GHz | 5.0 GHz)",
        "Wi-Fi Hotspot": "Yes",
        "NFC": "Yes",
        "USB Connectivity": "Yes",
        "Audio Jack": "3.5mm",
        "GPS Support": "Yes",
        "Smartphone": "Yes",
        "SIM Size": "Nano Sim",
        "Graphics PPI": "409 PPI",
        "Sensors": "Fingerprint Reader, Proximity Sensor, Accelerometer, Ambient Light Sensor, SAR Sensor, Gyroscope",
        "Upgradable Operating System": "Quarterly Security Update",
        "Other Features": "Plastic Body, Water Repellent Design, 33 W Turbo Power Charger, Bottom Ported Loudspeaker, 2 Microphones, Face Unlock, Google Assistant, Charging Time: 50% in 20 mins and 100% in 60 mins",
        "GPS Type": "GPS, A-GPS, LTEPP, SUPL, GLONASS, GALILEO",
        "FM Radio": "Yes",
        "Battery Capacity": "5000 mAh",
        "Width": "73.87 mm",
        "Height": "161.19 mm",
        "Depth": "8.49 mm",
        "Weight": "179 g",
        "Warranty Summary": "1 Year on Handset and 6 Months on Accessories",
        "Domestic Warranty": "1 Year"
    },
    "product_description": {
        "Powerful Qualcomm Snapdragon 695 Processor": "The moto g71 5G features Qualcomm Snapdragon 695 5G Processor to deliver fast graphics card performance, thus transforming your gaming experience into a realistic one. Also, this mobile phone comes with 6 GB of RAM and an expanded 2 GB of RAM so that you can seamlessly multitask between apps.",
        "True 5G with 13 Global 5G Bands": "Enjoy connecting to blazing-fast 5G networks and download your favourite shows within a few seconds, and stream videos with a significant lag, as this moto g71 mobile phone comes with a fast 5G connection.",
        "Smooth and Vibrant Display": "Experience every content coming back to life on the 16.25 cm (6.4) AMOLED FHD display that comes with a 409 PPI pixel density and can reach up to 700 nits brightness to make visuals look true to life. As a result, you can enjoy crystal-clear visuals featuring dark blacks for enhanced brightness and contrasts.",
        "ThinkShield Security for Mobile": "Stay protected with ThinkShield security on this moto g71 5G mobile phone. This business-grade security helps to safeguard your data from malware, phishing and other threats through multiple layers of protection and advanced security.",
        "50 MP Quad Function Camera": "Flaunt your 50 MP Quad Function Camera System that lets you capture your special moments in vividly-clear shots under any light. And, with its 8 MP Ultrawide and 8 MP Depth Sensor and Macro Vision Camera, you can enjoy capturing low-light photos and detailed close-ups shots.",
        "Blazing-fast 5000 mAh Battery": "You don't have to be tired of your phone’s battery running out soon, thanks to the massive 5000 mAh Battery in the new moto g71 5G. Work, play games, stream movies, video chat with your friends, and do more for up to 30 hours on a single full charge. And, with 33 W TurboPower charging, your phone gets charged up in just 30 minutes so that you can go back to using your phone as soon as possible.",
        "Stunning Design": "This mobile phone comes with a curved body featuring rounded corners so that you can enjoy immersive usage on its expanded screen as well as enjoy good looks while you carry it outside.",
        "Massive Storage Capacity": "Thanks to the built-in 128 GB of storage capacity on this mobile phone, you can have ample space for storing your favourite photos, videos, and other necessities in one place.",
        "Near-stock Android Experience": "You don’t have to go through the hassle of duplicate apps and clunky ads, as this mobile comes with a Near-stock Android experience that allows you to manage your privacy settings, conversations, and more.",
        "IP52 Water-repellent Design": "Thanks to the water-repellent design, you don't have to worry about spills and splashes damaging your phone’s functioning. So, keep taking your calls even during rains or while you are swimming in the pool."
    },
    "reviews": {
        "ratings": [
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "3",
            "1",
            "4",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "4",
            "5",
            "4",
            "3",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "4",
            "3",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "2",
            "1",
            "5",
            "2",
            "5",
            "5",
            "1",
            "1",
            "1",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "1",
            "5",
            "5",
            "2",
            "4",
            "5",
            "5",
            "3",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "1",
            "4",
            "4",
            "1",
            "3",
            "3",
            "4",
            "1",
            "1",
            "1",
            "3",
            "1",
            "2",
            "4",
            "5",
            "5",
            "1",
            "1",
            "5",
            "1",
            "5",
            "1",
            "4",
            "3",
            "2",
            "5",
            "3",
            "4",
            "5",
            "3",
            "4",
            "3",
            "2",
            "3",
            "5",
            "4",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "3",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "3",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "3",
            "4",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "2",
            "5",
            "4",
            "3",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "4",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "3",
            "5",
            "5",
            "4",
            "4",
            "3",
            "5",
            "4",
            "5",
            "3",
            "4",
            "4",
            "4"
        ],
        "review": [
            "I am using this phone for 2 days now. As per my opinion the battery life and the display ar quite good. Camera is also decent.\nAs I was a Redmi user before, so I would like to mention few points. This phone doesn't have any\n🔴 Sound Recorder\n🔴 Gallery\n🔴For seeing the daily data usage and internet speed you have to download different application.\nBut the problem I am facing most is the call quality. The microphone's recieving power is not good at all.\nOtherwise it's performance is great till now. I am very happy with all other things. If the above mentioned points are not necessary for you. And you need a smooth functioning, clean UI Phone. Then definitely you can go for it. It really feels good in hand and all the applications are running fine.\nI hope the review is helpful 😄.",
            "I'm using it for last 5days and I'm very much satisfied with its performance,and camera settings. Only one problem I'm facing that the battery drains fast(May be I'm using it a lot)But it charges also super fast as it have 33watt super fast charger.I will give a better review after using it one month.",
            "Phone is nice and having super fast processing camera is also good this time moto has improved its camera from other phones amoled display and 33 watt charger in this price range not posible and it has option of extending the virtual ram to 1.5 gb you can get 7.5 gb of ram procesor is also good\nDolby Atmos enhance the sound quality and gives you Good sound effects. Arctic blue is just awesome gives premium feel to phone value for money phone must buy",
            "1. Very good Processor with super performance ✔️\n2. Great Amoled Display ✔️\n3. Very much light weight and slim ✔️\n4. Great battery with 10hr+ screen on time ✔️\n5. Stock Android with bug free OS ✔️\n6. Decent back camera with a good selfie camera ✔️\n7. Moto gesture ✔️\n8. Dolby Atmos sound ✔️\n9. Call quality is good✔️\n10. Overall good after 48 hr use✔️",
            "Good phone with strong 5G processor, AMOLED display and storage management.\nStock android feature is also good but front camera not like 16 MP, photo clarity is not good with zoom. Back camera's main sensor and vide angle sensor are good but macro sensor is not good.Speaker voice quality is good with dolby atmos support. Phone Design and look are okay.\nOverall nice! phone. Thanks! moto",
            "Hi All,\n\nI got this phone from Flipkart on 1st Feb 2022 that is 9 days ago. So I will post my honest reviews on this. I have not tested or played games in it as I play games in my other phone one plus 7T.\n\nBut in other things, here are below Good things :-\n\n1) Good crisp display with AMOLED Full HD display.\n2) Battery backup is excellent. Screen on time ranging from 10 hrs to 11 hrs SOT (Note that I don't play games on this device).\n3) Charging speed is ok (33W fast charger). Phone will charge from 0 to 100 % in about 75 mins time.\n4) Though it doesn't have stereo speakers but still the sound quality while listening music or watching videos is excellent on this phone both via speakers and earphones and also via bluetooth earphones.\n5) Software experience is quite clean with no ADS or Bloatwares. Moto UI is always clean with zero ads.\n6) Call quality is also excellent both via speaker or earphones. Mic works good while on calls.\n7) Processor is good. SD 695 chipset which is equivalent to Dimensity 900 or equal to SD 765.\n\nNow some things which I think is not good :-\n\n1) Though the display is AMOLED Full HD but screen refresh rate is only 60Hz. It should have been atleast 90Hz.\n2) Camera could have been better though I have not tested camera much.\n3) No stereo speakers in 19K phone.\n4) Though software is clean with no ADS but Motorola has not confirmed how many major Android update and security updates it will get. (Though Android 12 is guaranteed).\n\nNOTE :- Here were my honest reviews above. If you have any questions you can reach out to me.\n\nThanks,\nRitesh",
            "The phone is light, comfortable to hold and quite thin. What stands out is the display. The colors are accurate which makes for a nice viewing experience. So far the processor seems snappy and I haven't experienced any lag. The audio and the front facing camera is decent but the main camera is nothing to boast about. The pictures taken are out of focus and seem to lack color. The fingerprint reader is also unresponsive at times, but it doesn't take away from the overall experience of the phone.\n\nIf you have a previous generation Moto g phone, you aren't missing much and I wouldn't suggest upgrading to this.\n\nGet the g71 if you have a much older phone (<2017) and want a stock android experience. But there are cheaper options out there that offer similar features at a lower price.\n\nNote: The phone does not come with earphones.",
            "Motorola is my favourite brand . I'm using this version of moto from last 7 days . Performance, battery n sound quality is Awesome 👍. Amoled display with 13 5g band support is a great combination. Camera quality should have been better but no issue with that🙂. Overall performance of the phone is good. Love u moto 💕.",
            "Camera stock app: 4.1/5.\nGCam: 4.5/5\nPerformance: 5/5\nCarrier aggregation support: 2CA on all bands including interband and intraband with 4×4 MIMO so don't worry.\nDisplay: 4/5 could have been better if it was 90hz\nBattery amd charging 4.5/5\nAll and all its a great product that you must prefer if you are looking for stock android experience along with Carrier aggregation. Do go for it.\nWill review it after 1 month of usage\nAlso I'll be uploading some of the camera samples to show you camera quality",
            "Best all-rounder phone in this price range.\n5g 12 bands✔️\nAmoled display ✔️\nStock android ✔️\nDolby Atmos (powerful sound)✔️\nNo Bloatwares✔️\nMassive Battery ✔️\n100% Charge in 60 mins✔️\nLooks Premium and I like \"Hello Moto\"✔️\nGaming experience is good ✔️\nNo lagging ✔️\nCamera is fine but not expect much!",
            "I am using this phone for 2 days now. As per my opinion the battery life and the display ar quite good. Camera is also decent.\nAs I was a Redmi user before, so I would like to mention few points. This phone doesn't have any\n🔴 Sound Recorder\n🔴 Gallery\n🔴For seeing the daily data usage and internet speed you have to download different application.\nBut the problem I am facing most is the call quality. The microphone's recieving power is not good at all.\nOtherwise it's performance is great till now. I am very happy with all other things. If the above mentioned points are not necessary for you. And you need a smooth functioning, clean UI Phone. Then definitely you can go for it. It really feels good in hand and all the applications are running fine.\nI hope the review is helpful 😄.",
            "I'm using it for last 5days and I'm very much satisfied with its performance,and camera settings. Only one problem I'm facing that the battery drains fast(May be I'm using it a lot)But it charges also super fast as it have 33watt super fast charger.I will give a better review after using it one month.",
            "Phone is nice and having super fast processing camera is also good this time moto has improved its camera from other phones amoled display and 33 watt charger in this price range not posible and it has option of extending the virtual ram to 1.5 gb you can get 7.5 gb of ram procesor is also good\nDolby Atmos enhance the sound quality and gives you Good sound effects. Arctic blue is just awesome gives premium feel to phone value for money phone must buy",
            "1. Very good Processor with super performance ✔️\n2. Great Amoled Display ✔️\n3. Very much light weight and slim ✔️\n4. Great battery with 10hr+ screen on time ✔️\n5. Stock Android with bug free OS ✔️\n6. Decent back camera with a good selfie camera ✔️\n7. Moto gesture ✔️\n8. Dolby Atmos sound ✔️\n9. Call quality is good✔️\n10. Overall good after 48 hr use✔️",
            "Good phone with strong 5G processor, AMOLED display and storage management.\nStock android feature is also good but front camera not like 16 MP, photo clarity is not good with zoom. Back camera's main sensor and vide angle sensor are good but macro sensor is not good.Speaker voice quality is good with dolby atmos support. Phone Design and look are okay.\nOverall nice! phone. Thanks! moto",
            "Hi All,\n\nI got this phone from Flipkart on 1st Feb 2022 that is 9 days ago. So I will post my honest reviews on this. I have not tested or played games in it as I play games in my other phone one plus 7T.\n\nBut in other things, here are below Good things :-\n\n1) Good crisp display with AMOLED Full HD display.\n2) Battery backup is excellent. Screen on time ranging from 10 hrs to 11 hrs SOT (Note that I don't play games on this device).\n3) Charging speed is ok (33W fast charger). Phone will charge from 0 to 100 % in about 75 mins time.\n4) Though it doesn't have stereo speakers but still the sound quality while listening music or watching videos is excellent on this phone both via speakers and earphones and also via bluetooth earphones.\n5) Software experience is quite clean with no ADS or Bloatwares. Moto UI is always clean with zero ads.\n6) Call quality is also excellent both via speaker or earphones. Mic works good while on calls.\n7) Processor is good. SD 695 chipset which is equivalent to Dimensity 900 or equal to SD 765.\n\nNow some things which I think is not good :-\n\n1) Though the display is AMOLED Full HD but screen refresh rate is only 60Hz. It should have been atleast 90Hz.\n2) Camera could have been better though I have not tested camera much.\n3) No stereo speakers in 19K phone.\n4) Though software is clean with no ADS but Motorola has not confirmed how many major Android update and security updates it will get. (Though Android 12 is guaranteed).\n\nNOTE :- Here were my honest reviews above. If you have any questions you can reach out to me.\n\nThanks,\nRitesh",
            "The phone is light, comfortable to hold and quite thin. What stands out is the display. The colors are accurate which makes for a nice viewing experience. So far the processor seems snappy and I haven't experienced any lag. The audio and the front facing camera is decent but the main camera is nothing to boast about. The pictures taken are out of focus and seem to lack color. The fingerprint reader is also unresponsive at times, but it doesn't take away from the overall experience of the phone.\n\nIf you have a previous generation Moto g phone, you aren't missing much and I wouldn't suggest upgrading to this.\n\nGet the g71 if you have a much older phone (<2017) and want a stock android experience. But there are cheaper options out there that offer similar features at a lower price.\n\nNote: The phone does not come with earphones.",
            "Motorola is my favourite brand . I'm using this version of moto from last 7 days . Performance, battery n sound quality is Awesome 👍. Amoled display with 13 5g band support is a great combination. Camera quality should have been better but no issue with that🙂. Overall performance of the phone is good. Love u moto 💕.",
            "Camera stock app: 4.1/5.\nGCam: 4.5/5\nPerformance: 5/5\nCarrier aggregation support: 2CA on all bands including interband and intraband with 4×4 MIMO so don't worry.\nDisplay: 4/5 could have been better if it was 90hz\nBattery amd charging 4.5/5\nAll and all its a great product that you must prefer if you are looking for stock android experience along with Carrier aggregation. Do go for it.\nWill review it after 1 month of usage\nAlso I'll be uploading some of the camera samples to show you camera quality",
            "Best all-rounder phone in this price range.\n5g 12 bands✔️\nAmoled display ✔️\nStock android ✔️\nDolby Atmos (powerful sound)✔️\nNo Bloatwares✔️\nMassive Battery ✔️\n100% Charge in 60 mins✔️\nLooks Premium and I like \"Hello Moto\"✔️\nGaming experience is good ✔️\nNo lagging ✔️\nCamera is fine but not expect much!",
            "Overall experience so far good with this phone. Display quality is very smooth and bright. Camera could be more better, front camera is not working good in low light.",
            "Not worth the Money.\nPlease don't buy, Many other options are available in the same range which are way better.\n\nScreen resolution is not industry standard so You'll have problems in standard apps like Hotstar in playing video because video will lag, no matter of your interest speed ( I have 150 Mbps connection) and tested on new phone so no overload of apps.\n\nRest is up to your decision 😅",
            "Only Motorola brand and stock Android and 5G bands is good not much more in this phone average when compared with other brand's less futures in MOTO but I LOVE MOTO 😍 MOBILE main security is first preference in my opinion then moto is best phone",
            "Camera average\nBattery backup and charging really good\nPerformance good but sometimes it lags, may be will be fine with an update.\nIt looks premium and cute btw\nJust waiting for an update.",
            "Excellent value for money phone\nWriting this after using it for a week\nPros-\nGreat display, excellent battery life(lasts easily for 1.5 days), top notch performance(no issues so far)\nCompact design which is easy to hold and use in one hand.\nStock ui experience, clean interface.\nCons-\nThe only negative about this phone is its camera quality.\nMy 4 year old honor phone give better results with 12mp camera, compared to this phone.\nColours are great but it lacks clarity, even after taking a full 50MP shots. Also the 2 MP macro camera is useless, it shouldn't be there.\n\nIf you are looking for a phone with great camera, then you would be disappointed, other than that its a great phone",
            "Awesome phone!! Motorola is a trusted brand. My previous Moto g5 plus I have used for 4.5 yrs 😍 super impressed with g71 and its intelligent features. Superb display, works buttery smooth... Performance is simply ace! I don't know why people complain about the camera, I found it excellent. Well, I am not very selfie obsessed and do not post pics on social media but do use the camera sometimes and found it awesome! Thank you Flipkart and thank you Moto 😘😘",
            "From 10 days of usage, I can confidently say performance of the phone on this price bracket is amazing, snapdragon 695 is looking a good prospect in power, efficiency and RAM management. Though I am not a gamer to explore its limits. 1.5 days of damn sure battery life for the general user though if you have 1 hr of video conference. It is a polycarbonate built but still it was really put together well. Selling points of this phone would be excellent Amoled screen stock android, no advertisement, Lenovo Thinksheild protection and Motorola has promised to give 2 yr updates and hope they stand by what they say. Only gripe would be Motorola could have gone with some sort of Gorilla protection for the display.\n\nOverall if you are looking for a steady performer with great efficiency, security, Amoled screen, stock Android and your budget is around 20k, this is the phone for you!",
            "Totally genuine review after 2weeks of use.\n\nThe phone seems comfortable to use in below aspects as given in its description:\n1. Camera is actually good, it process the image post click for better images.\n2. The images when taken efficiently comes out well but on walking or movement they get blurred.\n3. No blot ware as it's near stock Android.\n4. 5G can't be tested soon but seems comfortable connecting the wifi 5g band that's normally provided these days.\n5. The features and customisation available for phone is quite good.\n6. Performance is good so far.\n7. Display and colour contrast looks good and classy neither too bright to eyes nor too dull. Balanced well to give a decent clean look.\n8. Dolby Atmos is the only speaker feature but could improve with 2 speakers.\n\nLacking below things :\n\n1. No magnetic compass app.\n2. Call recording always occured with announcement, can't disable announcement.\n3.Earphones and screen guard were mentioned in box details here, but it's not available in the box.\n4.Charging speed was mentioned as 33w but the battery drains faster and charges slowly. Not upto mark.\n5. No installed notepad app, music, recording and album app. It uses default Google photos app.\n\nWorth buying as the processor and display, cam pixels, performance, cost, connecting bands and sound quality with near stock Android. Most of the concerns can be fixed installing apps manually if needed except charging... But, on moderate rate of use charging stays for entire day. So can compromise on that then you can go for it.",
            "I have been using the Moto G71 5G for more than a month now(from 28th Jan).\nThe Display is superb 😍, Good Battery life too.. charging is also fast.\nThe camera 📸 was not I expected. It's a descent camera no dout about it. It gives social media ready pics, little colour boost, skin smoothening...etc. the people who use extra filters and apps for that will definitely love this, I don't like that type of photos, I like the natural photography, natural colours and my face as it is. Now I am using a google camera port and I am getting great photos from it... But my wife will still prefer the Moto camera 😉.\nEverything is super smooth, no complaints at all.\nThe stock Android experience is awesome, but still running on Android 11 (13/03/2022)\nThe design, I don't liked it at first but now it is growing on me.\nFingerprint sensor is on the back, no problem there easily reachable. And that can be use to pull down notification tray. But no other gesture like screen off, which was seen in earlier Moro phones. Manufacturers should give more usability when they go with back sensors.\nMotorola should added a Compass sensor to it, didn't faced any issues in Google Map.",
            "An excellent phone in all aspects.\nCharging amazingly fast.the battery held the charge for full two days with charge still to go until the next morning. With two sims on and data on and usage.i was using a xiomi 10 which lasts not so long.\nSmooth to use\nQuality and build excellent.\nSome gesture features are nice and handy.for ex shake for light on etc etc.\nSound clarity dolby atmos is very good and loud and rich.\nGps is quick to lock and seemed very accurate,10t redmi took a longer time and was many times inaccurate.\ni think it has all the good things and is a no nonsense phone.\nCons: it does not have a magnetometer which means it will not display compass readings.no effect on GPS though.\nMotorola is a trusted brand and the phone,at the price that it is being offered,is a worthy buy.",
            "Pros:\nBattery and fast charging\nAmoled display\nFast Snapdragon 695 chipset\nLight weight\nClean stock Android\nBack camera 50mp and selfie camera good. 4/5.\n\nCons:\nOther cameras decent not worth in 19k phone\nShould have at least 90hz display\n4k recording support not there",
            "Its a good phone overall, am liking the usage.\n\nPerformance is good, 695 can handle a lot, no heating even after extended use\n\nCamera is decent for selfie and close up shots but lacks detail in long shots..that has to improve, camera ui has to improve\n\nBattery is excellent\n\nCall quality, wifi, network reception excellent\n\nDisplay is good quality, a 90hz display would have made it outstanding.\n\nStock ui is such i pleasant usage",
            "Motorola G71 5G is a amazing phone at this price point 🥰🌟\nDisplay- Quality is amazing but if company give 90hz Or 120hz so it's almost fabulous but it's ok at price point.\nBattery- Battery performance is also amazing almost it give me 1 day battery backup and 33 watt charger is very fast for charging it's take 55 to 60 minutes for full charge.\nCamera- camera of this phone is not good at this price point camera is ok camera need a software update to fix the exposure issue in camera not good😡.\nPerformance- Performance of this phone is amazing with 695G processor it's very fast for day to day usage performance is very good I like it.\nConnectivity- i use a jio sim i did not get proper tower in the phone some time give 2 or 3 idle in the tower I am very disappointed with that because previous I use redmi note 6 pro it gives always full network but in this I facing this issue.\nConclusion- It's very good phone for daily usage but think about this point of my usage.",
            "Those who want the best performance for faster mobile with many apps this mobile is good.\nBattery life is excellent.\nMobile is lighter to handle.\nToo good when it comes to sound.\nI am happy with performance.\nCamera is OK but who want their selfi and want to post as a frame then also it is good but for the zoomed pics it get scattered.\nI will rate 4.5star overall.",
            "Everything is just top notch except the camera. Camera is not bad but average and I knew it. Motorolla never focused on camera. My priority was not camera , so it doesn't bother me. Otherwise if you want a phone with clean stock Android, good display, smooth touch ,fast, good battery, decent processor and of course under 20000, please go for it.",
            "Writing the review after 1 week of usage.\nI was follower of redmi phones however redmi works fine initially but its not that durable. Hope moto is a good choice.\n\nPros:\nBattery backup is great and works for atleast 1.5 days with heavy usage.\nTurbo charging, take only 1.5 hrs to charge 100%\nPerformance is great and processor is also great.\n\nI am not a camera addict so the phone provides average quality which is fine with me. However, if you have camera preference then you can search some other handset.\n\nDisplay is good!!\n\nLight weighted.\n\nHaven't found any cons yet, I will edit the review if i come across any con.",
            "Pros:\nLight weight: Sleek one, pretty compact due to 6.4inch\nDisplay: Amoled , awesome colour reproduction.\nGreat performance: Very smooth n fast response\nQuick charge: Takes less than an hour for full charge\nBigger battery: Easily 1.5 day for a rough usage too\nCamera : pretty decent\nNo bloatware, Moto gestures.\n\nCons:\nNo SdCard slot\nBut not a major one as 128Gb internal storage is enough for me.\n\nFinally feel happy with Moto again. Just go for it.",
            "Great overall package for the price. Gifted it to my sister and she loved it... Hope moto keeps their word and give timely updates too...",
            "Excellent phone with great performance, feels feather light on hand. Great display can't tell about the screen refresh rate I think it's 60Hz with sharp images, sound from speaker is decent enough not so loud but good and clear sound. Camera is the only thing I found to complaint about videos taken by camera is good but front camera need to be improved I would give 3.5/5 for it camera performance only hope they improve it in future software updates. Call quality is superb, with no heating issue. Phone is capable of handling all kind of gaming activities(only played Asphalt 9,COD). Charging is fast overall a extremely good value for money. Deserve a 5★ rating.",
            "Buy recommendation only after you go through the brief review given.\n\nBest battery, above avg camera, processor is good, little confused with processor numbering though.\n\nThe phone comes with stock android so hardly any adds, bugs or spam applications. Being a moto user for four years, little new to stock android so sometimes I miss fancy interfaces of poco.\n\nDidn't understand moto choice of not providing compass sensor in 18k phone, that's the only major drawback I must say. You definitely will face problem with navigation sometimes as the map has to run on only GPS signal. Not recommended phone if you are a daily navigation user.\n\nLast point, personally liked green color better than blue and it would have been better if it comes in black or gray with matt finish.",
            "Moto G71 is a balanced phone. Superb Amoled display, good battery life, improvement required in camera...",
            "1st of all I have to say 1 thing,in my opinion this is simply best in business under 20k....\n\nPros\n1-5G(with 13 5G band)😘\n2-battery back is awesome🥰🥰\n3-amoled display😍😍😍\n4-front camera is good😍\n5-punchhole selfie camera✌️\n6-stock Android experience💪💪\n7-design quality is superb💙💙\n8-super fast net service with tripple carrier aggregation🤩🤩\n9-not a gaming phone,still good gaming experience🥰\n10-value for money😎😎😎\n\nCons\n1-refresh rate is just 60hz(I expected 90hz)😞😞\n2-back camera just average😖\n3-rearmount finger print scanner(but it's ok for me)\n4- no compass sensor😲😲\n\nComparing with prize range some cons are acceptable,still I feel no better option available in this price range✌️✌️✌️",
            "Performance is best .\nDisplay is awesome .\nBattery is also very good.\n33 w turbo charger which is good\nCamera is decent but rear camera is good .\nProcessor is very good.\nMotorola gestures is nice .\nStock Android is good .\nOver-all Motorola is back. Good budgets mid range phone",
            "This review is after a full day use. A very good phone in this price range with a powerful processor and a good battery life. This device gave me a battery life of 25.5 hrs from 100% to 21%. A decent camera and its biggest usp software is brilliant. After using MIUI for 3 years the moto MyUx feels light and fast to use and not adds nothing. The UI is customisable and hence give a personalized experience. Just waiting for Android 12 update in the phone.\nOnly thing I miss is expandable memory, though 128gb is enough but still expandable would have mad it a wonderful phone, also 60 hz display. For me 60Hz is fine but at this price we see phones with 90Hz. Overall this an amazing phone that I can suggest to anyone.",
            "Processor does the job well without any lag.\nDisplay is bright enough and visible even in bright sun. Battery last 1-1.5 days for moderate usage of social media calling and surfing.\nOnly shortcoming is the absence of magnetic sensor which makes phone lack on compass based apps.\nBuild is plastic but looks good and low weight and 6.4 inch display make it handy mobile.\nOverall an allrounder phone ideal for kids and elders.",
            "I ordered this phone on the day of its launch, because I was very curious about this phone, I am using it since delivery, and I am satisfied with it, if you like simple UI then you can take it. Phone's diaplay, battery, charging, sound, everything is good. I don't play games so I can not tell about it, hope comment will be useful for you..",
            "Ok , Actually i had purchase this phone for my Sister . I am just writing her experience in last 2 months\n\nPros\n\n- No bloatware app. it is a clean android\n- Easy to use\n- Lot of camera function & Picture quality is good\n- battery life good , with extensive use also it would last for 1.5 days\n- Easy to hold in Hand & unlock phone as it is still using traditional back figure print scanner\n- good 4G+ carrier aggregator as still 5G is not their in India\n\nCons\n-As Compass / Gyroscope is not their you tend to get wrong information in Google Maps\n-Still waiting for the upgrade from Motorola as it is coming Android 11 out of box\n- need to work more on image enhancement by pushing update on camera",
            "Overall phone is nice .\nIt would be a fantastic but if they would have givem 90hz refresh rate and better wide angle camera.",
            "Pros\nHandy n good looking\nResponsive touch screen\nGood Clean software\nLightweight\nDual snap mode , new features that captures images from both camera and combines in one pic.\nCons\nWifi connection gets disconnected again n again. I m using jio fiber which was working fine on previous phone.\nHeats when charged with cover on\nLags in video play while watching high res videos.",
            "Absolutely Recommended\nBest smartphone in its class...\nIt's an all-rounder\nGreat processor\nGreat battery life and very fast charging\nVery good camera, great for selfie\nStock Android experience\nFantastic display (60hz no real worry)\nSingle speaker but sound is very good\nSignal reception & network is excellent\nOnly qualm is no compass sensor, have to rely on GPS\nFeels light weight & great in hand\nFlipkart service is awesome",
            "Everything is excellent except camera, camera is average, but if you use GCam then camera is also awesome in this price range.\nI like Motorola phones because of its clean stock android experience and durable build quality.",
            "Clean android experience.\nGreat battery life.\nSuperb screen.\nCamera good for the price.\nNice and handy form factor.\nLight weight for this size of screen.\nNo ads.\n\nNote. It doesn’t have magnetic sensor/compass so navigation using google maps might be clumsy but you can use the maps. Just that experience is not smooth as it can’t change direction along with the movement of car/bike.\n\nOtherwise a good phone.",
            "Additional Specification:- 1) 6GB RAM model is boosted to 7.5GB for now....May be they provide 2 GB additional boost in Android 12 Update....... 2) 2 day battery (Turbo Charge is awesome).....3) Dolby atmos is best for 3.5 jack divices (I used in Senhiser cx180 ) 4) Camera is OK ......5)UI is realy awsome You can change Textstyle, colour theme front , Apps and folder option customization .... 6) Game Mode is great....7) And the best part is MotoUI. Shake for torch, Camera. etc.... And not forget OLED display awsome... #OPENION:::: I chose Moto G71 instead of Moto G60 or Samsung M52 778snapdragon model... I see advertisment of 695 is a powerfull processor.. and yes it is powerfull and power efficient. (I used it for more than a month).",
            "Value for Money Phone\nPros\n1. Excellent Processor\n2. Great Battery backup\n3. Superb Call Quality ( Due to 4*4MIMO)\n4. Awesome display\n5. Good Performance even for Hard core users\n6. Stock Android UI with Customisation\n7. Build quality and outer apperance\n8. 5G and Carrier aggregation (4G+)\n\nCons\n1. Camera (B/w average and Good, actually camera is not con if you use Gcam)\n2. Old style finger print scanner\n3. Android 11 ( Should be 12)\n\nIt needs Camera Update, Android Update, System Update to remove gitter",
            "Good product and value for money. Camera is average only. Performance, battery and display are above expected level. Clean stock Android, no bloat ware. Well distributed weight balance. Doesn't look premium but looks cool in Neptune Green. Speaker sound is loud enough to hear in crowded area. Delivery was done before expected date. Overall, so far satisfied product. Let's see in coming days.",
            "Someone looking a clean , stock Android UI then go for the phone. Awesome camera, sleek and very well weighted phone. Load many MOTO features and The refresh rate should have been atleast 90hz but 60hz with bright amoled panel is a deal maker.",
            "The phone is fantastic\nPros :\n1. Good looking and handy\n2. Good processor\n3. Good battery\n4. Good display\n5. Good rear camera for taking snap\n6. Stock android thus no garbage apps\n7. 33w fast charger\n\nCons\n1. Front camera is ok type not so good not so bad\n2. 4k video cant be shoot using rear camera\n3. Compass sensor is missing which is very useful during navigation to identity the phone direction\n4. Go pro feature is missing for rear camera which used to available in earlier moto g phones.\n\nVerdict : its a very good purchase!!",
            "Superb Display.\nExcellent performer.\nBattery lasts longer than expected.\nCharging time is approximately 1hr.\nBattery charging optimisation is there for the better health of the battery in long run.\nCamera is the only issue.Moto should work on this segment.\nNo connectivity issue.\nSpeaker is quite loud with Dolby Atmos support.\nOverall best all rounder in this price segment.",
            "Budget phone at this price range excellent display quality and smooth built texture battery is a little disappointing but overall it's a best 5G phone at this range, only one speaker gives you no stereo experience but quality of Dolby speaker it have gives best sound quality, camera is also pretty good and performance of sd 695 is so smooth.",
            "It's a fantastic phone.don't even think twice...just go for it",
            "Review after 1 week usage\nPros:\nGreat display\nSnapdragon 695 is a very capable processor for day to day task...\nAwesome battery backup..would easily last a day with moderate usage\nIt's not having stereo speakers but the single speakers are loud and clear. It's also having Dolby Atmos support.\nClean Stock Android experience.\n13 bands of 5G (No Gimmick)\nCons:\nCamera is average. It boosts the colors and the blurring effect is not calibrated properly. In good lighting conditions the photos come out really good.\nNo higher refresh rate ( this might bother some people who have used a higher refresh rate device before,otherwise you won't notice it. There are no lags or jitters in day to day operations!)\nNo SD Card slot\nThere is no inbuilt gallery or app lock feature (this might bother some people migrating to stock Android from other UI )\nBut definitely this provides a good value for money and is definitely one of the best phones in this price segment. If you are looking for a camera centric phone then you can go for Redmi Note 10 series. Otherwise this is a great phone to have in this price segment.",
            "Perfect in every way",
            "The display is amazing,\nVery thin mobile with 5000mah battery,\nPremium finish you get when this is in your hand\nMust buy this Motorola mobile",
            "Good phone with nice features as expected. Liked by all family members. Thanx Flipkart for delivering nice phone promptly.",
            "I'm not a heavy camera user but I care about the performance of phone. I liked stock android clean UI. Best part is its display, it is best and smooth. Battery can last under normal uses. Both sim slot can work in 5G but can't test is but both sims are working fine in 4G. Liked the gesture of DND when put phone face down.",
            "Camera is not that good\nColours are good but details are missing in the photos\nIt gives you soft photo not detailed\n\nBattery backup is not up to the mark.\nDon't buy the phone just because of 5g bands\noverall it is a decent phone but does not worth 19000 at all",
            "I'm pleasantly surprised by the quality of photos the camera clicks. Moto is never known for good camera, but on seeing the shots, I think they've been listening to feedback.\n\nThe spec sheets are good as they are, the one major con would be the lack of a compass sensor. While I'm not someone who frequently uses the phone for navigation, I can appreciate the need for a compass. I'm not too bothered by the refresh rate since I've been using a 60 Hz panel most of my life.",
            "Under 20 k rang mobile best this segment.overall phone good but better to more work in features moto ...",
            "The best thing about this phone is that it has pure stock Android without and bloatware. Has good display and perfect size. Performance is awesome with good battery backup gives screen time of 9-10hrs on full charge.\n\nCamera could have been improved and an additional speaker would be appreciated.",
            "Excellent\nPerformance is good but Xiaomi users some future missing dual app & remote. long time working is good my experience overall good product for Motorola",
            "10 days of experience with moto G71.\nPro's:\n- Good battery backup(8/10)\n- Good display but it need atleast 90hz refresh rate.(8/10)\n- performance is good (7.5/10)\n- calls and signal strength is good (8/10)\n- audio is ok (6/10)\n- device weight is good it is 180 grams (8/10)\n\nCons:\n- the worst camera i ever seen with this price range.\n- no external memory support.\n- Worst experience with call recording.\n- fingerprint swipe notification not working properly.\n\nFinally I should give 7/10.\nI am Moto Lover I used for Motorola devices.\nIf you are camera Lover Don't buy it...",
            "Not that great in comparision to samsung M51 with regards to display and processor. Phone size is handy , display better than FHD+, Average performance of Camera but camera features are good. Overall i feel phone is value for money around 16k or 17k. Somewhere Samsung wins my heart compared to Motorola n feels premium.",
            "*5 star rating (minus 1 star)*\nOverall pretty impressed with Motorola's offering at this price. Excellent display, good camera, good battery, bloatware free near-stock Android experience, Moto's excellent tweaks, nice specs - highly recommended.\nEdit: Would've rated 5 stars, but only drawback for an average daily user is the absence of compass sensor, without which the direction arrow in the Maps doesn't work properly.",
            "Good quality pictures",
            "Overall phone is good . Missing 90hz display ,although good . Camera is not up to mark . I am using 3rd time moto device . It has issue in camera segment . Other competitor is decent enough in same price .",
            "Switching from Moto G5s plus and it feels so refreshing. Love my New phone. Great product.",
            "Best phone under 20000thousand",
            "Overall great 👍",
            "Good phone .. working great .. display is good..",
            "Goog product",
            "Loved it.",
            "I am using it From almost 10 days. As of now it is great",
            "I wish there were Matt Black finish",
            "Worth for money",
            "Just loved it .... Clean Android with moto features ...just go for it ...♥️",
            "Nice phone '\nNo wastage money",
            "It is the best phone to have in this price. Smooth and best for 5G connectivity.",
            "Main Con is Camera about this device, camera needs improvement.",
            "Good mobile",
            "Good",
            "Good",
            "Good product 👍",
            "Good and amazing phone",
            "Fabulous product",
            "As expected its a good phone. Bit camera quality issue, it doesn't look like 50MP😅",
            "I bought this phone instantly after launch.\nI was waiting for its launch after seeing its specifications on flipcart advertisement.\nThis is the only 5G phone launched with Snapdragon processor with Amoled display and 5000mah battery under 20k range.\nNice Product, worth buying.",
            "Need to improve camera quality",
            "Value for money 💸💰 improve rear cam for long shot.",
            "This phone was amazing performance and it is a looking good thank you moto",
            "The phone doesn't have a magnetic gyrometer. No compass apps from playstore will work. IR is also not supported. Apart from this everything is value for money. Camera is okay. Video quality is not good. New buyers can wait for new product or purchase previous models.\nFor those who have issues with Sound Recorder, Dolby has a sound recorder app, available on playstore which is worth installing provided the phone has Dolby atmos.",
            "Good phone compared to the current market value of all the phones in this price range. Everything is balanced. So you can buy this phone.\nBut... I really want to say that mobile phone companies (especially Android os platform) is pushing us to pay huge amount of money for same technology of 5 years back. No improvement in processing speed and security and privacy of the customer. We Indians are being fooled by them as we are going crazy for Megapixel & 4;5;6 cameras and useless charging battery speed or huge batteries. We miss main focus on the processor,GPU,display,durability(at least should be 3 years) & OS improvement... Android upgrade is all hipe ... The basic thing is Android security patch which Android denies to provide after 18 months ... Basically pushing us to buy new phone.\nFinal verdict - Indian companies need to develop better phones and Indian own OS or atleast a better UI.",
            "Just got and one day use. Seen good only concern it don't have provision of additional storage facility through micro sd card. Since I used earlier also Moto phone hence feel that this also comes to full of my satisfaction. Review after 1 month again.",
            "Awesome phone\nUnexpected Display\nI love this product\nThank you Moto and Flipkart\nparth_r_bhatt",
            "Super👌mobile thanks Moto super back camera",
            "Writing this review after 2 months\nMobile is mostly stable,but I see freezes here and there.\nThe only good about this phone is\n- battery life (It will easily give 9+ hours of SOT) and\n- heat management(I didn't heat up at all ,except while charging)\n- Software(I like stock experience)\n- Colors pop out on display, particularly Red and brightness is very good. I didn't see any issues even under direct sun light.\nOther than these,everything is below average\nDisplay is Amoled but lacks sharpness(Redmi note7 display is way sharper than this one)\nCamera is not at all good\nBiggest bummer is compress. There is no compass, hence maps won't show the direction in which you are facing. This is very annoying and I got lost once.",
            "This phone has overall performance is awesome\nIn this price range no one beat moto g71 by quality nd performance.#Moto rocks nd long lasting phone.\nU can see my upload pics for camera quality.",
            "The phone is good\nGood build quality.\nGood camera\nGood android experience.\nGood display\nGood battery\nOverall a balance phone under 20k in market.\nIf you want a phone which perfom decent in all segment then buy this phone.",
            "its a wonderful all rounder phone in this price range😊😊😊😊🤩must buy",
            "Review after 1 day usage\n\nClean Android\nNice battery backup\nLight weight\n13 5g band\nSun light photography very nice\nNight photography average\nWill review after 1 month",
            "I loved this phone because it's has good camera and processor overall It is good phone",
            "Pros -\nClean Android\nNeat selfie Camera\n6.4 inch handy phone\nIn hand feel is good.\n\nCons -\n\nNo Gallery\nInspite of having stock android the phone had android 11",
            "Best 5g mobile",
            "Beautiful phone. No unnecessary features, so need to customize it and give it a style",
            "Worst ulter flop packing by Flipkart...Did you have any commo sense for sending a mobile in single packing with side open?Huh..Waste packaging by Flipkart.\n\nMobile is good will edit the review after one month usage",
            "Value of money",
            "Night Mode camera awesome\nawesome Camera 😘🤩",
            "Battery - 5/5\nCamera - 3.5/5\nCamera with Gcam - 5/5\nProcessor & Performance - 5/5\n\nExcellent & Must buy product under 19k",
            "Very good device in all respect.",
            "It's osm..",
            "Very Good Product from Moto. Camera and phone Performance, Quality of Product is too good as compared to other phones.",
            "Excellent specifications at this price range worthy buying 👍",
            "superb......",
            "Value for money ✨🥂",
            "Value for money far better than Samsung in this range",
            "Mic/microphone not working properly. Before resolving issues return policy closed whenever 2times Technision visit completed and issue not resolved. No one hearing. Customer support very poor. Before receiving call drop many times.",
            "Moto phones have worst camera..a little more light photo gets bleached and loses true colours..face unlock too takes time and does not get unlocked most of the times..I bought this phone for processor and it's amoled display but it's a disappointment",
            "There is a measure bug in the mobile. Whenever a call is going on and if you change the screen to any other application the front person won’t be able to hear you . Pathetic experience. Also if you want to add someone on call during that time if you press any buttons then too the other person won’t hear anything. Also when you are on call after sometime automatically the voice goes blank.DONT BUY THIS MOBILE",
            "The Best value for money phone under 20000\nCamera✔️\nDisplay ✔️\nBattery life ✔️\nStock Android ✔️\nFast processor ✔️",
            "3 Days Before Only Ihve purchased Moto G60 Also Both The Phones Performs Good\nCamera , Battery And Design Moto Nailed It But The Worst Thing Of This Deal Is Flipkart They Had Taken Morethan 12 Days To Deliver The Product.\nWorst Service Experience Flipkart.\nI'll Be Uninstalling ur App Just After This Review👎",
            "Superb camera",
            "Light Weight phone",
            "Guys OTT platforms video is hanging . Pls don’t buy this mobile",
            "Worst mobile in my life.taken a bad decision. Just 7 days of return.handset hung is on at peek .waste of money within 7 days slowness can feel..when I about return ,period also finished.. slowness at peek .don't waste money.19k I have spend .",
            "Charger adapter is not working after two months use",
            "Great Phone at this range. Moto Stock Android experience a big plus point.",
            "mic is not working, heating issue while charging, hanging issue",
            "Battery backup is awesome, display is awesome, performance is also good but sometimes some apps get crashed and that surprised me overall a good phone but this is not alone in this price segment",
            "Best Mobile 👌👌👌👌👌",
            "Except for camera quality, rest all things seems to be flawless...",
            "It's a very nice budget phone under the price range of 20k. In my personal opinion the camera and the display are the two areas where moto should focus on. And the best thing is stock Android without so many pre-installed annoying apps. If you are a moto fan who is looking for a brand other than MI go for it. It's worth.",
            "One thing I would say... Moto is back.. nd another thing I have to say there are lots of customisation thorough moto app where u can change theme with moto gestures and with stock Android gives perfect combination",
            "Great phone. Worth of its price. But don't buy with phone exchange option. They will not give true value of the phone.",
            "Good one",
            "Camera 2.5/5\nBattery 3.5/5\nDisplay 4/5 because yellowish display\nCharging 4/5\nPerformance 5/5",
            "Best phone",
            "Since 2010 I am using Motorola only but I am happy at last I got it which were in my mind",
            "in this price segment this is an extraordinary phone with hrate specs",
            "Once a MOTO fan always a MOTO Fan",
            "The best budget 5g phone with almost every juice element",
            "Value for money device",
            "Value for money 👍👍",
            "NET problem",
            "Good phone in this segment.l like it very much.",
            "A very good phone in this range.\nOverall peroformance is quite good.\nU must go for it rather than buying any other chinese brands like redmi etc.\nIts performance may impress u too with 120Hz Refresh rate.",
            "After 45 days of use I am totally disappointed by this phones performance. Too many glitches and issues:\n1. The automatic brightness sensor is perpetually confused, screen brightness keeps flickering and it even happens during video calls\n2. Battery performance is okay but drains really fast when using Bluetooth devices\n3. App crashes are common\n4. Normal pictures taken during day are okayish but low light shots come out very crappy\n5. Camera processing is slow and there is lag when recording videos. This is very irritating as taking a still framed video also looks glitchy\n6. Gaming performance is okay but there are performance lags there also\n7. Only good thing about the phone is looks and weight, even the stock android doesn't save it from so many performance issues",
            "Biggest con of the phone is call quality which is below average. Similarly camera is pretty average on this price point. Otherwise, all other features are as expected of Moto",
            "Highly Recommended\n🙂👍🏻 Best Phone at this price... Don't think just take it.\nBefore this phone I used MI 11X past 4 months, and now I am using MOTO G71 last 30 days,\n& Now I am falling in love with Moto g71.. It's feel premium & awesome.",
            "Impressive battery backup and performance as before as used",
            "Major issue facing\nHaving call drop issue while connected through wifi.\nCall not connected while connect wifi.\n\nDisplay - amoled but not much quality like Samsung\nBuild quality - not good",
            "Camera won't disappoint,\nDisplay is good\nFingerprint is large...takes time to adjust hence causing delay\nPerformance is unbeatable\nCarrier Aggregation is noticable when compared with other phones\nAs usual other things are there which are good.\n\n✅✅** Best and reliable phone(Samsung exception) with this price...",
            "looking for good looking phone? Don't worry it's here.\nGood battary backup atlist 2 days for normal use..\nCamera is good in daylight. But average in night photoshoot.\nPerformance is too good on this prise point..\nDisplay is too good. Touch is responsive.\nAlso gaming performance is ok.\nI am using from last 15 days.",
            "Performance of device is excellent.\nBattery -excellent\nCamera and display - Average\nLight weight mobile.\n\nAs Motorola is known for making performing device and not camera and display centric, so please understand these before buying it.",
            "All over the quality regarding performance and display is too good in this price range. The battery backup and fast charging is very good. It takes an hour to fully charge itself using the 33 Watt charger provided with. I do not play games in mobile. In normal use with 18 hours of all time Internet access it takes for me 2 days to drain out the battery after a full charge. Finger print sensor and face detection quality is very good compared to other company phones except Apple. Having 5000mah battery it is still light weight. No unnecessary boult wares or ads. Having said these pros, the concern area is the camera. The back primery camera is fine, the macro camera has various issues and the front camera quality is not as good as expected.\n\nOverall if one is looking for a phone with quality performance, display, battery life and ease of use in a moderate budget and not because of camera quality then without any doubt go for it.",
            "Good phone in this price point , missing in display fingerprint and it SOFTWARE HANGS SOMETIMES",
            "Superb value for money. Camera quality is very good ☺️. Thanks 👍",
            "Everything is fine but u can't talk happily with this mob, because u have to struggle a lot & loud so that other person can listen ur voice. In simple mic(bottom) is worst and too worst.",
            "No non sense stock Android phone at this price. No regrets",
            "I like always Motorola.",
            "Really Good One",
            "Great mobile",
            "Very nice phone. Motorola bundled very nice features at this price. far better than newly launched phones after purchasing this phone.",
            "The powerful thing what I feel in this phone is battery and processor.\nFor Moderate user can last 2 days\nProcessor is also very impressive.",
            "6 GB RAM | 128 GB ROM\n16.26 cm (6.4 inch) Full HD+ Display\n50MP + 8MP + 2MP | 16MP Front Camera\n5000 mAh Lithium-ion Polymer Battery\nQualcomm Snapdragon 695 Processor\n\nOverall great package...",
            "Looks good and little bit costlier",
            "Good deal with moto 5g\nNice mobile",
            "Phone is good but delivery was so erritating",
            "Camera performance is bad, rest all good",
            "Not bad mobile is good",
            "Value for money",
            "Superb phone",
            "Device is working much better than expected",
            "Build quality are greet",
            "Superb",
            "Good 5g mobile",
            "Camera could have been even better.",
            "It's very good",
            "Most awaited product and very much reliable",
            "Good phone",
            "one of the best phone at that price point of 19k. Amoled display is the main highlight along with 13 bands of 5g and stock android experience.\n\nIn reviews, snapdragon 695 will be similar to the performance of snapdragon 750g amd close to 765g. But in real life, the performance is balanced. You cant play pubg in extreme frame rate even in low smooth settings.",
            "Nice mobile within Network, Battery, processor, Ram, Storage everything is fine.\ncamera quality is little low but in sunlight it was good\nThe price value is a bit high. It would be nice if it's price could be reduced.",
            "Good 👍",
            "Good phone, camera speaker battery performance all are awesome. 13 5G bands",
            "Photos come with extra red effect , mirror casting is not working , worst phone which I have purchased in my life time till now I believed moto would be good so I returned back to moto after 3 years of usage of other brand worst phone don't buy not worth for hard earned money .",
            "Fingerprint is little slow,\ncamera is ok ok,\nBattery backup is awesome, but heating issue while charging,\nFace unlock is also not working well,\nDisplay is good, but auto brightness isn't working properly,\nPerformance is good,\nPhone has no inbuilt app lock and safe gallery.",
            "After 10 days usage Mobile will awesome i love it but this mobile accessories are not available be careful i will not put temper glass in our mobile 😒😕 #moto mama",
            "Don't buy , 50 megapixel camera is only gimmick. Not recommended . Moto is not the one like before ,it has lower his quality.",
            "Lots of drawbacks ...\n1-Battery backup very disappointed as compared to other phones. OLED display with 6nm processor but battery performance very low.\n2-After capture photo need to stay 3 to 5 seconds otherwise photo is not clear.\n3-Speaker sound is loud but not clarity missing.",
            "Camera is horrible needs lot of improvement",
            "Quality and Features is just Awesome but Money is just High 🚫😓",
            "Price is very high camera is not good as compared to Samsung",
            "Don't purchase camera is not good its like vga camera",
            "I am using moto's phone since 2014 but fist time very disappointed. There are so many issues going on with this phone.\n1) Call issue- frequent voice issue . Neither I can here nor receiver.\n2) Display issue- Buffering while watching contents on OTT platforms like Hotstar, Netflix.",
            "Network ic problem",
            "I am facing Toch problem",
            "Facing network issues on this phone.\n\nIntermittent issues on hotspot and mobile data.",
            "Nice pH and good camera",
            "Nice compact phone\nDisplay is good\nCamera is decent\nOverall value for money",
            "Veey good phone.. Not China that's a plus point.. Money not gone to our enemies hand.. Itsa American company.. With excellent performance with reasonable price.",
            "Working good but cast not working properly",
            "Lags in gaming not giving 60fps",
            "Using from last three days.\nVery nice phone overall.\nAwesome camera.\nBattery performance very nice.\nDisplay too good.\nI loved Neptune Green colour.\nThank you Moto.\nThank you Flipkart.",
            "Bad",
            "Very nice",
            "Headset not available., i am very disappointed.",
            "Everything is fine about this phone. Only the camera needs a bit improvement.\nAnd it would have been better if moto provided at least 2 android version updates.",
            "Camera Quality is not Good Very Bad Camera Experience",
            "Not meet my expectations",
            "Being a moto fan since ages, i have always been found of their unique offerings in the price range.\nStock Android experience has always been a criteria for me and potentially the huge range of 5g bands support definitely makes a leap.",
            "Good product but rate is high",
            "Moto G71 5G have an AMOLED & Dolby Atmos which is for a person who buy mobile for movies and music. Battery is so good, normal usage last for 2 days and heavy user, 1 day. G71 comes with 33 W turbocharger. Overall this is future ready 5G phone with amazing battery and display. Just one anoying thing is back mounted finger print scanner.",
            "Excellent worth buying",
            "Phone below speaker volume explodes from purchasing time and System performance is not good as expected and comapre to other android phone.",
            "Awesome mobile in this range",
            "Mobile phone is not good because many common feature is not available in this phone. Photo editing facility, SD card is supported.",
            "Camera quality very low\nBattery awesome\nDisplay awesome",
            "This is a good phone. You can go for it. I liked the display and battery is awesome.",
            "Great",
            "Perfect midrange, display, battery good,camera 📷 average,finger print senses delayed.",
            "Worst phone to capture photo at this price range",
            "Blindly go for moto G 71..One of the best in this segment..",
            "Over all good",
            "Perfect for me",
            "Good mobile from moto",
            "Pros n cons\nPros\nA magnificent display\nNice camera\nBattery is very good\nCharger is on top notch\nSmooth ui\n\nCons\nActually processor is very good but u can't watch 4k\nNo 4k recording\nSmooth ui but lack of features\n\nBut in one word it's excellent",
            "Very good phone in this price range.",
            "Good for average users.",
            "Camera could have been better, display, brightness is top notch. Processor is good. Battery can last upto 1 day on moderate usage( using internet) and 6-7 hrs of you game.",
            "Excellent product at this price point....",
            "Good Device",
            "A very good mobile",
            "Ok",
            "Good but camera not good",
            "Good performance at the price . please provide sd card slot for memory extension.",
            "I highly expected the battery pack but I didn't attain the satisfaction otherwise the product is okay",
            "Good product",
            "Camera is average.\nDisplay is awesome.\nBattery backup is good.\nPhone is snappy and fluid.",
            "Great OLED screen\nLong battery life\nFast charging\n\nValue for money.\n\nJust go for it !!",
            "The product is awesome in this price range. A separate slot for memory card could make a difference. But over all graphics are awesome. Picture quality is awesome",
            "Just go for it if you need phone with great battery back and expemplary performance",
            "Battery is good with normal usage it easily goes to 1.5 days .\nCamera is decent .\nIts little different to use as moved from xiaomi phones. No dual apps and other custom features are missing due to stock android",
            "performance is verygood im playing 7 team game in pubg and 5 chiken dinner with minimum 5 max 11 kills (with default setting)..\nbattary is allso good with turbo charger facility...\ndisplay is awesome im loving it...\ncamera is good but still need to test..\nIm satisfy...",
            "1. Camera quality is not good as per the price point.\n2. You can't choose video quality over 1080 p\n3. Battery is ok.\n4. Phone looks good in hand.\n5. Performance is good.",
            "Its good for battery life but this is very heavy feel like mobile and camera not good and sharp",
            "Good one",
            "Nice product every one can buy",
            "Worst phone ever. Poor Flipkart service",
            "Moto in light weight version is new thing and overall good mobile",
            "Great ph from moto",
            "It is worth to buy but only con I faced is the wifi slow download speed and I think that is a software problem hope moto will fix it",
            "Whatever they are specifying in specs is as good as they are expected. But some minor issues with the apps like hotstar. Definitely a buy",
            "Awsome",
            "Phone looks awesome and is good purchase.\nOnly concern is phone performance which need to tested on its usage.\nOverall 4 / 4.5 Star.\n\nNice features:\n1. Phone is light\n2. Back case looks premium\n3. Camera is descent\n4. Amoled , visual looks great\n5. Android stock\n6. Free from pre installed apps\n7. 5 g support.\n\nThings to be monitored, over a period of time :\n1. Performance\n2. Multitasking\n\nOthers: Price factor\n\nOverall : Descent purchase",
            "Good",
            "So easy to use",
            "Awesome Camera clarity .",
            "Value",
            "Good One... Great display, performance and battery backup is also awesome...!!!!",
            "Nice Mobile in this varient for stock Android experience",
            "It's a nice phone with so much features in such a low price. It's very lightweight and easy to carry. Also, its performance is very good.",
            "All-round performance is good",
            "Very nice Phone",
            "A better clean UI phone around this price point.\nIt is best for normal user.\nNot recommended for gaming.",
            "Good phone for the price acceptable camera ,clean os , big battery,fast charge 33 watt, overall good phone",
            "Good phone",
            "Good phone",
            "Pros\nCrazy good battery backup and charging speed.\nGood back camera.\nVery good performance with SnapDragon 695.\nVery good display.\nNot too big to hold.\nSpeakers are very good.\nGood quality case provided.\n\nCons\nVery slow copying speed from laptop.\nVery bad front camera.\nScreen could have been 90hz atleast.\nAssistant button is unresponsive most of the time.",
            "Worth it\n\nBrilliant battery ,easily last 1.5 days(if ur not gaming)\nGood display,(amoled)\nMediocre camera(may improve on update)\nGood looking phone\nGood interface and haptics\nLight weight and good in-hand feel.\n\nTo finalize\na simple yet powerful smartphone that gives u a very good battery backup and a good amoled display with 13 bands of 5g with a clean ui(stock Android ).\n\nWon't be disappointed.\n\nDisclaimer\nThis phone is not for GAMERS😅😅lol",
            "Perfect one",
            "Excellent Performance",
            "Best configuration instead those expensive flashy phones, no regret at all, worth every penny",
            "After 2 weeks of use\n\nThe display quality is superb\nSuperb rear camera\nPoor Front camera\nSoftware experience is good\nBattery backup is excellent\nSound quality is good\ngood headphone output\nGood call quality",
            "Couldn't have bought this all-round, quality, reliable and value-for-money smartphone at this price point.\n\nGo for it.",
            "One of the best product in the price segment..!!! But there are some basic things are missing like notification light 🚨, inbuilt finger print sensor, battery is ok for day-to-day usage...\notherwise moto g71-5g awesome 👍😎",
            "Good performance",
            "Good phone under this price battery backup is good and display is very good bright",
            "Excellent",
            "Good one moto",
            "If you are thinking 50megapixel camera and an old screen would give you an amazing picture output, than you are wrong.\nThe camera picture quality is not great. Pics burst once goo zoom the clocked picture.\nWhen you try to click pic using the zoom the entire screen gets bursts.\nAltogether camera not worth at all.",
            "Simply superb",
            "good decent product",
            "The only consequence is absence of compass sensor, in all other departments moto nailed it this time.",
            "Satisfied with purchase🤗thumbs up for moto G71 5g ✌️",
            "Nice phone but lacks compass sensor.",
            "Best phone of moto",
            "Fantastic",
            "Aa round ok",
            "Good Mobile, all feature are good, one disappointment screen mirroring is not in this mobile.",
            "All the specs are perfect.Only negative thing is average camera...Rest all very smooth n beautiful...Looks are awesome, lightweight,handy to use.The most beautiful thing is the naughty ringtone'HELLO MOTO\"",
            "Good",
            "It's a good phone 📱",
            "Motorola G71 it good performance and light weight..\nI love it .",
            "As of now, i don't see issue, but you have to be used to of using it new features of looking the opened apps.",
            "Superb",
            "Superb",
            "Nice phone, battery performance should increased.",
            "High class",
            "Best overall performance\nGood UI\nOptimisation is best",
            "Not ok",
            "I love it 😍",
            "Budget 5g phone with okay able features",
            "Good",
            "Nice mobile",
            "Verg good product",
            "Best in this segment",
            "Product is good, if you're using stock Android earlier, then the UI of the mobile will feel like okay but this mobile has some good features like gesture navigation and shortcuts for lots of features.\n\nBattery is awesome. 0-50 percent in 30min, 50-100 percent in 30 min. So in 1hr now or less your mobile will be charged full. Battery lasts for two days in normal usage and 1.5 days in extreme usage.\n\nCamera is good compared to my previous mobile. But needs to improve compared to Xiaomi brand.\n\nDisplay is also good with lot of new features in it. Game mode is superb.\n\nOverall good purchase in this segment.\n\n\"Only issue i faced is, delivery took 14 days for me which is not acceptable. Look for delivery date of you're purchasing the mobile.\"",
            "Very happy value mobile",
            "Nice mobile",
            "Very good",
            "Perfect buy but finger print sensor old version connectivity is so good 13 5g band that’s good go for it 👍😍",
            "Worth it! i would suggest to use gcam for better quality photos.",
            "Nice phone",
            "Motorola is a trustworthy phone",
            "Best phone in the price bracket. Good display , battery lasts full day , full charging in just over an hour . Camera is also good . Fully satisfied with the purchase.",
            "Good mobile",
            "Just go for it personal opinion",
            "Camera good - 4/5.\nwith update processing image and other can be optimised.\n\nDisplay- 4.2/5.\n\nPerformance -4.5/5\nLight weight.It feels comfortable with the size and the weight .Works smooth\n\nFingerprint - lacks a bit but u can consider it\n\nBattery -4/5.\nGives a average of 1% drop in every 5mins.",
            "Value for money",
            "Very good",
            "Nice Mobile",
            "I am using this phone for a week now. Overall a good package. But camera is average, and the back finger print scanner is not that responsive.haptics are good.",
            "Good budget phone",
            "Pros:\nDisplay\nBattery\nNo Bloatware, stock Android experience\nFast processor\n\nCons:\nAverage camera\nNo gorilla glass",
            "All is good",
            "Awesome",
            "Display - 5🌟\nProcessor - 4🌟\nLooks - 4🌟\nCamera - 3🌟\n\nOverall - 4🌟",
            "Awesome phone",
            "Overall best phone under 20k and camera performance is avaerage. Hope they will fix it in software update.",
            "Good but price is hight",
            "Justifying the mobile at this price.",
            "Best phone in 2022",
            "It is a good phone.\nCamera is average, if you often go to photoshoots and expect a stunning photographs don't go for this phone. It will give you decent photos not extra ordinary.\nBattery backup is quite well, in 1 hour it charged 10%-95%.\nCharging get a bit slow after 85% but it's common in almost every phone.\nPerformance is really good 5/5 it's a Stack Android no un necessary advertisements. It would be really great if it comes with 90 Hz refresh rate but still it's good.\nDisplay is also good. If you watch videos and Netflix or any other platform you will get good experience.\nThis Motorola phone is not that heavy weight like other phones of Motorola. Which is a good the\nOver all I would give 4/5",
            "Fantastic buy",
            "Good",
            "Camera need to improve",
            "Amazing phone made by motorola. hardware software integration is good i loved the gestures on motorola. it has nice camera and phone is fast and does not lag",
            "Nice product.",
            "good product..value for money",
            "Super value for money",
            "The camera quality feels like 5MP camera, no option to select the video quality. Don't buy if you want to buy for camera.",
            "Excellent display , light wait\nexcellent performance\nexcellent battery life\n4*4 mimo support excellent network with 5g bands\nevery thing in this phone excellent\nnot camera it's average good in day light but\nlow light and night photo are bad quality",
            "Overall practical smartphone in mid range segment good job Motorola",
            "Good phone.\nIn this price range phone is good.\nYou can choose :)",
            "Good performance",
            "It was good",
            "Best mobile for 19 k .... best buy ..... Commenting after 20 days of use......",
            "Really great package if you are the fan of clean software and Snapdragon performance processor in that price point..!",
            "Mobil is best best but camera quality is vere disappointed",
            "Okay!",
            "Super",
            "While zooming, pictures were stretching.",
            "Superb performance...👍",
            "It is excellent device on performance, display and battery. Light weight and sleek. Camera is decent but could have been slightly better.",
            "Very nice phone am impressed with functioning of phone basically best at this price range",
            "Must buy good phone",
            "Decent midrange phone with leading Snapdragon chipset.\nSD 695 5G is superior to some SD 7xx\nStock Android\nNo bloatware\nIBM ThinkShield\n\nNegatives\nNo compass\nNo high refresh rate\nNo wow factor",
            "After around two month , ,phone is dead not powering on",
            "After one week usage -\nBattery life is absolutely best getting nearly two days with around 8+hours screen on time, Charging very fast nearly in and around one hour\n\nPerformance is top notch no lags or no issues, no bloatware or ads, Pure Android 11\n\nDisplay is good but does not like the punch hole but we can use \"Nacho Notch\" app to hide it, No higher refresh rate only 60Hz\n\nArctic Blue looks very good and very light weight in hand\n\nComes with Case and 33W charger and Cable\n\nCall quality and Signal Reception is very Good,\n\nCamera is above average, No Stereo Speakers\n\nGot it for 18K - At this Price we get 13 5G Bands Support and clean Android instead of Chinese UI, Top notch Processor, Turbo Charger and 5000Mah Battery, Very Good User Experience it's worth the money",
            "It just ok.Go for another device for this price range.",
            "Best phone go for it",
            "Good product",
            "Good",
            "Powerful battary,",
            "Good phone. Satisfying performance.",
            "Ok",
            "Good",
            "Great phone in this price range.",
            "Very mudh handy mobile in this price and best performance. I just loved it",
            "Good battery charging and backup\nVery excellent for ordinary user.",
            "Camera quality improvement required. Other than that this phone is excellent.",
            "Good",
            "Every thing is ok but when i play video video are slow working and audio also",
            "Good",
            "Nice and neat experience.",
            "Great phone....lands on expectations",
            "Very Nice Cell Phone, Mainly Processor is Very Good work equal 850 SCG Processor, India's first Snap Dragon Processor Mobile, Camara Quality is Very Good.",
            "Good product",
            "Great phone however there is always but, camera isn't good.",
            "Camera is average , battery performance excellent,,light weight .The only draw back photo in flash light extreme black. I have previously use Motorola photo nd that love still continue.",
            "Good phone at good price. Almost all 5g bands are available.",
            "Camera needs to improve",
            "Excellent",
            "The best thing which I like the most is its performance... extremely superb ..no lag while playing bgmi and cod...all were saying that the display is not good but it is nice irrespective of 60 hz panel.overall a very nice phone and the camera is also killer...must consider this while buying in this price segment.",
            "Superb Display.\nExcellent performer.\nBattery lasts longer than expected.\nCharging time is approximately 1hr.\nBattery charging optimisation is there for the better health of the battery in long run.\nCamera is the only issue.Moto should work on this segment.\nNo connectivity issue.\nSpeaker is quite loud with Dolby Atmos support.\nOverall best all rounder in this price segment.",
            "Awesome Phone very light weighed",
            "Camera is not so good ..\nBattery life is ok ok\nBut overall good if you don't have much expectations with your phone",
            "Superb performance",
            "Value of money....🥰",
            "I ordered the phone and delivered next day and phone is in blue color and phone cover is very good.",
            "Display is very poor compre to Samsung phones of less price.",
            "Good",
            "Overall good phone but camera could have been better",
            "I received my phone within two days as promised. Its an all-round mobile and good for daily use.\nThe display, camera, battery are all very good.\nThis is very good product from Motorola. This is my third Motorola phone and they have maintained the name and quality.\nWould recommend to go for this mobile. It won't disappoint you."
        ],
        "likes": [
            "491",
            "113",
            "176",
            "103",
            "125",
            "23",
            "33",
            "27",
            "39",
            "96",
            "491",
            "113",
            "176",
            "103",
            "125",
            "23",
            "33",
            "27",
            "39",
            "96",
            "25",
            "32",
            "52",
            "56",
            "17",
            "13",
            "11",
            "16",
            "19",
            "12",
            "13",
            "6",
            "18",
            "4",
            "4",
            "4",
            "19",
            "6",
            "6",
            "3",
            "3",
            "3",
            "3",
            "7",
            "4",
            "4",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "3",
            "1",
            "2",
            "1",
            "2",
            "1",
            "2",
            "3",
            "1",
            "1",
            "1",
            "2",
            "0",
            "0",
            "2",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "209",
            "158",
            "31",
            "50",
            "55",
            "40",
            "7",
            "99",
            "14",
            "22",
            "6",
            "4",
            "5",
            "4",
            "7",
            "1",
            "1",
            "1",
            "0",
            "10",
            "10",
            "13",
            "4",
            "3",
            "3",
            "3",
            "3",
            "3",
            "2",
            "3",
            "9",
            "4",
            "4",
            "7",
            "13",
            "7",
            "4",
            "5",
            "6",
            "3",
            "1",
            "3",
            "1",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "6",
            "3",
            "3",
            "20",
            "4",
            "4",
            "1",
            "2",
            "1",
            "5",
            "3",
            "2",
            "2",
            "1",
            "1",
            "2",
            "1",
            "0",
            "1",
            "1",
            "1",
            "2",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "12",
            "4",
            "5",
            "2",
            "2",
            "2",
            "2",
            "2",
            "3",
            "4",
            "1",
            "1",
            "0",
            "1",
            "8",
            "2",
            "1",
            "1",
            "2",
            "1",
            "2",
            "2",
            "3",
            "0",
            "0",
            "2",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "102",
            "20",
            "48",
            "28",
            "43",
            "3",
            "10",
            "3",
            "1",
            "16",
            "102",
            "20",
            "48",
            "28",
            "43",
            "3",
            "10",
            "3",
            "1",
            "16",
            "17",
            "29",
            "13",
            "14",
            "0",
            "0",
            "0",
            "1",
            "2",
            "1",
            "2",
            "0",
            "7",
            "0",
            "0",
            "0",
            "9",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "5",
            "1",
            "1",
            "1",
            "9",
            "1",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "30",
            "24",
            "3",
            "7",
            "9",
            "11",
            "0",
            "40",
            "4",
            "6",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "2",
            "5",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "1",
            "2",
            "1",
            "9",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "1",
            "2",
            "28",
            "2",
            "2",
            "4",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "24",
            "6",
            "6",
            "3",
            "2",
            "1",
            "2",
            "4",
            "7",
            "6",
            "1",
            "1",
            "1",
            "1",
            "41",
            "7",
            "2",
            "2",
            "2",
            "3",
            "2",
            "57",
            "0",
            "1",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1"
        ]
    },
    "qna": {
        "questions": [
            "Q:Dynamic RAM expansion is available???",
            "Q:Dolby Atmos Yes or no",
            "Q:Does the mobile has a SD card slot (Memory Card)",
            "Q:Is the screen recording feature available at this phone?",
            "Q:Where's finger print sencer.??",
            "Q:Is it given adopter ?",
            "Q:Can i play pub g mobile ultra high setting smoothly???",
            "Q:Slow motion video recording here?",
            "Q:Does moto g71 support 2sim 4G....?",
            "Q:Corning gorilla glass protection?",
            "Q:Good for high gaming",
            "Q:Is Charging cable pure USB C (both side usb c connector)?",
            "Q:gorilla glass coated , yes or no ?",
            "Q:Is there a fingerprint sensor in moto g71g",
            "Q:How is the loudness of the speaker during phone call's ?",
            "Q:Does it support biomatric otg ? Plz tell me",
            "Q:It is running on Android 12 or 11 after opening box",
            "Q:Pubg/BGMI play smoothly??",
            "Q:Is call recording option will show on dialpad once other user lift call ??",
            "Q:Down and back buttons are available in this phone?",
            "Q:Does it support memory card",
            "Q:Is ready to tv",
            "Q:Does this phone have a gyroscope sensor?",
            "Q:Does this phone come with hybrid or dedicated sim slot",
            "Q:Is OTG available in this product ?",
            "Q:Where the Camera photo save on",
            "Q:Redmi Note 10 Pro vs Moto g71 Best Camera.",
            "Q:In this phone have auto call recording option without any announcement???",
            "Q:Is there a problem while using Google maps",
            "Q:How many 5g band's available in this phone",
            "Q:Have g71 have mirroring",
            "Q:Dual spekar and Dolby Atmos",
            "Q:How mimo is configured on this phone?",
            "Q:, How is the camera clarity?",
            "Q:does this contains stereo speakers or mono",
            "Q:Call recordering hai kya",
            "Q:Does it has it blaster",
            "Q:Does g71 has DUAL VOLTE service?",
            "Q:What is the battery capacity",
            "Q:Does this phone has dual app feature ?",
            "Q:Whether we can use GPS for directions?",
            "Q:Is the processer 6nm or 8nm?",
            "Q:Does this phone has a front flash?",
            "Q:Does it include earphones?",
            "Q:Does it include headphones?",
            "Q:Is may call recording ke suvidha hai",
            "Q:Call recorder avlible",
            "Q:Does it support both sim 4G at a time ?",
            "Q:which storage type is available",
            "Q:Does the phone come with screen guard or should i buy extra",
            "Q:Is this phone requires tempered glass?",
            "Q:Charging time from 0 to 100 with the original Turbocharger 30 ?",
            "Q:Does Moto g71 support 5g on both SIM slot?",
            "Q:3.5 Audio jack support???",
            "Q:Does this phone support Wifi Calling?",
            "Q:Does it has two sim slot and one dedicated sd card slot",
            "Q:It is support 120hz refresh rate",
            "Q:Fingerprint in dsplay",
            "Q:amoled display???????? h ki nahi",
            "Q:How much time g71 take to get fully charged?",
            "Q:Is it OTG compatible ?",
            "Q:Does this phone has type C charger?",
            "Q:Is it water resistant?",
            "Q:As some reviews says there is a problem playing videos in OTT platform like Disney+, Voot etc. Is there any issues?",
            "Q:WILL THIS DEVICE UPDATE TO ANDROID 12",
            "Q:Does it support Airtel wifi calling?",
            "Q:Auto call recording system hai",
            "Q:Is memory expendable",
            "Q:Does it support reverse charging?!!!",
            "Q:Does it support 4k video recording ?",
            "Q:Automatic call recording system available your phone call recording",
            "Q:Call recording facility is available for this phone",
            "Q:What is the maximum shutter speed in pro mode? is it 16s?",
            "Q:pre applied tempered glass",
            "Q:In this phone can possible jio to jio video calling?",
            "Q:Does it support HDR 10?",
            "Q:Is there gallery application.?",
            "Q:does it have compass which will help in navigation",
            "Q:1sim card and 1 memory card slot available?",
            "Q:This phone has notification light",
            "Q:Does it have call recording feature and call through broadband?",
            "Q:Call recording warning sound is heard by the 2nd person.",
            "Q:Is protective cover is hard tpu case",
            "Q:Does this mobile support native video calling?",
            "Q:Does it support 4g volte?",
            "Q:Purchased the tampered glass from Flipkart, which is without camera hole. It will effect picture quality or not?",
            "Q:Moto G71 or Realme 9 which one is better",
            "Q:Battery issue in moto phone??",
            "Q:Can we use two jio 4g sim at single time? Does it have direct video call option??",
            "Q:have widevine l1 support?",
            "Q:In built App lock? Yes or no",
            "Q:Can we use type C to 3.5mm to get 3.5mm jack support? Please confirm",
            "Q:What's the build quality?",
            "Q:Is this phone supports VoLTE ???",
            "Q:Waiting call facility in this phone aveliable",
            "Q:Is this phone has VoLTE option...",
            "Q:Will phone get Android 13 update?",
            "Q:What experience of 4x4MIMO? is signal, data quality improved or not?",
            "Q:Is auto call recording is available in this phone.... without 2nd party knowing this....",
            "Q:Does this phone support audio recording?",
            "Q:Is it ufs storage?",
            "Q:Jio to jio video call is possible",
            "Q:Does this phone have a provision of expendable memory?",
            "Q:Does Moto G71 5G come with stock android?",
            "Q:Is moto g 71 supports volte sim",
            "Q:Does the phone come with earphone in box",
            "Q:How is the call quality and microphone ? I generally face this issue with network strength and call quality in Moto",
            "Q:Headset is available in box",
            "Q:Does Moto G 71 has two sim slot and one dedicated SD card slot"
        ],
        "answers": [
            "A:yes",
            "A:Yes",
            "A:Non... Only 2 sim slot",
            "A:yes",
            "A:backside",
            "A:yes 33watts charger included in box.",
            "A:yes",
            "A:Yes.",
            "A:yes",
            "A:No.",
            "A:Yes definitely. Snapdragon 695 handles everything smoothly.",
            "A:Yes",
            "A:yes",
            "A:Fingerprint sensor on the back of the phone. No in display fingerprint reader.",
            "A:crystal clear and loud",
            "A:yes",
            "A:11",
            "A:Yes",
            "A:yes,but it will inform the caller that uhh have started recording a call.",
            "A:Yes",
            "A:No",
            "A:yes",
            "A:Yes.",
            "A:dedicated sim slot",
            "A:no",
            "A:You can see picture in Google photos or you have to download File Manager from play store",
            "A:no",
            "A:My phone is probably 15 or 16 days old but I haven't seen any call being recorded automatically. u can activate that feature in the settings menu.",
            "A:no",
            "A:12 or 13 as per your specifications",
            "A:yes",
            "A:No, it's single speaker with Dolby Atmos.. but excellent sound. You will not be disappointed..",
            "A:4*4",
            "A:It is ok, not that good. If you are looking specifically for camera phone, this is not that product",
            "A:mono speakers.with Dolby Atoms",
            "A:yes",
            "A:If you mean IR blaster then it doesn't have one",
            "A:yes",
            "A:5000",
            "A:No",
            "A:Yes for sure .",
            "A:6nm",
            "A:no",
            "A:No ! The box does not have earphones. You have to buy them separately.",
            "A:Hello Madhav. No , it does not include headphones.",
            "A:Yes",
            "A:Yes available",
            "A:yes",
            "A:128 gb",
            "A:you should buy extra",
            "A:Yes",
            "A:33W charger",
            "A:No",
            "A:Yes",
            "A:Yes, but you will need internet based calling apps installed",
            "A:No. Only 2sim slot, no memory card slot.",
            "A:No, 60 Hz refresh rate",
            "A:No",
            "A:No it comes with OLED , they are misleading",
            "A:50 minutes",
            "A:Yes, C type OTG compatible.",
            "A:Yes it is type C charger",
            "A:yes",
            "A:No, I did not face any problems while playing videos on the OTT platform.",
            "A:Yes",
            "A:Yes",
            "A:You can readily record any call whenever you want. But just to inform you that it will announce that the call is being recorded.",
            "A:No, it's not having memory Card slot . However you can use external OTG pendrive for storing extra data.",
            "A:No",
            "A:No",
            "A:No",
            "A:no call recording facilities",
            "A:32sec",
            "A:no.",
            "A:Yes",
            "A:no",
            "A:yes",
            "A:no compass",
            "A:No",
            "A:no",
            "A:Yes it does support call recording and calling over wifi.",
            "A:yes",
            "A:Yes and it is decent one.",
            "A:Yes, it does",
            "A:yes. also has support for 13 5g bands.",
            "A:If you place a glass that has been tampered with, it will definitely affect the picture quality.",
            "A:moto G71 is Far better.",
            "A:I am user of Moto g71, and has been using it for past 1 month or so, haven't faced anh battery issues yet. In fact I get a very healthy battery life",
            "A:Yes, you can use 2 JIO SIMs, Also it Support Direct Video Call.",
            "A:yes",
            "A:Yes",
            "A:Yes this is working",
            "A:this phone is light weight and smooth display",
            "A:yes",
            "A:Yes",
            "A:yes.",
            "A:not yet",
            "A:yes improved",
            "A:No",
            "A:Yes",
            "A:no",
            "A:Yes.",
            "A:No, it doesn't.",
            "A:Yes",
            "A:yes",
            "A:No",
            "A:call quality and microphone very good . network strength also very good no issues. my issues in this divice only the finger print scanner not working.",
            "A:not available",
            "A:yes Two SIM card but not dedicated SD card slot"
        ],
        "likes": [
            "8",
            "21",
            "24",
            "6",
            "30",
            "2",
            "2",
            "3",
            "3",
            "1",
            "4",
            "4",
            "4",
            "11",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "4",
            "1",
            "2",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "21",
            "31",
            "16",
            "4",
            "21",
            "2",
            "2",
            "3",
            "3",
            "2",
            "3",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "2",
            "3",
            "2",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "2",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0"
        ],
        "dislikes": [
            "1",
            "8",
            "16",
            "1",
            "32",
            "0",
            "0",
            "1",
            "1",
            "6",
            "2",
            "3",
            "4",
            "14",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "6",
            "1",
            "5",
            "6",
            "8",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "1",
            "0",
            "0",
            "1",
            "1",
            "4",
            "3",
            "1",
            "6",
            "74",
            "9",
            "9",
            "1",
            "17",
            "1",
            "3",
            "1",
            "3",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "0",
            "1",
            "1",
            "2",
            "4",
            "0",
            "1",
            "2",
            "3",
            "4",
            "3",
            "4",
            "5",
            "5",
            "7",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "0"
        ]
    },
    "summary": {
        "pros": {
            "Performance": "The Qualcomm Snapdragon 695 5G Processor is superfast and gives optimal gaming performance.",
            "16.25 cm (6.4) AMOLED FHD display": "The AMOLED FHD display gives crystal clear visuals and a smooth, vibrant experience.",
            "5000 mAh Battery": "This phone comes with a 5000 mAh battery and a 33W turbopower charger giving 10+ hours of backup on heavy usage."
        },
        "cons": {
            "Camera": "The triple camera setup and 16MP front camera combination is not upto the mark and is of average quality."
        },
        "verdict": "The Moto G71 5G is an amazing phone at this price point suitable for daily use and an awesome gaming experience.",
        "Additional Information": "Dolby Atmos, Screen recording, Backside fingerprint, Slow motion video recording."
    }
}