{
    "title": "Whirlpool 292 L Frost Free Double Door 2 Star Refrigerator with Glass Door  (Crystal Black, Neo 305GD PRM Crystal Black (2S)-N)",
    "product_specification": {
        "In The Box": "1 Refrigerator, User Manual, Warranty Card",
        "Type": "Double Door",
        "Refrigerator Type": "Top Freezer Refrigerator",
        "Defrosting Type": "Frost Free",
        "Compressor Type": "Normal Compressor",
        "Capacity": "292 L",
        "Number of Doors": "2",
        "Star Rating": "2",
        "Coolpad": "Yes",
        "Toughened Glass": "Yes",
        "Built-in Stabilizer": "Yes",
        "Convertible Refrigerator": "No",
        "Shelf Material": "Toughened Glass",
        "Design": "Solid",
        "BEE Rating Year": "2020",
        "Stabilizer Required": "No",
        "Refrigerator Interior Light": "Yes",
        "Launch Year": "2020",
        "Net Total Capacity": "292 L",
        "Net Height": "1720 mm",
        "Net Depth": "670 mm",
        "Net Width": "570 mm",
        "Weight": "60 kg",
        "Installation & Demo": "Authorised Service Engineer will install the Refrigerator, make it operational and explain the below details. 1. How to Use, 2. Features,3. Do's and Dont's.",
        "Warranty Service Type": "Technician Visit",
        "Warranty Summary": "1 Year Comprehensive on the Product and 10 Years on the Compressor from Whirlpool",
        "Covered in Warranty": "All Parts Excluding Plastic Parts, Glassware, Bulb and Tube from the Date of Purchase Against Defective Material and Workmanship",
        "Not Covered in Warranty": "Parts: Plastic / Glassware / Bulb / Tube. Any Accessories External to the Product. The Product is Not Used According to the Instructions Given in the Instructions Manual. Defects Caused by Improper Use as Determined by the Company Personnel. Modification or Alteration of Any Nature made in the Electrical Circuitry or Physical Construction of the Set. Site (Where the Premises is Kept) Conditions That do Not Confirm to the Recommended Operating Conditions of the Machine. The Serial Number is Removed, Altered or Obliterated from the Machine. Defects Due to Cause Beyond Control Like Lightening, Abnormal Voltage, Acts of God or While in Transit to the Service Centres or Purchasers Residence"
    },
    "product_description": {
        "12 Days of Garden Freshness": "This refrigerator offers up to 12 days of garden freshness, thanks to the Honey Comb Design (with a moisture control system), the Microblock Technology, and the FreshFlow Air Tower with Flexi Vents. This way, you can enjoy the freshness of your fruits and veggies for a long time.",
        "6th SENSE DeepFreeze Technology": "The freezer compartment of this refrigerator makes use of the 6th SENSE DeepFreeze Technology to provide circular air flow in it. This helps limit cold air from going out of the freezer when the door is opened.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "3",
            "1",
            "3",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "5",
            "3",
            "1",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "3",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "3",
            "4",
            "4",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review": [
            "It’s Huge in dimension compared to single door fridge.\nBest in\n+290L category\n+ Space is enough for family of 4-5\n+Aesthetics wise it has minimalist interface\n+VFM\n\nLacks\n-Fruit Basket\n-Child Lock\n\nOverall it is good",
            "So nice I like to buy this...😘😍 Black colour is perfect like marble shine doors",
            "Whirlpool is one the best products it's very cool and looks different . fantastic work and soo patient we are very happy to say that it comes with happiness to our home classy product at this price 😘😘",
            "Very Nice Product. Very attractive and good design. delivery and installation was earlier than expected. Excellent.\nSince it is mirror finish Vastu may be considered. the product is worth every penny.",
            "In my opinion Whirlpool has the best product at the best price. I don't buy anything but Whirlpool. My new bottom freezer refrigerator has more room than my previous side by side. The bottom freezer is a great feature and works very well for me.",
            "Nice design by whirlpool... Value for money... Silent product... Lots of space to use...",
            "Design and look osm,, I will give 4 stars to the function. But i am happy with this product.😍",
            "I bought crystal color.. I liked it.. Just go for it..",
            "Fantastic design impressive looook just love it❤️❤️❤️❤️",
            "Very nice products by whirlpool refrigerator",
            "It’s Huge in dimension compared to single door fridge.\nBest in\n+290L category\n+ Space is enough for family of 4-5\n+Aesthetics wise it has minimalist interface\n+VFM\n\nLacks\n-Fruit Basket\n-Child Lock\n\nOverall it is good",
            "So nice I like to buy this...😘😍 Black colour is perfect like marble shine doors",
            "Whirlpool is one the best products it's very cool and looks different . fantastic work and soo patient we are very happy to say that it comes with happiness to our home classy product at this price 😘😘",
            "Very Nice Product. Very attractive and good design. delivery and installation was earlier than expected. Excellent.\nSince it is mirror finish Vastu may be considered. the product is worth every penny.",
            "In my opinion Whirlpool has the best product at the best price. I don't buy anything but Whirlpool. My new bottom freezer refrigerator has more room than my previous side by side. The bottom freezer is a great feature and works very well for me.",
            "Nice design by whirlpool... Value for money... Silent product... Lots of space to use...",
            "Design and look osm,, I will give 4 stars to the function. But i am happy with this product.😍",
            "I bought crystal color.. I liked it.. Just go for it..",
            "Fantastic design impressive looook just love it❤️❤️❤️❤️",
            "Very nice products by whirlpool refrigerator",
            "Good",
            "Good product\n\nDesigned is to good\nSafe delivery 🚚🚚",
            "Look beautiful capacity good",
            "Beautiful...100%satisfied....",
            "Awesome product. Lot's of space and cooling is really good. Its look like 300ltr+. The glass is tough enough.",
            "It's huge and nice",
            "Nice 👍 product",
            "Very good 👌👌😊😊",
            "This fridge is realy the best whirlpool belive it,s realy hard to get a good brand of another brand. at this prize.refrigerator is a awesome. As u shown in the picture u it,s fully mirror style cooling is very good. Installation done. after two days of delivery.",
            "The cooling is very good even at normal temperature I am satisfied with the product",
            "Nice Look",
            "Best frize in this rate👍👍👍\nI love flipcart 😚😚🌺🌺",
            "Very good delivery and very stylish product",
            "After 7 days fridge was not cooling",
            "Must buy one!\nThe fridge at this price is very good, however, space is not at the expectation level when comapred with the size of the refrigerator. Just a month over and its performance cannot be judged. Overall Would strongly recommend for brand, stylish, decent price. Thanks to flipkart",
            "Excellent cooling",
            "Classic Design, Super attractive, Increasing home interior richness, Glass Finish, Noiseless and no heating issue at all.\nSuper Satisfied.",
            "I love it...Super design & very smart ...",
            "Very good",
            "Excellent I lv it",
            "Nice",
            "It's valuable product... Design was aswome. Performance also good.worth for money",
            "Just loved it",
            "I love ❤️❤️ this looking was plane and simple and Impressive and function 😀 was very good 👍👍",
            "Awesome 👍",
            "It's a very good product\nKudos to Flipkart and Whirlpool",
            "Awesome",
            "nice",
            "Excellent",
            "Very nice",
            "We got this at 12-08-2020. It's looking so good... Let's see how will work and share the feedback later..",
            "Fine design and elegant product worth for the money spent.",
            "Good product and maybe side walls will be heat faster. But ok with this.\nInstallation and Demo Good",
            "I Like it",
            "Nice product and good delivery",
            "The product is eye catching, slim black color gives it a perfect look. Vakue for money for sure",
            "Great to buy this item... happy for you Flipkart.....",
            "Just go for it ♥️",
            "Best one so cool and excellent refrigerator",
            "Its good in features and enough space for a family.\nFlaw which I felt , that it is having handle on the side of the door so when you open it your hands also touch front part of door which is a mirror . So it start looking dirty very quickly",
            "Pros\nDesign\nCooling speed\nPower consumption\nInside freezer arrangement\nOverall good for family of size 6\nSilent\nVegetable drawer is very large\n\n\nCons\nGlass panel get dirty easily finger print easily visible on fridge doors\nFragile - not suitable for family having mischievous kids\nCleaning door is a tough task\nSides of fridge should have more aesthetic appeal",
            "Smart colour.\nSmart cooling.\nVery nice product\nVery nice one finishing very good",
            "Dont buy this product...After i taken this product every 15 days the freezer was not coooling...There is a manufactor default",
            "No cooling even in max settings. Water forming and dropping in the bottom compartment. Ice not getting freezed in the freezer compartment.",
            "Installation is very bad",
            "Good",
            "Superb product. Thnx filpkart",
            "Awesome product, value for money, whirlpool forever, timely deliverd, timely installation and demo.",
            "Fully Satisfied this products",
            "Good product, but Flipkart didn't deliver it on time(took a month to deliver it) and didn't deliver to location, need to hire utility vehicle to get it. Pathetic delivery service by Gati couriers.",
            "Very bad. lured with exchange. Only to deceive to buy from Flipkart.",
            "In this price range, good to go for it.\nBut never heard anyone for installation it been more that 45 days.",
            "Good product came richness to my home\nLooking soooo gd",
            "Every thimg is good but it do have 2ltr bottole stand in side, you can not keep 2ltr bottol coldring that is miss",
            "Great looking ,i am happy with flipkart service,in freeze whirlpool always best brand, all over good experience,when i use this than i say about product performance",
            "Best product...best price...",
            "Nice looking\nwithout noise\nBest performance",
            "excellent. ..",
            "Overall performance is good.\nLooking fantastic.",
            "Delivery person denied in beginning to deliver to the village but ultimately delivered the product. All over experience is fine. Product is perfect,working good,satisfied.",
            "Very nice looks",
            "As per storage no of 265 liters the capacity is not fulfilled complete don't go with the numbers of storage capacity of 265 liters,my old refrigerator's storage capacity is bigger than this, my old refrigerator was of 225 liters, but it used to contain more things as compared with this product.",
            "Gd",
            "Good",
            "Wow means wow..I got this fridge with the exchange of 23k...very reasonable price and the performance is excellent. I just loved the built quality and black is my fav",
            "Good product",
            "Value for money",
            "Osm",
            "Value for money",
            "Excellent design and good space\nFlipkart online shopping experience also good",
            "Very nice product 🙂🤗",
            "nice",
            "Good",
            "Nice one",
            "Very nice Product & Good Price",
            "Good",
            "Nice",
            "Worst",
            "Superb Quality and no doubt this product,",
            "Refrigerator is really good.....and cooling is more....aver all good...👍",
            "I was really amazed with the product.",
            "Good company and looking style and working also better",
            "Exelent",
            "More satisfying product..there is no leakage of water anywhere nd colour and model of refrigrtor was awesome..I liked it..must buy..",
            "very nice products..thanxxx flipkart😊",
            "Good product . Must buy .",
            "Good design. Elegant look. Performance so far so good. No light in freezer is a negative. Also Glass covered doors need extra care and maintenance. Prompt installation by whirlpool service team. Happy with this purchase.",
            "Superbbbb, fantastic fully recommend",
            "Very nice worth for money",
            "Beautiful Refrigerator Good quality best product",
            "Lock is not available",
            "Not so good.. Totally different color",
            "Awesome",
            "Best refrigerator for 4 family members.. good performance and reduce electricity",
            "Product was amazing..... Looks awsome.... Excellent performance....... Installation done next day of delivery....",
            "Save your money don't waste on Dibba",
            "Very good product",
            "very Good product",
            "Good one",
            "Exact shown in the picture....",
            "Nice look",
            "All good but instalation not complete 😏",
            "Ok",
            "Good one genuinely you may buy it",
            "Good",
            "Nice",
            "This product is good",
            "Awesome",
            "I am so Happy😊",
            "Nice product I'm happy 😊😁 thenkyou flipkart",
            "Good refigerator.",
            "Don't waste your money.",
            "Good",
            "Good product",
            "Nice product",
            "Value for money. Good space and the design nd look of this product is just awesome. You can go for it.",
            "Good product, get wonderful discount. Highly recommended.",
            "The glass finish is a bit brittle on the edges.",
            "Very nyc ... 265 lilbit small if have a joint family...",
            "Ok",
            "Good",
            "good",
            "Good",
            "Superb product nice mirror design perfect time in delivered",
            "Good",
            "Excellent",
            "Excellent product",
            "Good",
            "Best in value",
            "Good for money",
            "Good..",
            "Nice product",
            "It's nice... ❤️💖👍🏻",
            "Whirlpool Refrigerator 265L is tha best product comparison to Other refrigerator.nice product I am happy..",
            "Looks great, price is also at very reasonable, specious, but it should be convertible, this feature is not added..",
            "Good product but it loses star for:\n2 star BEE rating ( less power efficiency)\nLack of many storage separation (like for candy,meds etc)",
            "Thank u flipkart ontime delivery good product installation also ontime",
            "Very nice",
            "Great support from Flipkart and Whirlpool for same day installation.\n\nColor looks completely different. (It looks crystal black instead of crystal mirror). Albeit that's ok.\n\nThanks",
            "2 star only its only a fault",
            "I am verymuch satisfied with the fridge.design and functionwise it is excellent.worth the money",
            "Good",
            "Excellent",
            "Looks really amazing..... performance is also good",
            "Fast cooling system in this fridge",
            "Sooo coool look ❤️❤️❤️❤️ black 🖤",
            "Superb owsome priduct\nM happy to buy this\nM using whirlpool first time n this gives amazing experiance",
            "Outstanding fridge in this range the glass design is just amazing lovely fridge thankyou flipkart",
            "Nice product super👍 👌",
            "im very much satisfy with this. recommend to everyone",
            "It's a very very Amazing product ,and I like it very Much and I am very Happy to buy this refrigerator and the crystal glass is so amazing and very shining..😊😊",
            "Nice",
            "Awesome product very affordable product at this price. Im super happy with product. Thankq flipcart amd whirlpool",
            "It doesn't have a lock and the door is made of toughend glass. It is NOT CHILD PROOF, However the cooling is great and easy to clean.",
            "Width wise its short and Bottle wrack is aslo small . big bottle of cold drinks cant keep in bottle wrack space is less",
            "I booked aqua color but I get black",
            "Using for past 1 month. Bought additional 3 years warranty\n\nPros:\nPacking was good.\nDelivery and installation as expected\nGlass finish in front. Complete black 🔥🔥🔥.\nNot much silent operation. But still good.\nSpacious and adequate bottle holders.\n\n\nCons:\nFreezer dont have light. Night times it might be difficult.\n2 star energy rating. More power consumption. So, Cooling- keep in normal mode. That would be enough.\nBe careful with the glass door finish.\nFridge stand not provided. You can buy separately though",
            "very good product. the refrigerator delivered on time in good condition, working good so far , still under observation. today is second day.",
            "It looks really great as shown in image and we really love it....🥰🥰",
            "Like it",
            "Design is very good",
            "Go for it's. It's awesome",
            "Good",
            "Good products no sound I am happy 😘🤗😆",
            "Best refrigerator in this segment Excellent product",
            "Very nice!! No comments value for money..",
            "Its great experience to choosen whirlpool",
            "Nice product beautiful",
            "Awesome refrigerator, it's very spacious , I m very thankful to flipkart",
            "Very nice product",
            "Nice product from flipkart",
            "Gd product",
            "Ossom",
            "A very beautiful product from Whirlpool .... awesome looks... excellent interior",
            "Great look.superb finish! Gives a grt look to your kitchen.must buy product.",
            "Thank you Flip kart,\nFor the best Service, Best products and Resonable Price,\nI hope will in future I'll get best product with best offers.",
            "Super",
            "It's good",
            "Very very nicely work 👏, looks very nice, i just love it 😀",
            "Always best",
            "Good product",
            "Best product",
            "Beautiful color and working effectively",
            "good one",
            "NYC product satisfying look is amazing",
            "Excellent",
            "Very good product....value for money....you should go for it....very nice glass body",
            "Go for it just amazing",
            "Not a good performance",
            "Very nice model and styles",
            "Very good product",
            "Nice design",
            "Very nice one finishing very good",
            "It is nice product and design is awesome",
            "Superb",
            "nice design",
            "Reach look, looking is super",
            "Colour is good nd good look. Exillent product",
            "Smart colour.\nSmart cooling.\nVery nice product",
            "Colour and its finishing is awesome, however space is not that much satisfying.",
            "Nice product",
            "If you add cover it will be worth for.money ....",
            "A good product with a good look.",
            "Good",
            "Nice product",
            "Excellent At This Price Really Very Good",
            "Superb product....",
            "Non inverter refrigerator but not a issue ....it's look is great",
            "Nice one"
        ],
        "likes": [
            "230",
            "24",
            "11",
            "5",
            "29",
            "20",
            "10",
            "30",
            "46",
            "83",
            "230",
            "24",
            "11",
            "5",
            "29",
            "20",
            "10",
            "30",
            "46",
            "83",
            "32",
            "23",
            "31",
            "11",
            "37",
            "5",
            "12",
            "4",
            "4",
            "10",
            "3",
            "5",
            "13",
            "4",
            "5",
            "5",
            "5",
            "6",
            "2",
            "2",
            "2",
            "2",
            "3",
            "3",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "46",
            "7",
            "2",
            "2",
            "39",
            "0",
            "0",
            "3",
            "7",
            "19",
            "46",
            "7",
            "2",
            "2",
            "39",
            "0",
            "0",
            "3",
            "7",
            "19",
            "6",
            "4",
            "7",
            "1",
            "14",
            "0",
            "3",
            "0",
            "0",
            "4",
            "0",
            "1",
            "7",
            "1",
            "2",
            "1",
            "2",
            "3",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "6",
            "2",
            "3",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Its 2 stars but energy consumption not mentioned in units per year?",
            "Q:how much is the storage capacity",
            "Q:can you tell me the colour of this refrigerator?",
            "Q:Is it worth it to buy or any other refrigerator is best for this price?",
            "Q:Is it a inverter refrigerator?",
            "Q:Crystal mirror is different peace or same?",
            "Q:Surface glass can be broken",
            "Q:Electricity consumption is more?",
            "Q:Model number of fridge",
            "Q:It is which year model",
            "Q:What is the size of fruit basket??!",
            "Q:The glass will break aa",
            "Q:Does this fridge required staplizer",
            "Q:Upper door is dark",
            "Q:Can we use this fridge for kirana stores",
            "Q:Is it frost free?",
            "Q:it was in built staplizer",
            "Q:Is it protect from shock",
            "Q:Is there os door alarm",
            "Q:door lock or not",
            "Q:is it possible to remove ice tray to make more space on the freezer compartment?",
            "Q:is there door lock in this refrigerator..?",
            "Q:has it door alaram?",
            "Q:is it a converter fridge?",
            "Q:Is there any light at upper part, i mean in deep fridge",
            "Q:It is convertable or not ?",
            "Q:neo 278GD PRM crystal Black (2s)-N and FF 2D 278 4S/2020 model are same?",
            "Q:I HAVE CONFUSED FOR THE COLOUR... PLEASE TELL ME THAT WHICH COLOUR IS BEST FOR LOOKING IN THOSE???",
            "Q:Power Energy consumption?",
            "Q:This model has child lock facility /normal key lock system???",
            "Q:Is it 6th sense technology",
            "Q:Lights in deep freeze",
            "Q:how many units per year",
            "Q:Does this fridge require a stabilizer ?",
            "Q:it can run by inverter or not",
            "Q:If light goes than how many times fresh the fruit or cold water in freez....?",
            "Q:Auto on off??",
            "Q:Dfreez Available yes or no",
            "Q:It says doors are made of glass... Is it strong enough to take accidental hits?",
            "Q:Per annual consume unit",
            "Q:This fridge compressor is made by which metal copper or aluminium",
            "Q:Is it scratchless glass?",
            "Q:how many units it takes per month?"
        ],
        "answers": [
            "A:Yes, But in term of energy consumption it is more efficient.",
            "A:265",
            "A:Its black with a mirror in which any one can see himself/herself. At night it looks grey due to the ambient light",
            "A:Technically it's worthfull to buy and also if you want a much more bigger storage with a style one.",
            "A:No",
            "A:completely different and very easy to clean. Took 3 months backs but satisfy with the product. Gyanesh",
            "A:yes ,if you hit hard not so fragile.",
            "A:Not much more.",
            "A:gd 2d 278 4s/2020",
            "A:2020",
            "A:its Normal just like other refrigerator...",
            "A:My fridge has completed 5 month and nothing happened.",
            "A:Yes",
            "A:yes",
            "A:Yes , you can where ever you want. Since it is 2 star power consumption will be more",
            "A:yes",
            "A:no",
            "A:yes",
            "A:No",
            "A:no",
            "A:yes...to good",
            "A:No",
            "A:No",
            "A:No, it's a non convertible and non inverter refrigerator",
            "A:No, lights in freezer",
            "A:Not convertable",
            "A:no",
            "A:Black at its best. It has glass finish in front looks very glossy and dashing",
            "A:253",
            "A:no i doesn't have lock as such..but there is no handle to pull the door..so kids wont have handle to hold and pull..",
            "A:no",
            "A:No, most Refrigerators don't provide Lights in Freezer area and same with this. Only high end Refrigerators come with this facility.",
            "A:253 units per year as company claims",
            "A:no",
            "A:yes it can",
            "A:2/3 hours",
            "A:no",
            "A:YES",
            "A:NO",
            "A:220-230 units per annual",
            "A:It's copper",
            "A:Yes",
            "A:may be 30+(surely I don't know because I don't want to check this"
        ],
        "likes": [
            "40",
            "42",
            "9",
            "5",
            "2",
            "2",
            "1",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "38",
            "16",
            "26",
            "8",
            "2",
            "3",
            "3",
            "2",
            "2",
            "1",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0"
        ],
        "dislikes": [
            "10",
            "21",
            "3",
            "3",
            "0",
            "0",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "9",
            "6",
            "16",
            "4",
            "0",
            "0",
            "3",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0"
        ]
    }
}