{
    "title": "LG 420 L Frost Free Double Door 3 Star Refrigerator  (Shiny Steel, GL-I472QPZX)",
    "product_specification": {
        "In The Box": "Main Unit",
        "Type": "Double Door",
        "Refrigerator Type": "Top Mount",
        "Defrosting Type": "Frost Free",
        "Compressor Type": "Smart Inverter Compressor",
        "Capacity": "420 L",
        "Number of Doors": "2",
        "Star Rating": "3",
        "Coolpad": "No",
        "Toughened Glass": "Yes",
        "Built-in Stabilizer": "No",
        "Shelf Material": "Toughened Glass Shelves",
        "Power Requirement": "AC 230 V, 50 Hz",
        "BEE Rating Year": "2020",
        "Launch Year": "2017",
        "Net Height": "1740 MM",
        "Net Depth": "710 mm",
        "Net Width": "680 mm",
        "Weight": "70 kg",
        "Installation & Demo": "Explain all the functionality of the product\nFlipkart will facilitate Installation & Demo at time of your convenience from an brand authorized service engineer\nUsage of the product\nThe authorized service engineer will be providing detailed demo that includes\nThe Installation & Demo service will be provided free of cost. All additional accessories not part of the the package will be charged separately\nPreventive maintenance action to be taken\nFlipkart will communicate the day and time slot of the scheduled Installation & Demo through a SMS and the same information will also be available in your order details page",
        "Warranty Service Type": "Technician Visit",
        "Warranty Summary": "1 Year Warranty on product and 10 Years Warranty on compressor from LG",
        "Covered in Warranty": "12 Months on Parts and Labor",
        "Not Covered in Warranty": "Consumables\nLoose Plastic Parts\nGlass\nLight Bulb"
    },
    "product_description": {
        "Smart Inverter Compressor": "This is an energy-efficient compressor that adjusts its cooling power according to the amount of food in this refrigerator to save energy. Also, its silent operation ensures that you sleep, work, or do anything else in your home without any disturbance.",
        "Ice Beam Door Cooling": "This technology ensures even and efficient cooling throughout the refrigerator. It circulates cold air from vents, along with the back, to ensure thorough cooling.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "1",
            "1",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "3",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "2",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5"
        ],
        "review": [
            "Excellent value for money. I purchased for 32500/- after exchanging old fridge. So far very good.\nPro's:\na) This is a 4 Star fridge. Super savings in the long run\nb) 420 litres. Huge capacity\nc) Silent operation.\nd) Installation & Delivery same day.\n\nCons:\na) Scratches on the freezer door. Improper handling by courier while transporting.\nb) Installation technicians explanation is not proper\n\nBut overall fridge is functioning excellently. 11.10.2019: After 11 months I am posting this. This product is absolutely fabulous, fantastic, excellent & very good Powe saver. This is a Bee Certified 4-Star Fridge. Good for a family of four. Go for it.",
            "Got at the best exchange value. The advanced and latest model. Great value for money. Working all right. Silent working. Highly recommend.\nOnly delivery was not promised on the date. I had to continually follow up for delivery.",
            "We had an LG refeigerator before which we used for nearly 20 years.My Mother had instructed me to buy a LG refrigerator only while replacing it as she was very much happy with its performance in these many years.So i had tp ho with this & i got this from Flipkart.This refrigerator has a 4star rating which ultimately lowers your Electricity bill.Its quite spacious inside & also has good storage shelves for keeping different sizes of items.The LED ligjt is quite bright & the compressor doesnt s...\nREAD MORE",
            "Just completed 1 year and auto defrost is not work properly...executive of LG says freezer door is not closed properly and we have to pay Rs. 767.00 to LG as service charge..not recommended",
            "It was a great deal. I have purchased it around 35k after exchanging my old LG single door refrigerator which was 10 year old. I am using this product since last one week and it is working fine. The freezer area is deep and has space to store lot of things. The vegetable box is good enough to store lot of vegetables and it keeps the vegetable fresh.",
            "Extremely happy about my decision to buy this fridge. Aesthetic design, spaciousness, low noise, good lighting even in the freezer compartment, and various other features make this LG refrigerator a superb choice. Moreover the purchase from Flipkart during their ‘Big Billion Days’ sale saved me a lot of money too…!!! The delivery was on time and the product reached me safe and intact. The installation and demo was done by an LG technician satisfactorily, but it took 2 days after delivery, that too after calling the customer care for speeding up the installation. (LG warranty will be applicable only if the installation and demo is done by their technician)\nOverall, I’m extremely happy about my LG 420 ltr double door fridge as of now.\nThank you Flipkart, Thank you LG..!!!",
            "Awesome product",
            "Amazing Packing and superior quality !\nLove the design and performance !!",
            "no one came for installation, still in box pack after 4th day. Freeze is osm 👌",
            "Its only been 4 days since the use of the refrigerator, however i am a big fan of LG brand in appliances and they did not disappoint with this fridge. The flipkart delivery was on time and no scratches or dent on the product. The exchange part was not that smooth, the delivery perspn initially did not take the old unit because of their defined quality checks. However later on he agreed, maybe Flipkart can improve this aspect.\n\nThe fridge is spacious and has all the required facilities. Door alarm after 1 minute of continuous door open. I never believed in the 5in1 convertible concept and opted this over Samsung. Also the Net space is more in LG comparee to Samsung, ultimately that is what counts the most.",
            "Excellent value for money. I purchased for 32500/- after exchanging old fridge. So far very good.\nPro's:\na) This is a 4 Star fridge. Super savings in the long run\nb) 420 litres. Huge capacity\nc) Silent operation.\nd) Installation & Delivery same day.\n\nCons:\na) Scratches on the freezer door. Improper handling by courier while transporting.\nb) Installation technicians explanation is not proper\n\nBut overall fridge is functioning excellently. 11.10.2019: After 11 months I am posting this. This product is absolutely fabulous, fantastic, excellent & very good Powe saver. This is a Bee Certified 4-Star Fridge. Good for a family of four. Go for it.",
            "Got at the best exchange value. The advanced and latest model. Great value for money. Working all right. Silent working. Highly recommend.\nOnly delivery was not promised on the date. I had to continually follow up for delivery.",
            "We had an LG refeigerator before which we used for nearly 20 years.My Mother had instructed me to buy a LG refrigerator only while replacing it as she was very much happy with its performance in these many years.So i had tp ho with this & i got this from Flipkart.This refrigerator has a 4star rating which ultimately lowers your Electricity bill.Its quite spacious inside & also has good storage shelves for keeping different sizes of items.The LED ligjt is quite bright & the compressor doesnt s...\nREAD MORE",
            "Just completed 1 year and auto defrost is not work properly...executive of LG says freezer door is not closed properly and we have to pay Rs. 767.00 to LG as service charge..not recommended",
            "It was a great deal. I have purchased it around 35k after exchanging my old LG single door refrigerator which was 10 year old. I am using this product since last one week and it is working fine. The freezer area is deep and has space to store lot of things. The vegetable box is good enough to store lot of vegetables and it keeps the vegetable fresh.",
            "Extremely happy about my decision to buy this fridge. Aesthetic design, spaciousness, low noise, good lighting even in the freezer compartment, and various other features make this LG refrigerator a superb choice. Moreover the purchase from Flipkart during their ‘Big Billion Days’ sale saved me a lot of money too…!!! The delivery was on time and the product reached me safe and intact. The installation and demo was done by an LG technician satisfactorily, but it took 2 days after delivery, that too after calling the customer care for speeding up the installation. (LG warranty will be applicable only if the installation and demo is done by their technician)\nOverall, I’m extremely happy about my LG 420 ltr double door fridge as of now.\nThank you Flipkart, Thank you LG..!!!",
            "Awesome product",
            "Amazing Packing and superior quality !\nLove the design and performance !!",
            "no one came for installation, still in box pack after 4th day. Freeze is osm 👌",
            "Its only been 4 days since the use of the refrigerator, however i am a big fan of LG brand in appliances and they did not disappoint with this fridge. The flipkart delivery was on time and no scratches or dent on the product. The exchange part was not that smooth, the delivery perspn initially did not take the old unit because of their defined quality checks. However later on he agreed, maybe Flipkart can improve this aspect.\n\nThe fridge is spacious and has all the required facilities. Door ...\nREAD MORE",
            "Very spacious fridge from trustworthy brand.. lots of space and utility.. looks great too",
            "This Refrigerator is one of the best deal I have ever got through the e-Commerce platform. Best Refrigerator in 400-450 ltr segment. I was confused between two of the best models in this range. Samsung 415 ltr and LG 420 ltr. I opted for the LG just because of the after-sales service.",
            "Bought this after using LG 260 litre double door fridge for 15 years.Not a single issue in the old fridge.Just changed it for storage shortage.So we know the performance of the brand LG.My family always go for LG for any home appliances though price is comparatively more.Now coming to this one , as expected performance is excellent.Noise free operation with excellent fast cooling using less power.Only usable space could be utilised more as I think.Awesome delivery experience from flipkart and quick same day installation by LG.Fully satisfied till now.",
            "Very Good Performance",
            "Very good super refrigerator. Fast delivery we like this refrigerator",
            "It has a big dent on top",
            "LG Refrigerator is a silent killer along with huge space. The best part of this fridge it beeps alerting the user that fridge door is open.\n\nNo CONs found. Overall a great product.\n\nThank you Flipkart and LG 😊👍",
            "Nice purchase",
            "My Fridge gone bad in 1.5 years and I also bought Extended warranty from Flipkart which is useless. They have not been able to fix my fridge in 1 month and are stating false reasons.",
            "Its just been 1 year now and the freezer door not closing properly. Poor quality.\nNot recommended.",
            "Vegetable are getting spoiled. In the vegetable box it's getting more moisture. Due to this water is getting inside the box. Even it's have less features when compared to 360 Ltr. Very disappointed",
            "Very spacious, noiseless, power saver refrigerator, I got it for 35.5k value for money:-B",
            "very nice product..\n\nperformance is very good..\n\nvery less noice...\n\nconfusion in warranty period....",
            "Fabulous...\n\nAs expected rather beyond our expectations.Nice product.\nFlipkart has given great deal too.",
            "Nice product. Thanks LG.",
            "While booking the freeze it was telling that they will give 5000 for my old lg freeze that was a running freeze but they dont even took my old freeze and i have to pay full money.",
            "When we see this in online, it was ok. But after unpacking, we really satisfied with the color and design. It's really awesome. Having more than enough space for storage. It's giving alarm sound for every 30 sec if open for 1 min. Value for money. Go for it.",
            "Was slightly apprehensive buying this online. But quality was as good as from showroom and did not face any issue on the product. Product demo was smooth and was satisfied. Refrigerator is excellent. Got almost 13 k cheaper than showroom rate",
            "Great product , Delivered on time and installed before time. What more you expect.",
            "We got it in scheduled time.Really appreciate LG Customer Care for the same day installation,even when the prescribed date was 3 days later.I appreciate AS Electronics,Thrissur for installation of the product within 3 hours of delivery.",
            "The product is very good.only there is one problem there are dust sign on the front of refrigerator which is no good except there is value for money.",
            "Best",
            "Very good products",
            "Package was received in good condition. Delivery was seamless. Installation was good. Product is performing very well. Overall was a good experience. Will definitely recommend it to someone else.",
            "As always lg is superb brand. Flipkart delivery and demo on time. I was really hesitant to give order because fridge was huge and I was concerned if their will be scratches or any problem during transit. But no issues. Till now it's working fine. Happy with product. Thanks",
            "Working fine till now",
            "A very good fridge for a family",
            "Got this for Rs 32450 on exchange...\nValue for money..\nIt 3 star having Simple design,silently working,light in freezer also,spacious smart inverter technology...\nWe are happy to have this.. Thanks flipkart for such amazing deal...",
            "refrigerator quality is good. delivery is on time. customer service is good. only thing is they reject exchange of old refrigerator because of 1 small corrosion on it, all though it working fine",
            "Good product",
            "value for money..very spacious and sufficient for a family of 4..build quality can be improved futher i believe..",
            "Very smart purchase, loved it",
            "Very much space.Dashing lg fridge..",
            "I was a little worried about dents and scratches especially after reading some reviews but it was delivered in immaculate condition. Thanks Flipcart. Kudos. It has been working perfectly till day. A really good product from LG.",
            "Awesome refrigerator I feel very happy with this product.",
            "Loved the quality of this refrigerator.",
            "Excellent product and value for money",
            "Good product 👍",
            "Sufficient for a family of 5.",
            "Excellent Refrigerator for large families up to 4 members.\nClean Open Box Delivery by flipkart without any damage to the product.\nCools Evenly through out the refrigerator\nSuper Silent Operation.\nConvertible Box is useful for storing meat etc for short duration of time.\nExchange option works like a charm. Best deal in the market without any doubt .",
            "Well good",
            "Nice product",
            "Ice formation is quick. Cooling is good. After 10days usage, I recommend this product.",
            "Delivered on time. Very big capacity, nice design and interior.",
            "Very nice refrigerator. The added convertible box is a plus. The back side is completely concealed with no wires hanging out. There are more trays in this model as compared to other brands. Cooling is good. All in all a very good recommended refrigerator",
            "Good product.",
            "Delivery boy was very helpful to us.\nDesign of fridge is good and it's spacious\nI'll update later",
            "Quality is good and\nPerformance is very good",
            "nice fridge",
            "Nice buy worth it",
            "Soundless compressor with good interior space",
            "Overall good product",
            "If you're looking for a 6ppl family refrigerator, then go for this",
            "Good product",
            "This is 2020 model. Design is not that user friendly. The shelves are not adjustable because of the design. The lower drawer does not open smoothly and gets stuck.",
            "An excellent buy. Writing g the review after 3 months use. No problem so far. Meant for the people just requiring Refrigerator, no fanciful stuff or gadgets attached. Nice product, nice service.",
            "Good storage capacity. Low power consumption. Noiseless. Nice buy.",
            "Superb Quality..Value for money",
            "Writing this review post 2 years of use. Highly satisfied with the performance, capacity and user friendly features of the refrigerator. Highly recommended!",
            "Good",
            "Fantastic. Worth buying. Great deal.",
            "Capacity is small",
            "Awesome 👌",
            "Works like a basic fridge with expanded capacity",
            "Value for money!!",
            "Just okay",
            "Not so good",
            "It's great experience",
            "Good one...",
            "Very good product",
            "LG is superb, very spacious, built quality and features are amazing. Hope Life's Good (LG) to all LG users. Thanks to Flipkart and the seller.",
            "Nice product value for money I always trust LG brand for its performance n durability go for it..",
            "So far good and serving purpose. Good storage for price range.",
            "Super fast delivery and installation!!\nAwesome product 👌",
            "good",
            "Very less space inside fridge",
            "No 1 refrigerator all over India capacity so more intelligent cooling best design LG is no 1 in Home appliances thanks to flipkart for fastest delivery good 👍👍 luck to flipkart",
            "Just delivered yesterday... Till now everything is perfect.\nRest is performance which can be reviewed after long time.",
            "Great product. Working smoothly. Very satisfied. Silent operation. Worth it. Highly recommended",
            "Very good fridge",
            "The delivery was on time. There were less hands to move it from the vehicle. It was dropped too, no major damage though. Its been 2 weeks now. It is working fine",
            "Good",
            "Changed from a whirlpool 450L that was close to 15yrs old. The LG seems quieter and surely more power efficient but can do better on the quality of the interior shelves and space utilisation.\n\nHaving said this, we could for all we had in our old fridge into this and still have some space left. This was mainly due to more space in the freezer door where a lot of bottles and boxes could fit in.\n\nWaiting to see the effect on power bills. On paper LG fridges seem to score high on efficiency. Plus the fact that this fridge can run on a inverter during power cuts. This is a Huge advantage..",
            "Lovely product\nGood volume",
            "Fantastic Fridge. Love it!",
            "Nice i am so happy dish protect",
            "Good deal worth it",
            "Good Purchase. Recommended",
            "One of the best fridges we have",
            "We can trust upon LG refrigerator blindly",
            "Very good I am satisfied thank u flipkart",
            "nice fridge with adequate space, very silent\nworking well , quick delivery and timely installation",
            "good",
            "Good👍 products",
            "Good but not excellent",
            "Nice product with full satisfaction.",
            "It arrived right on time. On my request, Flipkart arranged for installation immediately.\nWe are completely satisfied with this shopping experience. And the product is really cool!",
            "Bigger than expected",
            "Very good product",
            "First impressions are great, will review after using for some time",
            "Th refrigerator tray is shaking , product defective",
            "Awesome product",
            "If you have a family of 4-5 people 335-350 liter is enough.\nThis is way too large.\nGreat product!!",
            "Extremely happy with the refrigerator. Nice and spacious. Looks very posh. No noise, very silent.",
            "Good product",
            "The flipkart delivery was so fast. Installation was done very next day of delivery. This was purchased with exchange of old fridge with very reasonable exchange price. Fridge Storage space is very good and very silent operation of compressor.",
            "The received product has many scratches.",
            "Love you flipkart\nIt was outstanding experience and really happy\nIt saved me a lot of money and services were awesome",
            "Good",
            "Good storage and appropriate sections for all category of Food and Vegetables etc.\nGreat cooling and temperature adjustments as per requirement in different seasons.\nGreat looks and size.power consumption is ok as per capacity",
            "Very very best fridge in low price",
            "Best in class, Value for money, Smooth performance and smart looking",
            "Pros:\n\nPrice,\n\nBuilt quality,\n\ntechnology\n\nLG support for installation and service\n\nCons:\n\nNon-convertible,\n\ndeep freezer size is unnecessary large compare to normal area, if it will be convertible then we can use the deep freezer as normal.",
            "Really awesome performance of this product and delivered at time to time.",
            "Really happy for buying LG refrigerator. Vegetables preserved for long time. One must buy. Note that product packing box is very big. Must have highted and spacious lift to transport.",
            "It's working fine. Features r good. The space in the fridge door for holding can be modified for two layer for holding 01 ltr pet bottles. Presently although there r 3 layers in the door, but only middle one can hold 1 ltr pet bottle",
            "Best in business",
            "Good product at this price",
            "Initial impressions are very good-\nSpacious, super cooling and good build all round.\nDefinitely can recommend this if anyone looking for 400+ ltr model",
            "Super",
            "Nice fridge, must buy",
            "Great performance and product.\nUsing this for last 3-4 months and satisfied with the performance, capacity, design and functions.\nIt consumes less power compared to my previous 250 Ltr refridgerator (this one is truly a 4 star electrical rating product)\nThe storage capacity is huge. Food stays fresh for longer period and cooling is excellent.\nFlipkart delivered product before time and installation & demo is done within 2 hours after receiving the product.\nThank you Flipkart.",
            "good",
            "First time ordered large appliances on online platform and it was nice experience with Flipkart, received in very well condition and working very fine. No any kind of issue face after it was powered up.very good service by LG.",
            "owsem",
            "Super",
            "worth it I got very good condition thank you Flipkart",
            "Very good product. Just as expected from a brand like LG.",
            "The refrigerator is working perfectly after using it fortnightly.",
            "very specias and good performance.",
            "Great Product and service Flipkart. Thank you.",
            "amazing refrigerator\nmust buy",
            "happy to have it",
            "it's very specious as expected..gud price with the brand like LG. I m big fan of LG brand",
            "Product is good. Lets see the performance and then I will rate",
            "Liked the Product..Very much spacious.",
            "excellent",
            "like it",
            "Awesome service",
            "Excellent.... More spacious, vegetables remain fresh for long.... Worth to buy",
            "as described good quality product!!!!!!!"
        ],
        "likes": [
            "41",
            "11",
            "16",
            "4",
            "4",
            "1",
            "30",
            "50",
            "13",
            "62",
            "41",
            "11",
            "16",
            "4",
            "4",
            "1",
            "30",
            "50",
            "13",
            "62",
            "7",
            "18",
            "1",
            "19",
            "8",
            "14",
            "3",
            "3",
            "2",
            "2",
            "2",
            "3",
            "8",
            "8",
            "4",
            "3",
            "3",
            "3",
            "3",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "9",
            "2",
            "19",
            "4",
            "3",
            "0",
            "5",
            "11",
            "1",
            "18",
            "9",
            "2",
            "19",
            "4",
            "3",
            "0",
            "5",
            "11",
            "1",
            "18",
            "0",
            "5",
            "1",
            "8",
            "2",
            "7",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "4",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:What is the energy star rating of this refrigerator?",
            "Q:per year electricity consumption?",
            "Q:What are the advantages of a Digital Inverter compressor?",
            "Q:Hi, The height of this product is shown as 17255 mm which I don't think is possible, Can you please confirm the height for the same?",
            "Q:Year of manufacturing? BEE Rating Year?",
            "Q:is this model a convertible one?",
            "Q:Which year model will i get when i purchase it in 2022?",
            "Q:do we need stabilizer for LG 420 L Frost Free Double Door 3 Star Refrigerator (Shiny Steel, GL-I472QPZX) ? or is it inbuild in this refrigerator??",
            "Q:Is it 4 Star BEE rating ?",
            "Q:Is this fridge convertable?",
            "Q:Can it be converted",
            "Q:What is the net capacity",
            "Q:How much units if electricity will it consume?",
            "Q:what is the actual storage volume",
            "Q:Does this refrigerator has hygiene method",
            "Q:What is the gst%?",
            "Q:Which year model it is....??",
            "Q:what is the actual year of manufacture? there are multiple conflicting answers and is confusing.",
            "Q:does it come with mono cooling or dual cooling",
            "Q:Can freezer be converted into deep freezer?",
            "Q:What are the outer dimensions? WXDXH?",
            "Q:Do i need to buy external stablizer for this?",
            "Q:Can we convert the freezer compartment to refrigerator compartment?",
            "Q:How much units its comsumes in 24hrs?",
            "Q:How much kilowatt power does this fridge consume a month????",
            "Q:Do i need a stabilizer to run this refrigerator?",
            "Q:does it require separate stabilizer",
            "Q:In this product freezer is convertible?",
            "Q:Are there any wheel attached to its stand?",
            "Q:Do we get stand with the refrigerator, if not do this refrigerator require a stand?",
            "Q:i need above 400 liter with manufacturing year 2020. LG refrigerator suggest model ##",
            "Q:what is height of the fridge in inches??",
            "Q:Any feature to remove bad smell of fruits and other items from refrigerator?",
            "Q:What is the internal shelve size?, Which size of mat will exactly fit with this product?",
            "Q:Built in Stabilizer in Specifications panel says \"No\", but in Q&A section people are saying \" Yes\", why?",
            "Q:Does it have a door lock ??",
            "Q:is there any control panel on door",
            "Q:its manufacturing date?",
            "Q:is this fridge has inbuilt stabilizer ? or We require stabilizer",
            "Q:how many key's comes with this refrigerator?",
            "Q:Does freezer have a light?",
            "Q:how many wattage???"
        ],
        "answers": [
            "A:This is a 4 Star rated refrigerator, giving you Energy Savings of upto 40% approximately.",
            "A:230 Units",
            "A:Digital Inverter Compressor intelligently varies its power and running speed according to immediate cooling requirement of the compressor.",
            "A:the height is approx 6ft",
            "A:2017",
            "A:its a normal double door, it has a convertible box in the middle, thats the only part convertible",
            "A:2021",
            "A:no",
            "A:No",
            "A:No",
            "A:No",
            "A:Gross Volume 420 litres. Storage Volume 388 litres.",
            "A:230 units per year",
            "A:gross volume:480 L, storage volume :388.",
            "A:I do not know what this method is. But we are storing in this in a hygienic way only.",
            "A:18 % gst",
            "A:Manufacturing date June 2020",
            "A:Mine is 2020 manufacture year model",
            "A:dual",
            "A:no",
            "A:5'8ft height. 2ft wide. 2'5ft depth.",
            "A:No. It has an inbuilt stabilizer",
            "A:No,it cannot be converted.",
            "A:It says 230 units/year...I have a 5 year old 5 star 190litre refrigerator which claims to consume 197 units/year.",
            "A:230 units per year (around 20 units per month) under standard operating conditions i.e. both refrigerator and freezer at medium setting. This is as per the BEE rating sticker on the refrigerator.",
            "A:not required. The model works without stabilizer 100v -290v . It gives protection against fluctuations.",
            "A:No.",
            "A:Nope, only the top portion is freezer and the bottom portion is regular refrigerator",
            "A:no",
            "A:Not required",
            "A:Lg 420 Litres frost free 4 star refrigerator",
            "A:Height is 68.5 Inches",
            "A:You can keep piece of coal or any fragrance spray to remove",
            "A:Approx... 52 x 34 cm.. If you buy few cm more it may stick out a bit",
            "A:I had purchased the above refrigerator and found it faulty within a week. So i say NO",
            "A:Ya",
            "A:No",
            "A:Mine is 2021 model.",
            "A:It doesn't need a stabilizer as per the manual.",
            "A:1 key",
            "A:Yes",
            "A:This is a 4 Star fridge consuming 230units in a year."
        ],
        "likes": [
            "22",
            "15",
            "11",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "15",
            "14",
            "4",
            "2",
            "4",
            "0",
            "1",
            "1",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "15",
            "8",
            "9",
            "1",
            "3",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "3",
            "1",
            "2",
            "0",
            "8",
            "8",
            "2",
            "0",
            "3",
            "0",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2"
        ]
    }
}