{
    "title": "Panasonic 335 L Frost Free Double Door 2 Star Refrigerator  (Silver, NR-TBG34VSS3)",
    "product_specification": {
        "In The Box": "1 Refrigerator Unit, Ice Cube Tray, Egg Tray, User Manual, Warranty Card",
        "Type": "Double Door",
        "Refrigerator Type": "Top Freezer Refrigerator",
        "Defrosting Type": "Frost Free",
        "Compressor Type": "Inverter Compressor",
        "Capacity": "335 L",
        "Number of Doors": "2",
        "Star Rating": "2",
        "Coolpad": "No",
        "Toughened Glass": "Yes",
        "Built-in Stabilizer": "Yes",
        "BEE Rating Year": "2020",
        "Launch Year": "2020",
        "Net Height": "1747 mm",
        "Net Depth": "681 mm",
        "Net Width": "600 mm",
        "Weight": "56 kg",
        "Installation & Demo": "Authorised Service Engineer will install the Refrigerator, make it operational and explain the below details. 1. How to Use, 2. Features,3. Do's and Dont's.",
        "Warranty Service Type": "Technician Visit",
        "Warranty Summary": "1 Year Warranty on Product and 10 Years on Compressor",
        "Covered in Warranty": "Product and Compressor are Covered in Warranty",
        "Not Covered in Warranty": "All Aesthetic or Plastic Parts (e.g Doors, Plastic Shelfs, Glass Shelfs or Any Other Aesthetic Parts etc.) and Customer Abuse are Not Covered under Warranty"
    },
    "product_description": {
        "Inverter": "The inverter of this refrigerator adjusts the motor’s rotation frequency to offer effective cooling while saving energy.",
        "AG Clean Technology": "This technology eliminates various harmful organisms, bacteria, and mold to ensure that your edibles are hygienic and fresh. This refrigerator also has a Silver Air Filter that kills up to 99.9% of the bacteria and mold inside this Panasonic home appliance. Also, the AG filter purifies the circulating air to reduce odours and to deactivate bacteria and mold.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "3",
            "4",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "1",
            "1",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "4",
            "4",
            "2",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "1",
            "5",
            "4",
            "4",
            "5",
            "1",
            "5",
            "4",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "2",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review": [
            "I was very judgemental about buying this after hearing about product damage during delivery so I have to write this review to ease others in buying. The product was delivered in excellent condition and the packaging makes sure protection against damage. Fridge is worth the money as it is one time investment and keeps food fresh as described. Excellent space capacity to stack up evrything you need. Very less noise you can almost not hear nything. Installation guy came in just 2 hours of delivery. This has been an awesome buy for me. You don't have to think twice to purchase this.",
            "Very good product from Panasonic at an unbelievable price. Has sufficient storage space. Easy to shift from one place to other since it has wheels. Delivered by Flipkart in good condition but only hassle was to arrange for men to hoist the refrigerator to 3rd floor of my apartment. Installation was done on next day of delivery of the product. Extremely satisfied with the service of Flipkart.",
            "good refrigerator with ample freezer space. shelf depth and height is adequate for placing large bowels. lower vegetable basket is quiet small.no noise even if you stand very close to it. Good cooling even at temperature of 47 degree in my city. you can store good quantities of icecream bricks, and other essentials like dry fruits etc in this fridge. It releases heat by only side walls .Back of the fridge remains cool. so you have no need to leave any space between back wall and refrigerator. you can put about 8 bottles of water and 3 large cold drink bottles at a time. The vegetables remain fresh as long as 5-6 days. but fruits can be placed for only 3 days maximum.",
            "just 1 week of operational fridge, good value for money fridge of this capacity, and good after sale installation and service staff.\nhowever there are some of the things that I see not working for me.\n1 the fruit and vegetable baskets are very small for the fridge of this size, they are not deep and storage capacity is small in the baskets.\n2 in the freezer section the I was told that door panel is like chiller, but anything store there is also getting frozen, any cheese sauces milk etc everything freezes.",
            "Smart built refrigerator\nAll in all a brilliant refrigerator with smart technology and good quality. Thanks flipkart awesome product| True internal space provided by Panasonic 278l net and immaculate technology for everyday use with power saving mode |",
            "Perfect choice for me, first I was hesitating to buy Panasonic brand but now I must say it's amazing experience to own Panasonic side by side refrigerator previous I owened Electrolux single door refrigerator so decided to own any premium this time delivery by Flipkart in just 4 days in solid condition not any single scratches on it delivered by blue dart now come to space it has huge space perfect for 8 ppl family although we r only 4 ppl choiced this now I come to power consumption .we r all Indian first see how much power any appliances consumption before buying I did checked on various websites but no where's mentioned abt it still took risk and bought even Panasonic website shows nothing abt power efecency it's consuming abt 170 watt in first start up that means it will consume between 1 to 1.5 unit per day depends on how many time u open and close it yearly consumption could be between 350 to 500 unit it's very very very reasonable consumption go for it don't hesitate to buy it just own it thank you Flipkart for sweet deal during anniversary sale",
            "The product is really good! It's definitely worth its cost! 👍\nWe wanted a bigger fridge since a long time and finally got one!\nMy family is very happy about this purchase from Flipkart! My wife is happy as ever!",
            "it's too good and big, nice for 4 to 5 members and got it from flipkart very cheaper compare to all store and online, feels very happy thanks flipkart and Panasonic",
            "it's a very nice product, totally worth for money\nbest budget side by side fridge,just go for it without any hesitation. nice thing is the cooling speed and electric consumption i.e, rapid cooling and less consumption",
            "One of the best buys that I have done online. I was sceptical about 1. The performance of the product and 2. The delivery without damage.\nFlipkart delivered it in pristine condition on the scheduled day (my preference of Saturday) and in about 3 hours had a visit by the Panasonic engineer for installation.\n\nPros: the fridge is a beauty, has enough space for a large family, it is inexpensive compared to other brands.\nCons: heats from the sides which is usual but because of its large size o...\nREAD MORE",
            "I was very judgemental about buying this after hearing about product damage during delivery so I have to write this review to ease others in buying. The product was delivered in excellent condition and the packaging makes sure protection against damage. Fridge is worth the money as it is one time investment and keeps food fresh as described. Excellent space capacity to stack up evrything you need. Very less noise you can almost not hear nything. Installation guy came in just 2 hours of delivery. This has been an awesome buy for me. You don't have to think twice to purchase this.",
            "Very good product from Panasonic at an unbelievable price. Has sufficient storage space. Easy to shift from one place to other since it has wheels. Delivered by Flipkart in good condition but only hassle was to arrange for men to hoist the refrigerator to 3rd floor of my apartment. Installation was done on next day of delivery of the product. Extremely satisfied with the service of Flipkart.",
            "good refrigerator with ample freezer space. shelf depth and height is adequate for placing large bowels. lower vegetable basket is quiet small.no noise even if you stand very close to it. Good cooling even at temperature of 47 degree in my city. you can store good quantities of icecream bricks, and other essentials like dry fruits etc in this fridge. It releases heat by only side walls .Back of the fridge remains cool. so you have no need to leave any space between back wall and refrigerator. you can put about 8 bottles of water and 3 large cold drink bottles at a time. The vegetables remain fresh as long as 5-6 days. but fruits can be placed for only 3 days maximum.",
            "just 1 week of operational fridge, good value for money fridge of this capacity, and good after sale installation and service staff.\nhowever there are some of the things that I see not working for me.\n1 the fruit and vegetable baskets are very small for the fridge of this size, they are not deep and storage capacity is small in the baskets.\n2 in the freezer section the I was told that door panel is like chiller, but anything store there is also getting frozen, any cheese sauces milk etc everything freezes.",
            "Smart built refrigerator\nAll in all a brilliant refrigerator with smart technology and good quality. Thanks flipkart awesome product| True internal space provided by Panasonic 278l net and immaculate technology for everyday use with power saving mode |",
            "Perfect choice for me, first I was hesitating to buy Panasonic brand but now I must say it's amazing experience to own Panasonic side by side refrigerator previous I owened Electrolux single door refrigerator so decided to own any premium this time delivery by Flipkart in just 4 days in solid condition not any single scratches on it delivered by blue dart now come to space it has huge space perfect for 8 ppl family although we r only 4 ppl choiced this now I come to power consumption .we r all Indian first see how much power any appliances consumption before buying I did checked on various websites but no where's mentioned abt it still took risk and bought even Panasonic website shows nothing abt power efecency it's consuming abt 170 watt in first start up that means it will consume between 1 to 1.5 unit per day depends on how many time u open and close it yearly consumption could be between 350 to 500 unit it's very very very reasonable consumption go for it don't hesitate to buy it just own it thank you Flipkart for sweet deal during anniversary sale",
            "The product is really good! It's definitely worth its cost! 👍\nWe wanted a bigger fridge since a long time and finally got one!\nMy family is very happy about this purchase from Flipkart! My wife is happy as ever!",
            "it's too good and big, nice for 4 to 5 members and got it from flipkart very cheaper compare to all store and online, feels very happy thanks flipkart and Panasonic",
            "it's a very nice product, totally worth for money\nbest budget side by side fridge,just go for it without any hesitation. nice thing is the cooling speed and electric consumption i.e, rapid cooling and less consumption",
            "One of the best buys that I have done online. I was sceptical about 1. The performance of the product and 2. The delivery without damage.\nFlipkart delivered it in pristine condition on the scheduled day (my preference of Saturday) and in about 3 hours had a visit by the Panasonic engineer for installation.\n\nPros: the fridge is a beauty, has enough space for a large family, it is inexpensive compared to other brands.\nCons: heats from the sides which is usual but because of its large size o...\nREAD MORE",
            "Ever since this fridge got installed in our house we have been getting a steady stream of admirers to have a look at and awe-struck. It indeed is a value for money deal. A slightly bigger refrigerator chamber would have been great, though its depth compensates a bit !! full-marks to Omnitech for the prompt mapping of the product so that i could track its status very accurately. In fact product got delivered one day earlier than promised !",
            "i have been using for 9 months now. The performance is good . This gets heated when you switch on for the first time ,for a few days and then cools down after use. the service in Chennai has been good and a minor problem in light switch ( got stuck) sorted out in a few hours . Initially the cooling was very good like a freezer in the refrigerator compartment, for a couple of months and that has come down . . May be that is how it is designed .",
            "It is a awesome fridge. With superb cooling system and big storing capacity. Recommend to all who needs big storage and performance with budget price. Also support services of Panasonic is remarkable.",
            "good product good delivery demo is not good price is satisfied",
            "good space . value of money",
            "This is and outstanding fridge. It was right decision to buy this product from Flipkart. The price was right. The demonstration was done so quickly on same day.",
            "excellent design value of money and performance is good, but both sides are little bit heat",
            "Delivery was on time but delivery person were not professional. They dragged and pushed the item very rudely and damaged the cover but thank God refrigerator was good in shape. Else everything was fine. We are observing the working of refrigerator as it is just 3 days. So far working good",
            "excellent product & good delivery.",
            "The fridge is excellent. I am extremely happy with the purchase. Got a good discount with exchange offer. Only problem was the first fridge we received was not working so we had to ask Flipkart and get the product replaced. The replacement service was very slow but they gave us a good fridge after that.",
            "Awesome refrigerator\nReceived Panasonic refrigerator with in 3days, best packing with no defective.",
            "Good",
            "Awesome and Amazing product ever bought from Flipkart at this price range of just 56K. Fully Satisfied.\nThank you Flipkart and Panasonic :-)",
            "Timely delivered . No issue till order to home delivered. Good deal full mark.",
            "I have been using this product for last 1 year. No issues so far.\n\nPros:\n1. Beautiful design, lots of space.\n2. Works as promised.\n\nCons:\n1. Power hungry, electricity bill is up.",
            "Luv u Panasonic & Flipcart🖤🖤🖤",
            "good product from panasonic",
            "In this price range it is the best option to buy. And also delivery is very fast and installation guy's knowledge is very good.",
            "Happy with the product..... hope it will be like this for long time😊",
            "company service is just tooooo bad.... light in fridge was not working due to faulty switch. gave it to replace it and it has been almost a month but no news of switch.",
            "Poor Installation support by Panasonic Team. He was scheduled for today evening 6.30 and then passed the buck to some other person. On calling him, he flatly refused saying no call is forwarded to him. Be aware if this is the service level of Panasonic then better to go with Samsung or LG!! Now waiting at home to see when Panasonic or FK people act!",
            "only cons is unable to set temperature for freezer equal to fridge",
            "average refrigerator electricity consumption is to high...before buy read all the specifications",
            "it does not have feature to turn off the frizeer . so it feels bit outdated",
            "The product was good. Value for money.",
            "best! Go for it",
            "There is ample freezer space, but it lacks refrigerator space. Can’t keep big round vessels.",
            "I have been using this fridge for last 10 days, satisfied with the features and look of this refrigerator. Its very huge for the 3 member family. It comes with a 10 year compressor warranty. Its a heavy machine and difficult to carry it by stairs in a big society 7th floor, since it do not fit in the lift.\nLots of space for bottles and comes with 3 ice twister. Overall a very good package.",
            "Brilliant 2 day delivery by Flipkart. Excellent logistics support. Moreover it's a great product and huge value for money. Keep going",
            "Refrigerator was delivered on 28th November, and worked fine. After 14 days loud noise started out that lasted at least for 15-20 minutes .The problem was not continuous but occurred alternate days or twice in a day(not fix cycle). When I checked flip cart policy, it was mentioned they can exchange within ten days only. I directly contacted Panasonic customer care and they sent technician but he told there is no defect as that time no noise was audible but I talked to their manager and he a...\nREAD MORE",
            "Product is good value for money. it has all features. Installation was delayed otherwise a nice experience",
            "Though the refrigerator is received on time, the delivery executive delayed for one day and after repeated complaints the demo and installation engineer arrived after three days of delivery. This I felt very bad on both Panasonic and Flipcart people. The fridge is fabulous look and the package was very good, not even small scratch is found on it. I think that it is value for money to have it and it's a reputed brand to choose. It is running and as mentioned about it's performance let me hope that it goes well for long time. Thanks Panasonic and Flipcart..",
            "Scratches on doors and after 2 weeks led light sensors are not working",
            "good",
            "Super design, spacious, silent, elegant looking...",
            "Ultimate fridge I got in discount.. it’s awesome for only big family .. more than 7 people ..",
            "Good value for money...it would be great if the same product is available with inverter compressor.",
            "good product",
            "excellent product beautiful design service for installation was although slow from Panasonic",
            "Great Design.\nGreat Value for Money Product.\n\nbut only one problem I had face is HEATING ON BOTH SIDE.",
            "good refrigerator",
            "Within 6 months one side is not working",
            "very unhappy with flip cart service",
            "Value for money",
            "good serve the purpose",
            "An excellent buy. Value for money and exceptional quality...",
            "product is Good but delivery service is pathetic not happy with Flipkart customer service",
            "I am very happy with this product.\nit's truly value for money.\nThanks to Panasonic.\n👌👌👌👌👍👍👍👍",
            "If you want to buy side by side option. This refrigerator is cheap and Best option.",
            "great product at great offer !!!",
            "Nice product",
            "Flipkart delivered as per the time, But, Panasonic is not providing installation by themselves. Installation done by third parties and we have waited 2 day for installation that to complianing to Flipkart.\n\nPanasonic to work on this?",
            "So far so good. Great value for money",
            "Good",
            "We bought it 1 month back. Its great. They have given all possible features and 10 year warranty on compressor.",
            "Excellent product in this price range. It reached to me within 2 days of placing the order. It is working quietly since I bought it about fortnight back. I faced some problem with respect to occurrence of droplets in normal fridge section and asked Flipkart for exchange, which they did as Panasonic technician never visited to check if problem is minor or major. Full points to Flipkart here! So when technician again visited for the installation of the replaced fridge, he clarified that droplets is common occurrence and it is nothing to worry. I have also bought stabilizer to avoid any voltage fluctuation related damages. Although Panasonic claims that it is inbuilt but I did not want to take chances and so bought stabilizer also.",
            "Best price & good product thanqu flip cart",
            "The person who came for installation had no idea about the functionality of side by side refrigerator and was not able to provide any demo properly. Hence I am unable to use the refrigerator properly",
            "good product",
            "That product is very good\nFully space\nNo sound it's nice",
            "Awesome product",
            "super",
            "NICE PRODUCT",
            "Amazing product. Go for it.",
            "I bought this product two years back, to be precise May 2019. The delivery and installation were fine, But after using it for two years, I had faced an issue. The refrigerator is not working, during a further investigation from the service team came to know the board was damaged. Since I had taken a 2 years extended warranty, I was eligible to get the damaged parts replaced. Then I started to follow up, recently came to know the parts are not available, thus they agreed to return back the refrigerator with cash in return while considering depreciation. I have lost the depreciation amount and extended warranty cost for a refrigerator which I have used only for two years. Now am waiting for them to pick up my damaged refrigerator.........",
            "Nice",
            "Good one",
            "Don't purchase, it didn't work not even 3 days\n\nWorst service from flipkart not even 15 days it worked and there is no response even if we complain.",
            "Very good Product from Panasonic",
            "Quality is very good, very spacious, looks also very good. One drawback that there is no light in freezer.",
            "Nice",
            "I been using since two and half years, wonderful product, no complaints at all.",
            "Got spoiled by 4 months and its a horrible experience",
            "Wonderful purchases. Very happy about our Panasonic 335L. Amazing, very nice, beautiful, Excellent, very good & very high quality. Big size. Dream come to ture with flipkard online sales..",
            "Nice product in good price",
            "Tremendous product at unbeatable price...",
            "Good for big families.. service is at its best. Using since one year n more and reported no complaints. Thank u panasonic thank you flipkart for delivering such a Big machine without any scratch.",
            "Good Product. Japanese Standards. Value for Money..",
            "I got it for Rs 50,000/- approximately. The Refrigerator cools well but the working of internal lights is affected due to the flimsy switches that are supposed to turn on the light when the door is opened. Other than this issue with the internal lights everything else seems to be okay",
            "Superb side by side refrigrater in budget got it 46k ...",
            "I just love the fridge very spacious beautiful and performance make you happy..... I've been using for more than a year value for money",
            "Good budget side by side refrigerator, total satisfaction",
            "I am Very Satisfied Panasonic Fridge\nAnd Demo Service Very Good",
            "Value for money.. Good performance",
            "Gets heated on the sides from outside",
            "nice but defreeger is not use ful",
            "What a fridge in size and in space . Each of the family member happy with the product and service that FLIPKART has rendered. 5 star.",
            "It’s fine , can have converters",
            "Super",
            "Nice",
            "Excellent Product and Got only in Rs. 25000, as local rates are Rs.31500",
            "excellent product and excellent delivery by seller.",
            "Excellent for people with big requirement for space for bottles. Don't know how this EcoNavi sensor works but not much high consumption of electricity is observed.",
            "fabulous product",
            "Thanks to Flipkart. Awesome. Great deal. Prompt delivery and installation. Must buy.",
            "nice fridge only heating issue in summer. freezer can not be convert in to normal fridge.\noverall value for money.",
            "super",
            "very good...value for money",
            "this is very good quality and very nice fridge",
            "Awesome refrigerator",
            "Awesome ! I love it",
            "Good brand, size, features & value for money.\nworth buy",
            "installation boy not coming still I m waiting for last 15days . but today i done installation . it's nice product thanks to Flifkart *****",
            "After 3 months of usage. Product started showing defect. No support from the company. Worst experience with company service. Everything getting freezed on both sides",
            "Excellent product ,demo and installation\nWorth for money.I feel very proud of it",
            "Handle of the door(fridge side) is loose...",
            "super product",
            "4 star because in other refrigerators there is a feature in which ice don't freeze on the walls of the freezer. i.e frost free feature\nbut here this feature is absent..\nOverall feature is amazing",
            "awesome",
            "totally worth at this price",
            "It is very good product I like it",
            "thanks flipkart",
            "beautiful elegant spacious user friendly.",
            "SO far no problems with fridge .Flipkart and Panasonic service is excellent",
            "Fully satisfied with the product",
            "fabulous product and freezing time is very less 30min and ice cube in your hand",
            "good fridge...",
            "Everything perfect but little heat on both sides",
            "Great cooling even in high summers. However could be quieter. Overall a great buy at this price.",
            "awsum product.....😍😍😍",
            "excellent",
            "excellent purchase in this position price...must buy",
            "good one",
            "excellent",
            "good",
            "Side by side models have less refregirator space. So much of freezer space is a waste in India",
            "Nice products... worth of money",
            "good, cooling is excellent and design",
            "Excellent product. Value for money.",
            "Very nice product",
            "The fridge had a dent on the side.",
            "A great product from a great brand bought at a great price.",
            "Very Nice Products.",
            "Awesome product .Good capacity .",
            "Nice product Flipkart good job",
            "very safe delivered refregerator, by flipkart, on time, as per schedule.",
            "very goodgreze",
            "spacious but interior racks are not strong enough.",
            "Nice cooling... and value for money... thank you Flipkart",
            "Nice Product got in 44000. timely delivered. writing this after 2 years. Value for money. You must go for it",
            "Great product, Flipkart delivery is excellent product received on time and in excellent condition. The demo also scheduled automatically and was done the next day.",
            "Good side by side refrigerator for large families, looking good. Next day delivery by flipkart & engineer also came same day. Good service by flipkart",
            "excellent product. Delivary boys were highly cooperative",
            "I am using from last one year, excellent product and fully satisfied",
            "Exellent product! Delivered by Flipkart in very good condition..kudos!",
            "Excellent service provide by Panasonic team",
            "Worth buying only problem with these are sales service."
        ],
        "likes": [
            "21",
            "22",
            "9",
            "3",
            "16",
            "9",
            "1",
            "1",
            "1",
            "0",
            "21",
            "22",
            "9",
            "3",
            "16",
            "9",
            "1",
            "1",
            "1",
            "0",
            "2",
            "0",
            "0",
            "0",
            "95",
            "35",
            "10",
            "11",
            "6",
            "8",
            "18",
            "9",
            "4",
            "18",
            "6",
            "10",
            "5",
            "8",
            "12",
            "4",
            "8",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "8",
            "3",
            "4",
            "4",
            "6",
            "3",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "24",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "3",
            "3"
        ],
        "dislikes": [
            "5",
            "4",
            "0",
            "0",
            "16",
            "9",
            "1",
            "0",
            "0",
            "0",
            "5",
            "4",
            "0",
            "0",
            "16",
            "9",
            "1",
            "0",
            "0",
            "0",
            "6",
            "0",
            "0",
            "0",
            "28",
            "9",
            "1",
            "2",
            "0",
            "1",
            "6",
            "2",
            "0",
            "8",
            "1",
            "4",
            "1",
            "4",
            "8",
            "1",
            "5",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "6",
            "1",
            "2",
            "2",
            "5",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "62",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "1",
            "0",
            "1",
            "2",
            "1",
            "5"
        ]
    },
    "qna": {
        "questions": [
            "Q:What are the advantages of a Digital Inverter compressor?",
            "Q:Can't decide what size of fridge is fit for me. How do I decide on the capacity that is ideal for me?",
            "Q:Can large vessels be accommodated on the toughened glass shelves?",
            "Q:Please advise what is power consumption in watts & how much unit it consumes on an average per day.",
            "Q:does it work in inverter",
            "Q:Do I need to buy stabilizer alomg with this fridge? Or it cimes with built in stabilizer?",
            "Q:what is the energy saving rating",
            "Q:Does it require a Stabilizer?",
            "Q:door lock available or not",
            "Q:what is its height in feet",
            "Q:door are open is their any alram",
            "Q:what is the level of noise..",
            "Q:is it easy to open the fridge with handles or it becomes heavy once stuffed up..",
            "Q:How much space does the refrigerator require around it?",
            "Q:Does it contain ice freezer or is it frost free?",
            "Q:what is the star rating and the energy consumption? is this an inverter type refrigerator?",
            "Q:Does NR-TBG34VSS3 model has freezer temparature settings?",
            "Q:Does this require a stabilizer? i have power outage at my society and was wondering if i need a separate stabilizer for this fridge",
            "Q:is this refrigerator is Covertable",
            "Q:Can someone tell me what is the manufacturing date of this refrigerator.",
            "Q:What is the year of manufacture?",
            "Q:what are the dimensions?",
            "Q:Is this fridge have lock system facility?",
            "Q:How many litres of freeze area n freezer area?",
            "Q:is there any locking system in the fridge??",
            "Q:does the fridge need a stand ? does it need a voltage stabilizer?",
            "Q:What is the energy star rating of this refrigerator?",
            "Q:Is it suitable for Home use ?",
            "Q:WHERE IS IT MADE?",
            "Q:How will this fit in a lift or staircase? Can it be dis-assembled and re-assembled once it is inside the house?",
            "Q:Someone complained that the outside gets heated",
            "Q:Does this refrigerator have lights in freezer compartment/Top compartment ?",
            "Q:I need width 35\" with double doors, please advise which model is suitable for my requirement.",
            "Q:Does it has wheels under it or immobile legs ?",
            "Q:Can you explain the temperature to be set basically for both deep freezer and fridge",
            "Q:What are the dimensions (length*width*height) of the product?",
            "Q:or its built in stabilizer please let me know",
            "Q:whats the fridge vs fridger ratio?",
            "Q:how many days vegetables and fruits fresh",
            "Q:what is the power consumption in watts tell us",
            "Q:Is this refrigerator an inverter type compressor?",
            "Q:can i use the fridger comparment for normal use, and why the showing product is old manufactured as shown 2016 , can it be available in latest manufactured.",
            "Q:Separate tray to keep milk packets available ?",
            "Q:what is the length of wire?",
            "Q:Please share running power wattage , and rough units consumed per year. I don't see this info in product description, is that mentioned in product or in product catalog ?",
            "Q:this 3 star or 5star..? cause ones reply is 5star and other is 3star so what is exactly? i think this is withuout star",
            "Q:Explain how much of the temporature is for home use??",
            "Q:please explain to temperature setting use for home",
            "Q:this will be used for shop's",
            "Q:it need stabilizer",
            "Q:is 5amps socket enough or do we need 15amps?",
            "Q:is this is a convertible fridge??",
            "Q:what is the launch date??",
            "Q:Please tell this fridge have child lock",
            "Q:How many litre are there?"
        ],
        "answers": [
            "A:Digital Inverter Compressor intelligently varies its power and running speed according to immediate cooling requirement of the compressor.",
            "A:40-80L: Ideal for Bachelors or as bedroom fridge, 80-240L: Ideal for Couples and Small families, 240-400L: Ideal for Family of 4 to 5, 400L and Above: Good for Large Families",
            "A:Yes. If you're looking to fit large vessels on the shelves, you can do so by adjusting the height of the toughened glass shelves.",
            "A:2 units a day.",
            "A:YES",
            "A:You have to purchase stabiliser separately.",
            "A:5 Star",
            "A:It does not require a stabilizer since it comes with an voltage fluctuation safe internal circuitary. However, if you face frequent voltage fluctuations, an external stabilizer is recommended.",
            "A:no",
            "A:Approx 6feet",
            "A:Yes..there will be a warning sound if the doors are open for longtime",
            "A:Average, not so much.",
            "A:My fridge is pretty stuffed up. Opening the door is not a problem.",
            "A:In order to have sufficient ventilation, the refrigerator should have at least 10.2 cm space on all the sides. It should also have 10.2 cm between the wall facing the back of the refrigerator.",
            "A:This is FROST FREE",
            "A:3 star rating. Yes, it has inverter type refrigerator.",
            "A:yes",
            "A:Although manufacturers say it got inbuilt stabiliser it is advisable to have separate one since you mentioned about power failures in your society.",
            "A:No, it's just side by side. but happy with the product",
            "A:I bought in may 2019, n quality is really nice.",
            "A:It is 2019. happy to recieve latest stock.",
            "A:it's 6ft *3 ft",
            "A:No physical lock. The touch screen for controls has a lock.",
            "A:34:66 ratio of fridge and freezer respectively",
            "A:No",
            "A:No",
            "A:This is a 3 Star rated refrigerator, giving you Energy Savings of upto 30% approximately.",
            "A:yes it is, we are very satisfied with this model.",
            "A:They manufacture fridge upto 330 liters in Jhajhar Haryana but this one is imported from either Thailand, Indinesia or Vietnam.",
            "A:yes doors can be dis assembled. but depends on your lift size or staircase space.",
            "A:It's normal feature, awesome product",
            "A:No",
            "A:Dear Friend, I am sure such specs would be available on the site. Cant goo around measuring it now.",
            "A:It has got wheels on both back side legs.",
            "A:I have set 7 degrees for fridge n -21 for freezer",
            "A:it's 5ft 10\" tall ie 1785 mm height, 2ft 5\" ie 745mm width and 2ft 11\" ie 895mm length",
            "A:yes,it's in built.",
            "A:45/55",
            "A:Well if you just clean and keep it in net or in baskets properly then even in two weeks we observed the vegetables like spinach, bell pepper, Brinjal stay as fresh as as on first day.",
            "A:It consumes 1.5 to 2 units per day at 5 Degree temperature.",
            "A:No, such kind of side by side design refrigerators don't usually come with inverter type compressor.",
            "A:The fridger can't be used normal one. All you can do is turn up the temperature of fridger but that too a little.",
            "A:Nope",
            "A:2 m",
            "A:good",
            "A:3 star",
            "A:-18 Celsius for freezer (left side) and 5 Celsius for refrigerator on the right side",
            "A:-18 for freezer and 5 for refrigerator",
            "A:No",
            "A:No",
            "A:5 amps is enough.",
            "A:No, this is side by side door.",
            "A:24th May 2018, already launched.",
            "A:yes",
            "A:582 litter"
        ],
        "likes": [
            "12",
            "100",
            "61",
            "37",
            "3",
            "3",
            "7",
            "13",
            "2",
            "0",
            "1",
            "1",
            "1",
            "14",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "36",
            "8",
            "4",
            "7",
            "7",
            "3",
            "2",
            "2",
            "1",
            "1",
            "2",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "0",
            "53",
            "38",
            "24",
            "0",
            "0",
            "3",
            "13",
            "0",
            "0",
            "0",
            "0",
            "0",
            "39",
            "1",
            "10",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "7",
            "1",
            "0",
            "2",
            "3",
            "3",
            "0",
            "2",
            "1",
            "1",
            "7",
            "2",
            "4",
            "16",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "3"
        ]
    }
}