{
    "title": "Motorola 592 L Smart Wifi Enabled Frost Free Side by Side Refrigerator  (Premium Black, 592HSMTB)",
    "product_specification": {
        "In The Box": "1 Refrigerator Unit, User Manual, 2 Egg Tray, Ice Box",
        "Type": "Side by Side",
        "Refrigerator Type": "Side by Side",
        "Defrosting Type": "Frost Free",
        "Compressor Type": "Inverter Compressor",
        "Capacity": "592 L",
        "Number of Doors": "2",
        "Coolpad": "No",
        "Toughened Glass": "Yes",
        "Built-in Stabilizer": "Yes",
        "Shelf Material": "Toughened Glass",
        "Handle Type": "Recessed",
        "Door Finish": "PCM",
        "Gasket Type": "PVC Antibacterial Gasket",
        "Removable Gasket": "Yes",
        "Deodorizer": "Yes",
        "Other Convenience Features": "Smart Storage Designed for the Indian Home, 34% Freezer Space, 64% Fridge Space, Double Crispers for Veggies and Fruits, 2 L Bottle Storage, An Ice Box That's Also a Bottle, 2 Movable Ice Box, Leco Deodorizer to Maintain Long Lasting Freshness, Photocatalysis Light Based Technology, Odour Kill Technology, Fresh and Hygenic, Removes Bacteria, Longer Life with 10 Years Compressor Warranty, Low Noise Levels Greater than 43 dB, Stabilizer Free Operation, WiFi Enabled Smart Control, Multi Air Flow",
        "BEE Rating Year": "NA",
        "Refrigerator Interior Light": "Yes",
        "Egg Tray": "Yes",
        "Number of Crispers": "4",
        "Freezer Tray Type": "Ice Box",
        "Ice Cube Tray Type": "Ice Twister",
        "Launch Year": "2020",
        "Net Total Capacity": "562 L",
        "Cooling Refrigerant": "R600a",
        "Other Features": "Manage Your Smart Fridge with Your Smart Phone, TruWiFi, Set Temperature Remotely, Fast Freeze Mode, Smart Mode, Auto Error Notification, Smart Sensor for Accurate Temperature Control, TruSmart Sensor, Load Sensor, Ambient Temperature Sensor, Optimized Cooling, Evaporator Temperature Sensor, Freezer Temperature Sensor, Fridge Temperature Sensor, Designed for Best-in-class Cooling, Efficient Heat Transfer, Faster Cooling, 8% Faster Speed BLDC Fan Motor, Minus 32 DegreeC Coldest Freezer, Longer Condenser and Evaporator, Uniform Cooling in Every Part for Longer Freshness, SurroundCoolX, Maintains Freshness, Prevents Moisture Loss, Super Cooling Modes for Impromptu Party Plans, Rapid Temperature Cool Down, Preserves Freshness, Upto 25% Faster Ice Making Time, Premium Design to Complement a Stylish Home, Digital Control Panel, Flat Door Design, LED Lighting, Up to 40% More Energy Efficient, Adaptive Inverter Technology",
        "Net Height": "1770 mm",
        "Net Depth": "700 mm",
        "Net Width": "910 mm",
        "Weight": "95 kg",
        "Installation & Demo": "Explain all the functionality of the product||Flipkart will facilitate Installation & Demo at time of your convenience from a brand authorized service engineer|| All additional accessories which are not part of the the package will be charged separately ||Flipkart will communicate the day and time slot of the scheduled Installation & Demo through a SMS and the same information will also be available in your order details page||Please note that any unauthorized handling or self-installation of the product will lead to return & product warranty being void.||The Installation & Demo service will be provided free of cost",
        "Warranty Service Type": "For Warranty claims or any product related issues please email at support.moto@flipkart.com or call us at 080-46331090",
        "Warranty Summary": "1 Year Warranty on Product and 10 Years on Compressor",
        "Covered in Warranty": "All Parts Excluding Plastic Parts, Glassware, Bulb and Tube from the Date of Purchase. Against Defective Material and Workmanship.",
        "Not Covered in Warranty": "Warranty Does Not Cover Plastic Parts, Glassware, Any Accessories External to the Product, if the Product is Not Used According to the Instructions Given in the Instructions Manual, Modification or Alteration of Any Nature made in the Electrical Circuitry or Physical Construction of the Set. Site (Where the Premises is Kept) Conditions That Do Not Confirm to the Recommended Operating Conditions of the Machine. The Serial Number is Removed, Altered or Obliterated from the Machine. Defects Due to Cause Beyond Control Like Lightening, Abnormal Voltage, Acts of God or While in Transit to the Service Centres or Purchasers Residence. Warranty Automatically Expires After the Stipulated Period of Original Purchase Even if the Refrigerator was Not in Use for Anytime for Whatsoever Reasons."
    },
    "product_description": {
        "TruWifi": "This truly smart, truly revolutionary refrigerator helps you change temperatures and modes whenever you require – anytime and from anywhere. Choose from Fast Freeze and Smart Modes based on your requirements. Your wifi-enabled smartphone connects with your refrigerator and notifies you in case of any errors, such as leaving its door open or any technical error, among other things.",
        "TruSmart Sensors": "This Smart Refrigerator comes with intelligent sensors that help monitor the ambient temperature and internal load inside the refrigerator to help change the temperature inside the refrigerator automatically for optimal cooling and energy usage.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "2",
            "1",
            "5",
            "1",
            "5",
            "1",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "1",
            "4",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "4",
            "2",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "2",
            "5",
            "4"
        ],
        "review": [
            "Bought this refrigerator in big billion days delivered 2 days in advance and same day installation.\n\nI was using single door less than 200 L refrigerator. Motorola 592 L is not only spacious also looks elegant and I’m very excited.\n\nThe smart wifi allows you to change controls through EZ smart Home app.\nFrost free works fine. The LED white lights covers each side and bright enough.\n\n2 movable ice boxes and a small ice tray. Double basket in the fridge and freezer give ample space to store.\n\nInitially when you switch on, the Inverter side of the fridge heats up and it’s normal.\nFeather touch panels works fine except the child lock( need to wait 3mins to lock the fridge after you press lock button, never worked for me).",
            "Delivery is earlier than the mentioned date by Flipkart. Local delivery executive has given good support by all means. Exchange of my LG 9 year old Double Door Refrigerator was done smoothly. Got it at a very good price. Installation person visited within no time after delivery happened. Even though this refrigerator is the first to be seen by him in our location, he explored and given some demo and mentioned about the smart app to use in order to avail smart functions from our mobile itself. Product Quality is good, finishing also done a good job by Motorola. Spacing is well enough to place almost everything. As this is the first of its kind, we need to see the durability. Hope everything should be fine to use for longer years like LG.",
            "It is a very good purchase .. 592L of happiness..freezer and normal compartments work really well.. looks really classy and sometimes the heat gets dissipated through the side walls but that is common in all side by side refrigerators..silent performer.. very much recommended..",
            "Hai The Demo Team Should be More Knowledgeable So that they can give a proper Guidance...Child Lock how to enable it...How to use the Smart Wifi Application all should be done with proper Guidance and Knowledge...This is My feedback based on my experience",
            "Took a risk by buying the Motorola refrigerator when compared to a standard Samsung or LG! But to my surprise, the refrigerator is great overall. The features, design and looks of the refrigerator is great! Cooling is extremely good and temperature can be controlled through wi-fi (app based). Refrigerator is deep black but has some designs on the upper part which does not look great at certain viewing angles. For now, extremely happy with the purchase at the price!",
            "Delightful with the Product, Awesome Space for everything. First to buy in the State, Hopeful everything goes fine with the Function and Running of the Product.",
            "Product is good for the price... Also cooling is good.. however few cons i noticed are below:\n\nFridge sides get heated up some times, as per engineer this is normal.\nIn the freezer section i see a thin level of ice being formed, being a frost free model don't think this is a normal behaviour..\n\nApart from this product works well",
            "Product looks awesome and delivered as expected.exchanged my old refrigerator for best price Thanks a lot for that..Installation is bit intresting. The guy who did the installation , it is his first-time for this product. He just unpacked and plugged in. He is not aware of any of the product functionality.dissappointed with that.otherwise pretty happy with the product. Side walls of the refrigerator were too hot soon after switching on for few hours, then it does become normal. Build quality is more than good and recommend.",
            "The product is just fine from the day of its purchase, the look is nice, the feel is good and the cooling is just great. The only downside that I'd say is the overheating of the side panels, not sure if this is how it feels with any side by side refrigerator or Motorola is the exception. Would be nice If Motorola could expand their after-sales technical support base and send knowledgeable technicians for inspecting the performance of the product atleaset for the 1st year of its purchase.",
            "I bought this refrigerator recently and I must say I'm quite impressed so far. The delivery and installation was on time, as promised. They delivered it on the 2nd floor but I had to take the assistance of a few neighbors, so be mindful of that. Coming back to the refrigerator, the touch screen is easy to use and performance has been good so far but the long term reliability is something I'd like to see. If the product manages to last as long as some of the competitors like Samsung and LG i don't see why this wont be selling like hot cakes :) There is ample space for fruits, veggies and other stuff and you can set the temperature either manually or through the smart mode. You can also connect the refrigerator to your phone and control the temperature from your bedroom easily in case you forget to do it. All in all I'd say it's worth looking at considering it costs almost 20k less than the competition.",
            "Bought this refrigerator in big billion days delivered 2 days in advance and same day installation.\n\nI was using single door less than 200 L refrigerator. Motorola 592 L is not only spacious also looks elegant and I’m very excited.\n\nThe smart wifi allows you to change controls through EZ smart Home app.\nFrost free works fine. The LED white lights covers each side and bright enough.\n\n2 movable ice boxes and a small ice tray. Double basket in the fridge and freezer give ample space to store.\n\nInitially when you switch on, the Inverter side of the fridge heats up and it’s normal.\nFeather touch panels works fine except the child lock( need to wait 3mins to lock the fridge after you press lock button, never worked for me).",
            "Delivery is earlier than the mentioned date by Flipkart. Local delivery executive has given good support by all means. Exchange of my LG 9 year old Double Door Refrigerator was done smoothly. Got it at a very good price. Installation person visited within no time after delivery happened. Even though this refrigerator is the first to be seen by him in our location, he explored and given some demo and mentioned about the smart app to use in order to avail smart functions from our mobile itself. Product Quality is good, finishing also done a good job by Motorola. Spacing is well enough to place almost everything. As this is the first of its kind, we need to see the durability. Hope everything should be fine to use for longer years like LG.",
            "It is a very good purchase .. 592L of happiness..freezer and normal compartments work really well.. looks really classy and sometimes the heat gets dissipated through the side walls but that is common in all side by side refrigerators..silent performer.. very much recommended..",
            "Hai The Demo Team Should be More Knowledgeable So that they can give a proper Guidance...Child Lock how to enable it...How to use the Smart Wifi Application all should be done with proper Guidance and Knowledge...This is My feedback based on my experience",
            "Took a risk by buying the Motorola refrigerator when compared to a standard Samsung or LG! But to my surprise, the refrigerator is great overall. The features, design and looks of the refrigerator is great! Cooling is extremely good and temperature can be controlled through wi-fi (app based). Refrigerator is deep black but has some designs on the upper part which does not look great at certain viewing angles. For now, extremely happy with the purchase at the price!",
            "Delightful with the Product, Awesome Space for everything. First to buy in the State, Hopeful everything goes fine with the Function and Running of the Product.",
            "Product is good for the price... Also cooling is good.. however few cons i noticed are below:\n\nFridge sides get heated up some times, as per engineer this is normal.\nIn the freezer section i see a thin level of ice being formed, being a frost free model don't think this is a normal behaviour..\n\nApart from this product works well",
            "Product looks awesome and delivered as expected.exchanged my old refrigerator for best price Thanks a lot for that..Installation is bit intresting. The guy who did the installation , it is his first-time for this product. He just unpacked and plugged in. He is not aware of any of the product functionality.dissappointed with that.otherwise pretty happy with the product. Side walls of the refrigerator were too hot soon after switching on for few hours, then it does become normal. Build quality is more than good and recommend.",
            "The product is just fine from the day of its purchase, the look is nice, the feel is good and the cooling is just great. The only downside that I'd say is the overheating of the side panels, not sure if this is how it feels with any side by side refrigerator or Motorola is the exception. Would be nice If Motorola could expand their after-sales technical support base and send knowledgeable technicians for inspecting the performance of the product atleaset for the 1st year of its purchase.",
            "I bought this refrigerator recently and I must say I'm quite impressed so far. The delivery and installation was on time, as promised. They delivered it on the 2nd floor but I had to take the assistance of a few neighbors, so be mindful of that. Coming back to the refrigerator, the touch screen is easy to use and performance has been good so far but the long term reliability is something I'd like to see. If the product manages to last as long as some of the competitors like Samsung and LG i don't see why this wont be selling like hot cakes :) There is ample space for fruits, veggies and other stuff and you can set the temperature either manually or through the smart mode. You can also connect the refrigerator to your phone and control the temperature from your bedroom easily in case you forget to do it. All in all I'd say it's worth looking at considering it costs almost 20k less than the competition.",
            "It's a great product. Pretty new in the market but it's robust with great configuration, can change and adjust the temperature manually as well as via an app as well. Great design, look and a very sophisticated product and rich in class and looks",
            "We are using this product from last two months. Perrformance wise absolutely awesome, happy with the storage and installation process. Only one improvement area is motorola can work on looks wise.",
            "Doesn't look that premium, if it was a glass panel it would look super sexy. There are some issues with fit and finish. Both door are not properly aligned and over all outer body is ok Ok not that good\n, delivery personnel doesn't have much knowledge about the fridge, it is very difficult to use display. Cooling is very good and there is enough space to fit one more shelf but they didn't provide that. And also company has not provided any information regarding electricity consumption.",
            "Writing this review after a week of use. The product is a marvel! Worth every penny. Looks amazing, works like a dream. The installation wasn't upto the mark. The installation guy had no idea what he was doing. He was more interested in clicking selfies of himself with the product installed, face mask and sanitizer. I found the need for additional shelves and emailed Motorola for the same. Unfortunately even they have no idea and asked me to contact flipkart. Would have given 5 stars if additional shelves were sold separately.",
            "Product is good but we needed more shelves for refrigerator. We tried to get the information on the same from Flipkart and Motorola but no positive response. Both informing to contact other. Really miserable. How can a product success in market without accessories / spares clarity. Purchased due to name of Motorola and services of Flipkart BUT highly disappointed.\nHope somebody from their end should read this and contact me",
            "Value for Money",
            "Nice",
            "Great cooling,nicely works with mobile app",
            "Very nice fridge which is have great features and good looking !",
            "Giving Reviews after 6 month use, working perfect , frost free also working good, wifi enabled , you can use ezhome app to control this from anywhere . No heating issue 100% satisfied with this product",
            "Flip kart send me damage product and it's material quality si totally poor and when I rais request for refund they refuse and also can not return product its technical person say this is big refrigrator so it's got damage during transportation is normal so it's door not close properly we have to push door after it's close and door material is very chip quality plastic.\nTotally west of money\nDon't buy",
            "Delivery and time is very good but installation and demo technician is very bad and irresponsible and the product is worth for money more than we expect",
            "Worse refrigerator, my normal fridge sides makes ice ( not freezer I repeat) and company engineer is not able to solve problem. Please don't buy this company fridge, unless you want headache. Please go for Samsung or LG only",
            "Price little hai but product excellent",
            "It's one of the best in this range.\nSince Motorola is new in this category , so expecting to compete with other traditional brands.",
            "Value of money",
            "Motorola 592L Side by Side Refrigerator is a value for money purchase. Quick delivery as promised, and installation on next day by Jeeves was quicker than promised. Just reviewing after 24 hrs of usage, Cools faster, even though it is 592L. Connecting to Wifi was a snap and the app did recognize it quickly too. Just entered the world of connected Home Appliances. Hope it will not disappoint.\nThank You Flipkart/EKart/Jeeves !!\nNote: Still disappointed that Ekart did not take my old working Refrigerator in Exchange, as it had rust on the door. Those who are interested in exchanging please go through the terms and conditions carefully. They only take back Appliances in near perfect conditions.",
            "Absolute value for money. Huge storage capacity for this price with wifi enabled features. Got this for lowest price during big billion days offer. Delivery was great as the delivery guys carried successfully to first floor.",
            "Back dented...\nHeats a lot..\nWater dripping out of refrigerator inside the fridge compartment and technician says it's moisture...\nUseless ice box..",
            "The Product is Great ! There was some initial hiccups on setting the demo but FK sorted it out professionally.\n\nAbsolutely recommended ! It has got space and in this price range it is a steal !!! Go for it...",
            "Nice product",
            "Really value for money, go for it.",
            "Poor design. Poor quality. No proper fitting tray, non convertible.",
            "Side panel getting very much hot. Very dangerous if you have kids at home. Support person says that it get get hot till 60 degree. Worst product.",
            "Very good side by side fridge. Though side does gets hot .and the back remains at room temperature. Child lock means just control lock and not door lock. It can fit in 176.5 and above space",
            "Sides are generating too much heat which is very harmful specially for kids\n\nService persons do not know anything about the product,\nI am trying to return this product, so far flipkart is not cooperating",
            "Cooling as per display, spacious, accommodates all grocery items and also cooked food.\nVery much satisfied",
            "Product warrenty by Jeevs not motorola. No extended warrenty by company. Extended warrenty to be purchased from Jeevs only.. In case you want to buy extended warrenty buy while placing the order as after purchasing the product you cant buy extended warrenty too. Very funny part is motorola has no control on Jeevs. seems like motorola is a cheap chinese brand.",
            "I suggest every body to buy this product. It's been 3 months since iam using this product. No issues. Very satisfied. All are specifications defined in the catalogue are perfectly working fine. Buy now.",
            "Writing this after one week usage. Gud one",
            "Awesome quality\nSupar cooling\nVery smart system",
            "Worst",
            "Delivered the product on time and the delivery person have are very supportive, I would suggest not to wait for the installation person it's waste of time becouse the person dose not know anything about this product and 0 knowledge. It's to early to give a feedback about the performance, With one week experience i found the refrigerator is generating little bit heat I would say there is no noise. Nice product from motorola with excellent design and the space. Need to wait for the performance.",
            "Have been using it from last 2 months, and it's amazing",
            "Value for money",
            "No service, no response, not a trust worthy product.",
            "Good to have this product in this price range... however I would still recommend to go for LG at an additional cost.",
            "I have purchased this Product during big billion day sell and i think so it is value for money. I kept faith in name ‘Motorola’. I hope company will give best service in future. Because now a days customers oriented business model is in focus. For that it is early to say about this company. Hope company will focused on this point.",
            "osam price or item",
            "Looks good, and cooling is quick and great. Wifi feature is an added advantage.",
            "Refrigerator is good but the installation is cumbersome.",
            "Heat complaint. It omits heavy heat",
            "Awesome !! Makes no sound at all.",
            "The gas used in refrigent is of low performing that form the layer of water in vegitable.",
            "I was using Samsung double door fridge for about 11 years, since it started giving trouble decided to go for this, we never disappointed with this decision.\n\n1. LECO technology works fine, it will keep everything fresh, not only bad odour, no odour at all in the fridge\n2. Ample space for storage\n3. It runs fine in 150 AH inverter and 320 W solar panels\n4.the cooling is just fine matter of minutes\n5.no noise from the compressor, bearly could be hear it\n6.At this price point, better than hi-fi brands with higher price value",
            "A great fridge delivery was quick and installation was hassle free",
            "My mother dream fullfill",
            "Excellent this is. Very surprised with Motorola coming up with it. Very easy to use and spacious for Atleast 4-5 people",
            "We liked the refrigerator so much",
            "It is very good in look and in functioning alos",
            "Its really value for money",
            "Good refrigerator capacity is good",
            "Awesome",
            "Second hand friedge delivers\nFirst installation in not working wifi system and flipkart not answer properly and motorola repair circuit.\n\nI was purchase new friedge but delivery faulty refrigerator.\nDon't buy",
            "nice product, worth for price",
            "Wi-Fi not working",
            "Very good quality",
            "Nis good",
            "nice product, it's working gud\nSatisfied with the refrigerator 👍🏻",
            "All good go for it",
            "Nice product",
            "Making noise",
            "Awesome 👌products",
            "Worth buying",
            "Good",
            "Good time 😃",
            "Very good product. Noise is very less. Lot of place. Enjoying with the product.",
            "Stylish look..interior compartments r nice..well spacious to keep all things. Nice cooling. Superb",
            "Nice Product but installation would have been better",
            "Excellent brand\nExcellent product\nExcellent service from flipkart\nExcellent price\nAverage delivery boys\nExcellent technicians",
            "After 10 days of usage. 👍",
            "Very havy ly hiting 2 side, but friger in side water likege\nWorst product",
            "Very good fridge in such price satisfied from flipkart and Motorola, specially flipkart more because of better and fast service and support",
            "Product is very cost friendly and product is amazing. I was waiting for the product. This is my first big refrigerator and I was so glad to receive it. It look good. Only lil negotiate mark are these . But amazing quality. I still don't knw the usage ... But only one thing. No installation has been done but app show it has been done",
            "Just bought it... at Present the product looks great.. later I will update the review",
            "Amazing Product in the lowest cost as compare to other brands.\nLoved it!",
            "Best buy in this price range, using from last 3 month",
            "I’m happy to purchase this product for more advanced product this range of amount",
            "Good",
            "Was looking for side by side refrigerators, after doing study of so many options, drilled down to Motorola for below reasons:\n1. Brand name. In this price range all brands are Chinese.\n2. Inverter compressor\n3. Wifi feature (does not help much, but added advantage)",
            "Everything is perfect with the fridge. Let's hope it runs the same way.\nOnly problem was with the exchange guys. They were very reluctant to take the old fridge, which was working perfectly fine and didn't have any cracks or rust. Only issue was with its leg. There was one leg missing and they were not ready to take the product back. After long discussions and waiting for around 1 hour. They accepted to take it back. Very bad behaviour!! The leg could've broke during the transit as well, the way they handled the old fridge was also bad. It that was the case, they should've taken it initially only.",
            "Good",
            "Product:After one week usage, I felt product was extremely good and value for money. There was Space for everything, Competitor to Haier and Samsung\nDelivery: Was extremely disappointed with flipkart delivery, the delivery person didn't even helped the product to shift into staircase. If there is tiny lift extra man power is definitely required.\nInstallation: Installation was good, the technican has good knowledge on the product and explained the features",
            "It's a great product from Motorola if you are looking for a good refrigerator go for Motorola it is value for money and it is amazing product thank you Motorola",
            "Good product in this price range\neverything seems to be excellent so far. Door lock is a must that comany should provide..",
            "excellent",
            "Overall everything is good, it's just sometimes it's side walls gets heat up.",
            "All is well",
            "Nice Product with the cost.",
            "Been using for about 2 weeks. So far so good. Installation was smooth. Switch on and forget",
            "One of best deal online for side by side door. Value for money and excellent product. Quick delivery and installation five star rating",
            "Everything is k But looking is normal from outside",
            "Awesome product, fully satisfied with this fridge.",
            "Excellent product",
            "Happy now.",
            "good product & value for money\nI exchanged my old refrigerator with this - overall flipkart service is very good",
            "Nice",
            "Machine is good but installation & demo is a big problem. The company send a lay man who doesn't know about the demo & how it work especially wifi. Only unbox the refrigerator and plug the machine.\nNo legetemate person come for demo after many days🙏🙏🙏",
            "nice product deleverd by flipkart great performence colling and also refridgerator body is tuff and durable",
            "Look and design is very good. No noise. Wifi control is added bonus.",
            "Excellent product, having lots of space for food stuff. Good quality !!!",
            "So far it's good going ! Value of money with latest features and chill freeze...",
            "2 days it was delivered, the delivery was perfectly on time and the technician from Jeeves came the next day and set up and calibrated the refrigerator. perfect service by flipkart.\nthe fridge is huge and very spacious with lots of space for everything. black colour is fantastic, but be careful it also gets lot of smudges, i have kept a cloth to avoid the smudges. cooling is very good, its quite no sound from the fridge\nfantastic buy",
            "Everything good so far, one week over",
            "Great product awesome cooling...loads of space.",
            "Working fine, Satisfied"
        ],
        "likes": [
            "112",
            "25",
            "54",
            "3",
            "14",
            "1",
            "2",
            "5",
            "3",
            "6",
            "112",
            "25",
            "54",
            "3",
            "14",
            "1",
            "2",
            "5",
            "3",
            "6",
            "2",
            "4",
            "1",
            "1",
            "0",
            "17",
            "5",
            "1",
            "18",
            "9",
            "5",
            "6",
            "4",
            "5",
            "4",
            "5",
            "5",
            "2",
            "1",
            "2",
            "2",
            "2",
            "2",
            "6",
            "6",
            "4",
            "1",
            "2",
            "2",
            "2",
            "1",
            "0",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "4",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "28",
            "9",
            "17",
            "0",
            "9",
            "0",
            "1",
            "5",
            "3",
            "7",
            "28",
            "9",
            "17",
            "0",
            "9",
            "0",
            "1",
            "5",
            "3",
            "7",
            "0",
            "9",
            "1",
            "2",
            "1",
            "1",
            "0",
            "1",
            "7",
            "2",
            "1",
            "1",
            "1",
            "2",
            "2",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "5",
            "6",
            "5",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "6",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Per day power unit",
            "Q:Refrigerator need stabilizer?",
            "Q:Does this have a 5amp pin or 15 amp pin?",
            "Q:This is led",
            "Q:What type of compressor in it?",
            "Q:is it 2 in one, can we convert the freezer side with normal refrizrator",
            "Q:Do we have seperate freezer section in it?",
            "Q:Is this convertible? Can all area convertible?",
            "Q:Black colour comes in matt or glossy",
            "Q:Can anyone tell me the height and width of this product please???",
            "Q:Does the fridge have vacation mode option control.???",
            "Q:How is it working after 8 or more months of use ?",
            "Q:Can the door of fridge be opened by voice command?",
            "Q:Is ice forming in the freezer section normal? I see ice forming in the trays and everything kept inside.",
            "Q:How to control freeze and freezer temperature and by what and how many steps?",
            "Q:Are egg trays available in the Refrigerator?",
            "Q:Does it have inbuilt light?",
            "Q:What is length of the Power Cord",
            "Q:What is the maximum temperature of side panel of fridge? Is it getting heated very much?",
            "Q:Is the door get rust?",
            "Q:Is this 5 star or not???",
            "Q:It can be manually controlled by without using app and wifi?",
            "Q:What is the working Voltage range",
            "Q:Does it has door lock system?",
            "Q:Does this fridge freeze?",
            "Q:Can I set two different temperatures for two different sides? Let say one side I want -23 and another side 5 ?",
            "Q:How much percentage of GSTIN will be added to this product?",
            "Q:Is the entire left side a freezer? Or only bottom 2 closed drawer (on left) and ice tray area? Complete Right side seems to be Fridge. Its not convertible right? How is the service of Motorola?",
            "Q:Convertible facility is available or not",
            "Q:Are both the sides of the fridge are heating",
            "Q:What is the use of Wifi ? Can we connect with Alexa or google assistant ?",
            "Q:What is the colour name of this ,is its black or brack grey",
            "Q:Can we buy additional trays for this Refrigerator",
            "Q:What 3 the exact color",
            "Q:space required for it?",
            "Q:As this is almost 6 inches less wide compared to other brands, give inside dimensions of the compartments in freezer & fridge? How large vase/pot it can accommodate in terms of length and breadth?",
            "Q:Is the outside material of glass or steel?",
            "Q:Is it has child lock feature",
            "Q:How many members in a family can operate the fridge using their smartphone on the EZ app?",
            "Q:What about fridge noise ?",
            "Q:How do I set up my device for the first time?"
        ],
        "answers": [
            "A:Approx 1.5units per day.",
            "A:No not compulsory",
            "A:Regular 5 amp plug",
            "A:Yes",
            "A:Inverter",
            "A:No",
            "A:Yes, we do.. It's really convenient to have a separate freezer .",
            "A:No",
            "A:It is matt",
            "A:70 inch height",
            "A:Yes",
            "A:No issue which I am facing till now",
            "A:No",
            "A:yes",
            "A:Either through touch panel or through app, you can set custom temperatures or choose from preset modes",
            "A:Yes",
            "A:Yes",
            "A:it is more than 1.5mtr",
            "A:Yes",
            "A:No, as of now. I purchased it 3 months back",
            "A:yes,it is",
            "A:Yes",
            "A:The unit can run well in the voltage range of 160~260V",
            "A:No..",
            "A:Yes left side is freezer but there is section below in bottom where u can keep ice tray",
            "A:Yes. U can set different temp.",
            "A:18% gst",
            "A:The left side is totally freezer , and it's not convertible",
            "A:No, but freezer is too good. And u could control the temperature separately, via touch panel.",
            "A:no",
            "A:wifi function is for setting temperature though its of no use. reconnecting is like fighting a war. No u cant connect it with Alexa or Google assistant",
            "A:Black",
            "A:I am using it for last 4 months, I don't see any option to add additional trays. moreover, it has pretty big storage, additional trays should not be required.",
            "A:black",
            "A:dimension already mentioned. space required is as per findings mentioned.",
            "A:racks are adjustable and enough slots are available to accomodate large vessels. we could accomodate upto 7kg capacity vessels inside fridge.",
            "A:steel",
            "A:it has lock feature , but not a physical key. You have to hold lock key for 3 seconds to unlock.",
            "A:Anyone with a smartphone & EZ app downloaded can operate the fridge via the app",
            "A:It has less than 43dB sound level",
            "A:Please refer to the 1 page consumer insert which is received with the product"
        ],
        "likes": [
            "10",
            "18",
            "13",
            "7",
            "1",
            "2",
            "1",
            "2",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "27",
            "23",
            "21",
            "1",
            "1",
            "2",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "2",
            "7",
            "6",
            "2",
            "1",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "9",
            "8",
            "8",
            "0",
            "0",
            "4",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "2",
            "1",
            "0",
            "1",
            "0",
            "0"
        ]
    }
}