{
    "title": "SAMSUNG 192 L Direct Cool Single Door 3 Star Refrigerator  (Elegant Inox, RR20T172YS8/HL)",
    "product_specification": {
        "In The Box": "1 Unit Refrigerator, User Manual with Warranty Card",
        "Type": "Single Door",
        "Refrigerator Type": "Top Mount",
        "Defrosting Type": "Direct Cool",
        "Compressor Type": "Digital Inverter Compressor",
        "Capacity": "192 L",
        "Number of Doors": "1",
        "Star Rating": "3",
        "Coolpad": "No",
        "Toughened Glass": "Yes",
        "Built-in Stabilizer": "Yes",
        "Convertible Refrigerator": "No",
        "Shelf Material": "Toughened Glass",
        "BEE Rating Year": "2020",
        "Stabilizer Required": "No",
        "Launch Year": "2020",
        "Net Total Capacity": "182 L",
        "Net Height": "118 cm",
        "Net Depth": "64 cm",
        "Net Width": "53.2 cm",
        "Weight": "30 kg",
        "Installation & Demo": "This product does not require installation. The features of the product are presented in the user manual that comes with it. Hence, the manufacturer does not provide on-site installation or demo for the product. In case of any queries about the installation or the features of product, kindly call us at 1800 208 9898 or (080) 49400000 for assistance.",
        "Warranty Service Type": "Technician Visit",
        "Warranty Summary": "1 Year on Product and 10 Years on Compressor From Samsung",
        "Covered in Warranty": "All Parts Excluding Plastic Parts, Glassware, Bulb and Tube from the Date of Purchase Against Defective Material and Workmanship",
        "Not Covered in Warranty": "Parts: Plastic / Glassware / Bulb / Tube. Any Accessories External to the Product. The Product is Not Used According to the Instructions Given in the Instructions Manual. Defects Caused by Improper Use as Determined by the Company Personnel. Modification or Alteration of Any Nature made in the Electrical Circuitry or Physical Construction of the Set. Site (Where the Premises is Kept) Conditions That do Not Confirm to the Recommended Operating Conditions of the Machine. The Serial Number is Removed, Altered or Obliterated from the Machine. Defects Due to Cause Beyond Control Like Lightening, Abnormal Voltage, Acts of God or While in Transit to the Service Centres or Purchasers Residence"
    },
    "product_description": {
        "Digital Inverter Compressor": "This compressor adjusts the compressor speed automatically in response to different cooling demands across 7 different levels. Also, it needs less energy, makes a low noise, and also enhances durability by reducing wear and tear.",
        "Stabilizer-free (100 V - 300 V)": "This feature offers reliable, stable, and safe performance by preventing electrical damage or shorting due to voltage fluctuations. Also, when the flow of voltage increases, it cuts off the power supply automatically.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "1",
            "5",
            "5",
            "4",
            "1",
            "3",
            "5",
            "4",
            "5",
            "2",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "4",
            "1",
            "5",
            "2",
            "2",
            "1",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "1",
            "4",
            "4",
            "1",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "3",
            "4",
            "4",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "2",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "1",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "2",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "3",
            "4",
            "4",
            "2",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "2",
            "4",
            "1",
            "5",
            "4",
            "4",
            "5",
            "1",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "4",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "3",
            "4",
            "5",
            "4",
            "4",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "3",
            "3",
            "3",
            "2",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "3",
            "5",
            "5",
            "1",
            "4",
            "3",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "1",
            "4",
            "4",
            "5",
            "5",
            "4",
            "2",
            "4",
            "5",
            "3",
            "3",
            "3",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "1",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "3",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "3",
            "3",
            "3",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "3",
            "3",
            "4",
            "4",
            "5",
            "3",
            "1",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "4",
            "5",
            "4",
            "4",
            "1",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "1",
            "5",
            "3",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "2",
            "2",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "4",
            "2",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "1",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "3",
            "4",
            "3",
            "1",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "1",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "4",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4"
        ],
        "review": [
            "Updating after one year of usage. The refrigerator is working very finely. Timely delivery from Flipkart. Got delivered on the same day which Flipkart promised. Since this product doesn't require installation, can be switched on after four hours as advised by the delivery agent.But still its advised to call Samsung toll free number and register the product. This will help in raising complaints during warranty period. Also once we register the product, Samsung representative will come and do the demonstration which will help us in asking any doubts or queries about the working.\n\nWorking:\n1. Excess ice formation in the freezer zone: Since this is a direct cool refrigerator, need to do manual defrosting at least once in a week which is basically pressing a switch which will in turn make the compressor stop working. This helps in removing the ice as the compressor wont work for at least 3 to 4 hours. This is little inconvenient. So be very sure if you want to go for a direct cool refrigerator or a frost free refrigerator. I was not very much aware about this when I got this product and now I did a mistake in buying a direct cool refrigerator.\n\n2. Water is getting accumulated in a tray at back side of the refrigerator. As per the users manual its written, this needs to be drained manually by taking out this tray frequently. This is a very tedious job and very inconvenient and if not done water is over flowing from the tray which will make the floor completely wet. This problem is severe during defrosting so be ready for this.\n\nSize is suitable only for a very small family, so be sure about the requirement when you go for this. Overall a good product at this price.",
            "Using it for 10 days now. Everything is good except there is a little vibration (which is normal in digital inverter compressor). If I put an empty bottle on top of fridge, sometimes it's vibrating. Side walls are getting hot, it's also normal. Cooling is excellent. Most of all the design is elegant and delivery boys are fantastic.",
            "Worth the price.\nA nice Samsung product.\nHas got a nice design and look. The back design gives it an upper hand. Cooling is good.... does its job in a quite fashion.\nInner trays and compartments are designed nicely. Absolutely no noise made. Right side gets bit warm - which is normal as per the manual provided and it's not a thing to even consider unless u hug ur refrigerator and sleep.\nThe power cord is bit short - only con that I have with this .... but not too short to consider buying a different product.\nRemoving the water collected after deforsting might be an issue... but doing that once in a while won't be a thing of concern.\nFilpkart - delivered the product fast and unscathed.",
            "Best in the price range. Nice finish. Delivery and installation done on time..spacious and perfect for 2 people. If u are looking for the same ..just go for it..",
            "samsung do good work on their products.\nvalue for money\ndesign is slightly good but awsm shiny material use\nyou can add ur cart it is a nice product\nand last flipkart do there best delivery this time.",
            "awesome purchase but the delivery boy was very disappointed. he didn't want to enter his vehicle at my address and also the delivery boy is talking very rudely\nbut no Dents in fridge great performance and looks and also cooling is very good\ngo for it.. my recommendation for 2-3 member",
            "Great refrigerator and mfd in 2019 . Cooling is ok great service by flipkart . Schedule delivery option helps a lot when you are not in town. Most reliable e commerce site",
            "Good better nice excellent super awesome admirable",
            "A good 4 rated fridge for a small family of 3-4 ppl. Design is good and is spacious inside. Overall happy with the product in this price range.\nonly thing its making some sound when I started it for the first time but that's normal as its written in the manual",
            "Perfect fridge from a small family, gives you excellent cooling.\nEnough space to accommodate vegetables and fruits for a week, keeps them fresh thought-out.\nWater bottle space can fit 2 litre bottles, you can keep your child drink bottles without worrying about space.\nOverall good buy!!!!!!!",
            "Updating after one year of usage. The refrigerator is working very finely. Timely delivery from Flipkart. Got delivered on the same day which Flipkart promised. Since this product doesn't require installation, can be switched on after four hours as advised by the delivery agent.But still its advised to call Samsung toll free number and register the product. This will help in raising complaints during warranty period. Also once we register the product, Samsung representative will come and do the demonstration which will help us in asking any doubts or queries about the working.\n\nWorking:\n1. Excess ice formation in the freezer zone: Since this is a direct cool refrigerator, need to do manual defrosting at least once in a week which is basically pressing a switch which will in turn make the compressor stop working. This helps in removing the ice as the compressor wont work for at least 3 to 4 hours. This is little inconvenient. So be very sure if you want to go for a direct cool refrigerator or a frost free refrigerator. I was not very much aware about this when I got this product and now I did a mistake in buying a direct cool refrigerator.\n\n2. Water is getting accumulated in a tray at back side of the refrigerator. As per the users manual its written, this needs to be drained manually by taking out this tray frequently. This is a very tedious job and very inconvenient and if not done water is over flowing from the tray which will make the floor completely wet. This problem is severe during defrosting so be ready for this.\n\nSize is suitable only for a very small family, so be sure about the requirement when you go for this. Overall a good product at this price.",
            "Using it for 10 days now. Everything is good except there is a little vibration (which is normal in digital inverter compressor). If I put an empty bottle on top of fridge, sometimes it's vibrating. Side walls are getting hot, it's also normal. Cooling is excellent. Most of all the design is elegant and delivery boys are fantastic.",
            "Worth the price.\nA nice Samsung product.\nHas got a nice design and look. The back design gives it an upper hand. Cooling is good.... does its job in a quite fashion.\nInner trays and compartments are designed nicely. Absolutely no noise made. Right side gets bit warm - which is normal as per the manual provided and it's not a thing to even consider unless u hug ur refrigerator and sleep.\nThe power cord is bit short - only con that I have with this .... but not too short to consider buying a different product.\nRemoving the water collected after deforsting might be an issue... but doing that once in a while won't be a thing of concern.\nFilpkart - delivered the product fast and unscathed.",
            "Best in the price range. Nice finish. Delivery and installation done on time..spacious and perfect for 2 people. If u are looking for the same ..just go for it..",
            "samsung do good work on their products.\nvalue for money\ndesign is slightly good but awsm shiny material use\nyou can add ur cart it is a nice product\nand last flipkart do there best delivery this time.",
            "awesome purchase but the delivery boy was very disappointed. he didn't want to enter his vehicle at my address and also the delivery boy is talking very rudely\nbut no Dents in fridge great performance and looks and also cooling is very good\ngo for it.. my recommendation for 2-3 member",
            "Great refrigerator and mfd in 2019 . Cooling is ok great service by flipkart . Schedule delivery option helps a lot when you are not in town. Most reliable e commerce site",
            "Good better nice excellent super awesome admirable",
            "A good 4 rated fridge for a small family of 3-4 ppl. Design is good and is spacious inside. Overall happy with the product in this price range.\nonly thing its making some sound when I started it for the first time but that's normal as its written in the manual",
            "Perfect fridge from a small family, gives you excellent cooling.\nEnough space to accommodate vegetables and fruits for a week, keeps them fresh thought-out.\nWater bottle space can fit 2 litre bottles, you can keep your child drink bottles without worrying about space.\nOverall good buy!!!!!!!",
            "This fridge is good but as compare to Haier, Haier fridge is better as well as cheaper than this.\nSamsung Fridge has noise and internally small",
            "Very good fridge , no sound , no heating on sides and very great delievery on time by flipkart .\nIt will sound only in the first day of installation but after 4 to 5 hours it will go away and this Fridge is worth the cost or Value for Money deal, I recommend all to buy it.",
            "last day i started using it ..its working perfect and its not noisy ..design is also give classical look ...i love it and i am satisfied with flipkart service people actually feel that electronics item we should purchase outside i was also but its better i don't take any stress they delivered at my door step...🤗",
            "Thanks Flipkart for awesome product at cheapest price...\nand of course with an excellent commitment & services delivered...",
            "well I get that fridge today. looks good and super silent. but it get warm in 2 sides and it mentioned already its a process to reduce moisture and its not malfunction.. overall its a great product in low budget..😇",
            "Light Weight, easy to relocate. Storge is good, Best in this prize...\nJust one this to say...You can't get everything in this prize",
            "Sufficient for family of 3-4 people. Cooling is great. Max cooling is at 6 and I have to set it to 4 in April end. Shelf and storage is almost and as shown in the pictures. Totally satisfied..\n\nIf you are looking for bar fridge, this is one of the best option. Although height is more than of bar fridges but it does have all the latest technology and better power ratings. Cannot be kept in room.... FYI",
            "amazing product..nicely working and good cooling. well delivered and placed",
            "I am really loving it",
            "value of 💰",
            "very nice",
            "very good fridge in budget range.\nproduct can be delivered to your door no matter your 🏠 is at 3 floor or 4floor. but it cannot be placed over stand.",
            "Please don't buy Samsung refrigerators, they keeping condenser coil on side panels and it is getting heating like anything more than 60 degree, you cannot keep anything nearer to the refrigerator, we must maintain 300 mm on both side and 100mm from back side from wall for heat dissipation as per manual , this features no where they mentioned in specification in flipkart , only it is mentioned in user manual of Samsung, this type of rubbish design will not work for small families who is having less leg room space kitchens and dining halls. More over if you have child this type of refrigerator dont buy, this body heat will damage the children's hand when they touched it. This type won't work for longer period side panel paints will peel peel off quickly if this much heat it exhaust.",
            "Over heating like iron box (right side)",
            "Very nice!!",
            "Very good product at this price",
            "fridge is good.but connected wire is very small as compared to others.And also fridge vibrate much more.if we ignore this two cons it is a good product.\nit,s energy consumption is 162 bot per annum.It,s salient features is designed.",
            "not satisfied i m worried buyed it",
            "Good",
            "Super awesome, thanks filpcart.....",
            "Nice product",
            "nice",
            "cooling is good but makes too much noise...it seems like product is faulty",
            "good",
            "value for money, good product, best for family of 4",
            "I m impressed with your service . Thanx for so nice Samsung refrigerator. It works gr8.",
            "good product....nice look...imminance cooling.... simply awesome",
            "good one with economy pricing",
            "very good product at reasonable price",
            "Product is too gud.",
            "Very good fridge. At this price cooling was great.",
            "Cooling is very poor and also gasket problem was there with my fridge but it was replaced by flipkart but they have taken a lot of time to do that ...\nEagerly waiting for my new replaced fridge as not yet delivered ..",
            "amazing",
            "prodect is good but refrigerator down bass stand r movabull try stand r atched to refrigerator",
            "Its so beautiful as compared to photo",
            "Not even a month old, Water leaking to the floor, freezer filled with ice berg, but your icecream will not get iced it will be normal how you kept before, disgusting qu",
            "Good products",
            "Nice product. Good for two or three family members.",
            "Its beautiful nice",
            "Nice product",
            "It's a perfect fridge for small family, cooling is fast, no noise, easy to clean. Although It has in built stabilizer but still I am using a V Guard stabilizer to ensure more safety. Electricity consumption is very low. Design is also quite impressive.",
            "Gud",
            "Nice product",
            "Good for small family",
            "Good",
            "i am writing this review after using it almost one year, It doesn't defrigde easily, veggie box is too small, not enough space to keep lots of fresh veggies. it gets kind of smelly in temperature, have to keep it in summer mode everytimes,not a smart buy i would say.\ngiving 1 extra star only for electricity consumption , otherwise it' 2 star rated .",
            "Product is good....but behaviour of the delivery man is so so bad.... and he enters the room without put off the sandals....what\"s this???",
            "Worst product in sum sung don't buy any one",
            "Amazing",
            "ok",
            "too noisy, does not keep freezer at same temp, if u keep ur icecream in freezer it will melt and doesnot freez making it to be liquid.",
            "it is vast bad don't purchase it",
            "Its getting too hot like iron with in 20 mins of switch on. i don't know what will happen to it after using day and night. else everything fine.\n\nEdit:\nWithin 2-3 weeks of usage its creating huge vibration sound which is easily audible. poor product.. never expected succh from Samsung.",
            "good",
            "Excellent",
            "very good for 4-5 mamber , it has great look and design",
            "awesome",
            "nice one",
            "Looks classy !!! Samsung is a nice brand . Cooling options are good. For this star rating little costlier . But for the looks its value for money.",
            "superb refrigerator for 4-5 members family in this price range.....",
            "good product but compressor is sounding but it is proper working better",
            "nice",
            "Perfect....",
            "Not ontime delivery....No response...Vibrate more...High voice of compressor",
            "is good",
            "This is really great product. In short value for money\nThe capacity of refrigerator is very good for a small family ... interior of refrigerator is osum ...",
            "Power cable length is very less.It is not reach up to plug ..size is less than standard height of plug in Indian homes ..so I kept fridge on stand",
            "this is very wrong decision which I have taken to buy it. heating is from right and lift side like a iron .gives noise & cooling is also very poor.\nnever buy Samsung fridge or this model ...\n😧",
            "I am very happy of this prodect",
            "Amazing superb tq flipkart",
            "It's good purchase. Colour expectations were more but is slightly different. Side walls are heating to some extent. Rest it is a power efficient, good looking and has a brand value of SAMSUNG.",
            "verry good product..... value of money",
            "bang for the buck!\ngo for it!!",
            "Good",
            "Did all the necessary setup. It looks very good. Good cooling. enough capacity for 2/3bhk house.",
            "Totally satisfied with product. Cooling is great. Look is pretty elegant as well.",
            "Nice rang of the product",
            "Super",
            "Good",
            "Very nice",
            "Good",
            "Nice",
            "Very Nice",
            "All is well",
            "Writing review after a week usage\n\n*silent\n*chilled\n*less power consumption\n*good enough for 4 members family\n*timely delivery",
            "Thanks Flipkart",
            "Working good... A quility product....",
            "I am very happy",
            "Nice",
            "very good very nice product",
            "Nice product",
            "Good quality and looking",
            "This is very good product 😊😊",
            "Good",
            "Good",
            "Great product with awesome performance.must buy",
            "best cooling",
            "E Kart Delivery was good and very cooperative.\nSamsung Fridge is user friendly",
            "Nice product\nSize is too small.",
            "Little bit complaints but not major complaints its ok",
            "Poor",
            "Ex",
            "Amazing product",
            "good product",
            "Nice product",
            "Nice Product in budget.. ❤❤",
            "Superb products",
            "V.good",
            "Excellent",
            "Super",
            "Good",
            "good",
            "Good",
            "Product is good and value for money... but not delivered on mentioned date. Overall quality is good but flipkart has to improve its delivery performance.",
            "Working fine using 4 days no noise good in budget.",
            "Not bad",
            "Not for fast cooling",
            "Nice",
            "size is suitable for small family and colour is awesome. using it for one month now everything is good and cooling is excellent. Best in the price range. Nice finishing. delevery on the time......😊😊😊",
            "Good",
            "Value for money and satisfaction",
            "Good",
            "Ver good 👍👍👍",
            "Nice product",
            "Good 👍😘😘😘😘😘",
            "I loved it❤️❤️",
            "Nice",
            "Nice product",
            "good. But some concentrate must on travelling",
            "Super",
            "Osm",
            "I am very happy",
            "Good product at this price",
            "Good product thank you",
            "Good",
            "Wonderful product...",
            "Good",
            "It's a lowest price refrigerator and performance level is good.",
            "Plz don't buy electronic products online ,this fridge is to much vibrating",
            "very bad product\nwaste of money don't buy this product",
            "Very Nice ..flipkart Service And Product Too\nThank You Flipkart",
            "Love it. Thankyou flipkart for the best offer. ❤️",
            "Look beautiful and specius , perfect for small family",
            "Good performance 🙂",
            "Very compect and good refrigerator",
            "Good",
            "Super",
            "Does the job. Spacious too",
            "Good product",
            "Fast cooling and less power consumption",
            "Budget friendly friedge guys go for it...its good for nuclear families",
            "Good quality",
            "Very nice",
            "The only thing is that its cooling features are very high. Due to this reason ice bucket is full of ice within 5 to 6 days.. Overall good for small family",
            "Good product this range.",
            "Value for money 💰",
            "At first time i received defective bulb and cooling problem but now after replacement i am satisfied.\nThank you flipkart for the service you provided to my expectation.\nBeleive on flippkart and its services Thank you all flipkart executive and",
            "Very good",
            "Impressive",
            "Good",
            "product is good but size is small",
            "Awesome 😎👍🏻",
            "Nice quality and value for money",
            "😊 Nice product 👌",
            "Good at this price , only sometime too much vibrating this is issue. Apart of super cooling and elegant design worth to purchase for small family. Flipkart is great to deliver on time .Thank You",
            "Design is simple super, looks pretty but performance is okay with in this budget",
            "Bad product very niose",
            "I AM VERY HAPPY FOR PURCHASE THIS FRIDGE, LOOK WISE GOOD, AND COOLING NICE, SOLID. OVER ALL GOOD PRODUCT.",
            "Nice",
            "Good quality",
            "Sides of the fridge getting more heat",
            "Awesome 😎",
            "Stunning design. Super stylist. Very nice performance.😘",
            "Third class product any other not to buy........",
            "Nice",
            "nice company and product...\n\nI using last some month...\nPerformance is good\nAnd quality is too good\n\nDelivery boy behavior is good",
            "Super. But side heating issue",
            "Nice",
            "Working nice but little sound",
            "Great choice for this price.worth for money.",
            "Makes a lot of noise. Not recommended",
            "Very good",
            "Product is better in this price",
            "Value for money .. good delivery use for small family I love it and thank to Flipkart",
            "Good design, performance but over heating.",
            "Good",
            "Good",
            "It is best prize argument",
            "This refri.is .3star ..electercity consumption equal to 5star refri from another brand refri. Awesome product.",
            "Excellent proud, I love it",
            "Good delivery service",
            "So far so good 👍",
            "Highly recommend! Best in quality. Fantastic look and design.🤗 Reasonable price.",
            "Good one",
            "Reliable product.",
            "Start sometime very heat and back site complete not cover",
            "Worth the price",
            "Awesome... quality speed delivery just in 24 Hr ofter booking and good product.",
            "Waste of money over heat issue",
            "Good",
            "Good",
            "Nice",
            "Nice",
            "Good for 3 members",
            "Nice product",
            "Super item",
            "Best",
            "Good and reasonable price..suits for 3 members family in my opinion.",
            "The vegetable storage is not upto the mark... If v keep the temperature in monsoon n summer... All the vegetables is filled with water... Specially tomato n cucumber... Bkm watery",
            "Good",
            "Nice product",
            "Nice performance 👍 I like it value of money",
            "Nice",
            "good",
            "It's noisy, more sound",
            "Good product, recommend to buy",
            "Damaged items send, broken leg , it's not sitting properly, I not return this product because of my emergency. This very bad experience with Flipkart.",
            "Worth of money..",
            "Nice",
            "Good",
            "Awesome",
            "Dnt buy this refrigerator,I facing too much heating & leakage problem,it is not worth for our money",
            "Good 👌",
            "Good quality...nd looking s",
            "Worth for money",
            "Very fast delivery and good product",
            "Good quality its look very nice.",
            "Verry good product",
            "Overall like design, performance, capacity it is very very nice refrigerator..",
            "Good 👍🏻 product.",
            "This was the best deal!",
            "Superb...looks perfect,cooling is also amazing...worth the price",
            "More than OK",
            "Nice",
            "One of the best product at cheaper rate. When enquired in local home appliances shop this refrigerator costs almost 1.5K more than the listed price in Flipkart.\n\nAbout the performance. The Refridgerator is working fine and doing all our small family purpose well.",
            "Fastest delivery 🚚 and good product.",
            "Comfortable item and loved it",
            "Value for money",
            "Nice",
            "Nice",
            "Nice product, I like it 👍👍👍👍👍👍.",
            "Very nice 👍",
            "This is a very good fridge in this budget, its size is also very big and it consumes less electricity, its cooling is also good but its plastic material is not so good. Thank you",
            "Good product",
            "Good product",
            "Thanks to seller and Flipkart for quick delivery. The Delhivery's service is also fantastic. Good Behaviour of deliveryboy is appriciable. Received fresh piece June21.",
            "Good Products",
            "Best is best",
            "OVERALL GOOD PRODUCT",
            "awesome products in low budget",
            "Worthy purchase 👌",
            "Brought in August last year and since yesterday it's non working due to gas leakage as per Samsung technical support....To mend it they take a week, but really shocked the gas got leaked within year, now I think this issue will continue every year.",
            "Good",
            "So far so good. One of the best budget friendly refrigerators.",
            "Good",
            "Nice",
            "Very nice product",
            "😍Very good product tq flipcart.........",
            "Good gality",
            "Build quality is looking very light weight. As technology improved things may be compact.. But some time it makes us to worry about sturdiness of the product.",
            "Good product at this price range.no stabilizer required and its produce heat sometimes.",
            "Go for it guys superb",
            "ICE BOX LITTLE BIT DAMAGE FOUND DURING DELIVERY...\nOVERALL PERFORMANCE IS GOOD..\nBUT SIDES OF FRIDGE BECOMES TOO HOT..\nOverall performance is best as per as price concern..",
            "Nice product",
            "Its good looking and nice. Feels very hot outside when its working. Thats all",
            "It's Good",
            "Must buy.. best prosuct in this range.. i just love ittt",
            "Good product 👍",
            "Nice product 👍👍",
            "Nice product",
            "Good",
            "Very good product",
            "It's refrigerator has no installation",
            "properly not standing and ice tray very small.",
            "Not a good option due to rear side plastic parts consume lot of space and built quality also not good",
            "Good for a single person like me, fast delivery and kind delivery persons, thankyou so much flipkart, thumps up?",
            "When First time a the Fridge..., Cooling Note Working ... bt When I exchanged fridge From flipkart. Fridge Cooling is Excilence.. Thanku Flipkart",
            "Its very gud product in this range.flipkart's delivry is very fast",
            "Good product at this price",
            "Good for the price",
            "Not bad",
            "Lock key is plastic material otherwise it was worth it if it will long last",
            "Samsung refrigerator is very nice...",
            "Very good product. Worth the money.",
            "Nice",
            "this is a very nice refrigerator",
            "Exlent",
            "Good product",
            "Good 👍",
            "Nice product",
            "Product is ok.. According to whirlpool",
            "Delivery was so fast as expected .... Good for small family",
            "Super product",
            "Its body heating too much.\nFlipkart didn't mention it in product description.",
            "Good.",
            "Good for the money",
            "Good product for small family..",
            "Good product",
            "Good fridge for nuclear family",
            "Nice product",
            "Good Design with sleek looks. Value for Money. Working super cool.",
            "Nice and for couples is the best one",
            "Super",
            "Value for money I love ❤❤❤❤❤ very much this product",
            "This fridge is good in its price range and even u can check the authenticity by checking in the serial number on Samsung site online and get ur warranty started.\nPosting review nearly a month after, so far so good. Will update the comment after 6 months and a year time frame",
            "Goid",
            "Ekart open box delivery is very good.received in good condition.product degine is nice . cooling is very good but it makes sometimes very noise.you can't keep it near your living room.energy consumption is only 162 unit per year.",
            "Fast delivery... Good product condition....",
            "Good one.",
            "Value for money.",
            "Very disappointed this product.i am return it but no response.😭😭😭",
            "Very nice product",
            "Product is good but delivery boy is\nvery good.",
            "Good except the fact there was slight alignment issue in The base.",
            "Fastest delivery in 3 days.... performance and quality is good.. highly recommend.",
            "Good",
            "Good One.",
            "Flipkart thank you good product",
            "Received as expected by today,\ngood product,\nvalue for money.",
            "Small size but good cooling, Nice product, Little snoring sound.",
            "Is awesome",
            "Nice Product",
            "Nice prodect",
            "Vry gd",
            "Superb Product",
            "Good quality products",
            "Fantastic product .....fully satisfied",
            "Nice product..",
            "Good",
            "This refrigerator is awesome & completely value for money..Thank u Flipkart..",
            "Everything is nice about the fridge from it's look to it's cooling and what not. I bought it for 13.7 K and I think it's a bit over priced for it's capacity 192L and 3 star rating.",
            "Good for small family...nice cooling",
            "Good quality product",
            "Worst refrigerator ever I have bought.",
            "Nice product for couples.",
            "Awesome 👍👍",
            "Good",
            "Supar",
            "I bought Samsung 192 L single door value for money.\nFor small family 4 members can use.I bought the product for RS 11533 including bank offer .Thanks Flipkart",
            "Damage products",
            "Awesome fridge for small family ,go for it",
            "Value for money 💰 refrigerator is awesome\nNo sound super 😀",
            "This is 2nd time I'm reviewing after two months seeing the performance of this refrigerator it make heavy noise and vibrates a lot please don't go with this product......",
            "Superb",
            "It's good for small family.",
            "Nice product and thanks to flipkart",
            "Best product",
            "The product is good. But Gati courier persons were very bad. They were charging to lift the fridge on the first floor, very disappointing. Their behaviour was also very bad.",
            "Good",
            "Heating issue and don, t working this product",
            "Price should be around 12000..bcoz size is small.. No problem still.. It's good.. Samsung.. Thank you flipkart for on time delivery",
            "I am unsatisfied with product flipkart service is very poor.",
            "Good",
            "Superb, looks wise it's good, functionality I need to check coming days and I'll give gd review after usage",
            "Its just awsome....awesome design",
            "No noise good look and very good product....... Value of money.....I love did.....",
            "Really Nice product",
            "Fabulous 🤩🤩",
            "Nice product",
            "Very Nice product.",
            "Great performance",
            "Steel as it looks.super gorgeous and enough for 5 ppl family.",
            "I buy this friz last year september. Now this friz is not cooling proper. This type friz life not much more just only one year.",
            "A fridge is worthless ..even it's not run for 1years..worthless 👎",
            "Value for money but they can do better in terms of space and capacity.",
            "SPL thanks to Delivery person nice behaviour,,and on time delivery,, again to delivery person team n Flipkart I m so happy,",
            "Good",
            "Very specious, vll give more than 5 star",
            "Good.. value for money",
            "Good",
            "Nice fridge u can go for it but its too small very small fridge",
            "Very good",
            "Sleek and elegant design value for money must buy.. but the cord length is very short approx 4 feet need to buy an additional extension board",
            "Overall good product. No noise and sufficient cooling. Build quality is adequate although compare to the whirpool product which i had earlier the quality is downside. So if whirpool is in your list, go for that. Power consumption is also ok. Thus, considering the price the product is good. Lets hope, the life of the product is also good.",
            "After 10 days of usage coming sound from back side(maybe compressor) makes noice...",
            "Nice.. happy with products 😍😍😍",
            "good",
            "Nice product",
            "Nice product",
            "The only problem is frosting quickly.",
            "Very good",
            "A worth product",
            "This is great product from Samsung. Side wall is heat like 60°C but it's normal because of copper pipe inside.",
            "Fantastic purchase",
            "Super cool",
            "Product is good but side weal is heating.",
            "Very good product overall by performance. Small issue of side heating but as mentioned on product it's normal and part of working process of refrigerator.",
            "Good quality 👌💪",
            "Overall a good product at mid budget by Samsung and thanks to Flipkart for delivery in this covid pandemic situation",
            "Good design and awesome product",
            "Nice product",
            "This is a great product. Got it delivered as per scheduled by Flipkart.\nCooling is awesome and look is as good.",
            "Satisfactory puchase .",
            "Not really satisfied with the product.... Some unrecognized sound is heard again and again from the unit.",
            "Cooling not so good. Whirlpool is best in this category. Accessories like side door trays are made of low quality plastic material. Can be easily broken. Same for the vegetables basket. Runs silently. Ice building starts from the very first day.",
            "More noise on compressor side..",
            "Uper door is not closed properly . there's small gap between",
            "Nice all",
            "Go for it",
            "Its already been 3 months its working fine",
            "Nice",
            "super",
            "Height is very low rest product is good",
            "supar",
            "Great fridge for the price you pay.\nWorth every penny.",
            "Nice",
            "Good",
            "All out of 5 star...",
            "Nice product Awesome.",
            "Good product and design is very impressive",
            "Nice",
            "good product",
            "good",
            "Nice.....",
            "Excellent product, if you are not looking for double door. Compact product, slight noise is there during operation",
            "a perfect 👍 product for small family. outlook is 💯✨ . value for money💰product. I got exact the same model as I ordered.\n🔅 it make a bit noise sometime.. but I m okay with that.\n🔅the delivery boy was on time n was very supportive in installation n pickup process. thanks to flipkart, you made my life easy.",
            "nice one",
            "velue for money",
            "best one and economy",
            "awesome product , value for money",
            "for couple purpose",
            "very good... m so happy with Flipkart electronics products shopping... thank you Flipkart.. buy More",
            "paisa vasool product",
            "nice for small family",
            "Good",
            "super value for money",
            "osm brodact",
            "One of the best",
            "fantastic, I love it",
            "fantastic freeze so awesome",
            "Decent product by Samsung.. rich look .. perfect for small family ...engery efficient...fast delivery by flipcart as always...",
            "nice",
            "ty",
            "This is amazibg profuct",
            "Nice design",
            "nice product",
            "best h good according to money",
            "best fridge in 12k",
            "avarage",
            "Very nice product",
            "As i read reviews of others like vibration and heating issue, there is no problem till now.. premium design looks great",
            "superb...",
            "Good purchase",
            "super",
            "In just 3 months, door is not worming. it is only partially closing.",
            "I would like to recommend this refrigerator",
            "good purchase",
            "Good Product....",
            "good product",
            "Good product within range...",
            "super",
            "Excellent",
            "Satisfied... Delivered in just 2 days.... Nice packaging... Working fine... No noise.. . FIVE STAR",
            "Excellent look and performance ,features are also good. value for money",
            "best and compact in this range",
            "Super",
            "damaged product",
            "wonderfull colour and design.",
            "Good experience with Samsung",
            "they didn't install",
            "Not having legs back side so how to stand properly its refrigerator cable too short",
            "Makes some noise at night.. Otherwise good product..",
            "Happy with the product but disappointed with delivery time.",
            "best features...and good product",
            "awesome",
            "Very high vibrations and sound making garbage it is. Not worth buying.",
            "It's a good product till now...Hope in long run it will work same...",
            "used it for more than 6 month and it works perfectly",
            "nice product was facing some issues but resolved by samsung",
            "Small size",
            "WHY THIS PRODUCT SIDE HEATING PROBLEM",
            "Worth the money. Classy look.",
            "Bought on worthy price with classic look. This is the first time that I bought an electric products from flipkart and stratified with product and it's services.",
            "Nice product",
            "excellent",
            "excellent product good service flip kart",
            "very good product but I received 8 days delivery so late",
            "it's ok 🤔🤔🤔",
            "looking very nice but little bit noise and Heating problem",
            "very good product",
            "super",
            "osm",
            "use full ..valuable",
            "Awesome product, Good quality...",
            "Good product",
            "very good product. good packing.. no noise..fast service thank you Flipkart.",
            "delivery was perfect as per promised date , but exchanged of product not been considered due to strict norms. product is good and value for money. later once product operational , heating issie observed",
            "Good morning",
            "good",
            "nice",
            "Best Product in Best Price.",
            "it's a good fridge ....but I touched it from back side it shokcs my hand ...it has the current in behind body.\notherwise all over is good .",
            "good product",
            "main wire is very short",
            "Go for ...this",
            "nice but over heating",
            "Excellent..",
            "best in below 200l capacity",
            "Working in good condition.\nValue for money",
            "very good",
            "new 🆕one☝",
            "overall good.",
            "Good for small family. energy efficient and quiet.",
            "I am not happy with this product as it doesn’t have option of auto dry wastage water we have to throw water manually so this is the main deawback",
            "ant are there from the back covered side",
            "very nice 👍",
            "good product",
            "delivery partner to good",
            "Overall nice product",
            "looking nice. working very.......",
            "super se uper",
            "Ordered product was good.\nI am quite happy with the delivery services.\nDefinitely I’ll recommend this to my friends circle",
            "Good product",
            "I love it",
            "good product.....thnx flipkart😍😍",
            "good product\nand best quality and 10 year warranty compression with steplizer",
            "cool fridge",
            "just omg😍😍😍",
            "This fridge it too good for 2 person.\nBut disadvantage is it vibrate alot. even some it will scare you.",
            "great product in this price. Thanks flipkart",
            "best",
            "nice product",
            "very fast delivery excellent job",
            "super",
            "product delivered 7 days after expected delivery date..otherwise product & price is good...",
            "sound coming from fridge is too loud. sometimes it gets high",
            "outer heating problem",
            "good.",
            "Awesome product worth for money",
            "Good Product...but Flipkart delivery very very poor..products delivered after 35 days,..👎",
            "good",
            "The door doesn't stays stable on opening and when there's a power cut, melted ice starts dropping through the freezer.",
            "Great product",
            "excellent product",
            "Cooling is fast but it doesn’t retain cooling for long if switched off or power is cut.. design is awesome. Interior also good. Not much noisy as I have read in some reviews and no abnormality with heating of side panels",
            "basement of this refrigerator is not appropriate. but no one will notice that. it can be found other reviews posted by customers.",
            "Budget friendly, very good option. Suits very much comfortably for Family of 2 or 3",
            "supper c,ool....",
            "good product",
            "Good product . It’s good for small family .",
            "value for money",
            "awesome product",
            "awesome quality. and samsung care is too good",
            "very fast cooling",
            "worth for money",
            "very nice",
            "this product is so good service",
            "5 rating for design, 5 rating for delivery using since 2-3 month very nice product,",
            "Excellent product",
            "Good product,proper delivery, connection of wire is very small, advantages is greater than compared to a disadvantages.so,worth product.",
            "capable for small family. go for a head.",
            "Good product",
            "Nice one",
            "I really loved it. Its really good and worth the money",
            "Sometimes it make noise",
            "A little on the smaller side, but looks fantastic. Doesn't seem to consume too much power and does everything expected of it.",
            "Very good... Value for Money!",
            "cooling awesome but the fridge cant fit exactly on floor some issue is there clear it",
            "Good fridge in this price",
            "very goo...",
            "goof",
            "Very good freeze, I feel botel holder should not be plastic as it will break very soon.",
            "Good fridge",
            "Good product by samsung\nGoid delaviry by flipkart",
            "Fridge is bot stable and making sound",
            "good product ,\nreceived delivery in time",
            "fridge OK. but key is missing",
            "this is very bad product of samsung.\npls don't buy this..very small and not performer..",
            "good",
            "Value for Money!!!",
            "Good",
            "Excellent",
            "nice product",
            "good product and budget renge refrigerator",
            "AMaxing Fridge very much appriciated loved one",
            "value for money..",
            "its nice product i am with this product.....",
            "nicee",
            "Very nice product at valuable price",
            "Awesome",
            "Nice",
            "Money west",
            "refrigerator is verry good cooling verry nice but pluck cable is small",
            "Too much vibration and noisy..",
            "for small family awesome go for it no sound problem no heating issues install it with help of instruction it is awesome",
            "excellent",
            "I purchased this product for 14k. The prodcut was delivered on time without any damages by Flipkart. Coming to the product, it is very efficient in cooling. The space is enough for the average requirements of a 3 member family. There are mo major problems that I have witnessed so far. Since it is not frost free type you will have to defrost this atleast twice a week manually to prevent ice formation.",
            "Nice Work",
            "good product and fast delivery",
            "Whoever is looking for small family fridges they can buy this product. Main features are digital converter and in built stabilizer. And no grill like structure behind the fridge.",
            "good product in comparison of price",
            "size is small. heating problem in starting but everything is ok after 2-3 days. overall good product for a couple",
            "budget fridge",
            "Safely and timely delivered, design 5/5, cooling 5/5, big racks for big containers, 5 bottles of 1ltr easily fits on the bottle stand. Cable is short for which one might need a refrigerator stand or extension. Value for money 5/5.",
            "very attractive and nice look this refrigerator for small family.",
            "good",
            "super",
            "Great choice. Timely delivered by Flipkart. Good Product for this price segment.",
            "Superb I am satisfied with this refrigerator",
            "size is small but good...",
            "good",
            "nice fridge. cooling is very good.",
            "not as expected",
            "Excellent product. Value for money. Handles are large, not looking good.",
            "Good product",
            "Owsm",
            "Good product silent freeze no noise quick cheld",
            "good product",
            "superb",
            "great nice products thanks to flipkart",
            "good product by sumsung also thanks to Flipkart to deliver in village areas",
            "Awesome, thanks to flipkart the product is great value for money, simpley sundar, sasta takue",
            "It's awesome, cools very quick. Go for 4 star.",
            "very good design, nice looking",
            "nice",
            "best",
            "Good...but some noise is there otherwise product is good",
            "thanks Flipkart for fast delivery... refrigerator is having elegant look... but it’s chord is short... you have to buy extension...",
            "good",
            "Nice product",
            "perfect",
            "good prod for small fams",
            "Hi guys, i am using this product from last 2 months, it's such a nice product and i have never use samsung brand earlier but this product is up to the mark, cooling very fast, no sound, no vibration, no heating problem on side of fridge. Thanks flipkart for sending this product quickly and safely. i would recommend this product to my friends.",
            "I don't know why but some it vibrate during operation",
            "very nice product😄✌️",
            "superb refrigerator...... for small family.\n\nthank you flipkart and delivery guys.....",
            "cooling good no sound best for money",
            "Good Product",
            "I bought it for my parents. It is producing very less noise and is working properly. It’s a great product. Delivery was fast also.",
            "Cooling is good but space is less. Have to compromise",
            "Gud",
            "Good . lacks instant cooling",
            "Good quality product...",
            "delivery was very professional. they handle with care .\nproduct quality is very good. front look of the refrigerator is very attractive.",
            "Nice refrigerator,as promised,prompt delivery.",
            "It's quite good",
            "best product by Samsung",
            "Good and excellent refrigerator",
            "Great product.",
            "wholly better but size is small and bottle case is small not fit to the 2ltr bottle",
            "excellent product with in the best price.",
            "Nice one",
            "1. Flipkart delivered in time\n2. Product build quality good\n3. Little noisy. but that is ok\n4. Satisfied with performance",
            "worst product...don't buy this one. .if u want to return also they won't accept",
            "good",
            "Good",
            "Gud one 👍 low power consumption, Genuine design , Couples or small family use only.",
            "nice good and osm product flipkar is the best company.",
            "Nice Refrigator For Family,\nSatisfied,\nAnd It Have 4star Energy Saving Facility...",
            "product is really good, but received the product with a dent.",
            "simply perfect .....",
            "good",
            "First of all a big thanks to Flipkart, delivered in less than 24hrs.\nThe refrigerator is fabulous, cooling is awesome, quality is also very good.",
            "very good delivery thanks flipkart",
            "Good product",
            "very nice thank u samsung & flipkart",
            "good one",
            "1. Its 20 days from my date of purchase. Till now good performance.\n2. Cooling is good.\n3. Very minimum sound.\n4. Overall appreciatable product",
            "Awesome"
        ],
        "likes": [
            "93",
            "115",
            "18",
            "17",
            "18",
            "3",
            "4",
            "5",
            "5",
            "2",
            "93",
            "115",
            "18",
            "17",
            "18",
            "3",
            "4",
            "5",
            "5",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "0",
            "0",
            "13",
            "20",
            "7",
            "24",
            "22",
            "22",
            "29",
            "4",
            "3",
            "29",
            "9",
            "3",
            "3",
            "3",
            "3",
            "5",
            "7",
            "2",
            "2",
            "2",
            "2",
            "4",
            "4",
            "4",
            "2",
            "2",
            "3",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "3",
            "1",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0"
        ],
        "dislikes": [
            "25",
            "44",
            "9",
            "2",
            "7",
            "0",
            "2",
            "3",
            "3",
            "0",
            "25",
            "44",
            "9",
            "2",
            "7",
            "0",
            "2",
            "3",
            "3",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "2",
            "0",
            "6",
            "6",
            "6",
            "11",
            "0",
            "0",
            "19",
            "3",
            "0",
            "0",
            "0",
            "0",
            "1",
            "4",
            "0",
            "0",
            "0",
            "0",
            "2",
            "2",
            "3",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "5",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "1"
        ]
    },
    "qna": {
        "questions": [
            "Q:is side wall of refrigerator heat up or not",
            "Q:how many liters",
            "Q:Stablizer required or not",
            "Q:howmany legs are required for stand??? it has only two legs",
            "Q:can we operate on solar inverter what is the watt capacity of this.",
            "Q:Where is the BEE star sticker shown on ds fridge ???",
            "Q:How many hours it work without electricity",
            "Q:It comes with base drawer??",
            "Q:Which refrigerant is used in this??",
            "Q:Defrost water is automatically evaporate or manual",
            "Q:How much time taken to cooling?",
            "Q:Does it make irritating noise or can it be ignorable ?!",
            "Q:In this model we need to adjust the leg level?",
            "Q:The product has a 3 star rating and 4 stars in the review. What is the truth?",
            "Q:was the back side having current?",
            "Q:back side closed or open",
            "Q:is there any remidy for over heat of those side walls?",
            "Q:Why the side wall is getting heated compared to others??",
            "Q:how to take GST credit",
            "Q:is side wall heat or not???",
            "Q:is it auto defrost?",
            "Q:Is it vivrate at the time of running?",
            "Q:just given invertor in highlights... what type of inverter is used in this model",
            "Q:is wall of refrigerator Heat up or not",
            "Q:Door stand no?",
            "Q:power conspusion unit per year?",
            "Q:does its have star rating stiker",
            "Q:electricity consumption unit per year",
            "Q:How much power consumption yearly",
            "Q:What are the advantages of a Digital Inverter compressor?",
            "Q:Is there in built stabilizer?",
            "Q:how much time it take to convert water into ice",
            "Q:back side covered or open?",
            "Q:Is this a inventor model or normal",
            "Q:Is that installe by a company or own?",
            "Q:Is it frost free refrigerator ??",
            "Q:How much is the height of the refrigerator",
            "Q:It's bag packed or not",
            "Q:It is 3 star or 4star",
            "Q:How many unit of electric bill come in one month.if I used in one month?",
            "Q:Did stabiliser is required for this ?",
            "Q:Which year model?",
            "Q:Trey lock system",
            "Q:Can i use established for this fridge ?",
            "Q:Does it come with ice tray?",
            "Q:Which compressor is used in this model",
            "Q:Bootam side how many legs are giving",
            "Q:the boxes of refrigerator is of glass or fibre?",
            "Q:should i have to remove the water collected in the back or will it get evaporated?",
            "Q:compressor inside or outside",
            "Q:It's have remobeable gasket?",
            "Q:Is it installed by a company employee or own?",
            "Q:does it makes noise?",
            "Q:backside is covered or not",
            "Q:can you provide base stand with drawer... ready to pay extra charges",
            "Q:Which type of stand I purchase",
            "Q:its connect to samsung smart thing app",
            "Q:Can we use a stand for this",
            "Q:how many unit consuption???",
            "Q:What is the energy star rating of this refrigerator?",
            "Q:Is it frost free?",
            "Q:Does this work on home inverter and solar inverter?",
            "Q:How the defrost is done",
            "Q:it is a automatic frost free refrigerator?",
            "Q:does it require stabilizer",
            "Q:stand is required for this product?"
        ],
        "answers": [
            "A:yes some time heat some time cool",
            "A:192 L",
            "A:no but a irritating sound will be noticed at night",
            "A:It has 4 legs.",
            "A:Well They have mentioned on the product that it runs on home inverter & Consumes less power than 2 CFL bulbs. I hope this may help u",
            "A:It's on the front top right corner, but not shown in picture.",
            "A:6 hours",
            "A:No it doesn't comes with the Base drawer.",
            "A:HFC-134a",
            "A:Manually",
            "A:For cooling it takes 30 minute and for freezing it takes 1 hours.",
            "A:No it's ok.",
            "A:YES",
            "A:3 star rating of product is for its energy efficiency and 4 star rating in review is gieven by customer for its performance",
            "A:no but a current is on top left corner.you can observe on arm or back side of your hand",
            "A:closed",
            "A:No, Not at all. My review is after using 5 months.",
            "A:yes it is getting heated and making lot of noise",
            "A:Don't know",
            "A:Heat",
            "A:No it's manual",
            "A:Yes some time",
            "A:Digital Invertor",
            "A:Yes heat it is normal",
            "A:No",
            "A:162",
            "A:Yes 4 star",
            "A:162* unit per annum",
            "A:162 unit consumption per year",
            "A:Digital Inverter Compressor intelligently varies its power and running speed according to immediate cooling requirement of the compressor.",
            "A:Yes",
            "A:About 2–3 hours",
            "A:Coverd",
            "A:yes digital inverter compressor, see in his title",
            "A:No installation by company..To be done personally.",
            "A:yes it is, you have to do it manually twice in a week",
            "A:Somewhere around 4.5 - 4.10 feet .",
            "A:Yes packed",
            "A:4 star",
            "A:less than 1unit",
            "A:If your area has low power of electricity then yes. Otherwise no",
            "A:2021",
            "A:No there is no track lock system only tray hanging is there",
            "A:yes",
            "A:it does. but very small one. for namesake.",
            "A:It is mention in the product details.",
            "A:In bottom side no legs are there",
            "A:fibre",
            "A:I will say remove it. it's better!",
            "A:inside only completely covered but must buy product",
            "A:yes",
            "A:It's installed by me only. you need to connect the power cable that it no other work is required.",
            "A:Yes. But very low",
            "A:yes...covered",
            "A:It comes without any stand .You have to buy it separate",
            "A:any kind of refrigerator stand",
            "A:No",
            "A:Yes. If you use a stand it will be convenient.",
            "A:162 unit per annum",
            "A:This is a 4 Star rated refrigerator, giving you Energy Savings of upto 40% approximately.",
            "A:No.",
            "A:Both",
            "A:By pressing defrost button given inside the door",
            "A:No it is manual",
            "A:No it's stabilizer free operation",
            "A:Optinal does not require"
        ],
        "likes": [
            "39",
            "12",
            "6",
            "1",
            "9",
            "2",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "35",
            "31",
            "8",
            "3",
            "2",
            "1",
            "0",
            "2",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "19",
            "4",
            "2",
            "0",
            "12",
            "2",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "2",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "9",
            "11",
            "1",
            "1",
            "1",
            "0",
            "1",
            "7",
            "1",
            "1",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0"
        ]
    }
}