{
    "title": "Whirlpool 265 L Frost Free Double Door 4 Star Refrigerator  (Magnum Steel, IF INV 278 ELT Magnum Steel (4S))",
    "product_specification": {
        "In The Box": "1 Refrigerator Unit\nManual\nWarranty Card",
        "Type": "Double Door",
        "Refrigerator Type": "Top Mount",
        "Defrosting Type": "Frost Free",
        "Compressor Type": "Inverter Compressor",
        "Capacity": "265 L",
        "Number of Doors": "2",
        "Star Rating": "4",
        "Coolpad": "No",
        "Toughened Glass": "Yes",
        "Built-in Stabilizer": "Yes",
        "Shelf Material": "Toughened Glass",
        "BEE Rating Year": "2019",
        "Stabilizer Required": "No",
        "Launch Year": "2019",
        "Other Features": "Freezer Location: Top Mount",
        "Net Height": "1590 mm",
        "Net Depth": "670 mm",
        "Net Width": "570 mm",
        "Weight": "70 kg",
        "Installation & Demo": "Authorised Service Engineer will install the Refrigerator, make it operational and explain the below details. 1. How to Use, 2. Features,3. Do's and Dont's.",
        "Warranty Service Type": "Technician Visit",
        "Warranty Summary": "1 Year Warranty on Unit and 10 Years Warranty on Compressor from Whirlpool",
        "Covered in Warranty": "All Parts Excluding Plastic Parts, Glassware, Bulb and Tube from the Date of Purchase Against Defective Material and Workmanship",
        "Not Covered in Warranty": "Parts: Plastic / Glassware / Bulb / Tube. Any Accessories External to the Product. The Product is Not Used According to the Instructions Given in the Instructions Manual. Defects Caused by Improper Use as Determined by the Company Personnel. Modification or Alteration of Any Nature made in the Electrical Circuitry or Physical Construction of the Set. Site (Where the Premises is Kept) Conditions That do Not Confirm to the Recommended Operating Conditions of the Machine. The Serial Number is Removed, Altered or Obliterated from the Machine. Defects Due to Cause Beyond Control Like Lightening, Abnormal Voltage, Acts of God or While in Transit to the Service Centres or Purchasers Residence"
    },
    "product_description": {
        "Adaptive Intelligence Technology": "Be it storing leftovers from last night’s dinner or your favourite fruits and vegetables, this refrigerator features, the Adaptive Intelligence (AI) Microprocessor and three Intellisensors that sense load, weather conditions and usage patterns to facilitate optimum cooling so that its contents stay fresh for a long time.",
        "MicroBlock Technology": "You don’t have to fret about bacterial growth as this refrigerator’s vegetable crisper, as well as its fruit crisper, boast the MicroBlock Technology to prevent bacteria from affecting the freshness of your fruits and vegetables.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "1",
            "1",
            "4",
            "1",
            "1",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "1",
            "2",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "1",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "4",
            "5",
            "4",
            "3",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "1",
            "4",
            "3",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "3",
            "4",
            "5"
        ],
        "review": [
            "Loved the design, finish and product quality. The alignment of the space is well designed. There is a separate section for storage of fruits and veggies which I quite like. Cooling is very good though this would be tested better during summer’s. Only missing thing is there should have been a separate light in the freezer section.\nOverall happy with this purchase.",
            "Very fast delivery and good product ..but I want dark gray color one..that's thing disappointed. overall good ..looking nice ..price also reasonable ..demo also good and simple ..after few months use.I wil rewrite the review",
            "Refrigerator is good but now as per 2020 electricity it is rated as 3 star and as per 2019 it was 4 star\nOverall function is good and in budget as well",
            "Delivery was on time as usual but installation took three days as per service center flipcart logged complaint after two days of delivery. Does hos job silently. Ice making is fast (I am not telling about quick chill function. in normal mode also ice gets ready fast) Freezer also have enough space. Power consumption I have to check once I receive this month electricity bill.\nI am happy with this product",
            "Very nice product. Working fine from last 3 months. Suggest to go for this product for its nice quality and reasonable price",
            "Good refrigerator with best feature and installation is too good technician is experienced and with good behavior",
            "This refrigerator is vary loving product for all my family members because its style and performance very sleek and sharp. This can handle all type of weather and their temperatures and convert own cooling accordingly to situation. We are so excited to write this review because its price and storage is perfect for value for money. You all can buy this product without and hassle, and I'm sure you'll be love this refrigerator.",
            "Product is good and value for money but company exchange policy is not good as need good condition product in exchange but if old one is good enough than why someone go for new ones",
            "I was not confident before buying this refrigerator during review reading. Keeping hesitate myself, I bought it..I am happy now it is installed and working fine. Design is eye catching and all parts of the product is in proper shape 👌. Highly recommended over Samsung /LG. No installation charges",
            "it is exceptionally awsome and works superb. a great vale to money product",
            "Loved the design, finish and product quality. The alignment of the space is well designed. There is a separate section for storage of fruits and veggies which I quite like. Cooling is very good though this would be tested better during summer’s. Only missing thing is there should have been a separate light in the freezer section.\nOverall happy with this purchase.",
            "Very fast delivery and good product ..but I want dark gray color one..that's thing disappointed. overall good ..looking nice ..price also reasonable ..demo also good and simple ..after few months use.I wil rewrite the review",
            "Refrigerator is good but now as per 2020 electricity it is rated as 3 star and as per 2019 it was 4 star\nOverall function is good and in budget as well",
            "Delivery was on time as usual but installation took three days as per service center flipcart logged complaint after two days of delivery. Does hos job silently. Ice making is fast (I am not telling about quick chill function. in normal mode also ice gets ready fast) Freezer also have enough space. Power consumption I have to check once I receive this month electricity bill.\nI am happy with this product",
            "Very nice product. Working fine from last 3 months. Suggest to go for this product for its nice quality and reasonable price",
            "Good refrigerator with best feature and installation is too good technician is experienced and with good behavior",
            "This refrigerator is vary loving product for all my family members because its style and performance very sleek and sharp. This can handle all type of weather and their temperatures and convert own cooling accordingly to situation. We are so excited to write this review because its price and storage is perfect for value for money. You all can buy this product without and hassle, and I'm sure you'll be love this refrigerator.",
            "Product is good and value for money but company exchange policy is not good as need good condition product in exchange but if old one is good enough than why someone go for new ones",
            "I was not confident before buying this refrigerator during review reading. Keeping hesitate myself, I bought it..I am happy now it is installed and working fine. Design is eye catching and all parts of the product is in proper shape 👌. Highly recommended over Samsung /LG. No installation charges",
            "it is exceptionally awsome and works superb. a great vale to money product",
            "quite good to have one it is actually a best product to purchase with good built quality and good service from whirlpool within 24hrs",
            "very good refrigerator in this price segment main plus point in this is it's fitted energy saver 4 star rated compressor. its look pretty good.",
            "whirlpool refrigerator good ... very big space... but flip kart delivery is not good ... delay delivery... not help answered customer sport teem... and not return options... means delay delivery customer ko accept karni hi hai...",
            "fantastic product",
            "product is very good but Flipkart cheat me.\n\nFlipkart unable install fridge.,....this customer care person very rude and helpless ..\n\nit like tourtoring to buy from Flipkart.\n\nworst sevice, pls don't buy.",
            "i received only 29 days, problem is in that refrigerator, no cooling",
            "Said 4 star fridge in the title\nAnd you send the 3 star one\nFirst time i feel not to buy heavy products online.",
            "nice product",
            "Don't buy electronic item from Flipkart. They will not provide installation on time. My installation issue is resolved after 20 days.",
            "overall good. Still some suggestions to put forward.\nIf led light is there inside and also on",
            "Nice product",
            "Cooling good",
            "Its been more than 3months and I just loved the performance,",
            "Don't buy from flipkart",
            "product of whirlpool is good and i suggest to take 292L capacity instead of 265L..\nNo doubts on the product but my question on the service provided by Flipkart\nthey will not coordinate with there clients.\nmy experience that installation and demo of product done by Flipkart after 8 days of delivery.and the product lying unopened till installation in my house",
            "Very good",
            "This product is waste do not buy from Flipkart and they do not have any support nor whirlpool knows about this product.",
            "I am writing review of this product after 2 years of installation, suddenly lower half of the refrigerator stopped cooling. Also intermittently sounds came during normal operation. Once enquired about the issue of cooling, it was found that it was an common failure with this refrigerator regarding lower half cooling. Even though after so many complaints, if failure is repeating some how it is questionable to the brand or may be its their strategy for maintenance revenue. Overall, within 2 years with such performance, i will not suggest to go for this brand.\nThanks\n\nOverall 2*/5*",
            "super poduct",
            "overall this refrigerator is awesome .... the only thing i dont lyk in this ....dat the fridge is very lean ... width is very less comparativly others brands of fridge .",
            "Look like is good but performance is just OK ok. And space is limited in 265 litre. I am not impress.",
            "awesome",
            "Product is very good and this model colour is only available in flipkart.",
            "Truly satisfied with this product, not available liked colour little bit.\nPerformance is good.",
            "Everything is awesome but if there would be light in the freezer it would have been hard to compete.\nApart from this it is all good. Must buy✌🏻",
            "good",
            "Nice product... recommend others to buy...",
            "verry nice,thanks flipkart",
            "Dont go for Whirpool refrigerator 1 yr it's working fine after that so many problems will be arise like cooling issue that is not part of warranty. Before buy just think once.",
            "Very good product,also early delivery with hospitality beheviour",
            "Whilpool is best brand for refrigerator.I prefer or.Best cooling nouseless operation.",
            "Everything is best in this fridge only ice tray quality is no good",
            "Not working after 2 months",
            "Good quality product, some noise occured after installation from back of the freezer section but got rectified by whirlpool service engineer during second visit.\n\noverall excellent product in this range. must buy.",
            "superb and design and performance good",
            "quite superb features and look wish, i must say just go for it...",
            "poor product after 3 month its no working proprly",
            "value for money with excellent performance",
            "very nice, we are happy with the service of Flipkart and nice product",
            "osm product.. ☺️😊🤗",
            "nice product and value of money",
            "one can consider this fridge as one of the best in market . whirlpool always stands one step ahead of other brands. cooling is too good, and what more to say. just go for it. worth every penny.",
            "dameged product, door dameged",
            "Really nice product and feature and also received as per images moreover installation and demo also done on time .highly recommended this product and satisfied",
            "gud for 4",
            "super product",
            "Honestly I am happy with the purchase have never been put down yet. Touchwood. Was very skeptical about heavy electronics. The packaging was wonderful.",
            "freeze is over all good but delivery service are bad",
            "Awesome",
            "very good.....,.",
            "Excellent product in this price range. Sensors working very nice. Design and performance excellent.",
            "I am writing afte 13 months of use the evaporator fan stopped working after 13 months its so early. and the technician who visited said in this model this problem is there its life is only 1 - 2 years and he charged 1300 + service charge for the fan quality of the parts are not good.",
            "I brought this one month back. Delivery and installation was done on time and it was running normal. During transport one dent was observed in upper door, but service engineer pasted a sticker and made invisible. rest others are ok.\ncoming to the design and size it's width was little less compared to Samsung and Bosh make. so it has to be considered while choosing. rest everything is ok and fine as of now.",
            "good product and I m happy with this one",
            "it's awesome. everybody like it.",
            "nice product... excellent cooling...",
            "superb",
            "Got this refrigerator at a very reasonable price during offer period.\nI wanted a dark grey color but it wasn't available.\nIt's been around 6 months and the machine is doing its job nicely.",
            "Good prodect",
            "This is a very bad product after one year.. it gets problem with lower part .. fans are getting faulty and after repeated maintannce it keep on getting failed . Never buy this",
            "Just go for it",
            "Smooth. Just go for it!",
            "Super se Uper",
            "Got this product delivered and installed in stipulated time. Nice product in price. Till date no issue. Works perfectly. Well I get some problem to get the stand. Better purchase a stand and refrigerator at same time",
            "Perfect for family of 3. Excellent performance, all veggies remain fresh even after 15 days of storage and that's amazing. Silently works and looks good. Go for it.. A proud buy.",
            "Good product with decent performance",
            "Almost good",
            "Good product",
            "It's working well I'm giving this review after using 1 year one of the best brand",
            "Great Build up quality and Rich Colour.",
            "Awesome",
            "wonderful",
            "Product awesome but the demo n installation persons responese is too bad, no one come to installed my frieze, thankyou",
            "I LOVE IT!!",
            "Awesome machine...love it",
            "Good design and valuable price ☺️",
            "Excellent from Whirlpool. Installation and product.",
            "very nice refrigerator & i m soo happy with this purchase & it's delivery was on time & installation was before the date it is valuable at this price. u all must go for it",
            "Good",
            "Good....",
            "I took my refrigerator by the 25 days after ordering such a chaos for me and my family . Really need to improve but the refrigerator quality was much great and works very well",
            "It's osm go for it",
            "Good product. Must buy. Satisfied with the product.",
            "Nice and good Product vaule for money when I received the product same day I got the call from whirpool for installation",
            "Excellent",
            "Excellent refrigerator",
            "Good product",
            "Awesome product. Easy to use",
            "Good",
            "Good",
            "Superb Cooling Ang Maintenance guyz\nRich colour and design",
            "Very good experience..Looks and color is very nice if u r luking for best shade of silver or grey..Features n capacity is gud for family of 4-5 people",
            "Nice. Delivered safely. Nice cooling. Freezer is working best. And mainly very chiper than market. Thanks to flipkart.",
            "Superb",
            "Best features and Service! ?",
            "Damaged",
            "Value of money energy saving with good performance\nI will suggest as per my experience",
            "Good quality but freeze to late",
            "Very nice it's realy frost free and temperature auto mode is fantastic it chills according to climate, look wise very rich, blindly purchase this product, I really thanks to whirlpool still kept the quality from many years.",
            "Nice product and value of money",
            "good price and specifications, trustable reputed brand whrilpool",
            "Cooling is good. Cant put big 2 L cold drinks bottle.",
            "Nice",
            "Sup product by Whirlpool But Flipkart and Ekart both are Bad company both service are VERY BAD... Don't Buy with this company's",
            "Excellent...",
            "Good product.",
            "not bad",
            "nice good working",
            "Overall Good performance but installation was too late.Improve customer satisfaction",
            "Its looking good .",
            "Product is excellent and delivery is also ok but installation is very bad. Worst experience from Flipkart. It is not a fully convertible fridge. The downside of this product is its space.there is less space in fridge to keep items by the way other things in the fridge are very excellent and value for money product the colour is also very good but I will prefer black colour because the grey colour is very common.",
            "nice",
            "Nice refrigerator :)",
            "very good, fantastic",
            "Best in this price range",
            "Excellent product",
            "good",
            "value for money and great product",
            "its Amazing...thanks Flipkart👍",
            "Very good product but Flipkart took long for installation",
            "Never imagined such a good quality product from Flipkart. I was very much skeptic about the delivery but they delivered on time. After using 4 months now I am completely satisfied. why do pay extra bucks in offline store when you can have the same online ?",
            "This is awesome experience to buy it .. plz don't get confusion and go for it",
            "some damage has came",
            "good product",
            "Value for money. Amazing product. Good service by Flipkart.",
            "Nice",
            "Very good product",
            "very good",
            "its ok",
            "Best perfomance and best value",
            "product is good",
            "good",
            "product good",
            "Superb",
            "Worth to buy!",
            "Good",
            "valuable price",
            "Great Deal.",
            "very good refrigerator .",
            "good",
            "this is good",
            "good fridge with good space and cooling, perfect air flow to all corners",
            "mind blowing show good",
            "Thanks team Flipkart. Nice product in this price range. Installation tooked some extra Days but Satisfied With the product Quality.",
            "nice",
            "Good product from whirlpool.\nThere was dent in the front door during delivery",
            "very best",
            "The product is awesome. Just 1 flaw. No light in Top Cabinet (Freezer). Just 1 LED in the main(bottom) unit.... Rest everything is fine.",
            "osm products & nice quality but. damage item",
            "awsome product... on time delivery",
            "good",
            "good product Nd am very happy with it Nd disappointed with colour but ok with offer to shopping in Flipkart thanku Flipkart",
            "This product is awesome & the most important part of current consumption is too good",
            "best for this refrigerator",
            "overall good",
            "fast ice makar",
            "Perfect",
            "it's good",
            "very good product.",
            "Good one...",
            "awesome",
            "awesome one and was surprised that this would be an incredible refrigerator.",
            "this is Amazing Refrigerator.",
            "Nice ,service also good",
            "Good product",
            "Good product, one day delivery by flipkart and same day installation by whirlpool. Installation is done but no product demo provided.",
            "since from one week working fine, complete review after one month",
            "Cooling awesome... fantastic feature...manage cooling using display button...other features is too awesome...must buy it.",
            "nice good product",
            "It comes with a very good packing and installation was good,as per my you also can purchase such type of product without any confusion.",
            "looks good and premium. working just fine.\nbut too much noice",
            "product is gud but whirlpool instoleshion so bed",
            "working good",
            "product is upto the mark and worthy.\ninstallation was carried out immediately on receipt of the item.\nIt is working very nicely.",
            "Good product",
            "super",
            "awesme product",
            "I bought this fridge 3 weeks ago, cooling is good but I foud some issue regarding the door closing..",
            "Good product",
            "good item"
        ],
        "likes": [
            "30",
            "8",
            "1",
            "1",
            "1",
            "0",
            "2",
            "1",
            "0",
            "0",
            "30",
            "8",
            "1",
            "1",
            "1",
            "0",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "50",
            "80",
            "23",
            "11",
            "16",
            "6",
            "4",
            "6",
            "5",
            "5",
            "4",
            "4",
            "5",
            "7",
            "2",
            "2",
            "1",
            "2",
            "3",
            "3",
            "3",
            "2",
            "2",
            "2",
            "2",
            "2",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "11",
            "3",
            "0",
            "0",
            "0",
            "0",
            "2",
            "2",
            "0",
            "0",
            "11",
            "3",
            "0",
            "0",
            "0",
            "0",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "7",
            "24",
            "4",
            "2",
            "5",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "4",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:does this model needs stabilizer ?",
            "Q:does it have a safety key to lock the fridge?",
            "Q:difference between model ENV 278 ELT AND ENV CNV 278 ELT",
            "Q:is it convertible freezer or not?? picture shows its convertible freezer or reviews says not",
            "Q:what is the actual height in feet of tjis refrigerator????",
            "Q:power consumption for month",
            "Q:Which One Is Beast Refrigerator Samsung Or Whirlpool",
            "Q:whats the height of this fridge?",
            "Q:What is its cooling efficiency ?",
            "Q:Is it capable for carriying 2 litres water bottles",
            "Q:What is the height of the refrigerator?",
            "Q:deep freezer light",
            "Q:can we fix the ice trey in the down shelf of the freezer??",
            "Q:does it require additional stand for seating???",
            "Q:It has how many ice strays",
            "Q:Is it has tuned glass",
            "Q:Does the ice maker is movable like samsung refrigerator? And does it has Coolpad?",
            "Q:is it shaby black colour and any design on it",
            "Q:is it steel colour or blackish 1?",
            "Q:why right side upper side temperature hit",
            "Q:company give stand with refrigerator and need stand compllusery under stand?",
            "Q:Is it is digital?",
            "Q:Is this a convertible one. where the freezer can be changed as fridge type cooling, whenever needed?",
            "Q:Does it has convertible freezer with 5 in 1 modes????",
            "Q:how many litre in fridge",
            "Q:Is it convertable freezer to freeze or vise versa???",
            "Q:please suggest me a refrigerator with r134a refrigerant",
            "Q:how long it is in foot",
            "Q:Does it require stabilizer",
            "Q:magnum steel means",
            "Q:is there fruit box available in this fridge",
            "Q:is this convertable or not?",
            "Q:what about hight of this one",
            "Q:door alaram there?",
            "Q:it has door lock option?",
            "Q:is there any lock on door??",
            "Q:does this have reciprocating compressor or rotary type? also suggest some reciprocating type models of whirpool?",
            "Q:do i really need stabiliser (voltage fluctuations 3-4 volt)???????",
            "Q:this is convertible or not??",
            "Q:how much units in a year",
            "Q:is it convertable to defrezzer or not",
            "Q:weather outer material is metallic or plastic ??",
            "Q:is it convertable or non convertable?there is so much confussion.",
            "Q:can we off the upper side of refrigetaor",
            "Q:energy consumption per year how much units???",
            "Q:Is external stabilizer required for it?",
            "Q:what difference between bee energy rating 2019 4 star and bee energy rating 2020 3 star?? which one is bette??",
            "Q:model no or name",
            "Q:CFC Free refrigerator?",
            "Q:Does it have water dispenser?",
            "Q:what is the difference between digital invertor and invertor fridge technology",
            "Q:Have led bulb",
            "Q:how many shelves are there? Is it convertible",
            "Q:What is the deference in smart inverter compressor and digital inverter compressor, digital inverter, which is better in this option....??",
            "Q:how much power it consume in one year in new 2020 model...?",
            "Q:If i bought additional stabliser, what will be the cost of it?",
            "Q:how to enable intellisensor in this fridge??",
            "Q:is it a microblocker refrigerator?which means it blocks microorganisms",
            "Q:can i use 500v v guard ac stabilizer for this refrigerator",
            "Q:alarm yes or no",
            "Q:Does door gasket is removable, for cleaning purpose?",
            "Q:is this has 5 in 1 convertible mode",
            "Q:is it convertable, inverter?",
            "Q:door alarm available in this freeze",
            "Q:how many shelves are there? Is is convertible?",
            "Q:i can convert it deep freezer",
            "Q:How many weight in this product",
            "Q:convertible freezer. does it have a convertible freezer?",
            "Q:is this refrigerator having cool pad technology",
            "Q:can this have Nerolac paint?",
            "Q:does lock system for both doors?",
            "Q:Is it compulsory to use steplizer",
            "Q:is it a convertible defreezer?",
            "Q:Does it has ice collector ?",
            "Q:there is not any label of 4 star rating on refrigerator. how it isc4 star refrigerator?",
            "Q:it's convertable deep Friz",
            "Q:Does it have digital inverter?",
            "Q:Is it convertable freez?",
            "Q:does this give any indication on the black surface shown on the front of the fridge?",
            "Q:Can I get alpha stel colour in this",
            "Q:what is max height and widh",
            "Q:is it a 4 star or 3 star acc. to its label??",
            "Q:what is the diffrence bitween 340 l and 360l",
            "Q:does the refrigerator has moving wheels at bottom?",
            "Q:Can we pull the sleves",
            "Q:Can running with inverter",
            "Q:Is it convertible frzeer?",
            "Q:how much power consumption in a year",
            "Q:What is the annual energy consumption??",
            "Q:please explain about the electric consumption of this product.",
            "Q:what is height ?? which year model??",
            "Q:is it convertible?"
        ],
        "answers": [
            "A:Best option Use Stabilizer",
            "A:Yes it have the key",
            "A:NOT BOTH ARE SAME",
            "A:No it is not convertible.",
            "A:around 6-6.5 feet.",
            "A:it says about 195 per year on the actual product.so month wise it would be 16 units",
            "A:whirlpool always good",
            "A:5 feet",
            "A:It's very good, but it doesn't keep ice cream cold like we get from the ice cream vendor. Overall experience is awesome. It takes very few unit of electricity.",
            "A:It depends where you keep, if keep on shelves then yes if door then no.",
            "A:5'4\"",
            "A:yes",
            "A:yes",
            "A:no",
            "A:2 No's",
            "A:no",
            "A:Yes, Ice maker is moveable, it has not coolpad, it has touch pad.",
            "A:it's not black color its magnum steel",
            "A:Steel.",
            "A:because this refrigerator all side sealed by cover.so that heat creates the upper side.",
            "A:company not provided stand with refrigirator.i want to stand.this one free of cost.",
            "A:No",
            "A:no.",
            "A:Yes",
            "A:266",
            "A:It's not convertible.",
            "A:no then it's not suitable for you",
            "A:5.5 FT",
            "A:NO",
            "A:IT WAS COLOUR",
            "A:Yes",
            "A:yes",
            "A:32",
            "A:Yes, the alarm gets activated if the door is left open for long time",
            "A:No, it doesn't have any lock.",
            "A:No Door is so much noicy,no lock on door",
            "A:rotary type",
            "A:no ,this refirdgerator does not required stabilizer",
            "A:you can covert it into deepfreezer ,normal,auto",
            "A:190",
            "A:yes you can convert it to deepfreezer.....you can also convert it to normal and medium freezermode also.....great product",
            "A:It's plastic. The colour is metallic.",
            "A:No this is not convertible.it is inverter refrigerator. but IF INV CNV 278 IS convertible refrigerator.",
            "A:no",
            "A:Just brogh a week ago, need to check.",
            "A:no requirement of external stablizer",
            "A:4 star energy save then 3 star minimum 15%",
            "A:Model 21031",
            "A:yes",
            "A:yes",
            "A:The amount of noise made by the refrigerator is much less in refrigerators with inverter technology as compared to the",
            "A:No, there is no LED bulb",
            "A:yes it's convertible",
            "A:Smart inverter",
            "A:195 units in a year",
            "A:2000",
            "A:can select keep pressing a button on door until light blinks in to deep freeze",
            "A:Yes",
            "A:No need for this",
            "A:yes , when you open the door more then 2 minutes",
            "A:No",
            "A:Yes",
            "A:It is inverter but not convertable",
            "A:yes, available",
            "A:4 shelves and no converation",
            "A:Yes, with single click on front wall.",
            "A:70kg nearly",
            "A:Yes",
            "A:Yes",
            "A:yes",
            "A:no .. only for lower side",
            "A:NO. Since it has an inverter,it doesn't necessarily need one.",
            "A:yes",
            "A:Yes",
            "A:yes...",
            "A:NO",
            "A:no",
            "A:No",
            "A:no",
            "A:yes",
            "A:Height approximately 60 inch by 24 inch",
            "A:4 star",
            "A:more space",
            "A:No. You have to purchase stand with moving wheels",
            "A:no",
            "A:no",
            "A:no",
            "A:190 unit per year",
            "A:190 unit per year",
            "A:192 units per year.",
            "A:5 feet 2019",
            "A:No"
        ],
        "likes": [
            "10",
            "3",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "24",
            "44",
            "3",
            "13",
            "2",
            "9",
            "2",
            "1",
            "1",
            "1",
            "0",
            "4",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "8",
            "1",
            "3",
            "0",
            "0",
            "1",
            "0",
            "0",
            "5",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "8",
            "24",
            "1",
            "5",
            "0",
            "7",
            "0",
            "1",
            "0",
            "0",
            "3",
            "6",
            "1",
            "5",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "2",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    }
}