{
    "title": "MarQ By Flipkart 563 L Frost Free Side by Side Refrigerator  (Silver Steel, 563GSMQS)",
    "product_specification": {
        "In The Box": "1 Refrigerator Unit, User Manual, Egg Tray, Ice Box, Spanner",
        "Type": "Side by Side",
        "Refrigerator Type": "Side by Side Refrigerator",
        "Defrosting Type": "Frost Free",
        "Compressor Type": "Inverter Compressor",
        "Capacity": "563 L",
        "Number of Doors": "2",
        "Coolpad": "No",
        "Toughened Glass": "Yes",
        "Built-in Stabilizer": "Yes",
        "Shelf Material": "Toughened Glass",
        "Handle Type": "Recessed",
        "Door Finish": "PCM",
        "Gasket Type": "PVC Antibacterial Gasket",
        "Removable Gasket": "Yes",
        "Door Alarm": "Yes",
        "Deodorizer": "Yes",
        "Water Dispenser": "Yes",
        "BEE Rating Year": "NA",
        "Refrigerator Interior Light": "Yes",
        "Egg Tray": "Yes",
        "Number of Crispers": "4",
        "Freezer Tray Type": "Ice Box",
        "Ice Cube Tray Type": "Ice Twister",
        "Launch Year": "2020",
        "Net Total Capacity": "521 L",
        "Child Lock": "Yes",
        "Cooling Refrigerant": "R600a",
        "Other Features": "Money Saving, Energy Efficient, Eco Mode, Super Cooling Mode, Super Freeze Function, Intelligent Touch Control, Deodorizer, Separate Crispers, Freezer Drawers",
        "Net Height": "1770 mm",
        "Net Depth": "660 mm",
        "Net Width": "900 mm",
        "Weight": "88 kg",
        "Installation & Demo": "Flipkart will facilitate Installation & Demo at time of your convenience from an brand authorized service engineer||Flipkart will communicate the day and time slot of the scheduled Installation & Demo through a SMS and the same information will also be available in your order details page||The Installation & Demo service will be provided free of cost. All additional accessories not part of the the package will be charged separately||The authorized service engineer will be providing detailed demo that includes||Usage of the product||Explain all the functionality of the product||Preventive maintenance action to be taken",
        "Warranty Service Type": "For Warranty claims or any product related issues please email at marq@flipkart.com or call us at 080-46609211",
        "Warranty Summary": "1 Year Warranty on Product and 5 Years on Compressor Warranty from MarQ by Flipkart",
        "Covered in Warranty": "All Parts Excluding Plastic Parts, Glassware, Bulb and Tube from the Date of Purchase Against Defective Material and Workmanship",
        "Not Covered in Warranty": "Parts: Plastic / Glassware / Bulb / Tube. Any Accessories External to the Product. The Product is Not Used According to the Instructions Given in the Instructions Manual. Defects Caused by Improper Use as Determined by the Company Personnel. Modification or Alteration of Any Nature made in the Electrical Circuitry or Physical Construction of the Set. Site (Where the Premises is Kept) Conditions That do Not Confirm to the Recommended Operating Conditions of the Machine. The Serial Number is Removed, Altered or Obliterated from the Machine. Defects Due to Cause Beyond Control Like Lightening, Abnormal Voltage, Acts of God or While in Transit to the Service Centres or Purchasers Residence"
    },
    "product_description": {
        "In-the-door Water Dispenser": "The in-door water dispenser gives you chilled water at the press of a button without even having to open the door.",
        "Intelligent Inverter Technology": "This refrigerator is equipped with the latest intelligent inverter compressor which consumes up to 35% lesser energy compared to a normal reciprocatory compressor, so you don’t have to worry about paying high electricity bills. It also has a door alarm which buzzes when the door is left open for more than 90 seconds (under controlled internal testing conditions).",
        "": ""
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "1",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "1",
            "5",
            "1",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "1",
            "1",
            "3",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "4",
            "1",
            "4",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "1",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review": [
            "Awsome refrigerator for this price. Better build and features than branded ones. excellent packing.\nSize is very huge than expected.\nTouch temp control\nwater dispenser\nsimple back\nperfect design\nbody is heavy and build quality is excellent\nplenty of shelves\nvery quiet no sound even in full use.\nFirst use - I kept in full high cold and everything freezed in freezer . So freezer level low is more enough and i see Ice made in an hour even i kept low freeze. So awsome.\nAs per standard it is very low power consumption compares to branded ones as I see 1.1 unit per day for 560 ltr refrigerator is nice.\nWater dispensers child lock is useful as children will operate simply.\nTemp child lock is nice feature, you can lock temp levels as it may be changed by children. Easy to operate touch control.\nEasy to move over the floor as it has wheels and you can lock movement with stand lock, wrench for operating stand lock is provided in kit.\nAdding this after usage a month. There is no power bill change it is very low consumption as my old 265 ltr refrigerator. So the power consumption is saving compared to other brands. Highly Recommended refrigerator in SBS sector",
            "We had a 266L refrigerator but this Diwali we thought of gifting ourselves a bigger refrigerator. A SBS was out of question for us given the high prices asked but Marq was a boon for our ever increasing need.\n\nOrder and Delivery:\nI ordered it within an hour after it was launched and the delivery was made on the 2nd day of the purchase.\nIt took 4 men to lift it to our home on the 1st floor. I'd advise people to only order this fantastic piece of appliance if you have a wide staircase or a lift.\nThe product is well packaged with well designed cardboard material.\n\nInstallation:\nIt was done barely 2 hours after the delivery. Since it was the first MarQ refrigerator delivered in my city, the representative from Jeeves was as clueless as me. Fortunately he had a installation video which he promptly shared.\nThe first thing during installation I'd suggest you to do is to make sure you lift the front legs of the refrigerator by turning it with your hand so that it stays in place as it has wheels on all 4 sides before using the refrigerator.\n\nOperation:\nOperation of the refrigerator is super easy. It's silent and doesn't vibrate at all. The doors are smooth to open and close. The LED lights are bright and light the whole compartment. The water dispenser has a capacity of 3 litres. It initially takes about 6 -24 hours for the refrigerator to reach the required temperature so do wait to evaluate its performance. Also, only the side walls (adjacent to doors) dissipate heat, thereby, requiring space for ventilation on the sides.\n\nValue for money?\nDefinitely yes. I don't think one can get a better deal than this. Go for it!\n\nMissing information?\n1. No information available on the weight load factor of glass shelves.\n2. No info if it has an inbuilt stabilizer as most refrigerators do.\n\nConclusion:\nIf I have to buy a refrigerator again I'd go for it without any second thoughts. It has a water dispenser which only a SBS with a price tag of upwards of 70+K has. Not only has it saved me money but its also a big space saving for me as we don't have to keep anymore bottles. It's silent. It's huge and it's presence is felt.\n\nP.S. - The display panel is different as shown by Flipkart than the one I received. But that's okay, it has the same functions and design (but a white light would have been my personal preference). Also the manual has a lot of grammatical mistakes and errors. But that shouldn't be spoiling your decision whatsoever :-D",
            "Hi,\n\nThe opinions after usage of a month.\n\nBest things:\n1. The price - bang on, affordable and well built. At this price point, i bet a proper good normal refrigerator would come.\n2. The looks - super trendy, a definate peice of praise\n3. The features - The description fits perfect with this product. The fridge is divided into 60:40 for fridge to freezer ratio. NO FROST as promised as a USP.\n4. Color available is only grey and it looks ubercool.\n5. Simple to use control panel\n6. Chilled water dispenser - yes, you guessed it correct, the water tank is placed inside and is to be MANUALLY filled. Tank is 10-13 ltrs.\n\nDidnt like:\n1. Flipkart sent only 3 persons to transport the fridge, if u have an appartment, you will face a hard time transporting it to upper floors.\n2. I just wish the freezer was convertible, so that the parts which is not being used as a freezer, could have been used as a fridge. However, somehow, the refrigerator only ices the products its supposed to, else things like sauces and pastes never gets iced, but reaches to much lower temperatures just before ice.\n3. I wish there cud have been 1 or 2 colors available.",
            "Best and awesome product by flipkart. features are too good and easy to use. installation and demo was done on the same day of delivery. worth the money. as usual on time safe and sound delivery by flipkart. instead of paying Lakhs for other models like LG and Samsung, better go for this. u will never regret",
            "The Best Side By Side Frost Free Refrigerator that come in very affordable price by Flipkart's Marq the best part in this price range it has water dispenser.......the LED Panel is color different that's it.....we just love it love Flipkart for the delivery and installation it's very fast and reliable.",
            "It's a very very good product . And their installation is also to good Mr amit and rajendra explained us the features and its a good product . It's performance is also too good and it's design is just too good .",
            "lovely gift which we presented to our family.... with lot of skeptical thoughts we chose to go ahead with this but as of now it has met all our expectations... super quick ice... we need to have more ice trays, which we bought as extras.... nice asthetics with an option of maintaining temperature of both sides... the water dispenser holds uptown 2.5-3 lit of water... which is adequate for a family of 4 as we normally jus use a Lil bit of it with normal water...",
            "Awesome product... Good design, Good quality, quick cooling and auto cut off, zero noise, quick delivery, custom adjust for freezor and fridge, movable product, water dispenser and overall superb, but very worst for demo man, he doesn't know about this side by side refrigerator and he is first time seeing and don't know about it and nothing helped to about my queries and doubts. Thanks to provide atleast user manual..",
            "Just the kind of fridge that I wanted ...\nSpacious, excellent cooling and freezing....\nValue for money... 100%\nQuality is good of both inside and outside..\nI'm glad I chose a new brand MarQ instead of the regular brands... It was worth the risk and I am absolutely happy... Thank you MarQ\nPs... I bought a microwave of the same brand.\n\nPS... The delivery person damaged my gate while unloading the fridge... Cost me a bomb to fix it... Hence such late review...",
            "MARQ Refrigerator is installed today but service engineer did not explained properly all the features.. He was in hurry and wanted to run away. On phone he said that simply plug in your power supply and refrigerator is on. No need of my coming. Moreover Stabilizer is required compulsory whereas FLIPKART has never suggested for stabilizer installation.\nDemo was not given properly, how water dispenser will work etc not explained by Service Engineer properly as he was in hurry and ran away in 7 minutes.\nIt is suggested to FLIPKART to take care of services provided for demo and installation by respective service Engineer. He was very rude, non-courteous and in hurry as if he was obliging for demo and installation of MARQ Refrigerator.",
            "Awsome refrigerator for this price. Better build and features than branded ones. excellent packing.\nSize is very huge than expected.\nTouch temp control\nwater dispenser\nsimple back\nperfect design\nbody is heavy and build quality is excellent\nplenty of shelves\nvery quiet no sound even in full use.\nFirst use - I kept in full high cold and everything freezed in freezer . So freezer level low is more enough and i see Ice made in an hour even i kept low freeze. So awsome.\nAs per standard it is very low power consumption compares to branded ones as I see 1.1 unit per day for 560 ltr refrigerator is nice.\nWater dispensers child lock is useful as children will operate simply.\nTemp child lock is nice feature, you can lock temp levels as it may be changed by children. Easy to operate touch control.\nEasy to move over the floor as it has wheels and you can lock movement with stand lock, wrench for operating stand lock is provided in kit.\nAdding this after usage a month. There is no power bill change it is very low consumption as my old 265 ltr refrigerator. So the power consumption is saving compared to other brands. Highly Recommended refrigerator in SBS sector",
            "We had a 266L refrigerator but this Diwali we thought of gifting ourselves a bigger refrigerator. A SBS was out of question for us given the high prices asked but Marq was a boon for our ever increasing need.\n\nOrder and Delivery:\nI ordered it within an hour after it was launched and the delivery was made on the 2nd day of the purchase.\nIt took 4 men to lift it to our home on the 1st floor. I'd advise people to only order this fantastic piece of appliance if you have a wide staircase or a lift.\nThe product is well packaged with well designed cardboard material.\n\nInstallation:\nIt was done barely 2 hours after the delivery. Since it was the first MarQ refrigerator delivered in my city, the representative from Jeeves was as clueless as me. Fortunately he had a installation video which he promptly shared.\nThe first thing during installation I'd suggest you to do is to make sure you lift the front legs of the refrigerator by turning it with your hand so that it stays in place as it has wheels on all 4 sides before using the refrigerator.\n\nOperation:\nOperation of the refrigerator is super easy. It's silent and doesn't vibrate at all. The doors are smooth to open and close. The LED lights are bright and light the whole compartment. The water dispenser has a capacity of 3 litres. It initially takes about 6 -24 hours for the refrigerator to reach the required temperature so do wait to evaluate its performance. Also, only the side walls (adjacent to doors) dissipate heat, thereby, requiring space for ventilation on the sides.\n\nValue for money?\nDefinitely yes. I don't think one can get a better deal than this. Go for it!\n\nMissing information?\n1. No information available on the weight load factor of glass shelves.\n2. No info if it has an inbuilt stabilizer as most refrigerators do.\n\nConclusion:\nIf I have to buy a refrigerator again I'd go for it without any second thoughts. It has a water dispenser which only a SBS with a price tag of upwards of 70+K has. Not only has it saved me money but its also a big space saving for me as we don't have to keep anymore bottles. It's silent. It's huge and it's presence is felt.\n\nP.S. - The display panel is different as shown by Flipkart than the one I received. But that's okay, it has the same functions and design (but a white light would have been my personal preference). Also the manual has a lot of grammatical mistakes and errors. But that shouldn't be spoiling your decision whatsoever :-D",
            "Hi,\n\nThe opinions after usage of a month.\n\nBest things:\n1. The price - bang on, affordable and well built. At this price point, i bet a proper good normal refrigerator would come.\n2. The looks - super trendy, a definate peice of praise\n3. The features - The description fits perfect with this product. The fridge is divided into 60:40 for fridge to freezer ratio. NO FROST as promised as a USP.\n4. Color available is only grey and it looks ubercool.\n5. Simple to use control panel\n6. Chilled water dispenser - yes, you guessed it correct, the water tank is placed inside and is to be MANUALLY filled. Tank is 10-13 ltrs.\n\nDidnt like:\n1. Flipkart sent only 3 persons to transport the fridge, if u have an appartment, you will face a hard time transporting it to upper floors.\n2. I just wish the freezer was convertible, so that the parts which is not being used as a freezer, could have been used as a fridge. However, somehow, the refrigerator only ices the products its supposed to, else things like sauces and pastes never gets iced, but reaches to much lower temperatures just before ice.\n3. I wish there cud have been 1 or 2 colors available.",
            "Best and awesome product by flipkart. features are too good and easy to use. installation and demo was done on the same day of delivery. worth the money. as usual on time safe and sound delivery by flipkart. instead of paying Lakhs for other models like LG and Samsung, better go for this. u will never regret",
            "The Best Side By Side Frost Free Refrigerator that come in very affordable price by Flipkart's Marq the best part in this price range it has water dispenser.......the LED Panel is color different that's it.....we just love it love Flipkart for the delivery and installation it's very fast and reliable.",
            "It's a very very good product . And their installation is also to good Mr amit and rajendra explained us the features and its a good product . It's performance is also too good and it's design is just too good .",
            "lovely gift which we presented to our family.... with lot of skeptical thoughts we chose to go ahead with this but as of now it has met all our expectations... super quick ice... we need to have more ice trays, which we bought as extras.... nice asthetics with an option of maintaining temperature of both sides... the water dispenser holds uptown 2.5-3 lit of water... which is adequate for a family of 4 as we normally jus use a Lil bit of it with normal water...",
            "Awesome product... Good design, Good quality, quick cooling and auto cut off, zero noise, quick delivery, custom adjust for freezor and fridge, movable product, water dispenser and overall superb, but very worst for demo man, he doesn't know about this side by side refrigerator and he is first time seeing and don't know about it and nothing helped to about my queries and doubts. Thanks to provide atleast user manual..",
            "Just the kind of fridge that I wanted ...\nSpacious, excellent cooling and freezing....\nValue for money... 100%\nQuality is good of both inside and outside..\nI'm glad I chose a new brand MarQ instead of the regular brands... It was worth the risk and I am absolutely happy... Thank you MarQ\nPs... I bought a microwave of the same brand.\n\nPS... The delivery person damaged my gate while unloading the fridge... Cost me a bomb to fix it... Hence such late review...",
            "MARQ Refrigerator is installed today but service engineer did not explained properly all the features.. He was in hurry and wanted to run away. On phone he said that simply plug in your power supply and refrigerator is on. No need of my coming. Moreover Stabilizer is required compulsory whereas FLIPKART has never suggested for stabilizer installation.\nDemo was not given properly, how water dispenser will work etc not explained by Service Engineer properly as he was in hurry and ran away in 7 ...\nREAD MORE",
            "A great product.\nVery happy with one day delivery of the product.\nBetter than some other brand costing almost double.\nYou might need a Stabiliser with the fridge.\nBuy V-Guard VG 100 stabiliser along with fridge.\nCooling is Fabulous and storage is very nice.",
            "It certainly deserves 5 star and infact more than that, ur neighbours are going to be jealous of you, this is huge and beautiful fridge and performance is absolutely superb, Delivery and installation time was super quick, installation person was quick in installing but only thing missing was his knowledge about fridge, he doesn't know how to operate touch panel and other features, rest everything is awesome, better than any other brand refrigerators. Keep your eyes close and go for it.\n\nIts been more than a year now and performance is still excellent, nothing like it. Once again recommending it to 100%.",
            "Best side by side refrigerator in budget. It’s a Flipkart Brand. Energy efficient, huge space and classic look. No other refrigerator can give you water dispenser in this budget. It’s a classic budget side by side refrigerator",
            "This is the best refrigerator in this price range. Its beats all the Samsung's and whirlpool and LG refrigerator in this 550 ltr capacity. And price wise its half of their price. Offers more than big companies. Writting this review after 4 months of use and it is giving flawless performance",
            "I would only tell the -ves since you can read the +ves in all reviews.\n\n1. Sides get very hot in summer. Almost like soup in a 5 star hotel hot.\n2. Water drips in the non-freezer zone at the top. ( water = 3-5 drops per day)\n3. Fridge needs 3-4 days to work properly after installation.\n4. Finger print magnet\n5. Extremely heavy but easy to move because of wheels.\n\nAfter considering all the above points its still a good buy.",
            "flipkart had delivered the product ontime and with very good packing condition. Quality and finish of the product is very good at this price. Demo provided by jeeves was also on time. overall iam satisfied with the product.",
            "The fridge is awsome and works perfectly without any complaint from the last 12 days.Those looking for a better range refrigerators must go for this as this refrigerator is providing the same features as in 80k fridge.The thing is that marq doesnt have exclusive outlets that is why its price is little less but i dont see any compromise with build quality.Value for money extremely happy with the purchase.",
            "Using it fr last one week everything is fine nw. good product with more value. Water dispenser is my favourite feature in it. It provides AI mode in it. Its very good. Let me chek for more time n update my review. As of nw i m really satisfied for choosing this product.",
            "This product is absolutely awesome in terms of its looks, design, performance, volume and capacity. This has complete value for each penny. Truely like a must buy product.But the 3 delivery persons were terrible, just couldn't carry the product to my 2nd floor home in a single attempt citing narrow passage.I had to arrange for 3 outside labourers who handled with ease and delivered to my kitchen although I had to spend an additional Rs.600 for the same.The demo guy who came the next day was a rude, arrogant and equally horrible.Flipkart must show some professionalism and there's a lot more to in terms of delivery and demonstration",
            "Best price and best product no noise at all till now and good finished and good quality cooling is very fast also. But few more features shld be added in the next model of the product...",
            "Pros :\n\nNice product with having immense performance with providing the option to the user for setting the customised cooling temp.\n\nGreat design and colour template.\n\n560L capacity including the utilities for ice cubes and holders are good enough for the home usage.\n\nCons :\n\nHeating issue will be there at the initial usage, but it will be rectified after day to day usage.\n\nIt would have been better if any separate section for freezing is provided, apart from the open space in left and right sides.\n\nDelivery process is very bad and I've waited 1 week more than the expected delivery date. Installation got delayed as well.\n\n\n---\n\nIf brand name doesn't matters, then this is the best buy under this price range offering good performance with 560L capacity.",
            "Value for money it looks great did not expect it to be so big, everyone at home are super excited to see the product. The delivery was and demo guys were good.",
            "Awesome product in terms of price, quality and performance. Installation done very next day of delivery. Till date cooling is great and hope the same will continue in future as well. Very satisfied and happy with the product.",
            "This refrigerator is really value of money i saw many fridge but price is very high that i can't afford also it's service and demo also good i gave 5star for this it performance also very cool it cool whole fridge in half an hour no doubt i recommended to buy this",
            "Am using dis product since one year it's wonderful product no noise. ....it's working silent. Am happy to buying dis marq. Refrigerator I have searched many brands on offline stores but not available in dis price range Thanks to Marq brand and Flipkart .",
            "As compared to others with same features, capacity and look, this is far better than others. Simply the best. Marq is a now a brand you can rely upon. This is one of my best purchse till date. Thanks Flipcart for providing such fabulous products in very less price.",
            "Must say!!!! i made the right choice.\nI was confused which side to side refrigerator to buy. And was wanting to buy a Samsung or Hitachi One..But this one really took their label off, Best for PRICE VALUE, excellent in design and performance.\nArtificial Intelligence added to maintain the temperature control and flow.\n\nA Must Buy !!",
            "Marvellous Refrigerator at this cost, loved it the way of its design, quality and appearance, no more thoughts in mind, i guarantee it's going to be the best and ideal refrigerator of the era for sure👍😊",
            "Amazing product. Did a lot of research online before buying. Also, visited couple of shops. Thanks to flipkart, came across this product. After reading through the reviews was in two minds as the brand is not well known in India.\nHowever, after using it for past 4 months my family is very happy with the quality and performance.\n\nInterest free emi option and extended warranty from flipkart was icing on the cake.",
            "This was like a wow moment for me n my family. My kids n spouse could not believe it. We are loving it, simply wow",
            "Great purchase and got it for best price. It would be good if there as an option to make defrost to normal so that we can use more fridge space . Interior shelfs was not sturdy and it was glass with very thin.",
            "Bought the MarQ because of its best in class pricing and very positive reviews online. I have to admit that I was apprehensive about the purchase but all my apprehensions have been dispelled by the stellar performance of the fridge so far. The fridge also looks quite nice and adds a lovely touch to the kitchen. Very happy with the purchase",
            "without any doubt please go ahead and buy the product .it's came good price n service also fast n fast delivered.marq is making good product as is it made by flipkart.very fast cooling",
            "This is a great product. There are enough space for your every item and cooling is great. lookwise it is beautiful and AI mode is great. overall happy with the product.",
            "NICE FRIDGE AND BUDGET FRIENDLY\nGOOD FOR BIG FAMILY\nCAN COMPARE THE QUALITY WITH LG AND SAMSUNG\nMY MOM LIKE IT VERY MUCH",
            "I love it and my mom also love it but it is so so so so much cool tnq flipkart tnq so so so so so so much",
            "It's simply superb in the price range. Best in class features and comparable with top class brands like LG, Godrej. We can go blindly on this",
            "After 1 month of usage, I would like to review the MarQ. Truly it’s from Mars, so silent and power efficient. Not much increase in my power though I moved from single door 240 liters to this double door big box.\nIf you really have a need to have this big then fine else the freezer is too big and we cannot convert it to regular fridge or shut it off though the power consumption is low and it doesn’t matter to us. Overall it’s a big Best Buy and truly performing well and it’s so silent that you don’t even know it’s performing. 👍👍👍👍👍",
            "perfect quality v.nice quality my family like it..",
            "Great performance , good look , simple to handle , worth buying",
            "super",
            "The power consumption increased drastically after using this product. Previously it used to be 100 - 150 units for the complete month.But now the power consumption after using it show above 220 all the time. Because of that I am paying Rs.700 month extra on current bill. So now I feel it is wast of purchasing. As I need to pay more amount for maintenance for this.",
            "value for money\nsince 6 days no issue\nno noise\nfunction wise good..\nlets see what in future",
            "best refrigerator in this price range\n1.)Super quite operating\n2.)So spacious\n3.) Awesome design\n4.)Water dispenser is great\nworth buying , value for money 😁😁😁",
            "best value for money",
            "very spacious fridge and nice look",
            "Coolest fridge at this price range, baap of many higher range product category, built quality, material, technology, features & Space, all are above expectation, go for it without any second thought, delivery & installation from flipkart done before scheduled, hoping product life to be also good.\nLike if you find feedback helpful.",
            "Steal in such a price. Ticks all the right boxes. No issue as of now... touchwood!!",
            "Very Good product.. buy in just cost 34800rs. on time delivery\nworth for buying",
            "after use of 7 days only\namazing product must buy\ndetail review after year.its to early for detail review\nthanks",
            "Its been 6 months and I/m fed up with this product. Fridge is not defrosting due to this there is no cooling in right side as well. I have purchased this side by side fridge and register my complaint of defrosting as well.\nPerson came and rectified issue by replacing the component but now the problem is as it is. Person has visited 3 times but he said he is not getting the issue.\nCan any one suggest what to do now? I'm fed up with dismantling the fridge again and again.\n\nNot at all a god product, we buy cheap product and flipkart provides cheaper things.\n\nI'm frustrate with this fridge, I wish I would have purchased other brand.",
            "budget king🔥🔥",
            "must buy it. if u think to purchase side by side refrigerator in ur budget go for it",
            "Really aswm",
            "hands down best refrigerator you could probably find in that budget. it looks classy and elegant",
            "Awesome Product by Flipkart..I am proud to say that I'm the 1st person who baught this product after launching with in half an hour.",
            "amazing product...on time delivery, great product and features at a great price..",
            "Fabulous deal !!\nbuild quality awesome\npremium looks (water dispenser)\ngreat capacity\nvalue for money\nthumps up cheers....",
            "Purchased the item in first week of January and installation was on time. Refrigerator is working very well and absolutely no noise while working. it's compressor is so smooth that we do not know whether it is on. Cooling is superb. I am fully satisfied with the product.\n\nD. Phani Kumar",
            "Bad to spend money on MarQ product\n\nI brought freeze and tv tv is very bad condition even color is not working properly and freeze is also not freezing as per specifications..",
            "Supb product... highly recommended. Very happy...cooling really great.",
            "Great product only unit consumption I have to check is left",
            "Osm at this price.... Other provide at 60k or 70k...delivery + installation done perfectly as per time...",
            "good looking amazing,good packing",
            "Worst decision ever made. Almost no cooling on one side. Called Marq so many times. The company is so much cheap that they don't even have their tech team. They have given the contract to company named Jeeves who don't give a damn about the customer. Filed complaint so many time. They don't even bother to visit customer and mark the complaint complete while sitting at their place. On several requests they changed a sensor but the issue persisted. Dont fall for the cheap price.",
            "Overall you can purchase it with no doubt in mind, using it for last 10 days , no issue as of now.",
            "I am writing this review after using it for more than 1 year..\nI will say very good product in this price range.\nThey say sound don't come ..but sometimes it do.sound when it is full.. may be for fast cooling.\nBut u can't expect more in this price range.\nDesign, performance, and capacity very good..\n.. loved it.. I think if u r looking for side door refrigerator.. u should go for it...",
            "awsm product",
            "nice product.... Can buy.",
            "Awesome fridge large space flipcart delivery and installation done in just 2 days working well looks so fabulous. I really satisfied with this product",
            "Product is sooo nice we can get in reasonable price performance is good",
            "Very nice cooling, freezer cools water bottles with 2 hours very nicely.\nA large space allows to store much food and beverages in a proper organised manner.",
            "Honestly this is an awesome product by flipkart\ni am using it for last 4 months and the performance of the product is great\nNamed companiea like LG, Samsung.. etc are just charging high just because they inveat so much on advertising nd showrooms\nyou can go for it",
            "it is good in this price limit",
            "value for money product and quality is awesome. i was worried about quality and my family told dont go for this brand because didnt know anything about this brand but i ordered and my family is very happy now Go for this brand and I purchase this at 36500rs in big billion days sale",
            "Excellent product",
            "Very good excellent product in this budget.",
            "Awesome product at awesome price.. beating big giants like samsung/ LG in the industry",
            "Nice Product Value of money",
            "very good",
            "nice......super product iam very happy thanks flipcart.......",
            "It's been a week and the refrigerator has been working like a breeze . No issues at all . Satisfied with the product at such a price point . Let's see how it plays out in long term …",
            "Received defective product and leakage in the water dispnser. issue with power consistency also. Highly dissappointed",
            "No issue till now. Its a plug and play device dono why people need to wait for installation.\nEven i had though twice before buying because of the brand name and price very less compared to other well known brands.\nRefrigerator does its job, there is enough space in addition to normal functionality there is a water dispenser.\nI have read few comments sayings it heats up on either side this a normal condition of a fridge to reduse condensation thats nothing wrong. At last if you need bigger fridge and not a big hole to your pocket go for it this is my personal opinion.",
            "You can not use one side",
            "refrigerator is good but service of Flipkart is very poor I got freezer tray cracked n demo person raised the complain about it but no one take any action",
            "Very good love it refrigerator is very nice and good working but shelfs are made with glass but it is week and one glass is breaked automatically in refrigerator IAM shocked and my mother shock and saying we are using refrigerator since 20years this is the first time I have seen glass breaking\ncompany should take care on that one instead of using glass to use fiber glass",
            "Good Choice but Stabilizer",
            "awesome lookwise .....performance will have to wait and watch...till now working well no noise super sleek design",
            "awesome, before time delivery, same day free installation, check-back call for confirmation and everything working fine.......",
            "Very good and worth full products .amazing product",
            "Excellent product looks like gaint bought 10 days ago good performence",
            "fantastic Product n Super chill ..with low noise n power consumption blind buy ...",
            "Good one",
            "it's amazing, special thanks to flipkart",
            "Super product value of money must to by middle class people",
            "Iam very happy this product",
            "Best in market till now",
            "Perfect product super",
            "Refrigerator right side too hot.",
            "First look impressive :- ) will update further after some usage",
            "I found a damaged",
            "It's a wonderful product of Flip cart, very economical. I recommend this product. You can buy it without any apprehension.",
            "Awesome product",
            "Using more than one year... no problem til now.... great performance... the cooling will retain for one day with out power supply.. you must use a stabilizer.. A small problem is some times the sides of the refregerator become heat.",
            "Just fabulous. We have been using this refrigerator for over 2 months now and it is working as expected. Cooling is good, quality of the glass and the outer/inner material is good. Have been recommending this product to all mg friends",
            "Excellent refrigerator",
            "Very nice",
            "This product is awesome.",
            "We ise to have a water leaking problem but thanks to filpkart marq they immediately responded and the problem has been solved. Overall it's a good product. Thanks you flipkart",
            "Nice product!!",
            "Good product",
            "very good",
            "Best product at best price",
            "Thanks flippkart fabulous product",
            "best delivery service",
            "working well",
            "value for money... good product ....I m happy\nfast delivery",
            "Using since 15th November, 2018. Working smoothly. Decent Product . Happy with Flipkart MARQ product. Fulfill all our necessary requirements. One can go for it. May be new product. But, rates are reasonable.",
            "Osm freeze in price and quality is so good yar same as lg freeze",
            "Nice product Money value",
            "Left part is completely freezer - u cannot keep any drinks water etc as shown in its video.. it is only for below -14 Degree..\nVideo & images are misleading as they have as shown and kept water juices and butter. it gets iced.. misleading video representation",
            "The 2nd day with the fridge. awesome cooling. lighting is great. great space. little difficulty was there in getting the fridge to 2nd floor but the delivery guys were good. Hope to have good experience with the fridge.",
            "Product is good but installation is too worst",
            "Product is good, but where installation part us considered, not at all satisfactory response to tat. Technician who came for installation was not at all learned and didn't helped us in any way to install. He was not having any basic knowledge even regarding product, the consumption of electricity and other issues.\nHighly disappointed with it, but other consideration for product is good and upto mark!",
            "The quality of the material used inside the fridge is of poor quality and the overall built quality is average.Budget product.Will review about the performance after usage of 1 month..",
            "Used it for three years.. amazing product at this price... should buy if planning",
            "Was apprehensive to buy this product, but it's turned out to be an excellent buy. Don't think buy it if you looking for a double door fridge. Writing this review after 30 days of usage. The only problem is the ice tray, wish they would provide a fixed ice tray. All said and done a great preformer.",
            "Amazing purchase... must buy it... Thanks to flipkart",
            "Awesome refrigerator with good features and affordable price",
            "chill profmare",
            "Its a nice Fridge at affordable price.Service is good.Installation on time.I will surely recommended to buy.",
            "Go for\nThis summer is awesome now",
            "Best In Class Superb Side by Side Door Refrigerator in this price you can Go Gooo Goooo Gooooo for this nothing Doubts",
            "Just awesome",
            "Very nice product",
            "Great purchase and got it for best price. It would be good if there as an option to make defrost to normal so that we can use more fridge space . Interior shelfs was not sturdy and it was glass with very thin.",
            "Fantastic fridge",
            "Okay value for money so comfortable 🙂",
            "Super product value of money must to by middle class people",
            "Very nice 👍",
            "Good one",
            "Good product",
            "Best in market till now",
            "Good",
            "Excellent product looks like gaint bought 10 days ago good performence",
            "Just buy ..dnt think ...👍",
            "Refrigerator right side too hot.",
            "Super product value for money...",
            "Excellent",
            "This product is wonderful. I am use for last 1year perfectly. Nice product",
            "Awesome Product....Value for money",
            "It is very nice",
            "Very good product thank you flipkart",
            "At present working properly",
            "Superb product in manageable budget. Less noise and less power consumption compared to other side-by-side models.",
            "Amazing product\nLow cost\nSimply superb",
            "One word \"awesome product\"",
            "Great.... Value for money. Performance excellent.",
            "It is good product. I recommend to buy this value for money refrigerator. If thing of these product is very good",
            "Nice",
            "Very nice",
            "I have problem in this with the cooling type of this refrigerator. The cooling system is not doing work as I expected",
            "Good product installation very fast and good behaviour for flypcart technician",
            "Writing this review same day got meni in good condition no problems till now hope no problems comes in future too everything is good but don't try too remove an annoying sticker on the front it will leave a glue stain and don't go away that easily",
            "Awesome one.......",
            "Awesome fridge",
            "Good",
            "Marq rifrizratior finishing awesome performance okey.. But future is not impresse",
            "Excellent go for it without second thought",
            "Very beautiful product",
            "Two spaces. The left side is freezer and the right side is the regular refrigerator side. The right side is not suitable for most of the items like storing fruits or sauces; everything gets freezed and not good to use. The freezer side can be used only for frozen food, which is not regular for the Indian households. Would be happier is the space given is made worth to use.",
            "It's too good i love this it's very useful it's too big and beautiful design my children are very excited to have this tanxz to you flip cart",
            "I was skeptical iinitially... But i am glad i took the decision to go for it. It works and looks classy.\n\nI just hoped more color options would be available.",
            "Value for money",
            "Value for money. Overall performance is good. The display/touch panel is not the same as shown in product description. The machine gets heated up pretty fast on the sides. Not sure whether that is normal.",
            "Excellent.Happy with 560.",
            "nice product",
            "nice",
            "I have been using this for the last 2 months and its a pretty good product. Its compressor is not inverter based but fir the price its ok. This does not compromise cooling. Similar products from known brands are over 60k and I got this one for about 43k.\nPros :-\nHuge capacity. You are not going to complain about less storage in fridge.\n\nSeparate door for freezer, so you open only that section which is needed.\n\nPremium finish\n\nAn external water dispenser. There is 3.5L tank inside on the door ...\nREAD MORE",
            "Awesome",
            "Good",
            "Valuebale amount worth product",
            "RECEIVED ON 29-MAY-2020 TILL NOW PRODUCT IS WORKING GOOD.TAKEN 2 YEARS ADDITIONAL WARRANTY.",
            "Very good product, value for money.",
            "Good product 👍👌",
            "Very very good product I really like it value for money",
            "Delivered yesterday, installed today. Happy with the service till now. Hope for the same in future too.\nImpressed with the product design, quality and capacity.\n*** 10 out of 10 ***",
            "Very good 👍👌",
            "Good at this price",
            "I love this fridge.... Just go for it... Cooling capacity is really Gud...",
            "Nice in budget service is good timely delivery and service",
            "Best",
            "Good product for valued money",
            "Best Product at Best Price.",
            "This Prodectis Good My Family so Happy with Mar ouQ",
            "Worth for money",
            "very good product",
            "Dont need anything more expensive.... it is perfect",
            "Excellent product value for your money..",
            "Value for money. I am using since last one month and very happy with my decision to go with marq",
            "It's excellent, only issue is with delivery and installation as it requires enough space. The ekart people has taken back and refused to deliver on the first floor. Since I liked the product very much I had to incurred the money for loading unloading. Rest you will like it.",
            "Best side by side\nBudget friendly\nNice job",
            "Amazing",
            "Super",
            "Awesome...",
            "Super",
            "Good",
            "very nice",
            "Worth for money",
            "Nice product",
            "superb",
            "100% satisfaction and very beautiful designed for customers.",
            "very nice 👍👌 happy",
            "Excellent value for money",
            "its good product under price its sold must buy for family size 5-6",
            "I have only one word amazing.Thanks flipcart for a great deal",
            "very good refrigerator at this price",
            "excellent",
            "good",
            "Got this installed yesterday...have bought this after going through the previous reviews....so far so good...hope it laast as long as my previous refrigerator lasted....",
            "nice product and thanks to flipkart",
            "best deal i got",
            "This Will Not Work As A Refrigerator\nYou Have To Use It's Like A Cold Shelf's\nThere Is Always Water Inside The Refrigerator\nThe Pre Options Will Not Work\nIf Change Any Settings Your Food Will Spoiled",
            "The refrigeratot is very nice and spcious. Happy with the product.",
            "value for money",
            "Been more than 2months and it's working fine. Time will tell how long it will last.",
            "Awesome",
            "Awesome product..",
            "Excellent product.",
            "Awesome",
            "Logistics and Delivery : thoroughly impressed. Not a scratch on the refrigerator. The team were professional and very courteous. Since it was an exchange, they also helped in removing the stuff old fridge and took it away. First time to see such a delivery team who are so customer friendly. THANKYOU guys :-) PRODUCT REVIEW: Awesome , the fridge is complete in all sense as they give ICE Twister , bottle stand (wine) cum egg tray , additional egg trays.LED light is also nice. Do not want to write more as many customers already reviewed in detail",
            "so far it is value for money & like dream come true. Exact performance will be known over a period of time",
            "excellent!",
            "very nice\nbut freeger is slow",
            "just one word.... awesome 👍👍👍",
            "value of money good design..",
            "Awesome",
            "excellent product by flipkart marq",
            "superr... product value for money..('-')",
            "good",
            "Just Now installed.Delivered as per promise.Installation was also nice experience.\nPerformance yet to be observed.4days performance is good",
            "very nice product",
            "Awesome side by side fridge. Value for the money.\n👌👏🥰",
            "I have been using since 3 months. It is value for money.",
            "Excellent desgine v.good product",
            "Very good refrigerator working too good only thing is could have given more bottle keeping options on side part",
            "Good product I loved to use it",
            "An excellent refrigerator at this price. Otherwise it is very expensive to buy a side by side refrigerator, but thanks to Flipkart, this has been made possible now......",
            "Very good product, worth for Money, installation and demo is poor at Tirupati, Andhra pradesh area.",
            "excellent",
            "Great Refrigerator!!",
            "I like it. Very beautiful",
            "so far very good value for money.hope it carries on like this for longer time.",
            "after using 20 days cooling is fantastic and this purchase is value for money.",
            "Excellent product in this price range",
            "Product looks good and was delivered on time. however , installation and demo did not happened on time as I had to call Jeeves multiple times for the same. Also, in the feature they mentioned door alarm, but that does not sound at all or it's too low for your ear. overall good product",
            "Built quality average plastic quality average but in this price range good product capacity OK ok types",
            "Super for this price Range 👌",
            "nice built, no noise, quick Installation value for money",
            "It’s worth of every penny\nThere is no noise it’s totally silent\nDesign gives it premium look\nWater dispenser is just awesome, you would not need to open refrigerator door\nYou can not compare with this price to any other refrigerator\nBelieve it if you have enough space and budget\n... Just go for it...",
            "surprisingly good. till now no issues. killer piece for LG Samsung",
            "wonderful product in this price range",
            "Reviewd many fridges, finally this set to my kitchen. Best fridge in limited budget.",
            "the most amazing fridge for the money in the market",
            "good product",
            "thank you",
            "So far so good",
            "Worth the price paid for.Noiseless and spacious.Satisfied.",
            "Great Product. Value for money. Amazing. No Comparison. Worth every penny.",
            "superb refrigerator.... best price....",
            "Best product by Flipkart",
            "product was awesome. best price. thanks marq. design was good. thank you so much flipkart",
            "I have seen many refrigerator but this one is the best. I want to give 5+ rating for this product. amazing fridge",
            "at this price. this is a must buy. amazing quality product. at par with other brands.",
            "Worth every penny...",
            "best in this price range."
        ],
        "likes": [
            "324",
            "420",
            "157",
            "67",
            "37",
            "56",
            "40",
            "10",
            "9",
            "12",
            "324",
            "420",
            "157",
            "67",
            "37",
            "56",
            "40",
            "10",
            "9",
            "12",
            "11",
            "17",
            "6",
            "4",
            "12",
            "10",
            "6",
            "10",
            "7",
            "5",
            "10",
            "6",
            "12",
            "2",
            "11",
            "3",
            "4",
            "4",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "144",
            "57",
            "16",
            "12",
            "38",
            "24",
            "5",
            "6",
            "8",
            "8",
            "10",
            "9",
            "14",
            "7",
            "9",
            "12",
            "6",
            "17",
            "17",
            "10",
            "3",
            "3",
            "4",
            "3",
            "8",
            "6",
            "14",
            "4",
            "1",
            "5",
            "6",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "3",
            "2",
            "2",
            "2",
            "2",
            "2",
            "3",
            "3",
            "2",
            "2",
            "6",
            "4",
            "3",
            "3",
            "6",
            "2",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "0",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "3",
            "3",
            "3",
            "3",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "2",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0"
        ],
        "dislikes": [
            "80",
            "129",
            "56",
            "23",
            "18",
            "8",
            "15",
            "1",
            "0",
            "1",
            "80",
            "129",
            "56",
            "23",
            "18",
            "8",
            "15",
            "1",
            "0",
            "1",
            "2",
            "5",
            "1",
            "0",
            "4",
            "3",
            "1",
            "4",
            "2",
            "1",
            "5",
            "2",
            "8",
            "0",
            "9",
            "1",
            "2",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "2",
            "22",
            "12",
            "2",
            "1",
            "12",
            "8",
            "1",
            "0",
            "1",
            "1",
            "2",
            "1",
            "4",
            "0",
            "2",
            "4",
            "1",
            "8",
            "9",
            "5",
            "0",
            "0",
            "0",
            "0",
            "3",
            "3",
            "10",
            "0",
            "2",
            "2",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "5",
            "1",
            "0",
            "2",
            "7",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "3",
            "3",
            "4",
            "2",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:is this refrigerator better than haier side by side refrigerators",
            "Q:Can you make icecream in this?",
            "Q:please update electric consumption",
            "Q:How much is the water dispencer tank capacity.",
            "Q:What about water purification?",
            "Q:How many watts does it require to operate - description gives voltage and frequency. I want answer like - 180 watts , 300 watts, etc.",
            "Q:Does this have a inbuilt stabilizer? or a external stabilizer should be used?",
            "Q:Is there locking system available",
            "Q:is this refrigerator recommended? other brands have 294 units per year is this energy efficient..and durable..",
            "Q:How will this fit in a lift or staircase? Does it come dis-assembled and then we can re-assemble it once it is inside the house?",
            "Q:what are the dimensions including the packaging?",
            "Q:Is it having enough space to keep the 2 litre liquid bottles like sprite coke frooty etc.?If yes Can they be kept on the side shelves where bottles are usually kept?",
            "Q:how much star ?enargy rating",
            "Q:Do we need a separate water supply to the dispenser?",
            "Q:Can I buy this refrigerator",
            "Q:power consumption per day",
            "Q:Brand name power rating",
            "Q:how much water is stored in water dispenser so that water dispenser work",
            "Q:How much capacity stabilizer required for this refrigerator?",
            "Q:can i adjust temperature manually for both section freezer and cooler.",
            "Q:Can it gives crushed ice?",
            "Q:Is this refrigerator is slanting in shape or straight",
            "Q:Bee star rating and power comsumption",
            "Q:in water dispenser comes which water, cold water or normal water",
            "Q:what are the box dimensions?",
            "Q:it runs on invertor or not",
            "Q:Does the water dispenser have filter? Does it have to be connected to plumbing",
            "Q:My stair case is 35inch is it ok for wishmasters to deliver me the refrigerator at 6th floor? as your width is 28inch",
            "Q:other's colour have or not there is single",
            "Q:how much power it consumes per day or per yer?",
            "Q:I have 3ft wide stairs and 2nd floor. No lift.. should I order ?",
            "Q:annual power consumption?",
            "Q:Where is ICE cube tray and auto rotation ice cube system??",
            "Q:ACTUAL POWER CONSUMPTION after some months use ??? & what about consumption in SUMMER ?? + CUSTOMERS SERVICE RESPONSE by MARQ good or bad ???",
            "Q:I read in some other questions that ita not inverter model but what happens if you have the inverter backup in fridge point and there is a power cut ?",
            "Q:can we wash or clean the water dispenser",
            "Q:star label is seen in product pictures. does it have star label? if yes, why is it not shown?",
            "Q:What's the difference between french doors and side by side fridge?",
            "Q:Is it convertible refrigerator?",
            "Q:Does it have fingerprint scanner in it",
            "Q:How to close ice building on other side",
            "Q:Water dispenser capacity",
            "Q:Highest cooling temperature in the fridge side",
            "Q:How much energy does this consume per day? What is the star rating?",
            "Q:Can I turn off the freezer section and just use the fridge section?",
            "Q:What is the exact length of refrigerator back side?",
            "Q:Which colour led light indicate in this instrument",
            "Q:What is the split in litres between the fridge capacity and freezer capacity",
            "Q:Is it artificial intelligence or not?",
            "Q:Does the external surface of refrigerator warms ?",
            "Q:Is this refrigerators need stabilizer?",
            "Q:How does the water dispenser works ? Should I connect to a tap ?",
            "Q:what is the doors dimentions?",
            "Q:Handle material is plastic or metal",
            "Q:water spilled inside the freezer and it turned to ICE. now how do I clean the frozen ice inside the freezer?",
            "Q:does it have ice maker",
            "Q:how much power consuption per day,i need exact answer plz?",
            "Q:can we cool coffee and make cold coffee in it ???",
            "Q:What is the BEE Star Rating for this product",
            "Q:how to clean the water holder and dispenser",
            "Q:Does it has build in stabilizer??",
            "Q:is this Fridege is Convertable???",
            "Q:in household invetor it can work or not",
            "Q:How will you refill the water dispenser",
            "Q:What is dimensions of the Fridge, like Width, Depth and Height?",
            "Q:Can this run on inverter in case of power cuts ? I am having Inverter with capacity of 2 KVA.",
            "Q:Which company is of this refrigerator?",
            "Q:can i use freezer section also as a cooler by adjusting temperature?",
            "Q:does this have temperature display LED as in pics shown by flipkart or it has temp display unit as in pictures posted by customers in review?",
            "Q:we have to fill the water or it is connected to water filter",
            "Q:what is the height and length of the refrigerator",
            "Q:how does the water dispenser works?",
            "Q:after opening refrigerator door side..inner side produce slightly tik sound.after every second or two...is it normal?",
            "Q:what type of stabilizer is good for it? also specify power",
            "Q:want know about freezer compartment for poultry and meet feesh section",
            "Q:can we add additional shelves in fridge door as only three shelves are there which I think are very few",
            "Q:how much pressure can be hold by the shelf or try for ur vessels and other stuffs",
            "Q:what is unit consumption per year???",
            "Q:at the bottom of the both doors,there is no bottle container. why?",
            "Q:how long vegetables will remain fresh?",
            "Q:what would be the power consumption of this fridge . when temperature is set lowest of it ?",
            "Q:How many unit consume per day?",
            "Q:max -c in freezer and ice cream store in freezer.",
            "Q:Do we need plumbing for getting the cool water",
            "Q:how to make ice cube",
            "Q:what is the annual power consumption of this refrigerator in units?",
            "Q:Is there any Ice Cube Tray available, where we can twist for ice cubes, could not able to find the same in pictures",
            "Q:Is the left side all freezer compartment.... . Or some part of the left side is freezer?",
            "Q:Does it have a ice/ freezing section. Can't be sure from pics.? And for water dispenser, do you have to refill every few hours, as capacity someone mentioned 3L, or can you have RO connected.",
            "Q:how is the power consumption , how many star rating is this product",
            "Q:how is the customer service.. for marq",
            "Q:5star or some other",
            "Q:What kind of power supply plug point (5A or 15A) is needed for running this fridge?",
            "Q:My touch panel is off after few minutes is this happens to everyone?",
            "Q:Hi, Does this refrigerator has a invertor compressor , convertible refrigerator / freezer ? Is it BEE Star rated ? What is water holding capacity for water dispenser?",
            "Q:what is the height of this fridge",
            "Q:Does it have an ice dispenser like water dispenser?",
            "Q:how open touch panel lock?",
            "Q:Both the sides of the refrigerator is very hot, is it normal???",
            "Q:Should i get GST invoice?",
            "Q:isn't the freezer to big? is it not convertible",
            "Q:why both sides of refrigerater very hot ?",
            "Q:how much unit power consumption per year??",
            "Q:this Model inverter",
            "Q:stand available or not",
            "Q:is it 3 , 4 or 5 star ??? energy star rating ???",
            "Q:This refreater have invetar",
            "Q:What is the Energy Start Rating of this product?",
            "Q:what about anti oxidation and Germs protection ?",
            "Q:what's the name of manufacturer?",
            "Q:Stabilizer is compulsory for this fredge",
            "Q:Can I use this product in restaurant? What's your opinion?",
            "Q:Is their any lock feature for water dispenser..??",
            "Q:What about fridge noise ?",
            "Q:What is length of the Power Cord",
            "Q:What is the working Voltage range",
            "Q:Are egg trays available in the Refrigerator?",
            "Q:Does it have inbuilt light?",
            "Q:is it frost free or do we have to defreeze manually by hiting defrost button",
            "Q:how much the maximum cool in freezer",
            "Q:do we need to fo a defreeze or it comes with auto defreeze i?",
            "Q:is this works on inverter technology or not",
            "Q:can we solidify ice in bowl ? ya in any container like aluminum big tiffin type",
            "Q:Is the refrigerator has defrost system like others if it is not how it works",
            "Q:People who have used the refrigerator, Is there any problem with the dispenser like leakage or something time and again ?",
            "Q:Do the refrigerator have lock, can we lock it .",
            "Q:is this fridge has converter with we can change fridger mode to fridge mode?",
            "Q:what is time taken to cool the water from water dispencer",
            "Q:Is this product manufactured by BPL.",
            "Q:is this eco friendly?",
            "Q:Does this refrigerator be controlled from Alexa or Google Assistant?",
            "Q:Does the water Dispenser needs to be filled up manually or does it need a water connection? If it is filled manually.. Kindly advice how is it done?",
            "Q:The outer body and doors of this refrigerator is painted or steel finish?",
            "Q:which company is it",
            "Q:I am looking to buy this for office. (a) Can I claim GST input TAX Credit? (b) how can I add my GST Number in bill to be issued by vendor?",
            "Q:can keep ice cream and fish in this ?",
            "Q:Should i get gst invoice by the name of our firm?",
            "Q:how much time take to make ice",
            "Q:performance related and quality",
            "Q:what is wattage of this refrigerator?",
            "Q:is it covertible..means can we use both as a freezer or both as a refrigerator according to needs...",
            "Q:Which gas use in refrigerator",
            "Q:is this a full metal body ?",
            "Q:How much space is required as ventilation on both side to fit the 91 cm width of this refrigerator ?",
            "Q:it's inverter model",
            "Q:does it have built-in stablize?",
            "Q:Can we use both side as cooler"
        ],
        "answers": [
            "A:Yes .Water dispenser in this fridge.and less noisy.",
            "A:Off Course",
            "A:This fridge consumes just about 1.06 units/day, this is mentioned in product description",
            "A:Around 3.5L",
            "A:this is refrigerator not water purifier. Very good product. Vegetables n fruits fresh for almost 15 days. Water dispenser works well.",
            "A:560W",
            "A:It have only surge protection.If you invest in this refrigerator.Better to use stabilizer if voltage fluctuations is more in area..I m using V Guard VGSD 100 for this refrigerator.",
            "A:No locks for the door. Slide Lock for the water dispenser.",
            "A:This is energy efficient and durability I have to check because recently only I am purchased the refrigerator. But one thing is sure the refrigerator compare to other brand so good on pricing.",
            "A:easy in lift....but very difficult in staircase bcz 100kg weight of refrigerator....you need 3-4 person in staircase....not dis-assembled",
            "A:Inside dimensions as in picture packaging adds thermacol sheets about 30mm",
            "A:Absolutely yes.Go for it.",
            "A:5",
            "A:No,u need to fill manually everytime when it is empty",
            "A:Please go ahead and buy without any doubt. Refrigerator is very good. No complaint till today. Size is good. Quality is also very good. Price is very reasonable comparatively. Satisfactory.",
            "A:around 1 unit .",
            "A:MarQ by Flipkart and power rating is 4.5",
            "A:3L",
            "A:no stabilizer required",
            "A:yes u can",
            "A:No",
            "A:Straight perfect",
            "A:5 star and no Power consumption",
            "A:Cold water",
            "A:Not remember exactly but dimensions are mentioned in picture you can add 2inch extra from all the sides.",
            "A:yes on generator, invertor , it dep nds on ur battery capacity. for regular house hold invertors it may not work",
            "A:no it does not have a filter. it does not need plumbing. you need to refill the container every time it gets empty. it's very convenient. capacity of water container is considerably big",
            "A:Refrigerator weight is around 95KGs, better you use lift, otherwise it’s too heavy to lift and I am there won’t be enough space carry up to 6th Floor, plan accordingly and then only move the product",
            "A:Black and silver",
            "A:got the delivery today and power consumption to other brands is lesser.",
            "A:No, if you can take a risk by your own to get this uplift on the second floor then only you should order. ekart will not support you",
            "A:I observed the power consumption was very high for this Refrigerator. Previously my monthly number of units per month used to be between 100 - 150. After using this it show above 220 units always.",
            "A:It is a box & can be kept on any shelf in the freezer. This box has (a) a lid with opening to pour water into cube tray (b) the ice cube tray with twist (c) tray to collect ice after twist.",
            "A:Is not responding this customer service is not good",
            "A:inverter model is not your ups inverter. and fridges are not to be used on your ups.",
            "A:yes you can wash",
            "A:yes",
            "A:French doors means which has more than 2 side by side opening..n maybe a pullout drawer...but this is side by side... 2 door on each side",
            "A:no. freezer s highest at -15 degree Celsius",
            "A:No..",
            "A:set the cooling temperature",
            "A:3 litres",
            "A:normal fridge 8 to 2 degrees and deep freezer -22 to -14 degrees",
            "A:1 unit for day",
            "A:Yes of course",
            "A:6.2 feet, both front and back",
            "A:pink",
            "A:66:34 fridge:freezer ratio",
            "A:yes",
            "A:yes right side of the refrigerator",
            "A:yess",
            "A:water dispenser has 3.5 litre capacity which u can refill by your need.Easily you can just press & fill your empty glass or water bottle",
            "A:90 cm",
            "A:metal",
            "A:Switch off Fridge till ice melts.",
            "A:Ya.. Good",
            "A:One unit per day.",
            "A:NO, WE CAN'T MAKE COFFEE. ONLY FOR WATER PURPOSE",
            "A:3 star",
            "A:It's easy to clean u have a lock inside u can take it out and clean entire thing and ur choice is best",
            "A:no",
            "A:No, its is not, but u can change temperature",
            "A:on inverter it will not work",
            "A:there is a box inside. fills with bottle",
            "A:please check specs",
            "A:no...and if you do put it on, it will overload and drain the battery very fast",
            "A:marq",
            "A:Freezer is not convertible",
            "A:Temperature display as per the climate control of it and automatically also in it.",
            "A:Have to fill the water.",
            "A:Height is 6ft and length is 3 ft approximately",
            "A:absolutely fine , no leakage and no plastic smell.",
            "A:If the door is open for more then two seconds you will get beep sound. not tik sound",
            "A:it's very good",
            "A:Lot of space available to store meet and poultry and it stay fresh for long time",
            "A:yes, and also add the function of freezer convert to freeze its helpful for customer.",
            "A:minimum",
            "A:Consumes 4.5 unit/day",
            "A:so that fruit and vegetable trays can be operated even with doors open at 90°.",
            "A:3 days",
            "A:2 units",
            "A:Same like 240/270 ltrs fridge.",
            "A:yes",
            "A:No",
            "A:That's something the refrigerator will do. You just have to pour water into the ice tray provided.",
            "A:383.25 units per year",
            "A:ya its available and also 24 egg tray available (12+6+6)....its actually awesome purchase",
            "A:Left side is all freezer",
            "A:You can not connect RO because it water tank is on above bottle shelf.You need to refill it.",
            "A:In manual it is mentioned as 1.05 units per day. 5 star rating",
            "A:Not great. I have a request pending from 30+ days and request gets closed or service postponed without information.",
            "A:No it's not a 5 star . But product is very nice in this price. Don't worry purchase without hesitate. .",
            "A:15A",
            "A:Absolutely yes, the touch panel will remain off until the fridge is opened or you use the control panel.",
            "A:Hello Hi, no need of stabilizer, yes it is convertible too, yes it is 5/4 rated from my side. water dispenser is up to 3 liters i am using . go for this MarQ product excellent one .",
            "A:Height is 180 cm & width is 91 cm, but since this fridge is side by side door so when both doors open you will need more width remember that.",
            "A:no , only water dispenser",
            "A:Press and hold the lock for 3 Seconds",
            "A:nope it is not normal.",
            "A:Yes you'll get it..",
            "A:It is big meant for big family or for those who have to keep lot of stuff in a refrigerator. It is not convertible.",
            "A:it's due to the coils present around it which prevents moist inside refrigerator it's also mentioned on the refrigerator as a caution",
            "A:As an average unit consumed by this refrigerator in a month is 30-40 units. It depends upon the usage. Overall this refrigerator is awesome and value for money, so go for it.",
            "A:No, reciprocator compressor.",
            "A:it's not part of the standard delivery . but the refrigerator has got wheels u see it so I did not see any need for stand . it's easy to move because of wheels .",
            "A:5",
            "A:No",
            "A:i will give 5 stars rating",
            "A:everything is best cooling noice 👌 but one thing is wrong water dispenser it was broken if u buy also it's only few days after it's looks odddd if dispenser come out",
            "A:The manufacturer of Marq brand is Flipcart india pvt ltd.",
            "A:We live in a society which has proper checks in place to handle voltage surge so I am not using it, but if you have an independent electricity connection would recommend you to get one.",
            "A:yes",
            "A:no",
            "A:It has less than 43dB sound level",
            "A:it is more than 1.5mtr",
            "A:The unit can run well in the voltage range of 160~260V",
            "A:Yes",
            "A:Yes",
            "A:no it is a frost free and u dont habe defrost button separately.",
            "A:Almost good not bad....thanks",
            "A:auto defreeze",
            "A:no",
            "A:yes, you can",
            "A:Yes the refrigerator has auto defrost.",
            "A:Not yet but this question u asking very early",
            "A:no",
            "A:no this fridge has not changing mode.",
            "A:20 to 30 minutes",
            "A:NO, IT IS MARQ,SINGAPORE BASED COMPANY",
            "A:yes",
            "A:No.",
            "A:We need to fill it manually, there is no auto filling option.",
            "A:outer body is metallic painted finishing is v.good",
            "A:Marq by Flipkart",
            "A:No you can not take input credit on it. plz note that you are the last buyer of this product & you have to bear such duties.",
            "A:Yes",
            "A:Yes",
            "A:1 hour",
            "A:It is best !!!",
            "A:1.2 per day as per company",
            "A:NO. Its not possible. Freezer can only work as freezer.",
            "A:R600A",
            "A:Yes its a metal body",
            "A:Same as any other refregrator",
            "A:No",
            "A:No..I have bought V Guard VGSD 100 stabilizer.",
            "A:one is cooler and one is freezer"
        ],
        "likes": [
            "17",
            "21",
            "128",
            "0",
            "5",
            "15",
            "4",
            "6",
            "45",
            "15",
            "2",
            "2",
            "4",
            "0",
            "10",
            "4",
            "3",
            "3",
            "2",
            "0",
            "1",
            "0",
            "3",
            "0",
            "4",
            "10",
            "9",
            "4",
            "2",
            "3",
            "2",
            "2",
            "2",
            "2",
            "2",
            "1",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "89",
            "9",
            "18",
            "9",
            "1",
            "6",
            "42",
            "21",
            "3",
            "12",
            "7",
            "2",
            "2",
            "2",
            "0",
            "1",
            "11",
            "9",
            "3",
            "1",
            "6",
            "3",
            "1",
            "1",
            "3",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "7",
            "7",
            "65",
            "2",
            "5",
            "5",
            "1",
            "1",
            "40",
            "14",
            "0",
            "0",
            "3",
            "0",
            "11",
            "3",
            "2",
            "2",
            "0",
            "1",
            "0",
            "0",
            "6",
            "1",
            "5",
            "20",
            "20",
            "8",
            "2",
            "6",
            "4",
            "5",
            "5",
            "1",
            "1",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "5",
            "0",
            "0",
            "0",
            "8",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "28",
            "0",
            "5",
            "3",
            "0",
            "2",
            "49",
            "21",
            "0",
            "15",
            "7",
            "1",
            "2",
            "0",
            "0",
            "0",
            "22",
            "15",
            "4",
            "3",
            "20",
            "8",
            "2",
            "2",
            "12",
            "2",
            "6",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "4",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0"
        ]
    }
}