{
    "title": "SAMSUNG 700 L Frost Free Side by Side Refrigerator  (Gentle Silver Matt, RS72R5001M9/TL)",
    "product_specification": {
        "In The Box": "1 Refrigerator Unit\nUser Manual\nWarranty Card",
        "Type": "Side by Side",
        "Refrigerator Type": "Side by Side",
        "Defrosting Type": "Frost Free",
        "Compressor Type": "Digital Inverter Compressor",
        "Capacity": "700 L",
        "Number of Doors": "2",
        "Coolpad": "No",
        "Toughened Glass": "Yes",
        "Built-in Stabilizer": "Yes",
        "Shelf Material": "Toughened Glass",
        "Design": "Solid",
        "Power Requirement": "AC 230 V",
        "BEE Rating Year": "NA",
        "Stabilizer Required": "No",
        "Launch Year": "2019",
        "Net Total Capacity": "647 L",
        "Other Features": "Freezer Location: Top Mount",
        "Net Height": "178 cm",
        "Net Depth": "71.6 cm",
        "Net Width": "91.2 cm",
        "Weight": "101 kg",
        "Installation & Demo": "Authorised Service Engineer will install the Refrigerator, make it operational and explain the below details. 1. How to Use, 2. Features,3. Do's and Dont's.",
        "Warranty Service Type": "Technician Visit",
        "Warranty Summary": "1 Year Warranty on Product and 10 Years Warranty on Compressor from Samsung",
        "Covered in Warranty": "All Parts Excluding Plastic Parts, Glassware, Bulb and Tube from the Date of Purchase Against Defective Material and Workmanship",
        "Not Covered in Warranty": "Parts: Plastic / Glassware / Bulb / Tube. Any Accessories External to the Product. The Product is Not Used According to the Instructions Given in the Instructions Manual. Defects Caused by Improper Use as Determined by the Company Personnel. Modification or Alteration of Any Nature made in the Electrical Circuitry or Physical Construction of the Set. Site (Where the Premises is Kept) Conditions That do Not Confirm to the Recommended Operating Conditions of the Machine. The Serial Number is Removed, Altered or Obliterated from the Machine. Defects Due to Cause Beyond Control Like Lightening, Abnormal Voltage, Acts of God or While in Transit to the Service Centres or Purchasers Residence"
    },
    "product_description": {
        "Spacious Interior with SpaceMax Technology": "The unique SpaceMax Technology, in this refrigerator, makes the walls much thinner to ensure a minimal amount of high-efficiency insulation. This gives you more storage space without altering the external dimensions or reducing energy efficiency.",
        "All-around Cooling": "The all-around cooling system continuously keeps a check on the temperature and blows out cold air. This helps evenly cool the fridge (including the corners) so that every food item stored inside stays fresh for a long time.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review": [
            "Superb One Day Delivery! Elegant Matt Silverish finish !! Very silent operation! Ample storage with good quality shelves ! Bright LED in both compartments! Temperature setting inside the fridge so the outside looks clean l... Its a heavy fridge so ensure the logistic people get atleast 4 persons of the building doesn’t have lift to carry it..\nNow waiting for the Samsung guy to come and inspect as a mandatory norm!\n\nWill update more in month’s time ...👍🏻",
            "Excellent fridge: quality make , nice mat finish colour , very spacious and value for money. Please have a clear measurement of your available space for it.",
            "I am very happy to share the experience of my new Samsung beautiful and Big Refrigerator which is working excellent..Power input is only 150 watts which is unbelievable and too low...I am expecting low Electricity bill from this month. Thanks to the inverter Technology for the Compressor.\nThanks to Flipkart for timely delivery, Packaging was intact..Samsung Technicians service in starting the Refrigerator was also excellent.\nEven though separate stabiliser not required, I am using the old stabilise which was earlier used for 250 litres refrigerator.",
            "Impressive side by side refrigerator by Samsung. My review -\n1. Looks very elegant with a Matt finish.\n2. Huge space in both the fridge and the freezer side. The depth of the side bins are very good.\n3. The fridge functions almost noiseless.\n4. The temperature control panel is given inside, which is good thought as one doesn't need to keep changing it and it protects from accidental touch.\n5. There is also a door open alarm which is a good utility.\n6. The lights are bright.\n7. Due to the side bins, pulling out the vegetable trays require the door to be open 180 deg, though this is not too much of an inconvenience.\n8. The wire length is quite adequate to reach bottom or top plug point. It also does not require 15amp point making it convenient to be placed anywhere.\n\nFlipkart had put up a Try & Buy offer which helped make the decision to buy easy. Superb delivery by Flipkart without any issue to the product considering that this is a huge refrigerator.\n\nOverall Very satisfied with this purchase.",
            "excellent & prompt delivery, installation Service by Flipkart. For product everything is excellent however I found that Vegetable tray plastic looks not strong enough.",
            "Pros\nGood Finish\nGreat capacity\nCan adjust 20 litres water bottle\nTouch pad to adjust temperatures for freezer and fridge\nDoor alarm in case you leave it open\nWheels and lock wheels.. makes easy fit one person to move it within the house.. one side movement from to back..\n\nCons -\nUnwanted design to hand bottles but no hangers under the top right shelf\nThe room temperature has gone high because of the fridge emits too much heat..\nFlipkart guys gor installation never shows up and if you call flipkart they will raise a ticket and give you an eta of 4 days means be ready to be without fridge for 4 to 5 days\n\nSteps to be taken\n1. Call samsung directly and get the installation done.. visit is scheduled in 48 hours but he actually came in 6 hours.\n\nWish they could have given more door shelve options to store more smaller bottles too which can be easily removable",
            "Now we are using this refrigerator from past 10 days. It is best in class. Very spacious inside. Compartments are designed meticulously to accommodate maximum items. Features are too good. I liked vacation mode the most. Power consumption can be commented only after a month.Samsung service was good. Immediately arrived for installation. Explained all the features in detail. Extended warranty is quite costly. Overall a good experience. One time worth spend. In tropical hot weather for maximum food item spacious refrigerator becomes necessity.",
            "Everything is good but if u see side body paint is just like look like as wardrobe paint finish and also look like as wardrobe..",
            "The size of this elegant piece is a bit big. It occupies considerable space. Hence, we should have or identify a suitable place for this beautiful item in our houses before it actually arrives at our houses. A word of caution. The fridge, with its intact packing materials, will not pass through the conventional door frames at our houses, unless the door openings are wide in sizes. By and large there are no issues in transportation and installation. People are nice and very helpful. As of now we are very pleased and happy with this product.",
            "Very spacious, stylish, elegant & cool product from Samsung. Best side by side door refrigerator in this budget segment. Samsung's space max technology is new innovation. 700 litres is really cool and lots of space. All round cooling feature keeps items fresh. Digital inverter compressor with 10 year warranty. Stylish both interior and exterior.",
            "Superb One Day Delivery! Elegant Matt Silverish finish !! Very silent operation! Ample storage with good quality shelves ! Bright LED in both compartments! Temperature setting inside the fridge so the outside looks clean l... Its a heavy fridge so ensure the logistic people get atleast 4 persons of the building doesn’t have lift to carry it..\nNow waiting for the Samsung guy to come and inspect as a mandatory norm!\n\nWill update more in month’s time ...👍🏻",
            "Excellent fridge: quality make , nice mat finish colour , very spacious and value for money. Please have a clear measurement of your available space for it.",
            "I am very happy to share the experience of my new Samsung beautiful and Big Refrigerator which is working excellent..Power input is only 150 watts which is unbelievable and too low...I am expecting low Electricity bill from this month. Thanks to the inverter Technology for the Compressor.\nThanks to Flipkart for timely delivery, Packaging was intact..Samsung Technicians service in starting the Refrigerator was also excellent.\nEven though separate stabiliser not required, I am using the old stabilise which was earlier used for 250 litres refrigerator.",
            "Impressive side by side refrigerator by Samsung. My review -\n1. Looks very elegant with a Matt finish.\n2. Huge space in both the fridge and the freezer side. The depth of the side bins are very good.\n3. The fridge functions almost noiseless.\n4. The temperature control panel is given inside, which is good thought as one doesn't need to keep changing it and it protects from accidental touch.\n5. There is also a door open alarm which is a good utility.\n6. The lights are bright.\n7. Due to the side bins, pulling out the vegetable trays require the door to be open 180 deg, though this is not too much of an inconvenience.\n8. The wire length is quite adequate to reach bottom or top plug point. It also does not require 15amp point making it convenient to be placed anywhere.\n\nFlipkart had put up a Try & Buy offer which helped make the decision to buy easy. Superb delivery by Flipkart without any issue to the product considering that this is a huge refrigerator.\n\nOverall Very satisfied with this purchase.",
            "excellent & prompt delivery, installation Service by Flipkart. For product everything is excellent however I found that Vegetable tray plastic looks not strong enough.",
            "Pros\nGood Finish\nGreat capacity\nCan adjust 20 litres water bottle\nTouch pad to adjust temperatures for freezer and fridge\nDoor alarm in case you leave it open\nWheels and lock wheels.. makes easy fit one person to move it within the house.. one side movement from to back..\n\nCons -\nUnwanted design to hand bottles but no hangers under the top right shelf\nThe room temperature has gone high because of the fridge emits too much heat..\nFlipkart guys gor installation never shows up and if you call flipkart they will raise a ticket and give you an eta of 4 days means be ready to be without fridge for 4 to 5 days\n\nSteps to be taken\n1. Call samsung directly and get the installation done.. visit is scheduled in 48 hours but he actually came in 6 hours.\n\nWish they could have given more door shelve options to store more smaller bottles too which can be easily removable",
            "Now we are using this refrigerator from past 10 days. It is best in class. Very spacious inside. Compartments are designed meticulously to accommodate maximum items. Features are too good. I liked vacation mode the most. Power consumption can be commented only after a month.Samsung service was good. Immediately arrived for installation. Explained all the features in detail. Extended warranty is quite costly. Overall a good experience. One time worth spend. In tropical hot weather for maximum food item spacious refrigerator becomes necessity.",
            "Everything is good but if u see side body paint is just like look like as wardrobe paint finish and also look like as wardrobe..",
            "The size of this elegant piece is a bit big. It occupies considerable space. Hence, we should have or identify a suitable place for this beautiful item in our houses before it actually arrives at our houses. A word of caution. The fridge, with its intact packing materials, will not pass through the conventional door frames at our houses, unless the door openings are wide in sizes. By and large there are no issues in transportation and installation. People are nice and very helpful. As of now we are very pleased and happy with this product.",
            "Very spacious, stylish, elegant & cool product from Samsung. Best side by side door refrigerator in this budget segment. Samsung's space max technology is new innovation. 700 litres is really cool and lots of space. All round cooling feature keeps items fresh. Digital inverter compressor with 10 year warranty. Stylish both interior and exterior.",
            "We received today..we are very happy Nd exicted.it has great looks with superb capacity. It's a giant freeze. I must say it's a value for money.flipkart always gives superb service...I am huge fan of flipcart. Let's see how does my freeze works in coming days.\n\nI am satisfied with flipcart and ecart services. Delivery team are gentle Nd cooperative. Thank you all",
            "Excellent product by Samsung",
            "Great storage...nice product..\nI am happy...",
            "Value for money",
            "Excellent product. Look, Performance and demo service very good.",
            "Super hit product..Very much impresd",
            "excellent space. but we can convert the freezer to refrigerator",
            "Awsome colour with big capacity. Loved it. Good value for money.",
            "Thnk u flipkart for this product in such a low price..",
            "Good product.\n\nFreezer temp : -15 to -23 Celsius\nFridge temp : 1 to 7 Celsius",
            "The product was delivered before time and that too to Kohima Nagaland which I never imagined that they will deliver such huge product to my door step. The product didn't have any damage or scratches after traveling so far and hope the product will last long. As of now everything is fine. Thank you Flipkart. I will review the item after few months. Keep up the service.",
            "So nice product 😊👍",
            "Received the freeze without a scratch and dent . Beautiful freeze.",
            "I am really happy for owning this product. Very silent, spacious, cooling is awesome. All over product is awesome",
            "Very Spacious. Trust Samsung. My 3rd Fridge.",
            "Dream fridge , working flawlessly ,very much satisfied",
            "Good product, after some delay due issue of carring and get into building lift finally we got the product.. Max space with good finish and cooling.",
            "As expected",
            "Product is very good, delivery was seamless, although i thanked the delivery representative when he arrived, wanted to document his extremely helpful nature while delivering. Thank you very much and appreciated. Installation was done before the schedule.",
            "Nice product in thisprice. I really love it!\nValue for money\nHuge space fridge\nTry it nice design ?",
            "Received perfectly with no dent on box nad refrigerator\nHappy with purchase",
            "got this refrigerator in so much affordable price",
            "Should have to provide egg tray, the freezer is not convertible to normal fridge",
            "I bought this fridge 20 days back. It stopped working suddenly today. Very disappointing.",
            "Good product from samsung",
            "On time delivery and the fridge is simply amazing .",
            "Thnku for this lovely product with reasonable price with all one best Quality nd Features",
            "Amazing Refrigerator With Large Capacity & Ample Surround Cooling. Thanks Flipkart.",
            "Very very awesome cooling space material all is good in this",
            "Fridge is awesome.. haven't started it yet.. waiting for Demo person to come.. Its been 4 days since delivery but demo person is no where to be seen..\n\nUpdate: Today its 25th Still no demo person came for demo..",
            "Awesome Side by Side fridge by Samsung. I got it at 65K after a exchanging my old Samsung fridge.\nJust go for it, if you get it at around 65K.",
            "Worst product, not working within 1 week of installation",
            "Power is not flowing inside the refrigerator .Dont buy this.",
            "Excellent product. Huge space",
            "Nice product, installation and demo was done nicely. Till now very good experience.",
            "Amazing refrigerator",
            "I'm reviewing it after 10 days used. Go for it. It is very specious refrigerator also very smart work and look is awesome. Happy to purchase this product.",
            "Value For Money",
            "This is a very solid refrigerator with heavy doors and a premium look and feel. Cooling is fast and effective on this model. So far so good.",
            "Superb 1 day delivery with utmost care and handling.After one month of use,I find it very useful as it keeps vegetables and fruits fresh for longer.Space is never a constraint.With basic functionalities but all important useful one’s.No useless fancy features.",
            "I am writing this review a year after purchase. The fridge worked well initially and we hardly had any issues. But a month after fhe warranty expired all problems started…. The cooling diminished and the the temperatures inside reached 25degrees…. There were leakages in the coil which the samsung technician fixed and refilled the gas but two days later the samethibg happene",
            "Best",
            "Very nice product,and best gift for my mother",
            "Nice prdduct.mmind blowing purchase.",
            "Solid product with an awesome deal from Flipkart.",
            "It’s good but looks are not quite impressive all over a good budgeted product",
            "Very good product value for money",
            "Get Refrigerator,\nReview after using for six months\nVery spacious and the cooling is very good. The freezer you're not works fine and there is no Frosting the food last very long. Coming to the refrigerator unit itself is very big all the cells are large enough to keep a bottle standing as well have multiple utensils kept side by side.\nThe fridge looks very elegant and is value for money.",
            "This is an awesome product and great value for the price (70,000)",
            "Installation done in 2 days..Delivery guys did not bother to bring it inside the house and dropped it Infront of gate.product is good .",
            "Excellent product. Smooth delivery and installation. Prompt demo service. Also smooth exchange.",
            "nice",
            "Value of money !",
            "Awesome product.\n\nGood space.....great design....",
            "Very good product\nLooking so nice in kitchen 👍👌",
            "A silent operation refrigerator..no sound while working.pin drop silent, effective management inside, proper utilisation of storage capacity",
            "Very well delivered. Really good product. Too much space to work with.",
            "Best side by side in its price range..",
            "Good",
            "Excellent refrigerator.. Moreover I bought in just 62k.",
            "Excellent purchase",
            "Awesome product",
            "Really an awesome refrigerator at this price. It looks premium and classy. struggled a bit to place this big boy. satisfied with the purchase.",
            "Good",
            "Excellent Refrigerator",
            "Delivered as per the mentioned timeline and also installation and return pick up services are Good. Worth it and value for money",
            "Awesome....product...",
            "Awesome product!! A must buy",
            "Must buy huge size refrigerator i really love it",
            "Excellent refrigerator with lot of space for the storage in the freezer and the fridge. Sleek design by Samsung with the space Max technology. Good buy from the Big billion day by Flipkart.",
            "Product is good but Samsung demo service not upto the mark very bad service",
            "Excellent value for money product.",
            "Excellent Delivery Service.... Thanks to Flipkart...",
            "Nice product with best price",
            "I m very happy",
            "Loved the refrigerator the delivery and installation was timed fair",
            "Value for money",
            "Value for money awesome",
            "Me and My family liked the product very much. It's very nice. Not much time used but fully satisfied.\n\nThanks flip cart for delivery of this product at such reasonable price.",
            "Awesome product",
            "good product thanks flipcart for great offer"
        ],
        "likes": [
            "115",
            "57",
            "44",
            "174",
            "16",
            "6",
            "5",
            "8",
            "4",
            "5",
            "115",
            "57",
            "44",
            "174",
            "16",
            "6",
            "5",
            "8",
            "4",
            "5",
            "5",
            "19",
            "6",
            "5",
            "24",
            "93",
            "34",
            "14",
            "2",
            "9",
            "3",
            "4",
            "4",
            "3",
            "4",
            "6",
            "2",
            "1",
            "2",
            "8",
            "4",
            "4",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "30",
            "15",
            "15",
            "102",
            "8",
            "0",
            "0",
            "4",
            "1",
            "2",
            "30",
            "15",
            "15",
            "102",
            "8",
            "0",
            "0",
            "4",
            "1",
            "2",
            "6",
            "4",
            "0",
            "0",
            "6",
            "44",
            "15",
            "5",
            "0",
            "4",
            "1",
            "1",
            "1",
            "1",
            "1",
            "3",
            "0",
            "0",
            "0",
            "7",
            "2",
            "3",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "5",
            "3",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1"
        ]
    },
    "qna": {
        "questions": [
            "Q:water dispenser is there",
            "Q:the ice tray box is detchable?",
            "Q:is this inverter compresser",
            "Q:How many units per day does the fridge use or if possible can someone tell me the watt usage.. thank you..",
            "Q:Can we switch off freezer and just use refrigerator..",
            "Q:can you install it on 1st floor with as there is no lift and steps are narrow which thus cant be used ?",
            "Q:can you disassemble the front door and then reattach it as the staircase is narrow",
            "Q:what is the capacity of Freezer and Refrigerator separately.",
            "Q:What is the manufacture date of the product and Is this a fresh packed one",
            "Q:What is the width of the carton in which the fridge is packed? My Main Door's width is 30 inch. Can the Fridge go inside with the carton on?",
            "Q:How many star in the fridge",
            "Q:Is it having display on door?",
            "Q:Is this refrigerator can connect to WiFi or phone",
            "Q:In this works on invertor technology and what is the star rating?",
            "Q:Can I use both sides as a Refrigerator? Is this product convertible? My usage is only refrigerator, not freezer.",
            "Q:How much kVA stabilizer will be suitable for this freeze. PCB get short circuited only after use of 5 months.",
            "Q:Back side is covered or itis grill",
            "Q:It have stabilizer",
            "Q:What is the net depth of the tray inside the fridge? i think 71cms if for whole depth of the fridge from.the outside but i want to knw about the inside.",
            "Q:do you get metallic wine tray with product?",
            "Q:Width of the doors is less compared to the width of the fridge.can the doors be detached and fixed inside the house after shifting.",
            "Q:What is the difference between this model and Samsung RS72R5001M9?",
            "Q:Yearly power consumption by this unit",
            "Q:How will this fit in a lift or staircase? Can it be dis-assembled and re-assembled once it is inside the house?",
            "Q:Is the whole left side of refrigerator the freezer ?",
            "Q:oneside is only for froze products...",
            "Q:Does this have child lock feature?",
            "Q:Does this have child lock feat",
            "Q:How many star rating on this model",
            "Q:what is the freezer to fridge ratio?",
            "Q:How much electricity in unit it consumes in a day",
            "Q:Does it need stand and stabilizer"
        ],
        "answers": [
            "A:No. Not in this model.",
            "A:Yes.",
            "A:yes",
            "A:150watt and it is rated 3 star, no idea about the units per day usage",
            "A:Sorry you can't. The refrigerator & freezer should be used together or switched off together.",
            "A:Lifting through narrow steps is not possible.",
            "A:Yes. But you'll need professional help",
            "A:269 Freezer and 431 Refrigerator",
            "A:Yes. Brand new. Received without a single dent.",
            "A:yes",
            "A:5",
            "A:No outside . but it has one on the inside right hand door for temperature display. No",
            "A:we cannot",
            "A:Theres no star rating on this refrigerator",
            "A:It’s left side is freezer and right side is refrigerator. This is not a convertible product.",
            "A:Does not require stabilizer, it already has an inbuilt stabilizer",
            "A:covered",
            "A:inbuilt stabilizer",
            "A:Net internal depth is 40cm for trays. Net depth for vegetable box is 48cm",
            "A:No, not with this model.",
            "A:no",
            "A:its same",
            "A:Around 350 to 450 units based on your usage (door openings).",
            "A:Absolutely no problem in fitting it in a standard lift with capacity of 8 people. There is no need to dis-assemble the unit",
            "A:yes",
            "A:Yes",
            "A:There is a lock feature for buttons inside.",
            "A:No. I didn't find",
            "A:5 star very good fridge and lot of space and nice cooling effect too. Spacious",
            "A:I think it is 70:30 ( + or - 5)",
            "A:Around 3 to 5 Units",
            "A:In any freeze stand is not recommended by company. No need stabilizer."
        ],
        "likes": [
            "12",
            "14",
            "23",
            "3",
            "2",
            "4",
            "3",
            "1",
            "1",
            "2",
            "1",
            "2",
            "2",
            "2",
            "1",
            "1",
            "12",
            "45",
            "11",
            "44",
            "14",
            "3",
            "2",
            "5",
            "3",
            "2",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "1",
            "2",
            "8",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "1",
            "20",
            "2",
            "24",
            "5",
            "0",
            "0",
            "8",
            "2",
            "3",
            "0",
            "0",
            "0",
            "1",
            "10",
            "0"
        ]
    }
}