{
    "title": "MarQ By Flipkart 338 L Frost Free Double Door 2 Star Convertible Refrigerator  (Sliver Steel, 340JF2MQDS)",
    "product_specification": {
        "In The Box": "1 Refrigerator Unit, User Manual, Egg Tray, Ice Box",
        "Type": "Double Door",
        "Refrigerator Type": "Top Mount",
        "Defrosting Type": "Frost Free",
        "Compressor Type": "Inverter Compressor",
        "Capacity": "338 L",
        "Number of Doors": "2",
        "Star Rating": "2",
        "Coolpad": "No",
        "Toughened Glass": "Yes",
        "Built-in Stabilizer": "Yes",
        "Convertible Refrigerator": "Yes",
        "Shelf Material": "Toughened Glass",
        "Handle Type": "Recessed",
        "Door Finish": "PCM",
        "Gasket Type": "PVC Antibacterial Gasket",
        "Door Alarm": "No",
        "BEE Rating Year": "2021",
        "Stabilizer Required": "No",
        "Refrigerator Interior Light": "Yes",
        "Egg Tray": "Yes",
        "Number of Crispers": "1",
        "Freezer Tray Type": "Ice Box",
        "Ice Cube Tray Type": "Ice Twister",
        "Launch Year": "2020",
        "Net Total Capacity": "309 L",
        "Cooling Refrigerant": "R600a",
        "Other Features": "360 Degree Food Freshness, Multi Air Flow Technology, Coldest Freezer Temperature, Turbo Chill Technology, Silver Ion Based Deodorizer, 100 - 290 V Voltage Range, Easy Glide Drawer for Easy Operation, Internal Load Sensor, Door Usage Sensor, Ambient Temperature Sensor, 6 Step Inverter Compresser, Soft LED Light, 0 ODP",
        "Net Height": "1747 mm",
        "Net Depth": "681 mm",
        "Net Width": "600 mm",
        "Weight": "56 kg",
        "Installation & Demo": "Explain all the functionality of the product||Flipkart will facilitate Installation & Demo at time of your convenience from a brand authorized service engineer||All additional accessories which are not part of the the package will be charged separately||Flipkart will communicate the day and time slot of the scheduled Installation & Demo through a SMS and the same information will also be available in your order details page||Please note that any unauthorized handling or self-installation of the product will lead to return & product warranty being void.||The Installation & Demo service will be provided free of cost.",
        "Warranty Service Type": "Technician Visit",
        "Warranty Summary": "1 Year Warranty on Product and 10 Years on Compressor Warranty From MarQ by Flipkart",
        "Covered in Warranty": "All Parts Excluding Plastic Parts, Glassware, Bulb and Tube from the Date of Purchase Against Defective Material and Workmanship",
        "Not Covered in Warranty": "Parts: Plastic / Glassware / Bulb / Tube. Any Accessories External to the Product. The Product is Not Used According to the Instructions Given in the Instructions Manual. Defects Caused by Improper Use as Determined by the Company Personnel. Modification or Alteration of Any Nature made in the Electrical Circuitry or Physical Construction of the Set. Site (Where the Premises is Kept) Conditions That do Not Confirm to the Recommended Operating Conditions of the Machine. The Serial Number is Removed, Altered or Obliterated from the Machine. Defects Due to Cause Beyond Control Like Lightening, Abnormal Voltage, Acts of God or While in Transit to the Service Centres or Purchasers Residence."
    },
    "product_description": {
        "Large Capacity": "This refrigerator’s 338 L capacity makes it suitable for a family of three to five members. So, all the leftovers, veggies, and much more can be easily stored without any hassles.",
        "Frost-free Cooling": "Thanks to this refrigerator’s frost-free cooling feature, it auto-defrosts the freezer to curb ice buildup. So, you can freeze meat, peas, cold cuts, and much more without ice.",
        "": ""
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "1",
            "4",
            "3",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "1",
            "4",
            "3",
            "1",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "1",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "1",
            "2",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "2",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review": [
            "Surely its a best product in this price range far better than brands like samsung the best feature of this product is its cooling capacity which is just fantastic and its design and storage capacity is also good just go for it its technology partner is panasonic which is in itself a renowned brand",
            "Very good product value for money and very good design and colour I like this product thanks for Flipkart and delevry boy was very good and demo boys performec was good I need Bihar sharif in supporting coustmor care any problem this product I need call you help this any problem other was good thank for very very Flipkart",
            "Good frost free refrigerator at this budget range.\n1. Design and colour is good but not excellent. No other colour option.\n2. It does the performance so for.\n3. Interior build quality is good.\n4. Very less noise or no noise during compressor is on.\n5. Storage space is decent for 3-4 family members\nThanks for the flipkart for the best deal.",
            "A nice silent sturdy product at a very budget friendly price, the only fault being that both the doors do not close automatically and needs to be closed manually with a push. Installation was fast within 24 hours and both delivery and installation staffs were very courteous.",
            "COLLING OF REFRIGERATOR GOOD & RIGHT .COLOUR IS LOOK VERY GOOD . CAPACITY IS VERY GOOD. HANDLE OF REFIGERATOR IS VERY GOOD FROM WITHIN REFIGERATOR.\nICE COMPARTMENT IS VERY GOOD & CAPACITY OF ICE COMPARTMENT IS VERY GOOD.\nSHELF IS VERY THIN .SHELF NEED TO IMPROVE\nNEED TO IMPROVE BOTTLE SECTION OF REFIGERATOR.BUT THEIR IS NO BIG BOTTLE(2LI) SECTION.",
            "If you want an silent device. This is the best choice. It's cool design is loving .\n\nVeg basket is impressive.\n\n\n\nIt can earn 100/100 if it have a door lock.\n\n\nIt is good device . I can bet if anybody can tell when it compressor is on or off by standing near.\n\nNo noise even in night too.",
            "Very nice refrigerator,no voice,large vegitable basket, overall space wise comfort for 5-6 family members to use... thanks, very good service by Jeeves during call/installation",
            "exchange value can be decrease but shouldn't been cancelled totally.\n\nexchange system is very bad.",
            "Efficient cooling, almost noiseless, but average looking. Overall good for the price",
            "Wowwww it's Amazing!",
            "Surely its a best product in this price range far better than brands like samsung the best feature of this product is its cooling capacity which is just fantastic and its design and storage capacity is also good just go for it its technology partner is panasonic which is in itself a renowned brand",
            "Very good product value for money and very good design and colour I like this product thanks for Flipkart and delevry boy was very good and demo boys performec was good I need Bihar sharif in supporting coustmor care any problem this product I need call you help this any problem other was good thank for very very Flipkart",
            "Good frost free refrigerator at this budget range.\n1. Design and colour is good but not excellent. No other colour option.\n2. It does the performance so for.\n3. Interior build quality is good.\n4. Very less noise or no noise during compressor is on.\n5. Storage space is decent for 3-4 family members\nThanks for the flipkart for the best deal.",
            "A nice silent sturdy product at a very budget friendly price, the only fault being that both the doors do not close automatically and needs to be closed manually with a push. Installation was fast within 24 hours and both delivery and installation staffs were very courteous.",
            "COLLING OF REFRIGERATOR GOOD & RIGHT .COLOUR IS LOOK VERY GOOD . CAPACITY IS VERY GOOD. HANDLE OF REFIGERATOR IS VERY GOOD FROM WITHIN REFIGERATOR.\nICE COMPARTMENT IS VERY GOOD & CAPACITY OF ICE COMPARTMENT IS VERY GOOD.\nSHELF IS VERY THIN .SHELF NEED TO IMPROVE\nNEED TO IMPROVE BOTTLE SECTION OF REFIGERATOR.BUT THEIR IS NO BIG BOTTLE(2LI) SECTION.",
            "If you want an silent device. This is the best choice. It's cool design is loving .\n\nVeg basket is impressive.\n\n\n\nIt can earn 100/100 if it have a door lock.\n\n\nIt is good device . I can bet if anybody can tell when it compressor is on or off by standing near.\n\nNo noise even in night too.",
            "Very nice refrigerator,no voice,large vegitable basket, overall space wise comfort for 5-6 family members to use... thanks, very good service by Jeeves during call/installation",
            "exchange value can be decrease but shouldn't been cancelled totally.\n\nexchange system is very bad.",
            "Efficient cooling, almost noiseless, but average looking. Overall good for the price",
            "Wowwww it's Amazing!",
            "Initially it was working good, but as the summer temperature increased outside, its cooling effect gone down. Freezer is not working, it took 12 hrs to make ice",
            "I have purchased it in winter sale (around 15000rs).\nI think fridge is worth of every penny.\nVegetable storage is very big.\nI am very happy.\nAnd did not know about marq service quality but hope for good.\nI am very satisfied with fridge.",
            "Best refrigerator in low price. Freezer has lot of space and totally it has lot of space",
            "V good",
            "Very good fridge with good capacity. I have bought two pieces. Both are working fine. Delivery and installation is also quick. Must buy in this price range.",
            "Superb Cooling",
            "Good product 👍",
            "Very good cooling,major advantage is no frost in cooling chamber. Delivery boy is very punctual Delivery at actual time also behavior is very good. Installation service also good. Thnks to flipkart.",
            "V goog",
            "My ishu is not sol",
            "Water bottle space is bad",
            "Worst product...freezing is not at all working. Don't buy it.. We replaced..",
            "Not at all good product don’t buy this product",
            "Good",
            "Current consumption is larger than thay said",
            "Best and resnable cost",
            "Very good refrigerator value for money",
            "The Performance, Look and all other aspects is at its best. Have purchased two products of the same capacity - 338 L. Very satisfied.",
            "Ok but thanks",
            "Very good in looking ... excellent condition",
            "Very nice",
            "Awcsome after using for 1 month, no sound, low cost and nice look. Worth to buy. Thanks flipkart for wonderful product",
            "Worth its price",
            "Product seems good, finishing is oky not superb, budget refrigerator, trey size short is drawback, sometime sound loud.\n1 yr product warranty and 10yrs compressor.\nOverall average product",
            "I have already refrigerator but the capacity of old refrigerator is small for our family then I think to buy a big refrigerator 340 litre and I search on Flipkart I saw this product the design and the feature was value for money so that why I buy the product and I also read the review of other owner the review of the product is also good so I buy\nDon't think go for it value for money product the design is also good",
            "Good",
            "Very good product. It's ditto Panasonic fridge with Marq branded, so go for it without any doubt. I love the space, quiet operation and convertible function.",
            "Very good product and value for money.thanks Flipkart",
            "It’s not convertible, freezer doesn’t work as Refrigerator. Don’t waste your money",
            "Value for Money",
            "Poor product, have lots of issues. Raised so many complaints again and again",
            "Prouuct is ok,bt most imbrancing is that i was unable to get warrenty from service center,ok lets c hope for the best.",
            "Good buy,worth buying for every penny",
            "Superb performance excellent price\nYou must use it",
            "Nice",
            "Good choice for double door at this price",
            "Great product with good space , easy to handle, less noise, decent look",
            "Best in segment, price.",
            "2nd door not perfect cooling. Its a wrost one. Please clear the problem immediately",
            "After usage of 3months it's running awesome ... Performance is too good and capacity is too good ...thanks to flipkart ...",
            "Performance is good, but we have received damage (dent) item",
            "Nice product",
            "Just awesome",
            "Great refrigerator. spacious, lot of innovative features. Great delivery service by Flipkart. Value for money fridge. Strongly recommend if anyone is looking for an upgrade.... go for it.",
            "Super fridge ....awsome cooling .. ice in just 20 min",
            "it's good i like it most",
            "Good quality",
            "The product was delivered before time.. but installation took more than 20 days.. which was a big dissatisfaction.. having to look at a packed box for 20 days is frustrating.. if you try and install it yourself you risk voiding the warranty.. anyway once it was installed the product is Great..\n\nI only have one negative.. that is the ice tray.. this is a really big design flaw.. the ice cube tray has to be lifted off the ice box for any kind of functionality..\n\nOtherwise everything eles is awesome..\n\nPurchased it for my parents and they are extremely happy..\n\nJust go for it..",
            "Product is really Good.. We are fully satisfied..\n\nThe demo Guy Tuhin is very nice person.. very knowledgeable.. Polite.. He explained each & everything very nicely.\n\nOverall experience is Superb...",
            "Using it from the last 1month. No issue noticed. Running quite good.",
            "Ok product.thats it. This is not a better option if u r looking for above 15 k",
            "My first fridge was voltas and the second one was kelvinator..bith of them had very much noise while operation out of which voltas had too much....this fridge is of panasonic technology...and is the best out of the three when the operational noise is compared.",
            "good product",
            "Maout fridge in this price 💥",
            "Good",
            "Bit need to change tat upper storage",
            "Amazing\nPrice is everything\nPerformance is more than what I expected\nGood fridge",
            "Freeze seems to be okay... But the behaviour of delivery persons and the installing guy is excellent as they are caring and very polite",
            "Awesome product by flipkart..",
            "Thanks flip cart, nice product",
            "Very good product",
            "Super\nGood quality refrigerator",
            "Magnificent Product 👍",
            "Good refrigerator in this price",
            "Best quality",
            "Good products delivered by flipcart.\nIt's cool working nice. thank you flipcart.",
            "Super ....Thank you Flip kart.....",
            "Awesome fridge, go for it. Value for money. Performance is also good .",
            "Nice product....value for money",
            "Nice",
            "Good in this budget.i suggest to review on Looks of the fridge as they can provide some mirror finish",
            "A Very Good Product , At A Very Good Price , Thanks To Flipkart ...",
            "Its very very nice you can go for it its very nice",
            "Delivery in time\nMax storege\nBeautiful finishing\nVery good.",
            "Good",
            "Great design with excellent colour.value for money",
            "Good product I like it. It's just superb",
            "Overall nice fridge with nice cooling",
            "Overall good, refrigerator capacity can b improved in stead of a bit higher freezer capacity",
            "Good quality and design also 👌",
            "Thank you Flipkart. It's good in this range I love it.",
            "Damn nice.",
            "Really great product. Cooling is super fast. Look and feel is also great. Installation was also done in timely manner.",
            "I love it's look and performance",
            "Compared to other branded Refrigerators of the same capacity, it is reasonably priced. Time will reveal its durability. Satisfied.",
            "Very good product.",
            "Best products by marq",
            "Product was so good",
            "Simply superbbb",
            "Best product to the family. MarQ love you for performance.",
            "Perfect refrigerator in this price. Built-in quality is great. Got for it without any hesitation.",
            "Good product in this price",
            "Good product",
            "The quality of product is very good. Must buy the product.",
            "Good product"
        ],
        "likes": [
            "28",
            "44",
            "45",
            "8",
            "3",
            "0",
            "0",
            "15",
            "40",
            "24",
            "28",
            "44",
            "45",
            "8",
            "3",
            "0",
            "0",
            "15",
            "40",
            "24",
            "5",
            "15",
            "7",
            "4",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "3",
            "14",
            "13",
            "2",
            "4",
            "0",
            "0",
            "0",
            "4",
            "4",
            "3",
            "14",
            "13",
            "2",
            "4",
            "0",
            "0",
            "0",
            "4",
            "4",
            "0",
            "6",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "2",
            "5",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Outerlet pipe is there",
            "Q:What is the freezer's capacity (size) ?",
            "Q:It is convertible freedge ?",
            "Q:It's is converted freezer or not of deefridge",
            "Q:which compressor is used in this product",
            "Q:Is there light option in both fridge and freezer?",
            "Q:Is this a 300L or 338L?",
            "Q:Is this referigrator has single or double coil?",
            "Q:Deep frizer capacity",
            "Q:What is the working Voltage range",
            "Q:What about fridge noise ?",
            "Q:What is length of the Power Cord?",
            "Q:Inverter in bilet",
            "Q:After defreeze water gets automatically vapourize?",
            "Q:How to discard water from the chamber at the backside of the fridge?",
            "Q:How many Watt? Power consumption",
            "Q:Which refrigerator would be preferable samsung 253 L 3 star or marq by Flipkart 308 L 3 star ?",
            "Q:Power supply 15 amps or 5 amps?",
            "Q:Is stabilizer needed for operation?",
            "Q:Is this 3 in 1 convertor or 5 in 1?",
            "Q:Is it has child safety lock?",
            "Q:Are egg trays available in the Refrigerator?",
            "Q:What is the size of the Vegetable Drawer?",
            "Q:Does it have inbuilt light?"
        ],
        "answers": [
            "A:yes",
            "A:308 ltrs",
            "A:No",
            "A:No it is not convertible",
            "A:inverter",
            "A:No only in Fridge, no light in freezer",
            "A:338L",
            "A:double coil",
            "A:5Ltr",
            "A:The unit can run in the voltage range of 100~290V",
            "A:It has less than 40 dB sound level",
            "A:it is more than 1.5mtr",
            "A:No, they said stabiliser free operation, but on Fridge they laid a sticker saying please use a stabiliser",
            "A:Yes, Auto defrost.",
            "A:As per my knowledge Thiss a FrostFree Refrigerator & No Water discarding is required for this",
            "A:40",
            "A:Preferred Marq by Flipkart 308 L 3 star Refrigerator. It hyas more space than Samsung 253 L . The interior design is attractive. Liked it.",
            "A:it will Work in normal 5 amp switches smoothly",
            "A:no need",
            "A:5 in 1",
            "A:No.",
            "A:Yes",
            "A:The Vegetable 34L Capacity",
            "A:Yes"
        ],
        "likes": [
            "11",
            "16",
            "7",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "24",
            "26",
            "26",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "3",
            "16",
            "6",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "3",
            "6",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0"
        ]
    }
}