{
    "title": "Infinix INBook X1 Core i3 10th Gen - (8 GB/256 GB SSD/Windows 11 Home) XL11 Thin and Light Laptop  (14 inch, Starfall Grey, 1.48 kg)",
    "product_specification": {
        "Sales Package": "Laptop, Power Adaptor, User Guide, Warranty Documents",
        "Model Number": "XL11",
        "Part Number": "71008300050",
        "Model Name": "INBook X1",
        "Series": "INBook X1",
        "Color": "Starfall Grey",
        "Type": "Thin and Light Laptop",
        "Suitable For": "Everyday Use, Performance, Processing & Multitasking",
        "Battery Backup": "Up to 13 hours",
        "Power Supply": "65 W AC Adapter",
        "MS Office Provided": "No",
        "Dedicated Graphic Memory Type": "DDR4",
        "Processor Brand": "Intel",
        "Processor Name": "Core i3",
        "Processor Generation": "10th Gen",
        "SSD": "Yes",
        "SSD Capacity": "256 GB",
        "RAM": "8 GB",
        "RAM Type": "LPDDR4X",
        "Processor Variant": "1005G1",
        "Chipset": "Intel Core i3",
        "Clock Speed": "1.2 GHz Max Frequency Upto 3.4GHz",
        "Memory Slots": "1",
        "Graphic Processor": "Intel Integrated UHD",
        "Number of Cores": "2",
        "OS Architecture": "64 bit",
        "Operating System": "Windows 11 Home",
        "Supported Operating System": "Windows 11",
        "System Architecture": "64 bit",
        "S-video": "No",
        "RJ11": "No",
        "Mic In": "Yes",
        "RJ45": "No",
        "VGA Port": "No",
        "USB Port": "1 x USB 2.0, 2 x USB 3.0",
        "HDMI Port": "1 x HDMI1.4",
        "Hardware Interface": "PCIE 3.0",
        "Touchscreen": "No",
        "Screen Size": "35.56 cm (14 inch)",
        "Screen Resolution": "1920 x 1080 Pixel",
        "Screen Type": "Full HD IPS Display ( 300nits peak brightness, 100% sRGB, NTSC 72%)",
        "Speakers": "Built-in Speakers",
        "Internal Mic": "Built-in Dual Microphone",
        "Sound Properties": "DTS Audio Processing",
        "Bluetooth": "v5.1",
        "NFC Support": "No",
        "Dimensions": "323.5 x 219.5 x 16.3",
        "Weight": "1.48 kg",
        "Disk Drive": "Not Available",
        "Web Camera": "720P HD",
        "Finger Print Sensor": "No",
        "Face Recognition": "No",
        "Keyboard": "Backlit Keyboard",
        "Backlit Keyboard": "Yes",
        "Laptop Bag": "No",
        "Additional Features": "Microsoft Office 365 with one month free trial",
        "Warranty Summary": "1 year Onsite Warranty",
        "Warranty Service Type": "Onsite",
        "Covered in Warranty": "Manufacturing Defects",
        "Not Covered in Warranty": "Physical Damage",
        "Domestic Warranty": "1 Year"
    },
    "product_description": {
        "Sleek and Stylish": "Designed with an aircraft-grade aluminium finish, the full-metal Infinix INBook X1 Core i3 Laptop will grab eyeballs wherever you go. And, thanks to its sleek 16.3 mm body and overall weight of merely 1.48 kg, this laptop is easy to take with you even when you’re on the move.",
        "Fast Charging": "Equipped with a 65 W multi-utility USB Type-C fast charger, this laptop can be efficiently charged up to 70% in just up to 55 minutes. And, the USB Type-C charger can also be used to charge your smartphone, which eliminates the need to carry a separate charger for your mobile phone and laptop, adding to your convenience.",
        "Long Playback Time": "You can watch videos for up to 13 hours without having to stay tethered to a power outlet, courtesy of this laptop's 55 Wh long-lasting battery capacity. This way, you can easily work on your deadlines, complete assignments, and binge-watch your favourite TV shows.",
        "Full HD Display":"Sporting a 35.56 cm (14) FHD display along with 100% sRGB Color Gamut and a peak brightness of 300 nits, this laptop ensures precise, sharp, and clear colours. In addition, its sleek bezel lets you enjoy a wide view for an engaging viewing experience.",
        "High-speed Performance":"The combination of a high-performance Intel Core processor chip, high RAM size, and sufficient storage capacity allows you to seamlessly multitask with minimal lag. Moreover, this laptop’s NVMe PCIe 3.0 SSD facilitates rapid boot times, game-loading, and data transfer, lending you a seamless experience.",
        "Windows 11 Operating System":"Integrated with a pre-installed Windows 11 Operating System, this laptop lets you access a host of handy Windows services and tools. Furthermore, its advanced UI lets you complete multiple tasks with ease.",
        "Privacy Protection":"In case there are any spyware apps and software in this laptop, the hardware-based privacy switch turns off the mic and camera, ensuring optimal safety.",
        "Backlit Keyboard":"Boasting a backlit keyboard, this laptop lets you type comfortably even when you’re using it in an environment with low light. Also, its illuminated keys offer this laptop an elegant look.",
        "DTS Audio Processing":"The DTS Audio Processing feature of this laptop delivers rich sound for a realistic listening experience. Moreover, equipped with four speakers, this laptop lets you experience 360-degree surround sound, ensuring an immersive audio experience."
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "1",
            "1",
            "4",
            "4",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "2",
            "1",
            "4",
            "1",
            "5",
            "1",
            "4",
            "4",
            "3",
            "1",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "1",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5"
        ],
        "review": [
            "No other laptops can't beat this, at this price segment ⚡⚡⚡✨✨✨✨\n✨Display - Best\n✨Build - best in this segment ( except ports )\n✨Battery backup : 6 - 8 hours for normal usage in 80% brightness with WiFi\n✨ Fan noise almost equal to zero as mentioned by company\n✨ For students its specifications are more than enough\n✨ Windows 11 runs very smoothly on i3 10th gen also\n\nLet's see how is the infinix after sale service !",
            "First of all the design is superb. Its compact and looks sturdy. The body gives the feeling of a premium laptop.\nThe display is excellent. 100% sRGB with 300nits brightness. Not even the top laptop brands are giving that in this price range.\nKeyboard is OK with backlit. The backlit is not even through out but it's justifiable.\nSpeakers are really loud. You won't have any problem in watching movies. Listening to music is another joy.\nBattery is superb. I used the laptop for more than 4hrs and there is still 43% battery remaining.\nPorts are decent in number but they are a little bit tight but not a deal breaker.\nCharging speed is very good with type C to type C cable.\n8GB Ram and 256GB NVMe ssd combination is good. It comes with i3 10th gen dual core processor which is sufficient for normal tasks like web browsing, online classes, office apps, watching movies etc.\nNot suitable for playing games.\n.\nThis is my review after 1 day of use. This laptop is highly recommended for basic tasks.\nDon't let the brand name fools you. It's a very good product.",
            "1.First Flipkart Love it ❤️ Very Fast Delivery 🚚\n\n2.Design a no.1 top notch👌\n\n3.Display viewing Angle its Good 👌\n\n4.Battery Good 👍\n\n5.Performance It's Good 👌\n\n6.Price Very Good 👍\n\n7.Overall Good Price and Nice Laptop ❤️\n\n8. The Trackpad Performance. Is Very 😔 bad😡\nAny Time 3to5 time's tuch do it's a bad one\n\n\nThis price point 👉 good 👍❤️",
            "The design and build quality seems premium. The size is smaller than average laptops as it is 14inch. Note that it is made in China, although the brand is of Hong Kong.\n\nThe keyboard is very easy to use and spacious. Track pad is good but the trackpad buttons sometimes need to be pressed 2-3 times to click.\n\nSame goes for the power button, it never turns on in a single press. The power button light is also blue which for me is very difficult to notice. It should have been normal white light.\n\nThe screen is nice. Sound is superb. Lightweight and small size are good for portable use.\n\nThe laptop lid cannot be opened with a single hand. Use one hand to keep the laptop base down and other hand to open the lid.\n\nThere are sufficient ports to use but no CD drive. The charge cable received is type-C, but the cable is not very long. Also there is one AC power port which i dont know how to use as there is no cable provided for it. If someone knows then please tell me.\n\nOverall it is good. The only problems i have are with the trackpad buttons and power button.",
            "⭐️⭐️⭐️⭐️\nDesign- Good 😊\nBuilt Quality- Good 😎\nDisplay- Good, good viewing angles, good colours, 3 side thin bezels 😎\nCamera- best in this segment 😎\nBattery backup- Good, can expect 5-6 hrs multitasking🙂\nSound- Not bad/ Not too loud🙂\nTouchpad- Could be better😔\nWindows 11- Runs Smoothly😎\nSSD- Boots up fast takes around 6 secs to desktop😎",
            "Ohh my god what a laptop it's brilliant.\nMy wife is so happy with this laptop its very useful for heavy software like AutoCAD,SAP etc.\nDon't think go for it...",
            "Its a very good product. Better than most in this price.\nBuild : 4.5/5 (not macbook level, but great indeed)\nscreen : 4.5/5\nspeakers : 4/5 (loudness is great but not clarity)\nperformance : 4.5/5\nstorage speed : 4/5 (upto 6Gbps)\nbattery: 4/5 (around 8 hours)\nkeyboard: 4/5 (key treble could have been better)\ntrackpad : 5/5\ncharging speed : around 90 minutes",
            "They not provide the support we have face some problem in our system. I have tried to contact for support in Infinix official website. But we are not able to reach to support team.\n\nSo my concern is this product is good and also very good design and worth for money. But after purchase definitely we need service provider or support contact.\n\nIf you have near by infinix service center you can purchase this product 👍.",
            "I'm writing this review after two months of usage. laptop in this range is worth for every penny I've spent on this it's really a awesome laptop the design, performance, price everything is worth buying, I suggest you to buy this budget laptop",
            "Super budget core i3 laptop.\n\nDisplay....5/5\nBuilt Quality....5/5\nBattery.....4.5/5\nHeating issue...5/5\nPerformance...4.1/5\nWeight....4.5/5\n\nThanks infinix. 🙏",
            "Best laptop",
            "Nice Laptop 👍",
            "What a look 😍and design",
            "Laptop is cool, it's performance is good and sound and display is also good.",
            "I had think about this laptop for more than about 100 times but in this price range this laptop is more good than its price .it is totally worthy",
            "Best Laptop in this price segment ❤️",
            "Just loved it ❤️",
            "Best performance, battery 🔋🔋🔋 awesome",
            "Very happy",
            "Received yesterday and charging stopped within 1 hour.\nChecked all the settings. Charger was too Hot and had some burned smell. It seems the accessories are used of low quality",
            "I'll give it 5 stars ⭐⭐⭐⭐⭐",
            "Tq Flipkart this laptop so amazing at this price range\nBattery capacity is to good and camera is 3/5 not bad but good at this segment",
            "Battery 10/10🔋\nSound 10/10 🔊\nBass 8/10\nPerformance 8/10\nDisplay 9.2/10 🖥️\nCharging time 1 hour\nKeyboard 8/10\nCamara 9.1/10\nNo heating normal task\nBrightness & colour amazing\nBody is 100% metalic\n😍😍😍😍",
            "Nice",
            "Best laptop at this price level, Best thing in this laptop is it's display. Loved it ☺️",
            "performance 5 out of 5\nbattery 🔋 5 out of 5\ndisplay 5 out of 5\nvalue for money 5 out of 5",
            "Found the charging problem in a 1st week",
            "After 5 to 10 days charger is not working......And most ridiculous not support any C type charger with this Laptop.....Very Sad",
            "i got laptop today ... and its not charging ... charging stoped ... manufacturing defect",
            "Good",
            "It's, good only for browsing, study and normal use..\n3i .....",
            "This is a very good laptop. Anyone who wants to buy a laptop in those price segment for those this is a very good choice. I purchesed this laptop in 35999. My user experience on this laptop is very good.👍👍👍",
            "Super",
            "Charging issue..",
            "This product is most likely .this is very good at long time battery backup",
            "Very good product. Design and performance are so good. Battery backup is also good.👍👍",
            "Good laptop at its price segment",
            "excellent\ngood battery\ngood display\nkeyboard working smoothly\nno heating problem\nfast charging\nresponse time fast\nOver all Good Choices",
            "Got it at 36k & totally value for money but can't say about after sale service.",
            "Battery not charging aftr 5 days",
            "Some keyboard buttons are not working and no customer care support from the first day.",
            "I received the product in 20th December. As i tried to charge, i noticed that there was electricity leakage and I couldn't charge full as it heating up badly. Thinking that this will go away. Today, I tried using Belkin extension, the same issue repeated again. Electricity current leakage and extreme heat which doesn't allowed me to charge. Mine is grey color.",
            "It's one month review...no heating issue,perfect connectivity,perfect sound,perfect display,perfect built,superb battery,nice charging ....over all perfect perfect",
            "Charging problem",
            "Value for many product 👌👌",
            "My infinix laptop not working",
            "Hot deal 👍🔥🔥🔥",
            "Good:\nCharging is good\nScreen is best.\nMusic is awesome.\nBattery life is good.\nBad:\nSometimes it doesn't charge.\nRest is good\nValue for money",
            "Value for money...\nBest in the market in this price range\nBut adaptor is defective... Leaking shock during charging",
            "Windows crashed couldn't use even once",
            "Best laptop 💻 in this price\nBest performance\nBest design\nBest battery backup",
            "very nice product\n1- Display- 5*\n2- Design & Quality- 5*\n3- Battery- 5*\nNothing better than this for this price\nI have given all these reviews after using this laptop for 5 days.",
            "Its osm\nAfter 15 day use feedback\nIts amazing power\nThis price range osm\nFull metal body",
            "I bought a laptop it's not working power on button also damaged",
            "Best laptop in this price range.",
            "Iam satisfied 😊 and wonderful laptop , don't think go for it",
            "Very bad product , useless product, Battery is not charger after use of 7 days. How it is solve?",
            "This is good laptop. Value for money. But it should be made in indian",
            "I love it ❤well booting time and performance also very well,🎊👌 display is quality is very good n overally very best laptop in this price👍🤘",
            "Earlier I received a defected one but replacement experience was really good.. thanks to flipkart for this amazing product",
            "perfect",
            "After 10day use there is noise on one side of the speaker bad",
            "Very good products",
            "• Metal Finish, Ultra thin Bezels, Light Weight\n• Backlit Keyboard, Full HD Display, Webcam&Mic ON/OFF button\n• Windows 11 out of the Box.\n• Recommended",
            "Overall safisfied with the product.",
            "Worst product waste of money. The mouse pad was not working properly. After using 1 month battery life is worst. Pls go for good laptops, dont waste your money in Trash product.",
            "I had a fear in this company because I bought infinix product frst time . But it's a awesome l love it. Nice bild quality and everything exlent ....",
            "If you want a laptop for general purpose and can't decide which one to buy then buy this you won't regret",
            "So far so good. Didn't really see any performance issues.🍋🌳",
            "Awesome work by infinix loved it",
            "Working very fine. Budgeted laptop. Totally satisfied",
            "While charging thin current is passing on the body of laptop",
            "Extraordinary\n\nGo for it without thinking",
            "Best laptop in this price range and the best things is providing backlight keypad in this price range , very light and display quality is spectacular",
            "Very good quality Infinix Laptop\nThank you Flipkart On time delivery in Flipkart",
            "Build quality is not good keyboard",
            "I like the product I'm frm Kashmir ......\n\nI love the laptop but the most irritating part is it has no LAN port\n\n\n\nSo if u have to connect it with wifi\n\n\nYou hv to buy aftermarket usb to lan port",
            "Laptop is tooooooo goooooood",
            "Best laptop at this range .",
            "Value of money this laptop and buy this laptop good ms word and Excel not working",
            "if you are a person needs product quantity, good battery backup, premium look, portability, display and Audio quality ... what's more? .. believe me its worth.\n\n'except hard gaming' its not a gaming laptop. be realistic see what really matters.",
            "My first laptop and I loved it. Thanks Infinix and Flipkart.",
            "1 USB Port not working.",
            "Very nice👏",
            "worst product dont buy there are many fault\nas well as hangs too much\nauto screen off😭😭😭😭😭😭",
            "Never buy this laptop i got Many problems in just 10days automatically laptop gets off and after that i complained service centre but there r only 2 people on customer care and even they don't bother don't waste ur money go for realme or any other",
            "It is true beast... Value for money...\nI bought it for trading...!!!",
            "Good products",
            "It is best laptop",
            "I don't know what will happen in future but for the first time this items is totally impressed",
            "It’s just awesome.. design, built, look and speed.. all are very good 👌 worth every penny..u can go for it without any hesitation. Thanks flipkart",
            "Value for money 100/100",
            "Best laptop ever nice speed",
            "Switch sony to infinix x1 so this is my good decision.",
            "Extraordinary, fantastic, mind-blowing",
            "So good laptop",
            "value for money laptop ✴️✴️✴️✴️✴️sound and display very great full 💥💥💥 I'm happy 🥀❣️ty Flipkart ❣️",
            "Very good product",
            "Nice product value for money",
            "Awesome design, battery, performance"
        ],
        "likes": [
            "133",
            "160",
            "78",
            "53",
            "4",
            "7",
            "1",
            "1",
            "1",
            "1",
            "58",
            "127",
            "53",
            "30",
            "22",
            "37",
            "25",
            "13",
            "15",
            "14",
            "15",
            "14",
            "10",
            "11",
            "11",
            "5",
            "4",
            "6",
            "6",
            "3",
            "4",
            "4",
            "10",
            "2",
            "2",
            "3",
            "2",
            "3",
            "5",
            "31",
            "6",
            "21",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "4",
            "2",
            "3",
            "3",
            "5",
            "2",
            "2",
            "1",
            "1",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "1",
            "1",
            "0",
            "0",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1"
        ],
        "dislikes": [
            "13",
            "24",
            "35",
            "13",
            "1",
            "4",
            "0",
            "0",
            "4",
            "0",
            "4",
            "15",
            "5",
            "3",
            "2",
            "5",
            "4",
            "1",
            "2",
            "2",
            "2",
            "2",
            "1",
            "2",
            "2",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "5",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "26",
            "3",
            "19",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "1",
            "0",
            "2",
            "3",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1"
        ]
    },
    "qna": {
        "questions": [
            "Q:Does it have a backlit keyboard?",
            "Q:How much is the length of charging cable?",
            "Q:Can you charge your smartphone with this laptop charger?",
            "Q:Does this laptop has upgradable storage option ?",
            "Q:Is it a metal built or plastic built?",
            "Q:How many hours of battery life can I expect?",
            "Q:What is the slimness of this device?",
            "Q:Does it have a cooling system for heating issues?",
            "Q:Does it have Micro-SD card slot? Also, headphone jack?",
            "Q:How heavy is the device?",
            "Q:Can anyone tell me why my laptop vibrating while charging ?",
            "Q:Which Windows version it is coming up with? Winodws 10 or Windows 11?",
            "Q:Can i play gta v5?",
            "Q:I can do programing and gaming",
            "Q:Does it have a fingerprint sensor?",
            "Q:Is this useful for programming and coding for students?",
            "Q:Does it have graphic card?",
            "Q:Do we have any Type-C ports in this laptop?",
            "Q:Does this laptop have webcam?? If yes then what is the quality?",
            "Q:What is the duration of the warranty?",
            "Q:Is this laptop heat much ?",
            "Q:Did it have cd player",
            "Q:Extra slot for ssd",
            "Q:Does it support hhd",
            "Q:Does it have wireless connectivity",
            "Q:Would you give laptop bag with your company",
            "Q:Is ms office lifetime free",
            "Q:Ram upgrade upto ? And SSD another slot are exit",
            "Q:Does it have a fingerprint or face recognition?",
            "Q:Dolby audio support is there in laptop",
            "Q:Is this laptop has any hing Ishu after some time ?",
            "Q:Can I use for coading",
            "Q:Is this laptop contain front camera,so that we can use in online classes",
            "Q:Does this have additional RAM and SSD slot for future upgrade ?",
            "Q:Can I instal ms office 2007? Bcz it showing error during installation",
            "Q:Can we add another Ssd with existing SSD",
            "Q:Can this laptop run games like gta5...",
            "Q:Can we update this from I3 to I5 latter period of time",
            "Q:YouTube videos editing",
            "Q:Extra slot for Hdd and ram",
            "Q:Can u use for coding and video editing",
            "Q:Can it play gta v game",
            "Q:Will it cause shock??",
            "Q:Can we download ms office?",
            "Q:Can I utilise laptop in usa",
            "Q:Is there extra empty slot for additional HDD ?",
            "Q:Is the laptop work long term?",
            "Q:How much storage is there inside?",
            "Q:Can i upgrade graphic card?",
            "Q:Can i add extra hdd",
            "Q:why it is vibrating while charging?",
            "Q:Didn't charge my laptop with type C port.",
            "Q:How much maximum ram and ssd support in this laptop"
        ],
        "answers": [
            "A:Yes, it comes with backlit keyboard",
            "A:its 1.8 metre in length",
            "A:Yes, you can charge your smartphones also (which has Type-C charging port) with the type- C cable and adaptor of this laptop",
            "A:yes",
            "A:It has a Full Metal body and is made from air craft grade aluminum alloy",
            "A:The INBook X1 series laptops is equipped with 55Wh battery capacity which can give approximately 13 hours of battery life on a regular usage- mix of daily productivity tasks",
            "A:It is just 16.3 mm slim at its thickest part and 14.2 mm at its slimmest part",
            "A:Yes, INBook X1 series laptops have very efficient in-built ICE Storm 1.0 cooling system",
            "A:Yes, it has a dedicated micro SD card slot and 2 in 1 Audio jack",
            "A:It is very light weight and weighs merely 1.48 kg",
            "A:no",
            "A:INBook X1 series laptops comes with pre-installed Windows 11",
            "A:yes",
            "A:Programming ofcourse. lite gaming is possible I guess but I have not tried gaming on this",
            "A:Yes, only i7 variant have the Ultra fast fingerprint unlock sensor",
            "A:yes",
            "A:Yes, i3 and I5 variants have Intel UHD Graphics whereas i7 variant has Intel IRIS Plus graphics which are upto 64EU",
            "A:Yes, we have 2 Type-C ports, Both can be used for data transfer and one can be used for charging",
            "A:Yes, it has 720P HD Webcam",
            "A:INBook X1 series laptops has 1 year of warranty which does not cover any physical damage",
            "A:No",
            "A:no",
            "A:no",
            "A:yes as average",
            "A:yes,wifi 5 and bluetooth.",
            "A:No",
            "A:No, but INBook X1 Series laptops comes with 1 month free trial of MS Office",
            "A:yes",
            "A:No",
            "A:there's is an app for it which you have to pay for it.",
            "A:No issues from last 6 months",
            "A:no",
            "A:Yes, this laptop contains front camera, and also have a secured switch for on/off.",
            "A:yes",
            "A:You can install upgrade version office 2010 easily use and smooth work and currently I’m using office 2010.",
            "A:yes",
            "A:hm.... but some lag",
            "A:no",
            "A:Yes! but don't give too much load. You should purchase a higher version of this laptop.Mine is 8/256 . Overall build quality is superb.",
            "A:yes",
            "A:yes u can but works slow",
            "A:No, it's for only official work",
            "A:if you are referring to electric shock , no way you are getting electric shock as the laptop works on DC direct current. The high capacity charger supplied with the laptop converts the AC to DC",
            "A:yes",
            "A:yes",
            "A:no",
            "A:yes",
            "A:256 gb",
            "A:No you cant",
            "A:Yes",
            "A:no it's Not vibrating",
            "A:There are two type c ports One is for charging",
            "A:16gb ram and 500 gb ROM"
        ],
        "likes": [
            "99",
            "104",
            "127",
            "15",
            "61",
            "19",
            "6",
            "11",
            "14",
            "9",
            "7",
            "11",
            "4",
            "5",
            "21",
            "6",
            "9",
            "5",
            "4",
            "10",
            "1",
            "0",
            "2",
            "1",
            "2",
            "0",
            "11",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "16",
            "15",
            "14",
            "4",
            "2",
            "1",
            "1",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1"
        ],
        "dislikes": [
            "13",
            "20",
            "31",
            "1",
            "16",
            "3",
            "1",
            "3",
            "3",
            "1",
            "1",
            "5",
            "0",
            "1",
            "18",
            "1",
            "7",
            "2",
            "2",
            "13",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "48",
            "3",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "5",
            "6",
            "7",
            "0",
            "0",
            "0",
            "3",
            "4",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "2"
        ]
    }
}