{
    "title": "ASUS ROG Strix G Core i7 9th Gen - (16 GB/1 TB HDD/256 GB SSD/Windows 10 Home/4 GB Graphics/NVIDIA GeForce GTX 1650/60 Hz) G531GT-AL041T Gaming Laptop  (15.6 inch, Black, 2.4 kg)",
    "product_specification": {
        "Sales Package": "Laptop, Power Adaptor, User Guide, Warranty Documents",
        "Model Number": "G531GT-AL041T",
        "Part Number": "90NR01L3-M02860",
        "Series": "ROG Strix G",
        "Color": "Black",
        "Type": "Gaming Laptop",
        "Suitable For": "Gaming, Processing & Multitasking",
        "Power Supply": "150 W AC Adapter",
        "Battery Cell": "3 cell",
        "MS Office Provided": "No",
        "Dedicated Graphic Memory Type": "GDDR5",
        "Dedicated Graphic Memory Capacity": "4 GB",
        "Processor Brand": "Intel",
        "Processor Name": "Core i7",
        "Processor Generation": "9th Gen",
        "SSD": "Yes",
        "SSD Capacity": "256 GB",
        "RAM": "16 GB",
        "RAM Type": "DDR4",
        "HDD Capacity": "1 TB",
        "Processor Variant": "9750H",
        "Chipset": "Intel HM370 Express",
        "Clock Speed": "2.6 GHz with Turbo Boost Upto 4.5 GHz",
        "Memory Slots": "2 Slots",
        "Expandable Memory": "Upto 32 GB",
        "RAM Frequency": "2666 MHz",
        "Cache": "12 MB",
        "RPM": "5400",
        "Graphic Processor": "NVIDIA GeForce GTX 1650",
        "Number of Cores": "6",
        "OS Architecture": "64 bit",
        "Operating System": "Windows 10 Home",
        "Supported Operating System": "WIN 10",
        "System Architecture": "64 bit",
        "Mic In": "Yes",
        "RJ45": "Yes",
        "USB Port": "3 x USB 3.1",
        "HDMI Port": "1 x HDMI Port (v2.0)",
        "Hardware Interface": "SATA",
        "Touchscreen": "No",
        "Screen Size": "39.62 cm (15.6 inch)",
        "Screen Resolution": "1920 x 1080 Pixel",
        "Screen Type": "Full HD LED Backlit Anti-glare Display(120 Hz Refresh Rate)",
        "Speakers": "Built-in Dual Speakers",
        "Internal Mic": "Built-in Array Microphone",
        "Sound Properties": "2 x 1.5 W Speakers",
        "Refresh Rate": "60 Hz",
        "Wireless LAN": "IEEE 802.11ac",
        "Bluetooth": "v5.0",
        "Ethernet": "10/100/1000 Mbps",
        "Wireless WAN": "IEEE 802.11ac",
        "Dimensions": "360 x 275 x 25.8 mm",
        "Weight": "2.4 kg",
        "Disk Drive": "Not Available",
        "Keyboard": "Illuminated Chiclet RGB Keyboard",
        "Backlit Keyboard": "Yes",
        "Pointer Device": "Touchpad",
        "Included Software": "GameFirst, GameVisual, Sonic Studio",
        "Additional Features": "Li-ion Battery",
        "Warranty Summary": "1 Year Limited International Hardware Warranty",
        "Warranty Service Type": "Onsite",
        "Covered in Warranty": "Manufacturing Defects",
        "Not Covered in Warranty": "Physical Damage",
        "Domestic Warranty": "1 Year",
        "International Warranty": "1 Year"
    },
    "product_description": {
        "Functional Design": "This laptop's design has been designed inspired by ASUS's collaboration with the BMW Designworks Group and it offers cutting-edge cooling. Its sculpted shape and stealthy surfaces add more elegance to its overall appearance.",
        "Performance": "This laptop facilitates a powerful performance with the presence of the 9th Gen Intel Core-i7 processor and 16 GB of DDR4 RAM. Oh, and you needn’t worry about space either, as this laptop comes with an SSD capacity of 256 GB.",
        "NVIDIA Geforce GTX 1650 Graphic Processor": "Get set for superior graphics with this laptop, thanks to its NVIDIA Geforce GTX 1650 graphics processor.",
        "Dedicated GPU Power": "This laptop, with its dedicated GPU power, ensures easy multitasking for all your creative pursuits. The NVIDIA Optimus feature will optimize your laptop to ensure a great graphics performance.",
        "Intelligent Cooling": "With a well-ventilated exterior, dual N-blade fans, and ultra-thin fins, this laptop has everything in place to ensure efficient cooling, especially when you are gaming for long hours.",
        "Ideal Display for Gaming": "Do not miss out on your moves while gaming. This laptop’s rapid refresh rate (120 Hz), smooth graphics at high FPS, and expansive display ensure that nothing comes in between you and your game.",
        "Aura Sync": "Let the Aura Sync lights on your keypad take centre stage while you game. What's more, you can connect your Aura Sync-compatible peripherals and coordinate the colours.",
        "Keyboard Optimised for Gaming": "This laptop’s keyboard features transparent WASD caps and translucent edges to help you with your gaming needs. With the N-key rollover and Anti-ghosting technology, this keyboard lets you game more precisely. The ROG Overstroke technology registers keypresses earlier in the stroke, thereby paving the way for a responsive typing experience.",
        "Immersive Audio": "This laptop comes with the Smart Amp technology which monitors the audio output and keeps the speakers with the thermal limits, thereby enhancing its durability. As a result, the sound that is produced has less distortion, high dynamic range, more bass, and high potential output.",
        "Strong Connectivity": "The ROG RangeBoost technology establishes a stable Wi-Fi signal so that you can game without any network problems.",
        "Stutter-free VR": "Explore new dimensions of gaming with this laptop, thanks to its GeForce GTX graphics processor that ensures a smooth, low-latency, and stutter-free VR experience."
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "1",
            "3",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "1",
            "1",
            "5",
            "5",
            "2",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "1",
            "3",
            "3",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "2",
            "4",
            "5",
            "5",
            "2",
            "1",
            "1",
            "3",
            "5",
            "5",
            "4",
            "4",
            "1",
            "1",
            "2",
            "4",
            "4",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "1",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "3",
            "4",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "4",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4"
        ],
        "review": [
            "Firstly thank you very much flipkart for delivering the product on time. Ordered on 16th july and got delivered today. Product was packed perfectly as well. Now regarding the product:\n\n1. Excellent design, build quality and looks. The shining ROG logo, RGB lighting at bottom and rgb keyboard.\n2. Awsome performance of laptop. Intel core i7 9th gen with 16GB RAM is just mindblowing\n3. GTX 1650 4GB Graphics is just perfect for many new games.\n4. Dual storage ( 1TB HDD firecuda + 256GB SSD ) is awsome and perfect.\n5. Perfect display screen having 120hz display.\n6. Battery is ok. Lasts max 5hrs on light use and 1hr on heavy gaming.\n7. Speakers are also awsome.\n\n\nOverall its an excellant laptop from ASUS and highly recommended for all who planning to buy it.",
            "Overall Rating 4/5. First impression was awesome.good quality packing and good outer finish,even though its plastic its still makes you say wow when you open the box.Main attraction is the lighting in keyboard and on the sides.its simply amazing.battery life is good speed and other features are awesome. charging and hdmi and lan port are at backside of laptop thats a huge plus. Has no webcamera thats a negative and has no cd drive that doesn't matter because we dont use cds now. has a writing speed of average 100mbps thats awesome. and as in advertisement it shows only 4GB Graphics ram but Laptop actually has 8GB Ram [4 GB Nvidia GTx and 4GB Intel HD Graphics] laptop shares both rams so technically this is a 8GB Graphics Ram laptop. Sound system is supported by Dolby and this laptop has excellent Speakers,sound is superb quality. has additional battery modes apart from windows mods to help save battery and increase its life span.Asus center makes the warranty and product registrations easier. along with this laptop you will be getting 11,000 Rupees worth Games/Softwares for free as a part of promotion from intel.best laptop you can get at this price range.if you are looking for a affordable gaming laptop then this is your best choice.",
            "It is a very nice laptop with best performance and display quality is also a plus point and RGB lighting is also good.\nonly 2 Drawbacks are there...\n1) No Camera\n2) No Type C port and also right side numberpad on keyboard\nbut if u want it for performance then it is Beast..also have16gb DDR4 Ram Which is so fast..\nalso there is no storage problem 1Tb HDD..and 256 SSD (in which windows are installed and also which is very much faster)... i will say it is a must buy laptop if you are planning to buy it at this price..i purchased it during Big Billion Days at cost of 69990-/rs only..So i am very Much Happy With it......",
            "2 Month Review : The specs are i7 9th gen combined with a 16 GB Single Channel Ram, 256 SSD and 1 TB HDD. Nvidia's GTX 1650 handles almost all the graphic intensive titles pretty well.The base clock of the processor is around 2.7 Ghz and can be turbo boosted around 4.5Ghz,which is pretty much good figure.The laptop performance is absolutely great. I mainly use it for editing purposes (Adobe Premiere CC 2019) and the application works absolutely perfect without any lag or anysort of hang.I have also run games like Assassinscreed Syndicate, Maxpayne 3,GTA V, Forza Horizon 4,FIFA 20 etc, all in ultra settings and there was no frame drop at all.The battery backup is not something that you can rely on a gaming laptop,this laptop gives around 4-5 hours in silent mode and in performance you can get around 2 hours. The main thing I noticed is that the Turbo mode won't turn on until you plug it into a power source and without plugged in you won't be able to achieve the required frame rate in some games like GTA V, Witcher 3 etc. The 120hz display is an absolute bliss. But when you plug in and plug out, the refresh rate automatically lowers to 48hz which is disturbing and to turn it back to 120hz you either have to plug it in or go to display settings and change it back.The thermals are also great in this laptop.After hours of intesive gaming only the portion where the Cpu and Gpu located gets heated up, there is not much heat coming onto the keyboard.The speakers below average.The trackpad is precise, the RGB lighting combined with Armoury Crate is something great to work on and have fun.The built quality is absolutely stunning.There is only minimal(very less) flex of the screen.The keyboard is also fine but after a 2 months usage my \"backspace\" button started to sound a bit different. And for 2-3 times I heard popping sound from the speakers while booting up and it continued and then I had to restart the system, it maybe due to some bug on Sonic Sound Studio Software.i7 9th gen is an absolute beast.It's more than a budget gaming laptop,you can go for it.",
            "Good to buy\nThe specifications are totally worthy .\nexcellent gaming graphics and best FPS\nAlso good for Rendering and 3D MODELLING Software\nthis laptop gives Turbo power when plugged in charger and can enjoy gaming",
            "if u r gamer this laptop is perfect for gaming. current are famous game like hitman2, gta5, mafia3, call of duty advance warfare, etc. play smothly.... negative point~ free game offer, rubbish very poor offer...in high settings fan noise audible... and keypad heated. but these are acceptable, performance like beast, & offer price also good.i bought 74999 in this price range 16gbram, 256 ssd, and also upgradeble.. so do not think more..... like gaming just go for it.this review i submit near of 2 months after purchase",
            "I was not much into the colourful keyboard and the bottom side of the laptop until I got this laptop in my hand and experienced it in real time. the aura sync which is what asus calls the Rgb keyboard is absolutely beautiful in all of its Glory. the looks of the laptop are classy. even though the laptop is made out of good plastic, it no way feels cheap and is almost premium feeling. the hinges are meant to have a better than normal design and improve the life (yes the aren't any normal kind of hinges you see in a laptop, and it looks cool too).\nthe display of the laptop is sleek with minimal bezels and the rest of the body feels a bit bulky but nothing too much.\nthe port placement is weird , all the USB are on the same side, the charging HDMI and Ethernet are on the back which is good actually, with no ports on the right. the fans blow the air out from the back and not from sides which is also quiet good.\n\nthe display is beautiful, might not be the best like an AMOLED screen but it is quiet good and the minimal bezels do provide immersive experience, the colours are quiet good and viewing angles are great. the 120hz goodness is amazing which only works when plugged in and is on 60 hz when running on battery.\nthe keys are fine, the lack of numpad even on the trackpad is a slight bummer to me atleast.\n\nperformance wise this is a beast.\n\nit has silent , performance & turbo mode(only available when plugged)\nAbout gaming :\nI could run pubg at 70-85 FPS with auto configured settings(which was high), 55-60 fps on ultra settings & 100+ on low settings.\nfortnite runs 70+ upto 85 fps on high settings and the auto recommended settings were on epic which runs at 60 fps.\nGTA V auto configured to very high settings on most and high in few and it ran 55-65 fps, I've changed the settings to mix of medium and high and run at 70-90 fps and sometimes touches 100 or more.\n\nwhat impressed me is that no matter the game settings the laptop handled it fine (even if it had to reduce the fps by a bit) and no game ran unpleasantly with hiccups in performance or stuck. but it may happen if you run another heavy app in the background.\n\nthe cooling is fine , a lot of heat is dissipated from the laptop while in turbo mode running a heavy game or any other heavy program and the fans on turbo mode can be heard but not much so as to call it a bummer.\n\noverall this is a lovely laptop for daily use, office use, gaming, or any other high intensity purposes. the display makes browsing or media consuming a delight, the aura sync is a neat party trick (coming from a person who isn't much into such gimmicks) & this device is worth every penny you spend.",
            "the device is fantastic. the look is awesome and it performs beyond my expectations... best in this price range.. bdw got it for 87k on A certain sale... highly recommend it",
            "Pros :\nI7 - 9750h at this price point\nGreat looks even though it’s plastic made\nAsus aura sync looks great\nRuns most AAA on high ( ac odyssey - 45 fps, shadow of the tomb raider - 40 to 50 fps, dota 2 - 80 to 100 )\n120 hz\nGreat screen, good colors, great viewing angle\nGood keyboard\nFans are silent\n\nCons :\nBrightness is a bit low\nSpeakers are bad ( use headphones )\nNo webcam ( not a big deal though )\nModerate battery ( duh gaming laptop )\nRuns a bit hot while gaming ( cooling pad recommended )",
            "Great laptop go for it. the only problem is battery. better to wait for next year dussehra for good offers. It's really cool\nand wait after buying this laptop, you need to upgrade drives and software.\npros:\n1. SSD helps it to turn on fastly\n2. Trackpad and Keys precision is awesome. The finish of the keys and trackpad is way more than awesome!\n3. Nice RGB keyboard\n4. Thanks to Turbo mode. It cools laptop quickly. (works only while charging)\n5. lag free experience\n6. Included windows 10\ncons:\n1. No ms office included\n2. Some bugs in software for built-in including change in rgb lighting\n3. Battery life\n4. Sometimes screen casting would become problem\nThats it folks :)",
            "One of the finest laptop in the market. It's performance is great according to me has a 16gb ram 256 GB SSD so it works great. The appearance is one big best thing the RGB lighting in bottom of the laptop. And even the display is great. Overall I had a ever great experience with it.",
            "It's a beast if you are getting it for under 70K, Handles all the tasks smoothly. Aura lights are really cool and Asus armoury crate is packed with everything. Games run smoothly, faster installation. Battery back up is quite poor, hardly gets to 1 hour while gaming and 2 hours on general browsing. Build quality is okay, I loved the design though.",
            "Superb performance... nice build quality... Fabulous Design specially the lights... only con is just the poor battery back-up but its okay with that superb performance...",
            "First of all let me clear the fact that I am a professional banker.....I don't have a thorough knowledge about Laptops....But what I have felt about this laptop is, it's ridiculously fast, smooth, good looking and PUBG experience is ultimate on it and I am really happy owning it......I got it for Rs 78000/-.....That's all.",
            "it's been almost a month now.... works super smooth.... Powerful, sleek...... of course requires power so battery life is not much ....50 mins while gaming without plugged in for charging....1.5 to 2.5 hrs while web surfing n watching videos........N MOST IMPORTANT THING... ABOUT THE SPEAKERS VOLUME N QUALITY..... JUST GO N TURN SONIC STUDIO TO MOVIE MODE N LISTEN TO THE MAGIC.... n rest the BEAST IS AMAZING!!!!💥💥💥💓",
            "I took it on big billion day ... filpkart delivery is good ..within 10 days I got it... I was happy after looking it's design and lightings... I opened used for few days for 1hr/day ... after few days the screen went completely black ..I can see only arrow on the screen rest of the screen was black.... I restarted 2 times then everything was right... again yesterday I was watching movie on netflix suddenly I got some work so I closed the window ..The screen started shaking ...god Am fully ...\nREAD MORE",
            "I would like to start with false marketing or say they hide some facts, and one should do proper research (by proper i mean going through every bit of statement and not just go for the product description as they suggest. Well thats the mistake on my part.) The laptop is quite good. I've been playing GTA V, Farcry Primal, PUBG and performance was good.\n\nMajor con which no one will mention here is that the keyboard is not per key RGB key board, which hence just makes the keyboard effects looks like cheap grade keyboard. doesn't matter you use aura creator or anything else. I own ROG-GL12 from where i thought of importing some Aura templates i created for my keyboard which didnt work properly, and now i know they have just given LEDs to make it look like the real deal. Disappointed!!!!",
            "I loved it!! AURA lights tho❤️ Soo attractive.. Performance is awesome and there is no heating problem so far..! Perfect and a worthy laptop for money..😍 No other lap have the same specs and quality at this rate.. Loved flipkart for this 😍.. simply a BEAST❤️",
            "Best in its league.\nDisplay is more than what i expected.\nHell of a Beast in Performance.\nDesign and build is fantastic.\nThe battery performance is average but that is expected from a gaming laptop with high speed fans and cooling grids. But the good part is that still you can control the fan speed which enables the user to not waste much battery on fans when you aren't doing heavy payload work.\n\nTo sum up, i have been using this laptop for more than 8 months now, and till now it has never disappointed me in any trait.",
            "Everything about this laptop is amazing, works very well, the fans are good the design is good and overall performance is nice the problems I found worth telling are the low battery life and it either works on 120hz or 48hz refresh rate",
            "Laptop it's really good. The performance of laptop is top notch .The Armoury crate software provided by Asus is excellent i would say , you will get a good control of the laptop.The storage on the laptop is adequate enough to store your data, but if you install more games at a time , then the storage might be an issue.The gpu performs really good on this device , no issue with gpu at all. And the way they designed the laptop for heat exchange is really good.The laptop doesn't get hot unless and until you do extensive gaming .I got this laptop during big billion day for 70k.Overall it is a very good laptop.I would rate it 4/5 because i feel for this price , they would have given Nvidia geforce gtx 1660 ti gpu, and also they have skipped on usb type-c and sd card reader and a webcam.If these factors doesn't bother you , then you can straight away pick it.This is a really good choice in the market , or else if you can extend your budget then you can take a look at Predator helios 300 which has Nvidia geforce gtx 1660ti gpu , usb type-c port etc",
            "Awesome laptop with all the features you need. The build is plastic,but it's very strong. The screen is immersive,with minimal bezels. The Aura lights add a cool effect.\n\nBattery is the biggest drawback, but its the same for most gaming laptops. If you are going to use Linux,you're in for a disappointment,with just under 1.5hrs. Everything else is fine",
            "pros:\nbeast performance..no lag\ni7 9th gen 16gb ram 256 ssd + 1tb sshd.\nwindows home\n4gb graphics is enough to run all latest games\ninitially sound issues .. update the windows, drivers, software to latest version ..sound is loud & clear\ntried some heavy games it works like charm\nbacklight & aura lights\ncons:\nlook like cheap plastic\nbuild quality not strong\n(handle with care)",
            "Best product but go for 1660ti coz gtx1650 and 1660ti has bigger difference in graphics performance so better go for g731gt which is available offline but buy in ssd variant of 1tb or 512 gb ssd and go for i7 9th generation with 16gb ram and gtx1660ti 6gb graphics is the best solution if you try to add some what extra 8000rs.",
            "A very good laptop overall. The fans are very silent even at full RPM. The screen colour accuracy was not that great, maybe this is because it has less sRGB %. The build is plastic but its quite dense so no prob with that.",
            "I've been using it for 3 months now and whatever task I throw at it, It finishes it with ease without any hiccups. It really is a beast indeed. The render speeds, Gaming FPS, the refresh rate, the audio everything its complete elegance. I love it.",
            "great design great battery backup osm feature best for gaming 😎 thats laptop like a hero 😎",
            "Using it since last 50 days.\nBest laptop for this price. Got it for 70k on BBD sale.\nKillers looks. Great performace. Display is sharp and color accurate.\nBattery could have been little better.\nSpeakers are not that loud. (I use headphones 99% of time.)\n\nOverall great deal.",
            "Value for Money Product. Appreciate the looks and performance of this product. Design wise awesome!\nBattery could be a little more lasting but overall again gonna say a value for money laptop.\nKeyboard is good and durable\nRGB lighting on keyboard and bottom panel is remarkable\n1650 and i7 makes a perfect combo for a mid range gaming experience\nJust make sure you guys bought it during sales when price droped across 76-80K.",
            "The getup is really awesome. tough pad and keyboard is awesome to use.\nit works really fast and am using revit and navisworks with ease..\nthe only concern is battery. charge gets exhausted really fast and you need to plug in the charger almost after every 2 hours",
            "Amazing built quality.\nI did not recieve my intel master key, where do i find it?\nI definetly need the extra 11k worth software",
            "Beast .....Nothing to say .... loved it..... i jus brought for my 3d modelling software...... i worked well... got BIG discount .... i jus loved it...",
            "Mind blowing purchase!!! Runs GTA 5 butter smooth with ultra graphics settings!!! Excellent laptop from ASUS at this price range. It easily gets hot while gaming for more than 20-30min, though it has a in-build ultra cooling system I would recommend to use a supporting cooling pad! MUST BUY!!!",
            "dream laptop. excellent buy at that price. while I am yet to explore full capabilities the speed is awsome and very sturdy laptop. only challenge is feels heavy of you jave to carry with yiu",
            "best buy....I highly recommend this to every gamer out there.... working perfectly smooth. played Witcher 3 on ultra graphic the laptop only heated a bit but no performance lag.",
            "Great lap with absolute intense speed , must improve battery performance , overall cost worthy choice 😊",
            "Apart from poor battery, it's THE BEaST you can ask for. Killer Aura lights.",
            "Got it for 69990 in big billion day sale. Excellent laptop with such a mind blowing deal on flip kart. Lighting effects is awesome. Performance is very good. Graphics is GTX 1650. What else u need, again u can upgrade ram upto 32gb. Laptop comes with 16 gb ram. Only thing missing is webcam. Otherwise 10/10. Just go for it blindly.",
            "Everything is good on this price. Thanks to flipkart for fast delivery.",
            "I received defective product and now flipkart is not replacing this product worst experience i hv faced till now at any e-commerce site",
            "Cool in performance . Realistic graphics",
            "Excellent design. Cooling is very good. Value for money.",
            "It's a beast!! Only downside, it does not have a webcam.",
            "excellent performance",
            "gud product laptop is more fabulous 😍",
            "everything is good but there is little flex in the body",
            "my screen is bleeding poor quality product is sent\ni hate this",
            "The display is not working within 14 days of purchase. Display panel and board has complaint and has given to Asus for warranty. Very disappointing piece.",
            "No complains about the laptop, it’s amazing. My only complain is about Ekart logistics...! 100% unprofessional people working there...! Please train those guys before posting them on jobs...! Everything about the laptop of great, just go for it. Value for money..!!!",
            "it's it an awesome product for price on sale day i got it for around 69000 and it is value for money product only problem is its drain a battery fast but as it is a gaming laptop it's fine",
            "received a defective product",
            "Just three months and one of the speakers has stopped working.",
            "ABSOLUTE PERFORMANCE BEAST WITH ONE OF THE BEST DESIGN ND DISPLAYS IN MARKET(120HZ)\nBATTERY IS A BIT LOW BUT CHARGES VERY FAST.",
            "what a laptop...Its a beast..the LED below the keyboard is just amazing. Morover the performance is superb. No words to describe this beast.",
            "Good performance... But metrial is not good.. made up of plastic. Bottom plastic is very thin.. LIGHT effects are awsome.. handle with careee 😂😂😂😂😂.. over all Good",
            "Im definitely amazed by the performace of Asus Rog Strix G. The battery backup is not much after a full charge , may be around 2-3 hours but I wouldn't complain looking at the performance ,as its a gaming laptop.",
            "laptop is awesome.very fast.the looks are amazing.only drawbacks are battery and volume is low.thank you Flipkart and retailnet for this amazing poduct",
            "It's fab. Don't wait, just buy it. It's better than my MacBookAir rather than the trackpad, and battery life.",
            "The over all specifications is good . The only disadvantage is battery",
            "it's great and recommended",
            "good laptop for higher computing softwares and games.only draw back is no web cam battery time at the price rangr",
            "Good product",
            "The laptop is fast and loads in less than 2 seconds. the look is also premium. only that I miss is the camera.",
            "Display 5/5\nBuild quality 3/5\nBattery 3.5/5\nGraphics 5/5",
            "awsome product by flipkart",
            "VERY NICE LAPTOP, PERFORMING OUTSTANDING, AROUND 5 HOUR OF BATTERY LIFE ON NORMAL USAGE, 1.5 HOUR ON HIGH USAGE,HIGHLY RECOMMENDABLE FOR GAMING AS WELL AS GRAPHIC EDITING WORK",
            "Got this laptop for a good deal... It works smoothly and does not hang even after heavy usage and running multiple VM's",
            "Apart from average battery life you'll love everything about this laptop. There is no num pad (also not in the track pad) which I felt a downside. Otherwise everything display, performance, looks, build quality is awesome.",
            "only look wise laptop is good apart from that everything is worst battery wont last for longer time.. speaker is worst no better sound quality and ha laptop becomes very slow within 10 days",
            "The product's body is absolute trash. You drop it from three feets and it will be into infinte pieces. Asus's Customer Service is fraud! My headphone socket broke within 6 months of purchasing and they costed me 63,000/- for a laptop of 91,000/-",
            "there is a lag time delation is more when i trends to open a folder the photos and images r slow and the photos and videos r too late to open and the aura is not perfect it is unable to change using the short cut keys given",
            "Everything is good specs wise but there's a little bit disadvantage of like there's no Type-C connectivity there no direct SD card connectivity but in this price range this is the best laptop",
            "nice gamiing laptop",
            "Been using it for 2 years. Only problem I had was left speaker didn't work after a year and rgb light on left side of the laptop is having loose connection , so light flickers sometimes.. but its not needed that much. Sound quality is low, battery life is good..as it is gaming laptop for higher performance u have to plugin always.\nbest laptop for the range.\nif your are looking for medium gaming and software works go for it. don't expect much ! A decent gaming laptop at this range\n! Had no issues in performance so far. !!\n\nGo for it :)",
            "no words to say. the best you can get in the price.\njust for your information the keyboard firmware are not upto mark and this keyboard can only light single colour at a time. this is not 4 zoned keyboard single zoned it is",
            "Suer performance",
            "Performance is good. But, the screen brightness is very low.",
            "i purchased it for 77,000. i should say it is really worth the money....good for gaming, CAD, video editing. processes are super fast.",
            "A beast with some compromises..\n\nblazing fast performance. light effects on keyboard and the edges are good as well. nothing keeps it down.\n\nbattery backup is 2hrs max. speakers are just ok. USB isn't 3.1 or 3.2. Slow transfer speeds but not very slow. just don't expect thunderbolt speeds",
            "Its quite aswome in the price range i just got it for 76k and i love the display and speed of 256gb ssd\ni was disappointed with the charger the adapter gets heated up\nand the backup not too bad but its low compared to remaining\ndoing well with its been a month and haven't got any problem",
            "laptop is pretty good but within 2 weeks I'm facing problems of decreased sound quality whereas it has lesser sound from the beginning",
            "Unique high end performance",
            "I got this piece for 70 grand! I just love this machine! The performance is really awesome! Go for it people!",
            "I've been using this laptop from a week and I found that this laptop is completely a beast.It can be used for every kind of work purposes.For gaming it gives tremendous performance.The battery backup is not too much but it gives you sufficient backup.At last I can conclude that if you want a laptop for multipurpose use then you can go for it.",
            "Got it for 74k on big billion day.\nBest in this price range.",
            "Everything is perfect except for the sound quality, volume is too low.",
            "Awesome! Laptop. Highly recommended for gaming and day to day work.",
            "Dude,\nProduct is really nice. I received it today but i could not find 1TB HHD in laptop... Memory available shows only 250 GB SSD.\nCan anyone help please.\n\nIn specification and on product box its clearly mentioned for both memory drives.",
            "i think it is best budget gaming laptop i got it for just 68000 for the product cost 93000 at the time of big billion days... so thank u flipcart",
            "i have purchase this laptop in flipkart big billion days and got it for 70k(after all the discounts)..belive me the best laptop ihave ever used ...the display is awsome 120hz...the thermal system is too good no heating issue....i7 9gen perform very smoothly...16gb ram..is good...\n\none only issue found that it does'nt have numberic keyboard seprately...i have no issue with that ...but if u want numeric keyboard seprately then it is not for you...\n\nbest laptop nothing got confused by seen negative review...just go for it ...undoubtdly...",
            "ITS GOOD",
            "could have worked on the battery. Rest everything is perfect.",
            "this is by far one the most amazing laptops I have ever used",
            "Bad product, screen is flickering, there is a gap between the design and the windows and the screen goes off whenever you plug in the charger (I am writing this after 4 months of use)",
            "there is some ssd issue. laptop restarts if you try Ubuntu or other os. Nvidia graphics and Asus kernel has some problem making laptop deep freeze and restart suddenly. not recommend for use other than windows",
            "product are good . but flipcart order tracking facility are bed.",
            "The real beast....\nonnum nokkanda makkale...eduthho....\nadipoli sadhanama....",
            "Its an beautifully crafted N' has great performance capabilities.\nIt has its own asus rog button.\nGO FOR IT.\nDON'T THINK MORE BUY IT NOW!!!\n#gamingbeast #asusindia",
            "Its not good for adobe premiere pro cc only for gaming",
            "Os problem within 2 days\ngames also not opening proper\ndrivers not supporting proper\nonly look wise good rest everything bad",
            "low sound quality",
            "My asus warranty status is showing till 3rd September 2020..While my invoice date is 5th October 2019..No idea why the warranty status is not showing till 5 October 2020 as it is one year warranty",
            "Nice laptop for architects",
            "The laptop is amazing,\nthe best thing about this laptop i love is it's display and cooling system, although i have doubts about it's build quality and hinges but it's working real smooth as of now the performance is great, aesthetics are just amazing, love the laptop, I've always been an ROG fan so there's no doubt for me that this laptop is gonna be amazing.",
            "laptop is good, I got it 70k and its a amazing deal but cad software run a bit slow but its a beast in the house",
            "speaker are not very loud.everything else is at great at this price",
            "Don't buy this laptop.. Motherboard will crash in a year and support service is pathetic.",
            "Stopped working after 2 year",
            "Not satisfied",
            "Great we got 8gb model by filpkart by mistake then we got 16gn after exchange of it ....great deal it was i got it in 70k in October 2019",
            "Performance,look of the laptop is awesome.only problem is it's battery performance is poor,but it's a gaming laptop so we have to bear with it.",
            "Its awesome",
            "It was delivered to me on 30th January. Today October 17th and the right speaker has stopped working and the neon lights keep flickering.\nDon't get me wrong, I love it. It's absolutely amazing, but the fact that the speaker ditched me just like that? Not cool.",
            "Very good quality ...",
            "Excellent",
            "Best purchase of my life.... battery is little off but it's a gaming laptop.\nGot it for 62 in bbs!! ♥️",
            "One year now and still a beast. 🤘🏻",
            "Good product I have been using this since an year\nPerformance is nice . Expect speakers everything is good.\nSpeakers are not up to mark . overall the product is good .\nBut I think msi is good at this price range.",
            "I don't know how to review in details but here's my say on it because I bought it.\nI bought it exactly a year ago.\nSo the about the body, it's pretty stylish just like you see in the image. The colors are everywhere. It's body is built strong and it can handle some hits. But you shouldn't be careless enough to drop it.\nThe keypad is good but the arrow keys are small. You might take a time to adjust with them but it's all good.\nThe screen is decent. Can handle lights and it won't reflect.\nSo about the performance, the main thing. It's the best part of the laptop. I am no a pro gamer but I have played a lot of games like pubg, gtav, assassin's creed Odyssey etc and they all worked fine. Even in high graphics you won't notice any change.\nBut there was a problem while doing softwares. I also use it to do SketchUp and CAD. And it kinda gets slow when there are too many rendering and it gets you frustrated.\nTalking about the battery life, it's weak. You can use it without plugging into socket. You can play music, videos and do some office works without charging and will last for 3-4 hours but for gaming, always play while charging. Or else it won't work. Simple as that.\nAnd the sound system is pretty good. Not so dynamic but it's loud and clear.\nAnd there are few features given by asus to enhance the experience. Which is pretty good.\nThe only sad thing about this laptop is that it doesn't have a camera. I couldn't do video call on laptop during online classes and that kinda frustrated me because you pay so kuch and you don't get a camera. But that's just because of the classes.\nSo in overall, I think this laptop has every specs you need at a right price. And that's why I bought it. And I have had no issues with it upto date. It's been a year. Works just like the first day. You can go for it.",
            "Excellent",
            "Nice product",
            "Poor battery, and the rest is good.",
            "I have given review after using more than 6 month. This laptop is monster with his overall performance rating\n\nDisplay : 10/10 due to hight refresh rate\nDesign : 10/10 air ventilator and lighting\nPerformance : 10/10\nBattery : 6/10 because it gaming lapton no one care about battery\nPros:\n1 Performance (High ram , i7 9th gen, ssd )\n2. Excelent bootup time\n3. offcourse it is asus guys\nCons:\n1. Missing webcam (not issue for gamers )",
            "It's a awesome product I love it any way",
            "I brought this laptop in October 2019 and I am writing my experience 1.5 years later. I am a btech student at IITG this is the worst laptop I have seen. I'm facing problem from beginning. There is problem in hardware,fan,speaker is giving buzzing sound.I also visit asus service center where I met with people those also have very bad experience with asus. In an all this is the worst laptop company. And I don't know why the rating of this laptop is 4.6 .Please don't buy any asus laptop.",
            "pros\n- Best Gaming experience in this price range\n- Good Battery optimization\n\ncons\n- Heating issues\n- Aura keys don't work sometimes",
            "Overall it's a good PC. The only drawback is that it doesn't contain webcam.",
            "The beast",
            "Got it yesterday . Well ahead of notified time.\nWill review the usage experience soon\nBut now I can't help appreciating about careful packing and safe delivery of the Laptop\nI am giving all Stars to flipkart team for this\neffort.\nThank you Flipkart",
            "Nothing to say much...in one words it is a beast. Excellent performance and I am fully satisfied with this laptop.",
            "Thanks",
            "Great. This is second piece using in Asus.",
            "The built quality is not good enough and the screen flips for a certain limit only so you have to be careful about that while opening but performance wise it is amazing.",
            "if they had given a camera as well. it would have got 5 stars. the machine is a beast. have been using it for more than 5 months now",
            "Good one",
            "This laptop is really fantastic. This laptop updates contuinously. Its is also very durable",
            "Nice and good budgetin laptop from Asus.\nThank you",
            "Battery is bad",
            "Mind blowing purchase. Only at 69k during BIG BILLION DAYS.",
            "Nice",
            "its fps have start getting low very sad but its okay as they are at average of 30 fps",
            "Heavy in weight.\nLook is not so good.\nConnecting Charger length is low.\n\nBut performance and configuration for which it is build for is good.\n\n16Gb RAM extendable upto 32Gbps ..that's what I was looking for cloud lab for practice.",
            "Very good lappy upto i used its design and features are simply clever.",
            "The exterior build quality could me much much better. Everything else is good enough.",
            "Best Value to money gaming laptop right now.",
            "getting heated too much fast but overall it is nice product",
            "The best gaming laptop..",
            "Its good laptop for gaming and personal usage",
            "Battery capacity of laptop is the only issue.\nThough a bit heavy too.\nBut altogether this laptop is a beast.",
            "apart from battery backup rest all looks fantastic",
            "Battery is not good but for my Vfx and design works this is the perfect one",
            "Simply Savage 🔥💯",
            "wonderful",
            "Best laptop for programming. Android studio runs smoothly",
            "best laptop nowadays...full satisfied with this product",
            "Writing the review after 3months.\nLaptop has been performing well for most heavy resource intensive games without any lag.\nThe Nvidia GeForce Experience helps to optimise the graphics settings of the game so that it can run the smooth without compromising the quality.",
            "I like very much. I am using this one for design propose.its work good but battery early drin",
            "Wow nice performance and long battery life",
            "it's nice but plz look at in battery",
            "average",
            "battery backup not much",
            "great product....",
            "Pros:Amazing performance\nDesign is awesome\nNo heating issues\nGreat software range provided by asus\nCons:no card reader\nNo webcam\nNo numpad\nNo usb type c\nNo thunderbolt\nSometimes curser lags",
            "battery issue",
            "Hey\nI've bought this laptop for content creation purposes and the spec is good i totally recommend this to those who want a multi task and light weight gaming look laptop ,so go for it 👍",
            "Simply awesome",
            "Got a good performing gaming laptop in best price. Thanks to Flipkart. The delivery happened with out any delay. While received the package I noticed the corners of the laptop package was bent. While handling fragile goods please be cautious.",
            "superb product.... thanks Flipkart delivered fresh & undamaged piece",
            "WORTH IT!!!!!",
            "I had to reorder as flipkart couldn't deliver product for first time. After long wait I am happy customer now as flipkart escalations were d saviours at d end.. Product is unbelievable with only fault so far is battery",
            "This laptop is a beast. Go for it if you find it under eighty thousand bucks.",
            "best best",
            "Good one so far . It’s almost a week now. Everyone one should extend warranty to 3 years through asuspromo website",
            "Very nice product. Eye catching during presentations",
            "everything is nice except battery... but its good features dominates it. I feel vram(4gb) is less which cant stay with other features.",
            "The Product Is Superb....",
            "Battery 🔋 is just okay... otherwise everything is awesome...do set the audio mode to movie on sonic audio to get huge sound improvement...😊",
            "Awesome performance",
            "Just awesome 🥰",
            "everything is fine except for the battery.\n4.5 hrs while normal usage and only 1.5 hr while gaming",
            "excellent performance and styling for the price ,good build quality. only concern is the battery life which is not that great",
            "I love this product, best laptops in this budget.",
            "I love this laptop. before ordering I had lots of confusion on my mind but when it arrives on my hand all those confusion dismissed. I recommend this laptop to all people who want performance...",
            "Amazing performance. Nice design. No webcam.",
            "nice",
            "Nice one",
            "This a good product\nbut there are some drawbacks in the web cam and cd/card reader\nthere is also problem with charging in my laptop",
            "Loved It...",
            "firstly thanks for 1 day before delivery , lappy is beast but will update review after use",
            "Adapter heats up a lot and quite heating issue with laptop as well performance wise no issue",
            "best",
            "super ...&its a fabulous product...from asus..amazing for all apps and look is awsome..i love it. ..republic of games.",
            "Excellent specs , worth every penny.\nBut disappointed in sound quality, low volume is heard\neven when kept at 100. Idk whether it is my product or for all",
            "The system is a beast. Only one black spot it's battery backup.",
            "Its an awesome lap.Has got great features.Great gaming experience. Good packing by flipkart,no damage to the product when it arrived. Loved it...#ROG",
            "It's the best in this proice.......",
            "verygood laptop & Brand product.... thanks Flipkart",
            "loaded.",
            "everything is good\ni gave 4 star just because of delivery is not at time and battery is not so good without charger",
            "the sound is a bit less. other than that, the laptop is fantastic. amazing display, amazing performance",
            "all features are good expect battery",
            "this laptop is cool just the battery needs improvement",
            "Everything is great except battery.",
            "Excellent... Waiting till sale was added advantage",
            "Amazing product... I love it.... But battery backup is not good.. all gaming laptop not have good battery backup\n. So don't worry about that....",
            "it's very good product....☺️☺️☺️",
            "This laptop is really good for gaming and normal use. One thing which bothered me is bad battery backup. But rest is totally amazing. Go for this product.",
            "awesome product",
            "nice product",
            "just perfect , just perfect , nothing more to say , no issue at all 😍",
            "not much of a gaming type\naffordable\njst worth the money",
            "battery not good but performance excellent.",
            "size is small",
            "excellent must buy",
            "good",
            "Nice design and build but its only has single channel memory. Otherwise the product is very good.",
            "very good",
            "Amazing machine, worth the money one star less for late delivery but the laptop is just amazing,the display though its just amazing 120hz",
            "thank you Flipcart and Asus for this amazing product .Good product of this price range",
            "Good Laptop with greater configuration an performance on this budget",
            "Excellent product from ROG, look fantastic and performance also super",
            "Performance is more than superb for the price! It's been less than a week since I started using it, will keep updating the review regularly.",
            "value for money at 74000",
            "anyone looking for laptop for designing work go for these laptop... only issue is battery life... overall beast!",
            "super stylish product",
            "laptop is good performance other is this categories laptop\none and only issue is bettery life .\nbecause this is High performance laptop\nlife only 2 hours .",
            "beast....",
            "all over experience is very good.\nexcept the battery which is not as expected Upto 5hours.\noverall satisfied with product.\nStill work perfectly.",
            "Awesome",
            "nice build quality and looks very stunning at night",
            "thank you so much to the big billion day.\nGot it in 74k And the laptop is awesome\nsmooth performance",
            "Perfect in this segment💪",
            "battery and speakers are worst, other than that display is best",
            "this laptop is awesome..got it for 74k on big billion day...its feels primium and stylise..remember its a rog sibling..so no need to worry...other tahn battery its fantastic...just go for it..its gaming laptop so dont bother about battery...nice pick just grab it..",
            "i bought it in bbd just 72k ... it is a beast laptop. u can go with it without any tention.. only cone is battery backup..",
            "If you want a beast...HERE IT IS... awesome laptop",
            "battery backup not so Good over all laptop is good",
            "Beat laptop.It will give very smooth performancey",
            "it's truely a ROG",
            "everything is perfect at this range and price except the battery.",
            "awesome performance and design also look good\nbest Leptop for this range"
        ],
        "likes": [
            "258",
            "20",
            "28",
            "17",
            "13",
            "4",
            "8",
            "6",
            "16",
            "2",
            "3",
            "3",
            "3",
            "4",
            "4",
            "12",
            "2",
            "4",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "62",
            "76",
            "28",
            "36",
            "22",
            "15",
            "16",
            "13",
            "5",
            "8",
            "8",
            "7",
            "18",
            "14",
            "4",
            "3",
            "3",
            "3",
            "3",
            "8",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "3",
            "4",
            "9",
            "2",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "2",
            "2",
            "2",
            "3",
            "2",
            "2",
            "29",
            "4",
            "3",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "26",
            "15",
            "4",
            "2",
            "2",
            "0",
            "2",
            "1",
            "8",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "10",
            "0",
            "2",
            "0",
            "0",
            "1",
            "1",
            "3",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "6",
            "3",
            "6",
            "4",
            "3",
            "4",
            "3",
            "0",
            "1",
            "1",
            "1",
            "7",
            "5",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "12",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "2",
            "2",
            "2",
            "2",
            "3",
            "153",
            "11",
            "8",
            "1",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1"
        ]
    },
    "qna": {
        "questions": [
            "Q:Is there any problem with os and drivers installation ??",
            "Q:how much ram can we increase???",
            "Q:Is there any way to turn off the lights under the laptop without turning off the keyboard back lights",
            "Q:is this i7 9th gen?",
            "Q:What is the battery backup for AAA titles?",
            "Q:16 gb is in single stik or two 8gb rams??",
            "Q:How much time does it take to charge from 0 to 100 percent?",
            "Q:is the hdd a firecuda?",
            "Q:Does it have both hdd and ssd in it?",
            "Q:Is there light in logo?...Does the logo of backside of screen flap glow?",
            "Q:it has HDD and SDD",
            "Q:does it have MS office?",
            "Q:done screen get off for a sec when charger plugged in or removed??? it is feature of defect",
            "Q:Is it possible to upgrade graphic card in this laptop ?",
            "Q:Will the 1 TB HDD come with the laptop or nees to buy seperately",
            "Q:does it have web cam built in?",
            "Q:which is better Asus rog or Acer perdator Helios 300 ??",
            "Q:what type of SSD is given in laptop?",
            "Q:Does it come with laptop bag?",
            "Q:does the g531gt havw usb type c",
            "Q:can we play games while charging the laptop?If yes,is there any harm to laptop?",
            "Q:Is it safe to order from Flipkart?",
            "Q:Can I change the graphics card to Nvidia 2080?",
            "Q:is this laptop best for programmers",
            "Q:What is srgb ratio of this laptop?",
            "Q:Why does the screen goes black after the laptop starts ?",
            "Q:in this laptop dvd option yes or no",
            "Q:where is number pad present on this laptop?",
            "Q:can we expand the ssd",
            "Q:does it have inbuilt mike?",
            "Q:I can play GTA v in this laptop",
            "Q:Does it have RGB lighting?",
            "Q:Does the package include original Rog backpack ?",
            "Q:How much fps does it give on AAA+ Games",
            "Q:does it have wifi connection",
            "Q:can i do live stream on youtube while playing pubg mobile on it",
            "Q:Tell me does this keyboard have 3 stage lighting",
            "Q:How long can this laptop lasts ? How durable it is ?",
            "Q:My laptop screen goes off for a second or two after turning on and reaching desktop screen when im not connected to charger. Why is this happening? Is this any major problem?",
            "Q:can we play Apex legends",
            "Q:Can I change the graphics card to 8gb?",
            "Q:have in fingerprint",
            "Q:what fps will it give for gta V",
            "Q:Can i use it for 3d animation softwares like MAYA, CINEMA4D, BLENDER, 3DS MAX, Z BRUSH.Can this laptop handle it smoothly.",
            "Q:does the track pad light up to present a number pad like strix 3",
            "Q:can i change processor ?",
            "Q:can i play cod modern warfare 2019 with over 60 fps",
            "Q:Does the scree goes to 180 degrees? like the legion laptops ?",
            "Q:Zephyrus G with ryzen 7 or Strix G with i7? which one? Pls tell me - I am confused !!",
            "Q:does dual booting this pc with ubuntu run properly?",
            "Q:The OS is lifetime free or its trail version. because i got a message like \"\"Your license will expire soon\" . please reply.",
            "Q:What is the color accuracy and the response time?",
            "Q:Does it have nvme slot ?",
            "Q:can we expand RAM without affecting warranty ?",
            "Q:after full charge how much hour it gives",
            "Q:Can i stream PUBG Mobile or PUBG pc in it?",
            "Q:y does it get heated to 90 degree celsius???and is it ok to handle at that temperature??",
            "Q:Does it have a slot for sdcard ?",
            "Q:does it have thunderbolt 3",
            "Q:can i install Anti virus or Already installed by company?",
            "Q:Is there any way to turn of RGB light completely",
            "Q:How to check the battery fully charged while lap is off?",
            "Q:how many CPU are in this laptop ?",
            "Q:Only 144 ppi resolution in screen?",
            "Q:Desc. showd we can turbo boost upto 4.5ghz how to turbo boost it?",
            "Q:Voltage rating? Can it be used abroad, using an adapter?",
            "Q:can this come with laptop sleeve",
            "Q:does usb 3.0 external HDD work on this laptop?",
            "Q:Does this laptop have a white screen spot issue in the dark background?",
            "Q:Is there a version of 6gb/8gb graphics?",
            "Q:is this laptop good for game development in unity3d??",
            "Q:What is the use of keystone",
            "Q:is there any free antivirus sofware with it?",
            "Q:Can I play fortnite in it?",
            "Q:is this laptop has webcam",
            "Q:Is RAM dual channel or single channel?",
            "Q:Does it have Type-C support?",
            "Q:My question is for ASUS helios 300 4gb graphics version, when it's come back to sell?",
            "Q:What material is it made of plastic/metal? just wanna know the rigidity of material??",
            "Q:can we use it for software like autocad or revit",
            "Q:what is the referesing rate?",
            "Q:The gap between hinges looks scary. Are they strong enough???",
            "Q:Can we do video editing like in primere pro and other softwares for editing?",
            "Q:can any one confirm that it use intel i9 9750h 6 cores ?",
            "Q:Why Battery So Poor in Gaming Laptops ????",
            "Q:does this varient asus rog strix G531GT has USB type-C port or is it just wrongly shown in the description pictures?",
            "Q:Battery Capacity of Laptop????",
            "Q:what is the brightness level in nits",
            "Q:does it has anti dust cooling system",
            "Q:Is the HDD already partitioned or do we have to partition it??? If it is already partitioned then how many drives are there and of how much space?",
            "Q:doest this laptop accept another dual channel 16gb ram??",
            "Q:Is there any heating issues while playing high-end games like PUBG or Dota2, Witcher 3, GTA V, etc.?",
            "Q:can i play gta 5 with ultra high graphics with out any lag?",
            "Q:Can I run pubg at ultra graphics with 60 fps?",
            "Q:Does it contain sshd orhdd? As 17 inched variant has sshd? On site it is written optional hybrid hdd (firecuda) for 15 inch?",
            "Q:how bad is the backlight screen bleed? Is it noticeable while working?",
            "Q:this laptop comes with 16gb single channel ram. can I add another dual channel ram?? does it accept dual channel memory??",
            "Q:fn + left or right arrow key not working for lights changing... anyone facing this issue ??",
            "Q:Can I used it for 3D Softwares like \"Autodesk 3DS Max\" and editing softwares like \"Adobe After Effects and Adobe Premiere Pro!?",
            "Q:how is the speaker quality?",
            "Q:where is num keys",
            "Q:Is this variant is a Anti Glare Display?",
            "Q:Is there any heating issue in this laptop while gaming like GTA V...",
            "Q:Does this laptop has numpad in touchpad?",
            "Q:it has HDD or SSHD (firecuda) ??",
            "Q:is this have webcam?",
            "Q:What's the colour reproduction (sRGB and NTSC) and brightness level (in nits)",
            "Q:is it suitable for architecture students",
            "Q:Is it good for multitasking",
            "Q:What's the battery backup for normal usage?",
            "Q:Can I change Graphics Card???",
            "Q:Can we upgrade ssd storage on this version",
            "Q:ca i dual boot it with linux??",
            "Q:Speaker performance?loudness? Does it crack at max volumes?",
            "Q:Which games are given worth 11000?",
            "Q:does it have light in back(rog logo)",
            "Q:Can you do video editing with this? Can Heavy Software do it?",
            "Q:Can we charge it continuously for 24 hours?",
            "Q:1TB SSD V 1TB HDD+256GB SSD which is fast performance wise and overall storage read and write speed ?",
            "Q:How and from where to install all the required drivers and softwares after the initial boot?",
            "Q:What is boot time for this device",
            "Q:Does this Laptop comes with pre-installed MS Office.??",
            "Q:how's the battery for 3 cell?",
            "Q:Can we capture game without capture card",
            "Q:Can I play red dead redemption 2",
            "Q:It's good for watching videos or movies",
            "Q:I need to upgrade the RAM, total of 32 GB. There is an additional slot of 16GB in the motherboard. So which company's RAM I have to buy and its MHz? Please suggest.",
            "Q:Are Ram, HDD and SSD replacable or expandable?",
            "Q:screen refresh rate??",
            "Q:After booting the desktop screen is off for a second, how can I solve that issue?",
            "Q:my keyboard and laptop lights on/off button is disabled and i cannot find it in aura sync is there any way to solve please help",
            "Q:can I play call of duty modern warfare smoothly?",
            "Q:what is the battery backup for normal usage or for programming??",
            "Q:is it stable i7 9gen processor some people told me dont go for 9 gen plz reply",
            "Q:will this support virtual reality?/is this V.R ready?",
            "Q:can ot be used for study purpose? is Microsoft office available",
            "Q:I'm pressing the flight mode key in keyboard but it's not switching to flight mode why ?? is there is any problem??",
            "Q:can i play devil may cry 5 in it?",
            "Q:Is the keyboard backlit lights only available in RGB ? What If I want to have it in a white , is it possible ? If yes, How.",
            "Q:Is the battery removable..?",
            "Q:is this laptop capable of playing. high end games like uncharted 4 ......",
            "Q:solution for web cam for this laptop",
            "Q:Out of the 256 GB SSD (C Drive), how much is the available space?",
            "Q:Ram is single channel 16gb or 8gb+8gb??",
            "Q:This laptop have dvd player for installation. reply?_?",
            "Q:it has Wi-Fi",
            "Q:is ssd upgradable to 512? is windows is mounted on ssd?",
            "Q:Does we get an external web cam with this as on asus official web site there is a web cam also with this product.",
            "Q:is it multicolor",
            "Q:This Laptop Have Fingerprint Sensor....?",
            "Q:there is web camera in it.....",
            "Q:Can the lights below the keyboard switched off?",
            "Q:does it have 1tb hdd installed when we buy it ??",
            "Q:Does it comes with any pre-installed antivirus software?",
            "Q:does it has rgb on the logo back of the screen",
            "Q:Is backpack Included?",
            "Q:does it come with a bag",
            "Q:Does this have a full plastic body?"
        ],
        "answers": [
            "A:Os is preinstalled and drivers are automatically installed once you update windows",
            "A:there is a single channel 16gb ram stick and a empty slot out of the box , so you can increase it to 32gb by adding one more stick. I have seen the insides so, i am sure of this.",
            "A:Click on aura create, you can choose your lights according to your choice. You can turn off all the lights or turn on only keyboard lights. Its up to you.",
            "A:yes",
            "A:2 to 3 hours max....",
            "A:single stick.",
            "A:2 hours",
            "A:Yes",
            "A:yes it does have",
            "A:Nope. The logo on the laptop doesn't glow.",
            "A:it has 1TB HDD and 256gb SSD",
            "A:nop you need to install it manually ,it comes with antivirus though.",
            "A:No",
            "A:Yes of course",
            "A:with the laptop",
            "A:No",
            "A:Asus Rog is best",
            "A:It's a PCle 4.0 256 GB SSD",
            "A:no it does not come with a laptop bag.....",
            "A:No it doesn't have one",
            "A:Yes. Shouldnt be a problem though it is always safe to not use any electrical while charging.",
            "A:yes",
            "A:yes",
            "A:Yeah and also for best gamers",
            "A:50-60%",
            "A:On battery mode, by default the screen refresh goes to 48hz (so there is a flicker) and the whole 💻 goes into Power saver mode, so it goes to Silent mode. When you plug in screen goes back to 120hz",
            "A:DVD drive ? No",
            "A:There is no numpad present in this laptop.",
            "A:yes upto 1TB",
            "A:Yes, of course it does.",
            "A:yes brother you can !",
            "A:Yes it has RGB lighting, it has some presets for lighting combinations but it doesn't support the lastest Asus Aura Creator support.",
            "A:No only a box with laptop and charger",
            "A:120HZ",
            "A:Yes",
            "A:yup why not would love to do that!! and it's amazing gaming laptop for the price and yeah go ahead and streammm",
            "A:actually it have 10 different types of lighting. it's look great n gives u feeling of gamer.",
            "A:considering all the features it can easily hold you up for next 5to7yrs min!Speaking about durability it has got minimum flex,body is rigid,keyboard is above good,so to conclude its durable like hell",
            "A:No this is common in all of these laptops. After You plu g in the charger the screen refresh rate changes that's why this is happening..",
            "A:yes and you can play it with high graphics settings too.",
            "A:Nope. Graphic cards (GPU) comes with compatible configurations. You can't change it in this laptop. If you want a better one, go for assembling a PC.",
            "A:no",
            "A:50+",
            "A:It will run smoothly. It is an intermediate laptop for the above softwares.",
            "A:No ,track pad does not light up to present a number pad",
            "A:yes you can change what ever you want. prior to that make sure that's your laptop",
            "A:Smoothly. I believe so. Because I haven't played this game yet but there are many games who have 4K settings and this lappy handles that easily on turbo setting.",
            "A:no it doesn't.",
            "A:for me, it is i7 9th gen processor all the way. the rest of the bells and whistles don't matter as much. even if you are a serious gamer, Ryzen 7 doesn't provide any extra ordinary advantage.",
            "A:Absolutely it can run ubuntu & windows easily based on your usage",
            "A:OS is free, license should be of office 365",
            "A:RGB is exact. Response rate is quite fast. Worth the price!",
            "A:no",
            "A:Yes",
            "A:4hrs.",
            "A:ofcourse bro",
            "A:yeah it's okay but you need to let that heat dissipate . use a flat surface beneath the laptop and let the air flow our easily. and use the laptop in a cool atmosphere.",
            "A:No slot for SD card and CD Drive",
            "A:no",
            "A:It is not installed by the company. Yes, you can install",
            "A:Yes absolutely. The aura creator application gives you complete control over the RGB effects. You can customize it according to your liking or turn it off completely.",
            "A:Light turns from red to white",
            "A:It has 6 CPUs and because of hyperthreading technology they work and show as 12 CPUs.",
            "A:it's 141",
            "A:By activating the turbo mode...but we can only turn on it while charging.. ...",
            "A:Yes you can!",
            "A:no",
            "A:yes",
            "A:For me there is no white screen spot issue in my laptop",
            "A:no it contains 4 gb graphics",
            "A:Yes",
            "A:there is no keystone in this model",
            "A:How can I activate antivirus for 1 year.... It is showing 1 month trial only.",
            "A:You play pubg without lag",
            "A:no",
            "A:Dual",
            "A:nope",
            "A:Duh! Helios 300 is Acer Predator series not ASUS ROG",
            "A:It is made of Plastic but still feel rigid. Nice build quality",
            "A:Yes. You can easily run Autocad or Revit",
            "A:120hz",
            "A:nothing to be scared of",
            "A:It's a gaming laptop,yes you can!",
            "A:Its i7 9th gen 9750h 6 core",
            "A:The display refresh rate and the performance is very high moreover gaming laptops needs cooling so there is a slight compromise on the battery backup.overall this laptop is a beast.",
            "A:No usb c port",
            "A:its not that good, not that bad. On high performance, its 1.5hrs to 2hrs on battery nd on battery saver 3-4 hrs. But performance of this laptop is good so i dont mind that battery issue.",
            "A:It's between 270-290 nits.",
            "A:yes it has anti dust cooling system.... desgined by BMW",
            "A:SSD (256 GB) already partitioned as C Drive. Drive D has 1TB Space. Total of Two Partitions.",
            "A:Yes. It comes with 4 ram slot and one slot is used already with 16gb",
            "A:No Issues... It has very good cooling system... The fans automatically adjusts speeds hence all the heat gets outside through the Air Vents.",
            "A:yes for sure",
            "A:Yes.",
            "A:The version given has a 1Tb HHD as well as a 256 Gb SSD. It has variants with no HHD. Dont know about the 17 inch variant",
            "A:Nope, you can decrease it or dim it if you are getting irritated by it.",
            "A:Yes, it supports dual channel RAM",
            "A:Update All the asus tools (game visual and all) Its just a driver issue",
            "A:Yes you can. Even i am using this laptop for AI ,Ps and 3d.",
            "A:Honestly, speakers are decent. they have a bit of surround sound effect but overall just average. However when headphones are inserted the music sounds to good.",
            "A:there are no specific num keys or num pad in this laptop",
            "A:yes, it is.",
            "A:A little bit of heating while playing fifa 19 and similar games",
            "A:Doesn't exist in this edition, not necessary either.",
            "A:SSSD FIRECUDA",
            "A:no",
            "A:brightness level is adjusted as per our requirements and RBG on keyboard is about various colors we can used and also we can manage their speed they give you 3 option slow , medium,high.",
            "A:yes it should be more than enough for architecture students",
            "A:Ofcourse, it is good for multi-tasking, but if that is all you are looking for, then this might be an overkill.",
            "A:4 - 4.5 hours on power saver mode with low settings",
            "A:yes, well it has 4GB nvidia graphics and 4GB intel graphics so a total of 8GB Graphics built in😉😊 its more than enough for high end games since they use both graphic cards together",
            "A:Yes you can if you can replace it via the same size of solid state drive",
            "A:yeahh!",
            "A:bass and trebel is perfectly balanced ......you will have no ptoblem with that",
            "A:no games are given",
            "A:no it doesn't.",
            "A:Yes you can edit video with this",
            "A:if you are doing a high usage work on it then of course but if you just want to charge it 100% you can just charge fo 2 hrs for full",
            "A:1TB SSD itself",
            "A:The basic drivers and softwares are installed already, for further requirements, you can easily download it from MyAsus (app is pre installed) after registration with the product ID.",
            "A:less than 10 secs",
            "A:no",
            "A:it's ok I would say.. not bad though😁",
            "A:yes",
            "A:for sure.. switch on the turbo mode and play any games u want!!",
            "A:Basically this laptop is for the gaming but also due to 1080p hd screen and good sound quality you can get premium quality for watching movies on this laptop",
            "A:Go for crucial and frequency of RAM doesn't matters a lot, so go for the same frequency as we have with the default 16 gigs DDR5.",
            "A:The entire bottom panel is screwed in. But if you remove it, usually, RAM is replaceable. I don't think the SSD will be replaceable, since that's where the C:// partition is. But the HDD might be.",
            "A:120hz",
            "A:screen changes refresh rate NOT ISSUE when plugged in the refresh rate is 120 and on battery it's 60. when you turn off laptop while charging and turn on while on battery, screen changes refresh rate.",
            "A:download aura create or armoury application to command RGB",
            "A:Yes of course",
            "A:2hrs",
            "A:yess.. it is stable",
            "A:no",
            "A:Yes, it can be used for study purposes office 2015 is available.",
            "A:There is no flight mode key, which key are you pressing?",
            "A:Yes",
            "A:Go to aura settings in armoury carte and set the pointer to the lightest part of any colour in static mode",
            "A:No",
            "A:Yes",
            "A:you can purchase third party web cam.... that's allno other alternative",
            "A:237 gb",
            "A:Single channel",
            "A:No",
            "A:yes.. it has WiFi",
            "A:yes, it is upgradable to 512gb, and windows are also mounted on SSD only for quick boot-up.",
            "A:no",
            "A:yes",
            "A:Nope",
            "A:no",
            "A:Yes",
            "A:Yes",
            "A:30 days trail only",
            "A:No its chrome",
            "A:no",
            "A:No",
            "A:Yes"
        ],
        "likes": [
            "0",
            "158",
            "0",
            "42",
            "0",
            "9",
            "7",
            "6",
            "6",
            "8",
            "8",
            "11",
            "0",
            "14",
            "1",
            "0",
            "2",
            "3",
            "3",
            "3",
            "2",
            "2",
            "0",
            "1",
            "1",
            "2",
            "1",
            "2",
            "1",
            "1",
            "1",
            "7",
            "3",
            "1",
            "1",
            "0",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "1",
            "0",
            "34",
            "13",
            "10",
            "10",
            "10",
            "6",
            "7",
            "12",
            "6",
            "36",
            "5",
            "4",
            "3",
            "2",
            "3",
            "2",
            "5",
            "9",
            "0",
            "2",
            "1",
            "1",
            "0",
            "2",
            "1",
            "1",
            "0",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "2",
            "0",
            "1",
            "1",
            "3",
            "1",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "0",
            "22",
            "0",
            "6",
            "3",
            "0",
            "0",
            "0",
            "0",
            "2",
            "2",
            "4",
            "1",
            "10",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "12",
            "3",
            "1",
            "1",
            "0",
            "2",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "5",
            "2",
            "37",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "4",
            "15",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "3",
            "3",
            "1",
            "1",
            "1",
            "1",
            "10",
            "0",
            "1",
            "1",
            "15",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "2",
            "0",
            "2",
            "3",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0"
        ]
    }
}