{
    "title": "ASUS Pentium Quad Core - (4 GB/1 TB HDD/Windows 10 Home) X543MA-DM101T Laptop  (15.6 inch, Transparent Silver, 1.90 kg)",
    "product_specification": {
        "Sales Package": "Laptop, Power Adaptor, User Guide, Warranty Documents",
        "Model Number": "X543MA-DM101T",
        "Part Number": "90NB0IR6-M25790",
        "Color": "Transparent Silver",
        "Type": "Laptop",
        "Suitable For": "Processing & Multitasking",
        "Battery Backup": "Upto 6 hours",
        "Power Supply": "33 W AC Adapter",
        "Battery Cell": "3 cell",
        "MS Office Provided": "No",
        "Processor Brand": "Intel",
        "Processor Name": "Pentium Quad Core",
        "SSD": "No",
        "RAM": "4 GB",
        "RAM Type": "DDR4",
        "HDD Capacity": "1 TB",
        "Processor Variant": "N5000",
        "Clock Speed": "1.1 GHz with Turbo Boost Upto 2.7 GHz",
        "Cache": "4 MB",
        "RPM": "5400",
        "Graphic Processor": "Intel Integrated UHD 605",
        "Number of Cores": "4",
        "OS Architecture": "64 bit",
        "Operating System": "Windows 10 Home",
        "System Architecture": "64 bit",
        "Mic In": "Yes",
        "USB Port": "1 x USB 3.2 (1st Gen) Type A, 2 x USB 2.0 Type A",
        "HDMI Port": "1 x HDMI Port (v1.4)",
        "Multi Card Slot": "Micro SD Card Reader",
        "Hardware Interface": "SATA",
        "Touchscreen": "No",
        "Screen Size": "39.62 cm (15.6 inch)",
        "Screen Resolution": "1366 x 768 Pixel",
        "Screen Type": "HD LED Backlit Anti-glare IPS Display (200 nits Brightness, 45% NTSC Color Gamut, 75% Screen-to-body Ratio)",
        "Speakers": "Built-in Speaker",
        "Internal Mic": "Built-in Microphone",
        "Sound Properties": "Sonic Master, Audio by ICEpower",
        "Wireless LAN": "IEEE 802.11ac (Wi-Fi 5)",
        "Bluetooth": "v4.1",
        "Dimensions": "381 x 251 x 27.2 mm",
        "Weight": "1.90 kg",
        "Disk Drive": "Not Available",
        "Web Camera": "VGA Webcam (without Privacy Shutter)",
        "Finger Print Sensor": "No",
        "Security Chip": "TPM",
        "Keyboard": "Chiclet Keyboard with Num-key",
        "Pointer Device": "Touchpad",
        "Included Software": "Tru2Life, Splendid",
        "Additional Features": "33 WHrs Li-ion Battery, BIOS Setup User Password, BIOS Booting User Password Protection, HDD User Password Protection and Security",
        "Warranty Summary": "1 Year Onsite Warranty",
        "Warranty Service Type": "Onsite",
        "Covered in Warranty": "Manufacturing Defects",
        "Not Covered in Warranty": "Physical Damage",
        "Domestic Warranty": "1 Year"
    },
    "product_description": {
        "Stylish and Lightweight Build": "This elegant-looking laptop from ASUS weighs just about 1.9 kg, allowing you to comfortably take it along with you wherever you go. The premium finish lends it a classy and stylish look which is sure to grab the attention of onlookers.",
        "Powerful Performance": "Powered by an Intel Pentium quad-core N5000 processor and 4 GB of DDR4 RAM, this laptop helps you finish your tasks with ease and efficiency.",
        "Large Storage Capacity": "You can store all your favorite movies, videos, photos, documents, and other content on this laptop as it comes with an HDD that has a large storage space of up to 1 TB.",
        "Multiple Connectivity Options": "Offering a plethora of connectivity options, such as a USB 3.2 Type-A (Gen 1) port, two USB 2.0 Type-A ports, an HDMI output, and a microSD card reader, this laptop from ASUS makes it easy to connect a wide range of compatible devices to it. The USB 3.2 Type-A port helps you transfer files quickly via compatible USB devices and the HDMI output port lets you connect this laptop to a compatible TV or monitor.",
        "ASUS SonicMaster and ASUS Audio Wizard": "Get ready to experience every beat to its fullest as this laptop comes with ASUS SonicMaster and ASUS Audio Wizard technologies. The ASUS SonicMaster’s professional-grade codec, featuring the right combination of hardware, software, and audio tuning, ensures precise audio encoding and decoding, taking your aural experience to the next level. Moreover, the amplifiers, large speakers, and resonance chambers further make it a delight to listen to songs, play games, and watch movies on this laptop. Furthermore, the powerful software suite of the ASUS Audio Wizard ensures that it can achieve the perfect audio balance, irrespective of the content you’re listening to. You can even manually adjust the audio settings to suit your listening needs via this suite, so you can truly enjoy an immersive sound experience.",
        "ASUS Splendid Technology": "The ASUS Splendid technology of this laptop offers an enhanced visual experience, be it while playing games or watching videos. It includes four display modes, such as the Vivid mode (boosts contrast), Eye Care mode (minimizes blue-light levels, preventing eye strain), Normal mode (for daily tasks), and the Manual mode (for personalized color adjustments). The ASUS Tru2Life Video technology helps boost the sharpness and contrast of every pixel in a video frame by almost 150%, so you can enjoy optimized image quality, every single time.",
        "Clear and Loud Audio": "This ASUS laptop comes with dual 2 W stereo speakers that are enclosed within a large 19.4cc chamber, so you can enjoy an immersive and stunning aural experience with enhanced bass. Also, these speakers make use of every cubic millimeter of the chassis space, thereby delivering clear and low-frequency sound clarity.",
        "Keyboard": "Whether it’s to play games or type a large assignment, the full-size, one-piece chiclet keyboard of this laptop makes typing on it a seamless and comfortable experience. It offers a key travel of about 1.8 mm and minimal key float, making it a delight to type and play.",
        "ASUS IceCool Technology": "This laptop uses the ASUS IceCool technology to address the heating issues of the laptop. This technology ensures that the heat build-up under the palm rest is prevented by maintaining the temperature of that area within the range of 28°C to 35°C. Also, the internal layout is designed in such a way that the heat-producing components are placed away from you."
    },
    "reviews": {
        "ratings": [
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "3",
            "5",
            "1",
            "5",
            "4",
            "1",
            "5",
            "4",
            "2",
            "4",
            "1",
            "5",
            "2",
            "1",
            "5",
            "2",
            "1",
            "5",
            "3",
            "4",
            "1",
            "5",
            "3",
            "4",
            "3",
            "1",
            "5",
            "5",
            "2",
            "3",
            "5",
            "1",
            "2",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "2",
            "3",
            "5",
            "1",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "2",
            "2",
            "1",
            "1",
            "3",
            "1",
            "1",
            "5",
            "2",
            "4",
            "5",
            "2",
            "1",
            "5",
            "1",
            "4",
            "1",
            "3",
            "2",
            "1",
            "1",
            "3",
            "1",
            "1",
            "5",
            "3",
            "3",
            "2",
            "1",
            "5",
            "1",
            "5",
            "1",
            "2",
            "3",
            "1",
            "1",
            "5",
            "2",
            "1",
            "4",
            "5",
            "1",
            "1",
            "1",
            "4",
            "3",
            "1",
            "5",
            "1",
            "2",
            "3",
            "1",
            "3",
            "5",
            "1",
            "5",
            "4",
            "4",
            "1",
            "2",
            "1",
            "5",
            "4",
            "1",
            "2",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "1",
            "3",
            "3",
            "5",
            "3",
            "2",
            "1",
            "5",
            "3",
            "5",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "4",
            "3",
            "2",
            "5",
            "1",
            "3",
            "1",
            "3",
            "1",
            "5",
            "4",
            "3",
            "1",
            "1",
            "3",
            "1",
            "3",
            "3",
            "5",
            "5",
            "5",
            "1",
            "1",
            "3",
            "3",
            "1",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "1",
            "3",
            "1",
            "1",
            "5",
            "4",
            "5",
            "1",
            "4",
            "5",
            "5",
            "2",
            "4",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "4",
            "4",
            "4",
            "3",
            "3",
            "4",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "3",
            "5",
            "3",
            "3",
            "4",
            "5",
            "5",
            "5",
            "3",
            "3",
            "4",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "2",
            "5",
            "3",
            "5",
            "3",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "3",
            "4",
            "5",
            "5",
            "3",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "2",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "3",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5"
        ],
        "review": [
            "I just bought this laptop after exchanging my 10 year old lenovo core i3 in 8300 Rs.\nThe laptop is great though the build quality is not top notch and you can feel it immediately. But very light weight and shows premium looks.\nI have opened numerous multitasking on first day, did some office work and some light poker on adda52 and baazi apps. All worked without a issue.\nAll in all a good laptop for day to day work and light gaming.\nOne more things, the keys are soft and feel delicate so dont hit it like keybord or else I feel it can be damaged in no time.",
            "Processer speed very slow.. booting time high.. design good .. battery backup good.. overall satisfied in this budget.. if u want used it for basic need.. it's good otherwise go for another product ...",
            "Best Budget Laptop. I am very very thankful for flipkart for such a amazing Laptop at this price. Battery performance excellent. Display mind-blowing. Very little and minor issue with performance because of processor but overall very decent Laptop and it's design is just Outstanding.",
            "1. Processor pentium silver N5000 quad core = five star.\n2. Processor speed only = three star (performance a bit slower while installation and larg files).\n3. Screen 15.6’’ HD = five star.\n4. Storage 1TB HDD = five star.\n5. HDD rpm 5400 = four star (just very minute delay in retrieving data).\n6. Full size keyboard = five star. (no indicators like caps lock and num lock)\n7. It seems body is plastic material = four star.\n8. Charger cord length is good 2.5m = five star.\n9. Only windows 10 is preinstalled.\n10. No MS office and others are pre installed.\n11. Taking time 50 to 60 seconds to initialize the computer and also little bit time in every application (can be adjusted in budget laptop).\n12. Found good snip and sketch application for screenshots like paint app.\n13. This laptop serves the basic needs like browsing, word, excel, ppt and pdf applications and etc.\n14. Not suitable for who wants to use heavy applications.\n\nOver all laptop rating is four star.",
            "good laptop at price 19800 performance is good battery is awesome display is average design is super",
            "Good product. Design, battery display and performance all are good. There is little lacking while starting the laptop and opening the browser. However it works smoothly after few minutes. And performance is great . Good product for normal work. I have not tried any games",
            "Best Laptop 👌\nGood performance .... 3.8 out 5\nDisplay average ...... 3.1 out 5\nSpeaker ....... 3.8 out 5\nBattery 3.7 out 5\nBest for Students n Starters\nOverall Good and Best deal at *Flipkart*👌 ......!",
            "Very good for daily use ,like ms office email,surfing and battery is also very good it gives you 4-5 hours of battery backup since I have been using for 7 days it looks perfect for me as I have been working from home I feel lucky to get this laptop at this price range as all of the laptops present in the Kolkata market priced over 30-35k I get this within 20k. Thanks flipkart",
            "Ok",
            "Good product",
            "Smoothly",
            "Budget friendly laptop",
            "EXCELLENT PRODUCT....... THANKS FLIPKART FOR SUCH EXCELLENT PRODUCT.......",
            "Best product for me",
            "Large screen 1 TB HD 4 GB RAM Awesome Product this Range Thanks for Flipkart Courier Service is Good",
            "Excellent laptop thanks flipkart",
            "Honestly this laptop works very slow when you switch it on but it is good for basic work only and",
            "Slow but good....",
            "I have been using this laptop for more than 3 months and this laptop is worth for our single penny. It's battery backup is very good we can easily watch 1 or two movie in one go. It is little bit frustrating for first time starting .It requires many details etc for first time it's because the laptop comes to us in factory made condition.This laptop is a budget laptop #goforit",
            "Lags alot. Even on refreshing the system it takes 5-10 seconds to refresh once",
            "Performance is too good",
            "Satisfied with this product..... amazing delivery.. delivered within 2days...",
            "this laptop is nothing but a misfortune for me. Ordered for some light tasks but battery life, booting time, and lagging totally a very bad experience for me.",
            "Ok good",
            "Average performance .. unsatisfied..",
            "Too slow system not responding too quickly takes longer time to start",
            "Asus very good but slow performance and battery 3to 4hours and colour is nics",
            "Very slow speed",
            "Value for money...\nBest product within this price\nLove it ...",
            "Don't buy worst thing",
            "Third class laptop plz don't buy",
            "So nice",
            "Good but display and battery very bad . Battery get easily finished . Hangs very much while using . Didn't open for a while . Not that much satisfied. As I was thinking",
            "Waste of cost please don't buy this.laptop is death slow even i took on site visit after that also it's death slow please don't buy this they are saying 4gp ram but if u look at the speed not even 1gp ram.kindly don't go for this. Please don't take this. Please my dear frd don't take this. I have got cheat by this company",
            "Nice and good performance for online class",
            "Not bad just a basic laptop and it is worth of money",
            "All over OK product.",
            "Worst device ever, with not only slow but no performance, bought for around 27k not worth for even 10k , once if you buy this you cont exchange but only replace the same device, thick before buying dont waste your money",
            "Supar",
            "Pros:\nlow power 5w Pentium processor means battery life of 5+ hours and quick charging time\ncharger is also very light, like a mobile charger\nPerformance is sufficient if you are just browsing, sending emails , reading PDFs or doing simple excel or word documents ( some settings need to be made)\n\nCons:\n1.While this is a Taiwanese brand, it is manufactured in China, which means it is not cheap when you see the big picture. Any contribution to China's GDP results in contributing to its defense spending which in turn increases India's defense spending , which finally leads to inflation- you pay more but later, not when buying the laptop.\n2, RAM; win 10 home needs more RAM, 4 may be a bit low for intensive use\n\nHowever if you are a poor student or don't have a high budget but need a laptop, then please go for it. Salaried folks in the 30% tax bracket should not be buying these and causing inflation in the country.\n\n1. Please look up a cnet article 10 things to speed up windows, you will need to do that. Windows has transparency effects which you need to disable for example.\n2. I also turned off a windows process that scans for malware , as it was slowing down the hard disk\n3. I installed the opera browser, as Chrome hogs a log it the RAM. Memory utilization came down to 65% from 75% default when using Opera amd not using chrome or Edge .\n\nYes, the problem is windows 20 - it is bulky and eats up RAM,. CPU is free, I often see RAM as the problem with this laptop so wonder video editing or other stuff - how it will fare.",
            "Good",
            "I purchased this leptop in 27000.\n30 days of use i suggest you go with dell and hp. And always buy a ssd leptop. Because HDD speed is very slow.",
            "One page open 1 hours very slow back 10 year",
            "Value for money good product",
            "Okay",
            "HDD PERFORMANCE IS NOT GOOD",
            "Good",
            "Excellent laptop. Worth for money. All IT practice technologies easily u can do",
            "It's too damn slow.",
            "Overall Look and Battery Back up is OK. But Performance is too slow..",
            "Don't buy horrible product",
            "Picture quality & performance is too bad.....",
            "Lagging issue, system very slow.",
            "Keeps on hanging everytime I use it. My 10 year old laptop performs far more better than this laptop. Complete money waste.",
            "Its very very slow. Processor some times take around 3 to 4 mins to open Chrome or IE.\nOpen office also same case takes 5 mins.\nScreen Resolution and battery is good.",
            "Don't buy this product, very slow processing, battery backup also not good. I wasted my money.",
            "Not too good",
            "Battery is very bad drain very fast.\nDisplay not good\nProcessor is slow.\nGood for only beginners",
            "Value for money",
            "The performance is very slow...",
            "Well...I knew it would be slow but didn't expected to be this slow. I thought I made an informed decision as I only needed it for entertainment purpose but it is very slow for even normal operations.",
            "Bad",
            "Very bad performance",
            "Not so good",
            "Very wrost performance",
            "Worst experience if you want to struggle after purchasing this then you guys can worst product worst experience..\nMy biggest mistake that i purchased electronic item from flipkart.",
            "Battery backup very good",
            "received damaged product and didnt got the replacement very bad experience",
            "very bad performance.",
            "3rd type quality of this laptop.......1no. dustbin",
            "Worst laptop friends... don't go for it's look or ram or hdd....it's processor is so much slow that I can't explain it to you....I very much unsatisfied with the product....it's ram may be 1 GB...camera is worst...",
            "Low processing, camera quality too bad, avarage build quality.for increase cpu speed uninstall macfee anti virus which is preloaded.",
            "Don't buy very slow and lagging I think don't go for pentium at this budget choose AMD it's so far better at this budget lappy performance",
            "Very bad product never buy it .Not opening first time",
            "Extremely slow. Not sure if it is due to Windows 10 or the underlying hardware itself is slow. Cannot be used for anything",
            "Multitasking is slow. Only one work at a time is very good. If we shut down rebooting will take 5 minutes. But it's ok in that price",
            "Please don't buy very worst camera performance and the processor is very slow it's just waste of money. Service of this company is also very poor .And windows 10 was not preinstalled and the there is no webcam In the camera.",
            "Build quality is really pathetic feels cheap plastic quality lots of flex in body compared to this Avita Laptop build is good.\nGo for Flipkart MarQ laptop it has metal body",
            "Very good laptop with budget price for everyday use like media . Browsing",
            "Very bad quality, No CD Drive, NO LAN Port, Caps Lock Light not Connect",
            "Nice Laptop For Daily Use ...Thank You Flipcard",
            "Very nice Product in this price range.\nI am most satisfied with this product",
            "Laptop is very very slow not happy with the product.",
            "poor product",
            "Is a great performance at this price",
            "Waste of money 💰",
            "Nice",
            "Scratches problem",
            "Bad..... Very bad product 😭😭😭😭",
            "Material is toooooooo cheap\nBasic ports not provided\nUsefull only for students online classes",
            "Top slow",
            "Very slow , Gives u a feel like u are in 2005 era when systems were slow due to lack of fast processors..please don't buy it",
            "System take to much to start also hang when doing multitasking",
            "Very slow.. very much time taking for starting..",
            "Very bad",
            "Nice looking",
            "Verry slow, bad experience",
            "Slowly laptop",
            "Very bad product after using 10 day the screen show black and after shutdown when I open the laptop it show black screen I don't know how to solve this issue",
            "Very poor performance. It doesn't even fit for students. Boot time too much. Opening MS team takes forever.",
            "It is very good for students .this is a commercial laptop and very good in quality",
            "Vary Slow",
            "It a good at this price",
            "This laptop is waste of money. I am writing this review after using approx one and half year.\nIf you think of using this for kids online education, then also its waste as teachers and students will keep complaining about clarity.\nPerformance wise its so bad that its startup takes upto half an hour. It can't handle even few tabs of any internet browser.\nIts real picture of performance is seen just after your waranty expires. We feel ourselves daring if we find courage to start the laptop for some work.",
            "Product is pathetic, despite having good configuration, it is slower than Pentium 4... It's not even good for Word and excel",
            "Good",
            "I have used this product this is so laggy and i am tryi ng to replace it.",
            "The product set-up was extremely slow. The laptop started hanging up and crashing from the second day itself. I have to wait for atleast 3-4 mins before i am able to enter by pin after awaking it from sleep mode. Powerpoints take ages to open. Even closing a chrome tab triggers and slows the working. Forget about downloading appications. Really disappointed.",
            "Very good",
            "Built quality was worst keypads are very bulky performance very slow",
            "Very slow processor",
            "Good",
            "Amazing product",
            "Bakwas\nMoney waste",
            "Not have speed, very slow. Not even opening folder. No return only replacement. Don't buyit",
            "It's working slow",
            "Good but prosesing slow",
            "As per quality and configuration of laptop it's price is very high.",
            "Very slow response, slow process",
            "Good",
            "Very bad product.",
            "Not worthy",
            "Product is ok but to slow",
            "Very slow laptop waste of money",
            "It's evident that manufactures are deliberately making the new devices slow. The boot time on this thing is about a minute. Chrome takes quite some time to open up. I bought this for work/office purposes so I don't see why I should upgrade the ram. 4gb should be enough but apparently it's not. Applications take time to run/load. My old laptop (which also has the same processor and is about 5yrs old with 4gb DDR3 memory) is faster...",
            "Lag free uses",
            "Very slow on very first day",
            "Good",
            "Nice",
            "very slow",
            "I think I wast of money hanging problem display issue keypad it's not good",
            "Slow",
            "Slow process and hang",
            "Everything was just Awesome",
            "Good products",
            "Battery performance is poor and slow over all performance",
            "Processor is just waste...working slowly and stuck again and again even it's new",
            "This product very slow",
            "Good Product",
            "Everthing is perfect but startup time is like freezing",
            "Excellent",
            "Best podcast",
            "Good....",
            "Product look is Good ,Volume keys are not working properly ..overall good product for beginners.processor is slow ,it will take time for multitasking work not able to mobe or toggle between 2 pages quickly",
            "WORKING SLOW AND HANGING ALL THE TIME. NOW IT HAS STOPPED STARTING ALSO. THE SELLERS ARE SCAMSTERS AND THEY ARE NOT EVEN TAKING RETURN. REJECTING MY RETURN REQUEST.",
            "Not good",
            "This are only basic range model\nNot for professional.\nThis are just ok.\nWorking little bit slow and also power button is delicate.",
            "Very excellent product\nValue for money\nPremium design and looks\nMust buyy",
            "At that price it is slow.",
            "Quality not good",
            "The worst laptop,, just a waste of money. Booting time 5 mins, file opening time 5 mins. I have gone through the reviews before ordering and flipkart is keeping the good reviews on top and may be reviewed by them itself. My 10 year old 1gb laptop is starts in seconds still. I have been cheated and I need a refund please.",
            "very nice but slow process",
            "It's good for a basic use.But it's slow as it's pentium quad core processor",
            "Superb",
            "Very very very slow , even before installing any new software systems is working sooo slow and lagging at each and every step , pathetic plz dont buy",
            "Several lags in every application, restarting every 15 mins. Adapter faulty",
            "Waste of money",
            "system is very very slow even boot time is more than 4 mins . even simple browsing application also makes the system dead slow .",
            "Very unstable product, processor is very slow",
            "Booting time very high. Not slow, it is very slow.",
            "Start time 1-2 mint in 7 days\nVERY SLOW",
            "Best in this price you .you can buy this without any problem so go for it",
            "Good",
            "O. K. for the money spent",
            "It's a very good product for my experience\nProduct is very good value for money\nThank you flipkart for value of money product\n🤗🤗",
            "Worst product ever",
            "DEVICE QUALITY VALUE OF MONEY.BUT SELLER BEHAVIOUR IS VERY BAD,RETURN & REPLACE NOT ACCEPT,SELLER IS CHEATING",
            "Don't buy products from asus..worst product",
            "Good laptop value for money",
            "New product not working properly",
            "Nice",
            "Sound Quality is good.Speed is average.",
            "Better",
            "Performance very slow\nI am very broken heart 💔\nFest 15 days not working",
            "Very slow performance and hanging issues.... Waste of money",
            "Bet for basic",
            "I hate this product",
            "A little slower , with pre loaded apps and slower processor. Looks good",
            "Operating slow",
            "Good",
            "Awsome",
            "It is very useful for online teaching and learning process",
            "Very bad product",
            "Trash. Money wasted.",
            "Not very good but good",
            "Average laptop",
            "low process",
            "Performance & Processor of the laptop is too bad & It takes lots of time while processing & while starting too.",
            "Good",
            "Ok good everything is ok but performance is slow which is important in any laptop",
            "Excellent",
            "All.ok",
            "Very nice",
            "As per my personal suggestions, Don't buy this laptop, its taken more than 3 minutes to open and it's performance is very bad. Completely not satisfied.",
            "Very good quality products 👍🏿",
            "Not worth taking longtime not even worth for money",
            "EXTREMELY BAD SCREEN RESOLUTION, NOT LED FOR SURE!\nTHE PROCESSOR IS EXTREMELY SLOW.\nTHIS MACHINE IS NOT WORTH A PENNY.",
            "Nice Laptop.. Satisfied",
            "Good product",
            "Super product ❤️😍",
            "It's too slow in normal operations (Not Heavy).....Too much time taking too open files & Etc.....Iam not recommending this product",
            "Nice Product",
            "Wonderful Product",
            "Don't expect performance of corei3. It good for this price",
            "Average",
            "excellent prodauct",
            "Good laptop in asus 😇",
            "It shall be a great choice for the buyers.... Specifications are up to the mark... Only battery backup is not as described. Overall it is perfect.",
            "Very Good Performance.. Worth the money.. Impressive design..",
            "Simply awesome, tq you FLIPKART",
            "Good product",
            "Good product it is working fine",
            "Good laptop but starts very slow.",
            "Good laptop at this budget",
            "Good product...\nUsed for students purpose not for gaming ...",
            "Nice",
            "It's okay",
            "Very good product in this price but it's processor is very slow. This product is only for basic work.",
            "Very good woth paying",
            "White keyboard has silver keys that makes the keys totally invisible from all angles. You have to literally search the keys from helicopter view.",
            "Good performance",
            "Good at this price",
            "Very good",
            "It's so amazing. Laptop",
            "awesome laptop",
            "Stylish look but bad quality\n\nGood display\nGood battery\nGood sound system\nLight weight",
            "Lovely.... I loved it",
            "Unbelievable",
            "Little bit slow in performance but considering the price point of view it is worth the money.",
            "good.",
            "Good product",
            "Good",
            "Sound problem",
            "It's a very nice laptop",
            "Not made for heavy work because of proccessor is slow.\nsometimes it takes too much time for even small task\notherwise network is good and sound quality is good.",
            "Good product of this price. With Windows 10,The battery life is amazing with fast charge.",
            "Not good",
            "Good but not that much",
            "Very good at this price rate",
            "This laptop is very low perfomance",
            "Nice product but slow in processing...",
            "Excellent product in this price, I like n love it",
            "Camera is not good and without ms office. Mid range laptop to work for home and students.",
            "Overall ok but camara & proccesor is low and also cd drive not available .",
            "Perform Is Well",
            "Awesome",
            "Good product as per cost point of view",
            "Good product",
            "Good Laptop...!!!!",
            "I go 18783.unboxing and first impression in my youtube channel : omc tech travel & cook",
            "The perfect one in this price range just go for it",
            "Very Good working.",
            "Very beautiful in appearance and very good battery backup",
            "Laptop is good but slow sometimes",
            "Good laptop as compare to other laptop according to money.. It's a lightweight laptop for student purpose. Battery performance label is high and awesome looking.",
            "18533 m best laptop hai tq Flipkart for bbd",
            "Asus labtop very good",
            "To much hanging and speed is very slow, other wise is good for normal use, when i used internet is getting very slowdown, very stucky laptop I have ever seen",
            "Worth for money",
            "Below average",
            "Very good more than expected\nFast\nUse for daily work\nSound is little bit less\nOtherwise all ok",
            "It is very amazing laptop but the origin is China",
            "It's really slow",
            "Super",
            "Its a perfect laptop in this budget",
            "Superb product",
            "Initially it was very slow. Once the os got updated its performance seems fine now. Good laptop for basic surfing",
            "Amazing product",
            "Too slower than expected!!!!!",
            "This system is with a problem which worries me a lot...my money has been wasted...",
            "Laptop is good, but ms office no provide",
            "Worth for money on this price",
            "Worth laptop for money.",
            "ram not expandable",
            "Super",
            "Nice laptop for entry level. Nice performance, good battery backup at this range overall value of money.",
            "Nice lappy !",
            "Value for money",
            "I am satisfied under 20000 this laptop good",
            "First un install macfee and micorsoft 365 office and other unused apps either its very slow. perfect for students.....Perfects for programming... Display is good.... Sound is good... Camra poor.... Battery can not perdict. It can be predicted after 6 months.. Heating no issue as it is new.... For price range 17000 to 22000 its perfect. And its not advisable to purchase costly laptop.if you have less money in pocket then go for it.saving money always good for all. main cost is for processor, RAM, and Disk but this processor behaving poor at different Test conditions. So I will give 5 star at this price range.I hope in future some Indian company can also design and assemble products like this.",
            "Super",
            "This is a great deal in lower price\nIt's performance is average\nAt this price ypu never make a deal again",
            "Good laptop but camera quality is bad",
            "Very slow laptop",
            "NICE PRODUCT BATTERY BACKUP IS GOOD BUT CAMERA IS NOT NICE",
            "Please make fast delivery for Flipkart plus members.",
            "Fabulous products.\nEvery thing is good in this laptop.",
            "It is working very fine only u need to install microsoft office.\nIts worth n good for office work.",
            "Very good Laptop for the Money paid",
            "Nice product",
            "Very good product.\nNice built.\nWorth buy @ this price\nJust go for it",
            "Very good for basic uses...go for it",
            "Good",
            "This laptop is good for everything performance like 8gb ram lap",
            "Processor performance is good for the price. Display is of average quality. Webcamera is very poor. Rest all is good.",
            "Good product but with some limitations.. but in this price it's worth..",
            "Fantastic products",
            "Very nice ,,thank u flipkart.",
            "Nice product",
            "Good product in this range",
            "Very nice this product",
            "Over all good 👍. But it's slow update it 7 days regularly",
            "It's good thin and light laptop",
            "Good laptop under 20K. Performance is good .System boots within 30 seconds. Display is good . Battery backup is 3-4hours",
            "Thanku flipkart this product is good thank u so much",
            "Very Low processing you cannot play any game and any other more processing work",
            "very goid product light weight easy to carry big display good",
            "Best performance 👍",
            "Good product",
            "The product is excellent and its performance is good.",
            "Good in this price",
            "Good Product\nEverything is Good",
            "Good product at that price segment",
            "overall nice",
            "Excellent product",
            "All is good but cost is higher.",
            "Excellent",
            "I Got it at big offer. Nice product",
            "Like it",
            "Good product for basic used . Value for Money. Thanks flipkart for great deal.",
            "Awesome product 👌 I like it...",
            "This lap looks good and its only for normal users, it lags sometimes coz of pentium processor still its good at this price segment. Overall its really a good choice for Student and daily users.",
            "Bought in billion sale awesome feel and handy, hardware is good complementary Win10 home, goodness bad for basic users",
            "Very good",
            "Pros\nThe silver laptop looks premium.\nAbove average performance\nGood battery life.\nLightweight\nAwesome Chiclet keyboard\nSmall laptop charger(very much portable)\nOverall an eye catching design.\n\nCons\nNo indicator for capslock key\nNo bag provided with the lap.",
            "Very good Laptop",
            "Profitable product",
            "Very good product for basic use .",
            "Absolutely value for money.\nGreat laptop",
            "Gud product @affordable price.... Only for basic use not for hard use",
            "It most suitable lappy for basic office and student work. Good product for relative price.",
            "A good laptop in this this prize segment battery life is awesome thnx flipkart and thnx ekart for delivering in this pandemic type of situation",
            "Good looking laptop as it's price 👍\nLooking pretty\nBattery capacity good\nPerformance better than average\nDisplay could have been better.\nAs it's price it's good entry level laptop."
        ],
        "likes": [
            "69",
            "29",
            "7",
            "2",
            "4",
            "0",
            "0",
            "4",
            "1",
            "51",
            "16",
            "30",
            "13",
            "10",
            "21",
            "6",
            "12",
            "21",
            "19",
            "5",
            "11",
            "10",
            "5",
            "3",
            "2",
            "2",
            "5",
            "5",
            "11",
            "3",
            "5",
            "2",
            "1",
            "1",
            "2",
            "2",
            "2",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "0",
            "1",
            "0",
            "0",
            "1",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "40",
            "10",
            "4",
            "0",
            "2",
            "0",
            "0",
            "4",
            "0",
            "5",
            "0",
            "2",
            "0",
            "0",
            "2",
            "0",
            "1",
            "6",
            "5",
            "0",
            "3",
            "2",
            "1",
            "0",
            "0",
            "0",
            "1",
            "2",
            "7",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "7",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Can i used in autocad softare",
            "Q:Does it has WiFi and Bluetooth ?",
            "Q:Can attend online lecture",
            "Q:Is there any ssd slot inside or not please reply",
            "Q:Which edit app it will be support",
            "Q:Does it have internal battery or external changeable battery",
            "Q:Is it support windows 7",
            "Q:This is core i5 or not",
            "Q:Windows10 ableble in this laptop?",
            "Q:Can I will upgrade i3 processor in future?",
            "Q:Catia can work",
            "Q:I use internet in this",
            "Q:I can install autocad software and in this laptop",
            "Q:I want to install adobe cc master collection Coraldraw flimora is it support. For youtube works",
            "Q:Can I connect mouse? And can I connect net from mobile to laptop?",
            "Q:Coding dose running",
            "Q:Can I play free fire game ultra grafix.",
            "Q:Is it sufficient for CSE engineering student?",
            "Q:Can i run Minecraft in this smoothy",
            "Q:Is this use for office work??",
            "Q:photoshop is running well?",
            "Q:Can I play pubg in normal",
            "Q:Can I do You tube streaming",
            "Q:Can I Install Autocade,Solid edge etc. Engineering software ??",
            "Q:Which processor available",
            "Q:Can l play free fire game in this laptop properly",
            "Q:Can I install windows 8?",
            "Q:Wifi connection is available or not",
            "Q:Better than acer travelmate b3.",
            "Q:Is it better than celeron dual core",
            "Q:Do the microsoft office work properly??",
            "Q:Can i use this laptop for all coding purposes?",
            "Q:Can I stream free fire with connect mobile wireline?",
            "Q:Can it download windows 11 on the laptop?",
            "Q:Can I install ms office download",
            "Q:This laptop is having \"Wi-Fi'' ?",
            "Q:Does it Pre Installed ms office Excel,word, presentation???",
            "Q:How many storage is there",
            "Q:Is there m.2 sata slot available ?",
            "Q:Battery backup in full change",
            "Q:Can I use Fortran language properly in this laptop.",
            "Q:I can install vedio editing software in this laptop",
            "Q:Stock inventory can use this laptop",
            "Q:In which asus laptop to have a keyboard light",
            "Q:Can have finger sensor",
            "Q:Excel can we work",
            "Q:is ms office work properly",
            "Q:Can I insert sim card",
            "Q:Can I increase it to 8GB?",
            "Q:Can i playing free fier gam?",
            "Q:Wife use in laptop",
            "Q:Can add Ssd drive",
            "Q:Can we use Java and c language",
            "Q:Can we play minecraft or among us or GTA 5",
            "Q:Is it 64 bit",
            "Q:Can we increase RAM upto 8 GB or not ?",
            "Q:Full HD display or HD display?",
            "Q:Can i play GTA 5 or freefire in this laptop?",
            "Q:Can we use power point? Download apps like jamboard,Google slides",
            "Q:It is for simple gaming reply me",
            "Q:Can we do java c c++ etc",
            "Q:Can have DVD drive in this laptop",
            "Q:This laptop doing livestream",
            "Q:Can I play free fire smoothly with ultra graphics",
            "Q:Is it comes with pre installed window 10 ?",
            "Q:What type of processer insert in it",
            "Q:Can I install Ms excel",
            "Q:Free fire game this laptop play",
            "Q:Can I use for DJing",
            "Q:Can I use This Laptop For Working on Stock Market Like Viewing Charts, Graphs & trading ?? Please Guide Me !!",
            "Q:Can I use Android studio in this laptop",
            "Q:How the speed is",
            "Q:Is it slim ?",
            "Q:Can we use programming language And Python java other",
            "Q:Can I use video editing filmora app",
            "Q:Can I increase it to 8GB? Alamgir Zahirabad Telangana",
            "Q:Can i change the processor later ??",
            "Q:can i use ut video editing",
            "Q:Camera quality in mega pixels",
            "Q:Is it suitable for online classes daily purpose",
            "Q:Can i increase 8gb ram this laptop",
            "Q:I used autocad,3d max, photoshop,rendering softwares continious used and heavy work computer desktop but laptop user. when better option for laptop are desktop?",
            "Q:Can we python programming in this laptop??",
            "Q:Is there a m.2 slot?",
            "Q:Which generation 7 or 10",
            "Q:Does it have ms office? And what is the weight?",
            "Q:Is it support Linux",
            "Q:Does it contain webcam?"
        ],
        "answers": [
            "A:yes",
            "A:yes I am use WiFi and Bluetooth",
            "A:yes",
            "A:yes but I did not used it till date",
            "A:Bro if u r purchasing this for editing…i would recommend u to go for higher spec laptop as it is only for basic uses like browsing etc",
            "A:internal battery",
            "A:Yes",
            "A:No",
            "A:yes",
            "A:Yes",
            "A:No. It will require dedicated graphics card, 8GB or more RAM and higher version of intel processor I.e. i5 and above.",
            "A:Will definitely use internet in this laptop.....",
            "A:Yes, absolutely",
            "A:bro it is support but slowly work",
            "A:Yes",
            "A:It's not for coding. you can use it for basic office work.",
            "A:no",
            "A:yes. It is more than enough for study purpose. if looking for gaming purpose, graphics card model should be chosen.",
            "A:Yes you can",
            "A:No",
            "A:I haven't used. But I think photoshop need higher configuration than this laptop",
            "A:not heavy games",
            "A:no",
            "A:no",
            "A:Intel N500 silver quad core processor. Not recommended for heavy gaming",
            "A:yes",
            "A:yes",
            "A:yes available",
            "A:Yes",
            "A:no",
            "A:no",
            "A:No",
            "A:yes, and also wirelessly but it has a delay during wireless streaming.",
            "A:no",
            "A:Yes ofcourse",
            "A:yes",
            "A:No",
            "A:almost 900 gb",
            "A:No",
            "A:in begning 4-5hours battery backup",
            "A:No ..... it's a Starter laptop (use only basics).... better to go on Core I3",
            "A:Processor is real slow for Windows 10, Video Editing is definitely No No unless you are ready to wait hours just to load the software :) Haven't tried with Windows 7 or older versions though ...",
            "A:No",
            "A:no",
            "A:No",
            "A:There is no genuine ms, you can do with trial version with limited access. Not recommended.",
            "A:Yes",
            "A:No, it's a laptop not a phone",
            "A:Yes..will be valuable",
            "A:yeah almost.",
            "A:no",
            "A:Yaah, Sure you can connect or add ssd",
            "A:yes",
            "A:yes",
            "A:yes it is 64 bit",
            "A:No extra RAM slot, onboard 4gb available",
            "A:Full HD",
            "A:no",
            "A:yes",
            "A:yes. without graphics card",
            "A:Yes absolutely",
            "A:no",
            "A:Yaah. But loading in very slow. comparatively slow than other asus laptop.",
            "A:slow process",
            "A:yes, also with update of window 11",
            "A:puntium, it works fine in normal office use, not for heavy software",
            "A:yes you can install the ms Excel and as well as the whole ms-office package.",
            "A:Yes",
            "A:No",
            "A:Although I do not use it for the said requirement, it can be used for the same. This laptop is capable of handling routine computing except for gaming and the tasks that require higher end graphics.",
            "A:I guess so. I have not tried yet. However, if you have less applications, the laptop will run without much lag.",
            "A:speed is only 60 percent...😒",
            "A:yes it is",
            "A:It's good for beginners in coding...you can go for it 👌",
            "A:No you cant",
            "A:Yes",
            "A:no",
            "A:yes but it's won't be a smooth experience",
            "A:not upto the mark",
            "A:NO.....Net connected laptop from the dongle leaves the network running",
            "A:no",
            "A:desktop",
            "A:Yes you can install python software and use",
            "A:no",
            "A:It's pentium silver not i3",
            "A:Yes 30 days free trail offer with MS office 2019 / 360",
            "A:Yes",
            "A:Yes. Vga front camera"
        ],
        "likes": [
            "24",
            "21",
            "29",
            "4",
            "4",
            "4",
            "5",
            "10",
            "5",
            "2",
            "4",
            "3",
            "3",
            "1",
            "1",
            "1",
            "1",
            "2",
            "2",
            "1",
            "2",
            "2",
            "3",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "1",
            "0",
            "1",
            "1",
            "0",
            "0",
            "1",
            "314",
            "96",
            "49",
            "8",
            "4",
            "8",
            "6",
            "5",
            "3",
            "4",
            "2",
            "0",
            "2",
            "1",
            "1",
            "2",
            "2",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1"
        ],
        "dislikes": [
            "6",
            "6",
            "14",
            "0",
            "0",
            "0",
            "1",
            "4",
            "1",
            "5",
            "4",
            "2",
            "1",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "2",
            "8",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "3",
            "133",
            "42",
            "21",
            "1",
            "0",
            "3",
            "1",
            "2",
            "0",
            "3",
            "0",
            "1",
            "2",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1"
        ]
    }
}