{
    "title": "HP Pavilion Gaming Ryzen 5 Hexa Core 4600H - (8 GB/1 TB HDD/Windows 10 Home/4 GB Graphics/NVIDIA GeForce GTX 1650) 15-ec1021AX Gaming Laptop  (15.6 inch, Shadow Black, 2.04 kg)",
    "product_specification": {
        "Sales Package": "Laptop, Power Adaptor, User Guide, Warranty Documents",
        "Model Number": "15-ec1021AX",
        "Part Number": "183L9PA#ACJ",
        "Series": "Pavilion Gaming",
        "Color": "Shadow Black",
        "Type": "Gaming Laptop",
        "Suitable For": "Processing & Multitasking, Gaming",
        "Battery Cell": "3 cell",
        "MS Office Provided": "No",
        "Dedicated Graphic Memory Type": "GDDR6",
        "Dedicated Graphic Memory Capacity": "4 GB",
        "Processor Brand": "AMD",
        "Processor Name": "Ryzen 5 Hexa Core",
        "SSD": "No",
        "RAM": "8 GB",
        "RAM Type": "DDR4",
        "HDD Capacity": "1 TB",
        "Processor Variant": "4600H",
        "Clock Speed": "3 GHz with Turbo Boost Upto 4 GHz",
        "Expandable Memory": "Upto 16 GB",
        "RAM Frequency": "3200 MHz",
        "Cache": "11 MB",
        "RPM": "5400",
        "Graphic Processor": "NVIDIA GeForce GTX 1650",
        "Number of Cores": "6",
        "OS Architecture": "64 bit",
        "Operating System": "Windows 10 Home",
        "System Architecture": "64 bit",
        "Mic In": "Yes",
        "RJ45": "Yes",
        "USB Port": "1 x SuperSpeed USB Type C (5 Gbps Signaling Rate), 1 x SuperSpeed USB Type A (5 Gbps Signaling Rate), 1 x USB 2.0 Type A (HP Sleep and Charge)",
        "HDMI Port": "1 x HDMI Port (v2.0)",
        "Multi Card Slot": "3-in-1 Card Reader (SD, SDHC, SDXC)",
        "Hardware Interface": "SATA",
        "Touchscreen": "No",
        "Screen Size": "39.62 cm (15.6 inch)",
        "Screen Resolution": "1920 x 1080 Pixel",
        "Screen Type": "Full HD WLED Backlit Anti-glare IPS Micro-edge Display (250 nits Brightness, 45% NTSC Color Gamut, 141 ppi)",
        "Speakers": "Built-in Dual Speakers",
        "Internal Mic": "Integrated Dual Array Digital Microphone",
        "Sound Properties": "Audio by Bang & Olufsen",
        "Wireless LAN": "Intel Wi-Fi 6 AX 200 (2x2)",
        "Bluetooth": "v5.0",
        "Ethernet": "Integrated 10/100/1000 Gigabit LAN",
        "Dimensions": "360 x 257 x 23.5 mm",
        "Weight": "2.04 kg",
        "Disk Drive": "Not Available",
        "Web Camera": "HP TrueVision HD Webcam",
        "Keyboard": "Full-size Island-style Ultra Violet Backlit Keyboard with Numeric Keypad",
        "Backlit Keyboard": "Yes",
        "Pointer Device": "HP Imagepad with Multi-touch Gesture Support (Precision Touchpad Support)",
        "Included Software": "HP Documentation, HP e-service, HP BIOS Recovery, HP Smart, HP Jumpstarts, HP Audio Switch, HP Audio Boost, HP Support Assistant, HP SSRM, Dropbox",
        "Additional Features": "52.5 WHr Li-ion Polymer Battery with Fast Charge Support, MU-MIMO Supported, Miracast Compatible",
        "Warranty Summary": "1 Year Onsite Warranty",
        "Warranty Service Type": "Onsite",
        "Covered in Warranty": "Manufacturing Defects",
        "Not Covered in Warranty": "Physical Damage",
        "Domestic Warranty": "1 Year"
    },
    "product_description": {
        "Intuitive Interface": "The Omen Command Centre of this laptop is an interface that allows you to navigate and discover new features with ease. The Dynamic Hero tile showcases important experiences at the top so you can quickly view them. The tile-based feature navigation helps highlight several features simultaneously and the Dynamic content displays new updates or features. These features make this interface perfect for gamers.",
        "Versatile Task Management": "You can use the Omen Command Centre to help manage your tasks by tuning the system and personalizing it. Thanks to the network boosters, bandwidth for key tasks can be easily prioritized. The Omen Command Centre’s system vitals offer a quick view which makes it a breeze to work or play games on this laptop.",
        "Enhanced Gaming Experience": "The Omen Command Center offers a seamless gaming experience as it launches the app quickly so you can access the games of your choice. It also integrates My Games with gaming platforms, such as Epic, Origin, Steam, and UPlay, so you can access them in a single place.",
        "Graphics Processor": "Play your favorite games smoothly and seamlessly on this gaming laptop as it comes with a powerful 4 GB of GDDR6 NVIDIA GeForce GTX 1650 graphics memory and DirectX 12. You can play games even in dimly lit environments, thanks to the illuminated keyboard and integrated numeric pad.",
        "Powerful Processor": "This gaming laptop features the AMD Ryzen 5-4600H processor and 8 GB of DDR4 RAM (upgradable up to 16 GB), so you can enjoy a fast and seamless computing experience.",
        "Storage Options": "This gaming laptop offers up to 1 TB HDD storage space (upgradable up to 1 TB HDD + 1 TB SSD - sold separately) so that you can store all your favorite gaming titles, videos, pictures, movies, and more in a single place. The large storage space ensures this system functions smoothly and boots up in seconds.",
        "Vivid and Vibrant Display": "This laptop features thin micro-edge bezels that measure less than 7 mm on three of its sides to offer more display area and also comes with an edge-to-edge keyboard to offer more keyboard area. Featuring a 39.62-cm (15.6) anti-glare IPS display and a 1080p Full HD resolution, this laptop is here to revolutionize the way you view content on a laptop.",
        "Powerful Audio": "This HP Pavilion laptop’s front-firing dual speakers and B&O Audio ensure that you can enjoy clear and high-fidelity sound at all times, irrespective of whether you’re playing games, watching videos, or working.",
        "Wireless Connectivity": "Bid goodbye to spotty internet connections as this laptop features the Intel Wi-Fi 6 AX 200 (2x2) WLAN adapter. Also, you can enjoy a powerful wireless connection with compatible devices as this laptop supports Bluetooth v5.0."
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "3",
            "4",
            "4",
            "5",
            "2",
            "1",
            "1",
            "1",
            "5",
            "2",
            "4",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "1",
            "1",
            "1",
            "3",
            "1",
            "1",
            "1",
            "1",
            "2",
            "4",
            "1",
            "1",
            "3",
            "5",
            "5",
            "5",
            "3",
            "5",
            "1",
            "1",
            "1",
            "1",
            "1",
            "5",
            "1",
            "1",
            "4",
            "2",
            "3",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "4",
            "5",
            "1",
            "4",
            "4",
            "5",
            "5",
            "4",
            "3",
            "3",
            "4",
            "3",
            "5",
            "4",
            "4",
            "5",
            "1",
            "3",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "3",
            "3",
            "3",
            "5",
            "4",
            "5",
            "3",
            "4",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "3",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "4"
        ],
        "review": [
            "It's the best I got in this segment. It has a best performance in gaming as well as useful in business too. It's worth for money.",
            "i will say only 5 things\n1. cinebench r23 multi score 8600 (from my test )\n2. cpu temp max 86 deg centi. at room temp of 25deg .\n3. it shows its inner beast performance in A/C room.\n4. overall good cpu , thermals, battery,gtx 1650\n5.advice: just upgrade to ssd as soon as possible from hdd. trust me you will thank me later.",
            "I get very fast delivery 🚚.\nNext its working fine. I checked all functionality at the time of arrival.\nNo issue till now using for 1 month.\nBattery backup is good.\nPerformance is good i have not tested games till now.\nDesign will make you loved this laptop more.\nYes this was best deal.",
            "Super quality and faster delivery 🚚 exlent work for filpkart my is very important to time'thanks for Flipkart",
            "Definitely a good laptop at its price point.\nHDD makes the device a bit slow.\nBut you have a plenty of option to upgrade both storage and memory.\nNice screen.\nIt gets quite hot when running even moderate tasks(It has the right to get a little hot :-P as its a performance oriented machine)\nI do like the design but the whole body is fingerprint magnet, also I would like to add that this thing dosnt come with a fingerprint reader, so dosent support windows hello.\nTalking about HP service, its just terrible. That's it.\nAfter 3 months of usage:\nBuild quality is below average, flimsy feel and somewhat loose joints and have sharp edges.",
            "Its a great laptop. I would recommend it, have tried out few games like Gta V, witcher 3 etc. works fine. Start up time is about 30-40 sec its fine as it is having HDD. If i upgrade to ssd this would surely come down. Over all very good laptop for gaming or editing or even profession use.",
            "HDD makes it very slow, it seems like you are using a 90's desktop from our childhood... An SSD upgrade is must in this varient. If you are purchasing this one. Make sure you purchase a 256 or 512 gb NVME ssd saperately and clone your OS to make it worth buying... Otherwise you can go for the 512 gb varient...",
            "Review after one year of use. Gaming frame drops after some months. Can't play more than an hour. Heating issue. Best for office work and coding. Smooth and fast performance.",
            "Best product\nLags a little due to hdd\nJust buy an ssd and it will run smooth as butter\nGood for editing and Gaming\nStreaming experience good 👍❤️\nValue for money 90%",
            "Everything is super in this HP Laptop",
            "This is amazing",
            "Impressed with product. Thank you hp & Flipkart also for fast delivery.",
            "Super luv it",
            "Awesome",
            "Hey, flipkart I bought a laptop few weeks back and it isn't running properly, its very slow and no other applications are working on it.\nCan you please help me out with the product.\nAs the product is very costly for me so helo me out of this.",
            "Overall good to buy this its useful and look like saving of money",
            "Everyone thinks performance is dull but once you upgrade ssd and 8gb extra ram it’s becoming a beast overall built quality is very good also a sound is brilliant ❤️❤️",
            "Performance is best : 5 star",
            "Looks great",
            "Good laptop in this price segment. Must Buy !",
            "Beast in this price....",
            "nyc",
            "Good packing 😌\nGood battery performance 🔥\nFast delivery 💥\nBusy buy 🙌\nPerformance good",
            "Good performance, nice looking, well designed. But only one drive partition is there.",
            "Very good",
            "This laptop is just awesome. Performance is really fast and smooth. Don't have fast heating issues. Do all work easily and comfortably, whether its gaming or editing. You will not face any problem while doing your work.",
            "Nice laptop..\nGood experience..\nGood Performance.",
            "Good product\nGood for under 60k budget\nBut boot time is slow and slowed due to Hdd\nHanged sometimes . Please buy ssd after buying laptop these laptop",
            "Nice one",
            "Speed machine",
            "excellent product",
            "All ok but your service is so disgusting and slow",
            "It takes too much time to starting and runs slowly",
            "I didn't expected that it will be too slow it's take 5-7 mins to complete startup ... It's even slower then pentium I can't understand . When updated the driver\n. In Google Chrome it does hang and mouse cursor didn't move.. it's 4600H but why is it so.. now after 12 days later I can't be able to return it",
            "It is laging continuesley in normal use also . When I trying to install GTA 5 game on it . It is not working 😔 it is not responding with laging....It is laged in after three days only.",
            "Instead of buying basic laptop, opted for this one and it delivered the promise.",
            "Very bad performance, my 5yo laptop performs better.",
            "Good product\n\nlittle bit slow because it doesn't have ssd\nDisplay good ips and good viewing angles\nIt doesn't come with ms office subscription",
            "I played far cry 6 and valhalla. It does have glitch and jerks while playing even after activating the graphic settings. May need to upgrade to SSD.",
            "Don't Buy this Boot up Time is Very Slow",
            "Good Gaming Laptop..upgrade WindowsOS regularly so no lag problem and also it run fast in HDD too..but if you need faster performance just upgrade HDD to SDD.",
            "Best in price 53k",
            "Worth for money.",
            "Faster then I expected,I didn't find any problems till now.",
            "Laptop is quite good it doesn't lag inspite of having a hdd. It lag if you update Windows. So don't update other it will bottle neck.\nLaptop looks premium as well.",
            "Supreme product",
            "Very slow.... Poor performance🥲🥲",
            "Performance is very slow, it take more than 15 mints to turn on and even takes more time to load application.",
            "Too much lag. Hanging\n\nFor premearpro only 3h battery life\nNormal use 5 to 6 hours",
            "Very slow.\nHP online support asked us to reinstall OS.\nProblem still persist.",
            "I am getting 70fps but still my game lagging 👎",
            "System performance very bad.suddenly shutting down while working.\nBudget very high bad performance. Have it",
            "Bettry problem\nHard disk problem\nPlease don't buy this product",
            "Delivered defective products , system was very slow.take morethan 8 minutes to switch on and very slow",
            "Hard disk issue right from the beginning",
            "Laptop loading very slowly",
            "Good",
            "Performance worst",
            "Never buy this laptop complete waste of money. Got hanging issue from the Very 1st day.. Still hanging.. I put replacement request for this. save money stay out of this laptop",
            "I have bought",
            "Bought this.\nAmazing product.\n\nI recommend every student out there to buy this.\nRegular laptops wear out faster. In this generation it is necessary for a laptop to have a GPU for the laptop to last long.\n\nThe only issue with this laptop is heating issue.\nApart from that no issue.\n\nI mean what else can u expect from a gaming laptop.\nBattery backup is 2 hours max for heavy GPU use.(Gaming and editing)\nFor normal use it gives 6 hours - 8 hours backup.\n\nAfter few days OS keeps updating don't worry because it is OS issue not manufacture issue.\nIt is because it has HDD.\nIf u want more speed then purchase the SSD version.",
            "It don't open fast and don't working fast",
            "Man this laptop is amazing.\nPerformance wise I will write review after one month of usage but by the time you get this laptop, it will give you premium feel.... In short it's value for money...",
            "Not as my expectations",
            "We can extend ram upto 32 gb and there will be ssd slot and hdd slot seperately so that in future we can use ssd also. Refresh rate 144 hz we can open any file or folder very fastly. Nice product",
            "Delivery was good, but the performance is worst. Startup takes a lot of time, games doesn't run smooth this is horrible, atleast performance on desktop like opening normal apps should be fast. Very Slow Better go for SDD ones",
            "Very very slow. Taking more than 10 mins to start up the os. Even after it taking more time to launch the application. Not recommended this product.",
            "Low quality hdd\nFull lag my pc 🤬",
            "Its very slow",
            "Just don't buy it",
            "Very fast delivery and good quality",
            "It's keyboard start creating problem after 7 day",
            "I am facing low micro phone volume issue. Also i cannot use my wacom tablet since the pen stylus is lagging a lot.",
            "Worst system... Very slow",
            "Speed is very slow .",
            "Battery backup is poor.",
            "Nice",
            "Honestly it's a good machine, but you have to upgrade the Ram and SSD. otherwise you get disappointed. Because it's deadly slow. My recommendation buy this laptop upgrade it, don't go for the higher version. Compare to higher Madel price. Your upgrade cost is cheaper and better.",
            "best performing laptop and value for money also,\nperformance is slow because of hdd 5400rpm\nwhen u intall SSD then no one beat this laptop ,",
            "Awesome laptops",
            "Excellent and good working but battery backup is not work properly.",
            "The laptop is Awesome Please Buy an SSD and Insert it into this Laptop Becoz without SSD this laptop is waste .....",
            "Got this at a price of 51k during sale. Totally satisfied with the outcome. Performance is great considering the price, get an additional SSD and RAM (personal suggestion). It will definitely turn this laptop into a beast. Battery backup is of approx 4-5 hours, which is very good for a gaming laptop. Display quality is nice, but I've been facing a bit of screen bleeding issue from the beginning. Since, there's no problem in display quality experience due to this, it's totally fine (exchanging and refunding process are very hectic for me). Getting this HDD version and adding a SSD costed me less than buying a SSD variant and an external HDD separately (as per requirement I needed more internal storage space). Go for the SSD variant 5600H model if storage is not your priority.",
            "Poor performance very slow and unsatisfied with product",
            "Got this item at 54990. Delivery normal. Packaging normal.\nI'm gonna say I get the best deal at this price. Ryzen 4600H coupled with Nvidia 1650 (not the Max Q).\nBest at this price! I'm not buying this for gaming but I'm tempted.\nI needed the 1TB HDD for a reason. But imma buy an NVMe SSD 512GB or more later and upgrade this beast to its full potential.\n\nYou may go higher with better display like the 144 screen. I don't really care much because I'm gonna use an external monitor for my work.",
            "Good product",
            "Overall good",
            "One of the worst laptop .\n\nThey sent us second copy laptop on big billion day\n\nI had a budget of 40k for laptop but i still bought this laptop for 53k ..looking at its features ..\nThis laptop is frustratingly SLOW .. my old i3 laptop was must faster than this ..",
            "Good product, but I would have given 5 star if the company provided with SSD instead of HDD",
            "Good",
            "That's Amazing for budget gaming, that is value for money,but you can upgrade on ssd laptop more than faster 👍👍",
            "Worth for money",
            "Ok ok",
            "The laptop isn't that fast as it should be.",
            "Not much though. Expected 15s bootup but it goes more than 1 min😏",
            "Model good but boot timings is high",
            "Performance is not so good too slow laptop.. Too much slow laptop i hope 1tb ssd upgrade can make it faster and 1tb ram also 🙂",
            "Superb ❤️❤️",
            "Guys good performance but boot up time is high to reduce that you'll need to add SSD further for the reduction of boot up time but over all performance of perfect",
            "Go For SSD",
            "To be honest this is a decent laptop for the price but one thing you need to do as soon as you receive it to slap a nvme m.2 ssd and install your OS in it. If possible for better performance slap another 8GB 3200MHZ ram and this laptop is good for next 5 years.",
            "VERY SLOW LAPTOP I WONT RECOMMEND YOU TO BUY IT\nI THOUGHT IT IS GOOD BEFORE BUYING IT\nVERY SLOW LAPTOP TAKES 10 MINUTES TO START A GAME\nBOOTING TIME IS ALSO AROUND 5 MINUTES\nI WAS TAKING A ZOOM MEETING THE ZOOM CRASHED.\nDON'T BUY PLEASE SAVE YOUR MONEY",
            "System lags very much until U have upgraded it to a SSD,not at all good for high end gaming n editing.",
            "Superb and quality product",
            "The only thing is that speed lags when computer starts, need atleast 5 min in idle situation for better performance.",
            "Good but trust me you need SSD ... It's quite slow without ssd",
            "super",
            "Nice",
            "Very good 😊",
            "Its amazing. Heaxa core processor is awesome,it gives ssd like performance",
            "Best for gaming but, battery backup is not good",
            "Very good",
            "Good at this price",
            "Absulately good product.value for money.",
            "Overall a good gaming laptop for this price segment",
            "This Laptop is beast in performance. Thanks Flipkart for the fast delivery.",
            "Value for money",
            "It's the best product I got at big billion sale got it for 50k the delivery was Expected for 3 days took 3 whole weeks for delivery.\nIt's a beast",
            "Best laptop at this price range!!\nBut in my opinion if you have Little more money then go for ssd version.",
            "Value for money",
            "Good",
            "Go for ssd version design and quality is good",
            "Product is good but Service response is very bad.",
            "Not that good for gaming as mentioned and expected!!",
            "I purchase this for fast process on galing and other animation software\nBut on this price range i am disappointed with the processing speed of laptop\nMy i3 process pappu run master then this\nAfter all update i thought may be it will get some boost\nBut this keep disappointed me\nSome people says this will get faster after installing SSD but i am not sure with this because this is too slower then other laptop with HDD",
            "We just want ssd in it",
            "Nice laptop with good features",
            "Covering of key pad required otherthan alloted one . Otherwise satisfied with this product.",
            "Laptop is amazing.. Though it is lagging because of hard disk. Just upgrade to SSD and it is beast..",
            "Start it take so much time to load\nAnd lak so much in starting",
            "Its getting hanged up everytime.Worst ever product.",
            "Good laptop super working nice speed 🔥🔥👌",
            "MUST BUY ! Best laptop at this price segment with Ryzen-5 4600H.🔥🔥",
            "Awesome lappy",
            "You need to add a ssd, for boot up as the boot up using hdd is very slow. Rest everything is good. Good battery life, proper heat dissipation. The touchpad however is a little small, but it won't be of any use as most people use external mouse.",
            "Delivery was very very very late but overall it's good.\nFor normal usage that is for students college and school works.. This is perfect without ssd . But for heavy gamers ssd is must",
            "Marvelous design, it actually looks professional. Overall performance is good just a little issues with display which also depends on ur comfort.",
            "Good",
            "Well good",
            "Just add 8gb ram and nvme ssd",
            "Work in progress",
            "Nice product but have to add SSD other wise it's too lag",
            "Value for money ....",
            "Very nice 👍",
            "Good",
            "I am writing this review after using it for a month.\nPros.\n1.Good design\n2.Great battery backup.\n3.Good thermals.\n4.Nice performance.\nCons.\n1.little flex on top side.Quality of plastic could have been better.\n2.Only two usb slots.One with 2.0 and other 3.1 version.At least both could be of 3.1.\nNow there is updated version of this laptop.I think they may have improved the quality and other things.",
            "Good wark",
            "It will be beast performer after installing ssd",
            "Nice product and performance"
        ],
        "likes": [
            "154",
            "83",
            "38",
            "8",
            "18",
            "7",
            "2",
            "0",
            "1",
            "63",
            "115",
            "13",
            "19",
            "12",
            "23",
            "15",
            "27",
            "9",
            "5",
            "5",
            "4",
            "4",
            "7",
            "44",
            "3",
            "3",
            "2",
            "2",
            "2",
            "3",
            "2",
            "8",
            "6",
            "33",
            "5",
            "1",
            "1",
            "2",
            "2",
            "2",
            "2",
            "2",
            "1",
            "3",
            "3",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "8",
            "11",
            "1",
            "1",
            "0",
            "0",
            "1",
            "4",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "21",
            "12",
            "8",
            "4",
            "11",
            "3",
            "1",
            "0",
            "0",
            "4",
            "16",
            "0",
            "1",
            "1",
            "4",
            "2",
            "7",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "21",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "3",
            "33",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "14",
            "47",
            "1",
            "0",
            "1",
            "1",
            "1",
            "15",
            "6",
            "14",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1"
        ]
    },
    "qna": {
        "questions": [
            "Q:In hp pavilion storage options is 1tb hdd snd can we buy or get 512 gb ssd can u tell me",
            "Q:Is it's memory upgradable",
            "Q:What is Backlight color?",
            "Q:How to increase or decrease my laptop screen brigtness?",
            "Q:Can I play gta 5 on ultra settings??",
            "Q:would it possible to add 256 sdd in this laptop?",
            "Q:How many watt charger",
            "Q:Can I play any games like gta6",
            "Q:Can we add 256 gb ssd without removing 1 tb hdd? Does it have extra ssd slot for upgradation?",
            "Q:Can we do class",
            "Q:Plz tell if this is good for coding and programming",
            "Q:I can play pubg High Graphics",
            "Q:Is the monitor 60hzs or 144hzs ??",
            "Q:Can I watch videos on YouTube",
            "Q:I have recently learned that this laptop only has 6gb usable ram since about 2gb is used by the system itself..is it true?",
            "Q:Does it have lifetime subscription of MS Office?",
            "Q:Can we use ms office, excel?",
            "Q:Can I use autocad and Revit smoothly",
            "Q:If I buy this laptop in 2022 will I get it with windows 11?",
            "Q:Is it good for software work?(like for software jobs different softwares has to be installed..)",
            "Q:In this laptop I want to edit videos which one is best ssd or hdd",
            "Q:Does this product have omen command center???",
            "Q:Can it insert CD/ DVD",
            "Q:Can i get this laptop with 256gb sdd",
            "Q:Battery backup time for normal use?",
            "Q:60hz or 120hz display?",
            "Q:Is dual storage option(SSD+HDD) available for this laptop?",
            "Q:Can we keep extra mouse and keypad",
            "Q:Can we change refresh rate to 144 hz ?",
            "Q:What is the generation of the processor like 8th 9th ..?",
            "Q:Number of threads in this laptop. Like how many task can do at one time",
            "Q:What's the generation of this processor,like i5 11th generation",
            "Q:Can i play Call of Duty War Zone?",
            "Q:Can I use one 16 gb ram stick with the inbuilt 8gb stick ? I mean is it possible to upgrade to 24gb ram?",
            "Q:Does it have fingerprint sensor?",
            "Q:Can we play gta 5 , valo , ff , Minecraft , etc games???",
            "Q:Isn't work lumion 10",
            "Q:What is bad about this laptop ?",
            "Q:Can I use auto cad in it",
            "Q:Is it worth it use the hdd as storage after installing an ssd? Would the hard drive have good enough speed for storage functions?",
            "Q:it support sn550nvme 500gb is it available hdd port also & how many ram slot with frequency",
            "Q:Is it worth the price, can I stream games with it?",
            "Q:Free laptop bag also",
            "Q:What is the maximum refresh rate?",
            "Q:Can i run all language like c++.java. python. c in this laptop",
            "Q:is m.2 nvme ssd supported in this laptop?",
            "Q:Can I make ppt",
            "Q:Which Generation & i5 ya i3",
            "Q:Which ssd install for better gaming...?",
            "Q:Which processor i5 ya i3",
            "Q:laptop is useful for coding and programing",
            "Q:Can I insert Sim card in this Device",
            "Q:Is this product provided with full time Windows Office Package? Or else how much I have to pay to Activate the full Time Office package?",
            "Q:Can we upgrade hdd to sdd in this laptop",
            "Q:3D software Working or not or nx an etc.",
            "Q:Is it good for FIFA 20,21 and more future versions which will come,does it work smoothly without any lag and performance issues?",
            "Q:Can I play minecraft without lag",
            "Q:Is it possible to fix m.2 NVMe PCle SSD in that provided upgrade ROM slot??",
            "Q:Can you suggest best ssd for this laptop?",
            "Q:Do we need to activate the graphics card ?",
            "Q:Do we get Microsoft office subscription?",
            "Q:Which Accessories are in the box with laptop",
            "Q:Can we install 2.5\" sata ssd without removing pre-existing hdd",
            "Q:M2 slot available for ssd",
            "Q:Is windows 10 in this laptop lifetime or one year only ?",
            "Q:Can i get ssd in this 62 thousand variant if no then in which variant I get ssd",
            "Q:Can we run gta 5",
            "Q:Can I play freefire on high graphics",
            "Q:can i play free fire in ultra high graphics ?",
            "Q:Can I play gat5",
            "Q:Can we turn off keypad light??",
            "Q:Can we use this for education",
            "Q:Is it good for both gaming and video editing??",
            "Q:Is it good for students",
            "Q:Can i upgrade storage or ram after some time of purchasing ??",
            "Q:Whats the storage?",
            "Q:This laptop is good for study.",
            "Q:Can we connect wired mouse with it?",
            "Q:Which generation 10 or 7",
            "Q:Does the laptop have camera",
            "Q:Do we get lifetime access of MS Office?",
            "Q:How much battery back up it will give when we are playing high end games",
            "Q:Can I add SSD without removing HDD ? Is there any SSD slot ?",
            "Q:Can we upgrade to windows 11 from windows 10",
            "Q:Can we replace 1TB HDD with any of size SSD OR Does it have extra slot with 1TB HDD to add SSD. Can we also add extra 8GB of RAM ???",
            "Q:Can i play sea of thieves smoothly",
            "Q:Does it come with only 1TB HDD or 1TB HDD+256GB SSD?",
            "Q:Is it a plastic body laptop????",
            "Q:DO WE GET A MOUSE WITH IT",
            "Q:Does this laptop has UEFI and secure boot? Because Windows 11 requires them? Will I be able to update to Windows 11 when it drops?",
            "Q:Hp pavilion with i5 Processor ??",
            "Q:How many ram slot and SSd Slot are available?",
            "Q:What is the refresh rate of this? Bsjjss",
            "Q:Does this laptop have NVMe slot for ssd?",
            "Q:Can we upgrade graphic card? If possible how much we can?",
            "Q:Is This Better Then i5 10th Generation Processor",
            "Q:Can I play pubg lite pc in this laptop",
            "Q:Can i use it for 5 years?",
            "Q:Can i install m.2 ssd in this laptop??",
            "Q:can we add an external ssd?",
            "Q:can be change refresh rateee?",
            "Q:Can i play pub g game in it??",
            "Q:Do we get the bag with it?",
            "Q:Can we play mach arena",
            "Q:Can we use this laptop for daily gaming?",
            "Q:How is video and sound quality?",
            "Q:How can i trun on the keyboard lights",
            "Q:Sound quality is good ?",
            "Q:Many it ports of USB GEN 3 it has",
            "Q:Does this laptop support windows 11",
            "Q:Is ram expandable ? Is there any ssd slote?",
            "Q:How much graphic card inside",
            "Q:Can bluetooth option provide in laptop",
            "Q:Is there any ssd slote ?",
            "Q:Can you run Forza horizon 5 ?",
            "Q:What is the screen refresh rate of this device",
            "Q:What's about antivirus",
            "Q:Does this laptop has pre installed ms office",
            "Q:Is this laptop 64 bits or 32 bits ?",
            "Q:how to switch on keyboard backlight?",
            "Q:I mean to it is used to programs purpose",
            "Q:Can you upgrade your gpu in it",
            "Q:It has blinking keyboard",
            "Q:Can i connect wifi without pendrive",
            "Q:Is it normal for a gaming laptop to get heat because even if I play normal game like asphalt 9 it's getting hot very fast? Pls reply back",
            "Q:Does it has M.2 Nvme SSD slot available? Or only SSD Sata slot available? What kind of slot does it exactly have pls reply!!!!",
            "Q:Can we use adobe Softwares in this without any problem?",
            "Q:Boot time for this laptop"
        ],
        "answers": [
            "A:Yes! You can upgrade upto 1TB SSD.",
            "A:You can upgrade RAM upto 16GB and storage upto 1TB SSD.",
            "A:the colour ultra violate",
            "A:just hold the fn button and then press f3 to increase and f2 to decrease",
            "A:Yes but I would recommend you to upgrade your PC's ram to 16gb for smooth performance",
            "A:yes",
            "A:150W",
            "A:GTA 6 has not been launched yet!",
            "A:yes it has ssd slot",
            "A:Yes you can!",
            "A:yeah i actually bought it for the same reason it runs smoothly",
            "A:Yes you can play PUBG on medium settings of graphics",
            "A:60hz",
            "A:yes , you can watch video",
            "A:yes, sinceit has ryzen as processor.",
            "A:no",
            "A:yes",
            "A:buy the ssd hard disk version of this laptop , 4600H is a powerful processor should be able to handle it",
            "A:No , the windows 11 update will available soon in your laptop . You have to do it by your own.",
            "A:yes! I am using AutoCAD, CREO, ANSYS, CNC FANUC, it works perfectly.",
            "A:go with WD 250gb PCI NVME (3500₹) , if you wish more speed and you can have budget above 4000rs. then go for Samsung 980 250GB PCIe NVME",
            "A:yes",
            "A:no",
            "A:yes",
            "A:4-5 hrs for normal use",
            "A:60",
            "A:Yes, you'll get a SSD+HDD variant for a lil higher price or you can buy this 1 TB variant as it has a m.2 slot, which you can upgrade with a m.2 Nvme ssd.",
            "A:Yes, you can.",
            "A:Yes of course",
            "A:9th",
            "A:6-7 with out problems",
            "A:It has AMD Ryzen 5 processor 4600H (4000 series)",
            "A:yes,u can but buy ssd one hdd is slow",
            "A:no",
            "A:NO",
            "A:Yes you can , but for best performance you need SSD",
            "A:yes",
            "A:it is very slow",
            "A:yes",
            "A:both SSS and HDD can not be installed.",
            "A:yes",
            "A:yes",
            "A:No The package does not contain bag. You have to order it separately",
            "A:74",
            "A:Yes very easily",
            "A:Yes",
            "A:Yes",
            "A:it's amd Ryzen 5 processor",
            "A:Buy a NVME SSD its awesome!! , make sure this laptop supports NVME , most probably it will support",
            "A:AMD ryzen 5 equivalent to intel i5",
            "A:Until you put ssd this is like a normal laptop",
            "A:No",
            "A:no",
            "A:Yes you can use hdd and SSD both together as there is M.-2 SLOT available .",
            "A:i've purchaeed this laptop in freedom sale 2021.I've installed AutoCad 17, Creo4.0, Ansys 17, CNC. All os them are working. But system is quite slow purchase that one which already have ssd.",
            "A:no, it's not working smoothly.....",
            "A:yea of course",
            "A:yes",
            "A:Samsung 980 500GB M.2 NVME",
            "A:No it is already activated.there is no need to activate it just create an account.",
            "A:No",
            "A:Only Charger is given along with the laptop.",
            "A:yes you can, m.2 slot is available",
            "A:M.2 2280 FORM FACTOR NVME SLOT M KEY SLOT IS AVAILABLE",
            "A:Life Time",
            "A:yes you can",
            "A:Yes one can run GTA 5",
            "A:yes",
            "A:Yes",
            "A:Yes, you can play without any issue.",
            "A:Yes you can. Dim, Medium, Full, Off",
            "A:For Sure",
            "A:Yes this is a wonderful laptop for any kind of purpose! Its absolutely perfect for 1080p video editing, 4k also works smooth but I would recommend a different panel for this. Overall it's very good.",
            "A:absolutely ... good for studies codings and working",
            "A:Yes, you can.",
            "A:1 TB HDD",
            "A:no",
            "A:yes u can connect it",
            "A:10",
            "A:Yes it have a camera , quality of camera is low",
            "A:MS Office access for 1 month Windows 10 Home for Lifetime.",
            "A:normally without playing games it works around 7-8hrs but while playing high end games it may drain out in about 30mins or less but its better to play while charging to use your laptop to max potentia",
            "A:yes bro u can there is a dedicated nvme slot I have personally added a 256gb sad u can surely go with it",
            "A:yes. I already got auto upgrade option.",
            "A:Yes, sata ssds can be installed in place of hdd and also it has extra nvme SSD slot (1 TB expandable). Also, RAM can be installed.",
            "A:No",
            "A:it comes with 1TB HDD... But you can upgrate to 1TB SSD in the given empty slot",
            "A:yes",
            "A:Nope, you get a built in touchpad that's it",
            "A:Don't go for windows 11 untill it's fixed version is coming. Laptop speed gets reduced and lagging problem was occurred.for a smooth experience you should continue with the windows 10.",
            "A:No this is ryzen 5 4600h processor varient",
            "A:2ram slots 1 is already with 8gb ram stick 1 m.2 slot",
            "A:60hz",
            "A:yes. it have and it has 32gb upgradeable ram",
            "A:You cannot upgrade or change most graphic cards in a laptop. you can upgrade ram and storage by looking at YouTube tutorials. The warranty will be invalid by the manufacturer if you open up the laptop",
            "A:no",
            "A:no",
            "A:No only 2 years",
            "A:No one cannot install SSD in it.",
            "A:sorry we cant",
            "A:Yes",
            "A:yes. you can.",
            "A:No",
            "A:Yes",
            "A:yes",
            "A:awesome 💥",
            "A:use Fn+F5 key",
            "A:Yes it's good and descent",
            "A:two usb ports.",
            "A:yes",
            "A:yes",
            "A:4 GB",
            "A:Yes",
            "A:no",
            "A:yes but for 16gb of ram runs very good",
            "A:60 Hz",
            "A:it comes with a antivirus",
            "A:yes,this laptop comes with pre installed ms office",
            "A:64",
            "A:you can press fn + f5",
            "A:no HDD read write speed very slow",
            "A:No, it's lagging up",
            "A:no ita has only backlit keyboard of single colour constitution and can be set dimmer",
            "A:Yes.. It Has Wifi 6 Support And Dual Band (2.4GHz & 5 GHz Connection. So You Connect Wifi And Enjoy Without Any Problems 😃",
            "A:Yes it's totally normal that's why hp laptop have a amazing ventilation system which allow it to remain cool as contrast to other laptops in this range",
            "A:you can insert only 1tb SSD card in it , it has one slot available",
            "A:sure",
            "A:Too long, the pre installed softwares adds to the delay. I had to unistall all of them. 8gb ram is also not enough."
        ],
        "likes": [
            "64",
            "51",
            "65",
            "5",
            "5",
            "6",
            "5",
            "12",
            "10",
            "4",
            "5",
            "20",
            "12",
            "6",
            "2",
            "7",
            "3",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "3",
            "6",
            "4",
            "1",
            "1",
            "5",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "4",
            "98",
            "58",
            "19",
            "14",
            "2",
            "8",
            "4",
            "3",
            "8",
            "3",
            "2",
            "18",
            "6",
            "4",
            "2",
            "3",
            "1",
            "2",
            "1",
            "1",
            "1",
            "0",
            "2",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "3",
            "1",
            "1",
            "2",
            "1",
            "9",
            "7",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "1",
            "1",
            "1",
            "0"
        ],
        "dislikes": [
            "7",
            "10",
            "22",
            "0",
            "0",
            "0",
            "0",
            "4",
            "2",
            "0",
            "1",
            "20",
            "12",
            "3",
            "2",
            "7",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "3",
            "8",
            "8",
            "1",
            "1",
            "27",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "15",
            "10",
            "3",
            "2",
            "1",
            "2",
            "0",
            "0",
            "4",
            "0",
            "0",
            "17",
            "5",
            "1",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "8",
            "1",
            "2",
            "5",
            "5",
            "123",
            "114",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    }
}