{
    "title": "DELL Vostro Core i3 10th Gen - (8 GB/1 TB HDD/Windows 10 Home) Vostro 3401 Thin and Light Laptop  (14 inch, Black, 1.58 kg, With MS Office)",
    "product_specification": {
        "Sales Package": "Laptop, Power Adaptor, User Guide, Warranty Documents",
        "Model Number": "Vostro 3401",
        "Part Number": "D552149WIN9BE",
        "Series": "Vostro",
        "Color": "Black",
        "Type": "Thin and Light Laptop",
        "Suitable For": "Processing & Multitasking",
        "Battery Backup": "Upto 10 hours",
        "Battery Cell": "3 cell",
        "MS Office Provided": "Yes",
        "Processor Brand": "Intel",
        "Processor Name": "Core i3",
        "Processor Generation": "10th Gen",
        "SSD": "No",
        "RAM": "8 GB",
        "RAM Type": "DDR4",
        "HDD Capacity": "1 TB",
        "Processor Variant": "1005G1",
        "Clock Speed": "1.2 GHz with Turbo Boost Upto 3.4 GHz",
        "Memory Slots": "2 Slots",
        "Expandable Memory": "Upto 16 GB",
        "RAM Frequency": "2666 MHz",
        "Cache": "4 MB",
        "RPM": "5400",
        "Graphic Processor": "Intel Integrated UHD",
        "Number of Cores": "2",
        "OS Architecture": "64 bit",
        "Operating System": "Windows 10 Home",
        "System Architecture": "64 bit",
        "Mic In": "Yes",
        "RJ45": "Yes",
        "USB Port": "2 x USB 3.1,1 x USB 2.0",
        "HDMI Port": "1 x HDMI Port (v1.4)",
        "Multi Card Slot": "3-in-1 Card Reader (SD, SDHC, SDXC)",
        "Hardware Interface": "SATA",
        "Touchscreen": "No",
        "Screen Size": "35.56 cm (14 inch)",
        "Screen Resolution": "1920 x 1080 Pixel",
        "Screen Type": "Full HD LED Backlit Anti-glare Display",
        "Speakers": "Built-in Speakers",
        "Internal Mic": "Built-in Microphones",
        "Sound Properties": "Waves Maxx Audio Pro",
        "Wireless LAN": "IEEE 802.11ac",
        "Bluetooth": "v4.1",
        "Ethernet": "Yes",
        "Dimensions": "240 x 329 x 20 mm",
        "Weight": "1.58 kg",
        "Disk Drive": "Not Available",
        "Web Camera": "720P HD Webcam",
        "Finger Print Sensor": "No",
        "Lock Port": "Kensington Lock Slot",
        "Antivirus": "McAfee Multi Device Security 15 Months Subscription",
        "Keyboard": "English International Non Backlit Keyboard",
        "Backlit Keyboard": "No",
        "Pointer Device": "Touchpad",
        "Included Software": "Microsoft Office Home and Student 2019",
        "Additional Features": "Li-ion Battery",
        "Warranty Summary": "1 Year Onsite Warranty",
        "Warranty Service Type": "Onsite",
        "Covered in Warranty": "Manufacturing Defects",
        "Not Covered in Warranty": "Physical Damage",
        "Domestic Warranty": "1 Year"
    },
    "product_description": {
        "Seamless Productivity": "This laptop from Dell comes with an amplified 35.56 cm (14) Full HD display that delivers rich and bright colors and visuals, taking your entertainment experience to the next level. It also has a 2-sided narrow border which helps enhance the viewing area. The ExpressCharge feature can charge your laptop’s battery from 0% to up to 80% with just one hour of charging. Additionally, the Dell Mobile Connect feature enables smooth wireless integration between this laptop and your compatible iOS or Android smartphone. This feature helps you easily access multiple apps and devices, without any hassles.",
        "Powerful Processor": "This laptop is equipped with a powerful 10th Gen Intel Core i3 and 8 GB of DDR4 RAM, that helps you manage your daily tasks with ease. Not only that, but this Dell laptop also includes an HDD with a storage capacity of up to 1 TB, enabling you to store multiple documents and files in a single place.",
        "Array of Connectivity Ports": "Boasting a wide range of ports, such as two USB 3.1 ports, one USB 2.0 port, one HDMI v1.4 port, an SD card reader, and more, this laptop helps you connect various compatible peripherals to it.",
        "Enhanced Security Features": "This laptop uses the Trusted Platform Module 2.0, a commercial-grade security chip that’s placed on its motherboard, to create and store encryption keys and passwords. This module verifies if your laptop has been tampered with before it boots up and also ensures that your data is protected from any external software/cyber attacks."
    },
    "reviews": {
        "ratings": [
            "5",
            "4",
            "1",
            "4",
            "1",
            "5",
            "1",
            "1",
            "5",
            "2",
            "4",
            "3",
            "5",
            "4",
            "1",
            "2",
            "5",
            "5",
            "4",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "5",
            "1",
            "5",
            "5",
            "2",
            "2",
            "4",
            "5",
            "4",
            "1",
            "1",
            "2",
            "1",
            "1",
            "3",
            "1",
            "1",
            "1",
            "4",
            "1",
            "1",
            "5",
            "1",
            "1",
            "1",
            "1",
            "3",
            "5",
            "3",
            "4",
            "5",
            "4",
            "3",
            "5",
            "5",
            "1",
            "4",
            "4",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "2",
            "4",
            "5",
            "4",
            "4",
            "3",
            "5",
            "1",
            "5",
            "5",
            "4",
            "4",
            "3",
            "5",
            "2",
            "3",
            "1",
            "1",
            "3",
            "5",
            "1",
            "1",
            "3",
            "2",
            "5",
            "5",
            "3",
            "3",
            "4",
            "5",
            "5",
            "3",
            "1",
            "1",
            "5",
            "5",
            "5",
            "3",
            "5",
            "1",
            "2",
            "1",
            "4",
            "5",
            "1",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "1",
            "1",
            "3",
            "1",
            "1",
            "3",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "3",
            "2",
            "4",
            "3",
            "1",
            "5",
            "4",
            "3",
            "1",
            "5",
            "4",
            "3",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "3",
            "4",
            "5",
            "4",
            "3",
            "3",
            "3",
            "3",
            "4",
            "4",
            "4",
            "3",
            "4",
            "3",
            "5",
            "4",
            "3",
            "5",
            "5",
            "3",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4"
        ],
        "review": [
            "Very impressive design with thin and light weight. Easy to carry. Performance is pretty good 👌. Overall value for money.",
            "Found it worth the price of 35k .. does the purpose of your personal notebook .. surfing, storage, zooming, officing, etc .. has good battery backup of 5hrs, nice brightness, scaled matte texture, sound is loud n clear, webcam is HD clarity, upto 4k online videos could play easy, no extra softwares, pre installed windows, lifetime MSOffice, 15 months Antivirus, 1 TB HDD, 8 GB RAM, no SSD model .. make sure you do second partition after setup .. in all its a good one for the purpose !!",
            "very bad laptop audio as i was not even able to listen to teams meeting and zoom call even with full volume. looks like the hardware is bad. I can say this as i have compared the volume with with another laptop (with same model) has a way better sound. with this you can't even work without headphone/earphone on.",
            "Good product, light weight & good battery backup",
            "Guys i got this product delivered with Power button issue and also specification is not as expected what they mention here.\nWhen I requested for refund then #flipkart is not giving me refund also.\nPlease don't buy this product on flipkart they are fooling people.",
            "Nice priduct, processor was little slow",
            "Please don't ever buy this product with few days experience I am writing this message. Processor is very slow 15 to 20mins to login and often it get stuck",
            "Though got the product on time but few keys in the keyboard were not functional. Laptop is still lying with me and Dell is saying that they will replace the laptop after 50 days. My work is completely hampered. I will not recommend to buy Laptop through Flipkart as they are not responsible for any issues you come across once you paid the money",
            "Nice laptop",
            "Very bad Dell laptop I had ever seen. After 6 months it was hanging and lagging. It's very difficulty to open it will take long time to open.\n2 star's only for fast delivery.",
            "Good laptop in this price but not attractive.... Design.",
            "Not worthy at all, the battery performance is total bad and it gets heated quite fast. Still I liked the display and other functions, but, the overall performance is not very satisfying..",
            "value of money.",
            "Best for students 🙂",
            "Not a good decision buying this product. Laptop getting hung quite often. Keys on the keyboard is not in standard place. Very uncomfortable typing as ctrl, alt, delete, function buttons placed un-standard format",
            "Laptop hanging frequently",
            "Very nice ang light weight",
            "Nice podak",
            "Better laptop in this price segment. Speed is good. Battery backup is also good. I think best part of this laptop is separate slot for SSD. So no need to remove existing HHD",
            "Very cheap quality product,very very poor performance I ever seen please it's a my humble request to all of whoever seen my message please don't ignore.I know the worth of money so its my personal request don't go to buy this",
            "This laptop has very slow processor as it seems it doesn't have i3 processor. I don't t think so that this laptop is worth for this price.",
            "Pls don't buy this. It's very very slow loading.",
            "Don't buy this laptop ...trust me",
            "My keyboard is not working fine and the shift functinalty is not working for something keys\nPlease do reply and get my fix done asap\nI have been given a dummy laptop I took 8gb ram and 1tb had and the new laptop it is getting hang\nEven the cursor is taking 2 minutes to move on screen\nHorrible product",
            "Waste of money, just take 2 minute to read this before buying or you regret after 2-3 months of use:-\n1) Hangs a lot\n2) It works like 2 gb ram laptop\n3) Battery does not sustain for long\nAnd many more drawbacks, if you are planning to buy this instead you go for a 2 gb ram laptop",
            "Bought this for online classes. Hardly used it as there was summer holidays. The charging port was loose and wasn't charging properly. Tried with other Dell charger same issue.\n\nConnected with Dell Support - they confirmed the port was loose. However refused to repair it under warranty!\n\nThis is not even 2 months old !! with very less usage and the port is already damaged.\n\nEither the company/seller gave a defective piece or this product's durability is just horrible",
            "The laptop takes is a good one. It takes some time to set up the first time. You have to wait a lot. But, once you are done with that, you don't experience it again. Moreover, there'll be issues with the speed. The laptop Will freeze at times. But, you can overcome this by shrinking the size of the C drive. It's initially 931 GB. Shrink it to 256 GB or lower according to your preference and the laptop won't freeze.\n\nIt has been one day I got it. So far good. I don't know how it'll turn out to be in the long run. I hope it works well.",
            "1 worst battery standby after full re charge..you will get hardly 1-2 hr standby.\n\n2.Lapto getting overheated. Sometimes you assume it will get exploded\n\n3.Frequently get hanged and you have to wait 30 sec to normal",
            "Nice laptop",
            "Super",
            "Hanging issue and bettery backup low",
            "Very slow performance",
            "Everything is quite satisfactory according to the price point of this laptop. If you need some extra fast performance with the same configuration, then you should install a NVMe SSD (internal) as the booting hard drive, from a Dell authorized service centre.\nBut remember, it is one of the laptops those are specially configured only for office work and educational purpose, not for heavy gaming and heavy coding purpose.",
            "Perfect laptop for college students.",
            "Speed is little slow.\noverall good quality..\ncould be better if use SSD hard disk",
            "Giving 1 star for the very bad customer support provided by Dell.\n1. Bought this laptop 6 months ago & its performance has been going down since then.\n2. It hangs frequently & battery backup is maximum 2 to 3 hours.\n3. Onsite Support is mentioned but so far, Dell has not provided Onsite support in spite of my repeated requests.\n4. Request all people who read this to buy any laptop but never buy a Dell product due to very bad customer support & even worse product quality....",
            "Heating Issues. Very slow. Battery backup is almost good. Hanging issues",
            "No speed",
            "Worst product.I purchased on July, 21.within 6 month display got fail.I tried to Customer care.But no one is responded.Pls don't purchase",
            "I never recommended anyone to purchase dell product, within 15 days problem arise with display ,this was ridicules.",
            "Battery backup not good",
            "Slow from the begining. Software issues after a month changed the software.",
            "Worst experience . Got lines on screen .",
            "It takes years to start.",
            "Good product",
            "Hanging problem",
            "Very worst product. I never believe that Dell laptop will peform bad that you can't expect. To boot the system need to wait minimum 5 to 10 minute. To open any file, it is taking minimum 2 to 3 minutes. I can't able to use internet also because browser is not opening and sometimes it is taking minimum 30 minutes to open the browser and it is not allowing to type something",
            "Good.",
            "Very slow...not even good for beginner",
            "Not worth of product",
            "Don't buy.. You won't get refund",
            "Dell bistro which 17 days back I bought is not working that yesterday night stocked . All functions are not working. Even I am unable to close n restart. That is the position.",
            "It's really slow...it's been two days since I'm using it and even at that moment of time it's not working like a new laptop",
            "Nice product, value of products",
            "System performance is slow when compared with other companies System",
            "Very Nice laptop and performance also good.",
            "Very nice product but l need c type in dell in this price",
            "Good one. Very good daily use.",
            "Thing is this laptop get hotter sometimes so that's why I am not able to use it on my lap. This laptop is only for table . And if possible add SSD in it after buying.",
            "This laptop is good. But slow in the starting.But this laptop has great fitures🙂🙂🙂",
            "Hanging issue",
            "Laptop is too slow , after doing all settings as recommended on google to boost the performance still it is too slow to use.\n\nMight be problem will resolve after visiting customer support / OS upgrade but it is painful after buying brand new laptop.\n\nNot at all recommended.",
            "Nice product with good performance...",
            "Good product",
            "Nice",
            "Good",
            "Excellent",
            "Windows os asking licence key. Customer care service is not responceble. So many times i informed. But can not responce. Waste of buying online purchase. Laptop is working very slow. Dont buy online.",
            "Its okk",
            "Good product 👍👍",
            "Though it is 8gb & 1TB I don’t know why it is working tooo slow even not yet 100gb is full.. Might be because of HDD don’t go for this use SSD",
            "Can be better at this price if you have upgraded it to i5 processor or probably have given an option for upgrade with some minimum extra cost. Also, weight factor is still a little high, which can be improved abt 100-200 grams.",
            "Good product",
            "A very good product",
            "Poor service by flipkart. Laptop unboxed and found display is flickering. Tried to replace however flipkart asked to contact service centre. Dell finally came and changed the display.\n\nInitial feel is really good. Got my windows 11 upgrade which gives the laptop a really stylish look. Initial boot look slow but works fine afterward.\n\nOverall good value for money.",
            "Don't bye this laptop after 1yr use this laptop is hanging problm, i can't atten my exam.. I totally unsatisfied for this laptop... Please don't bye this laptop",
            "Excellent",
            "System is not working properly, very much slow , mouse not working properly, how can I solve the problem , kindly suggest me",
            "Good one!!",
            "Good but price is little high.",
            "Processor performance is good,very easy for carrying,and battery backup is 4 to 5 hours.. otherwise best Price for good product",
            "Best Quality",
            "Okay",
            "Good",
            "I reeceived a faulty laptop and nobody fixed this issue neither Flipkart nor Dell.\n\nSuch a disappointment service by flipkart as they dont take any responsibility for the products sold by them.",
            "Slow performance",
            "It is just for simple use only. Not good for programming and can't even think to play games 😅",
            "This product bad quality, Laptop is very hot🌡️ and performance 1% and Flipkart company is not response any reason so Please guys do not order this product",
            "Everything are Ok , value for money ,\nOnly Cons -- need sometime to boot up",
            "I got this laptop tomorrow\nAnd I m very happy with performance and display is also good, battery life is also nice.\nAnd the best part is I got instant upgrade for generation 11\nOverall I m happy with I got",
            "Totally waste of money...it's not working...my laptop updated windows 11 ..then it's not working...",
            "Don't by this product, they are not given good service, the leptop was very slow, when I said for return, they just said that, only replies option is available no refund giving by them, don't by any think from Flipkart",
            "Ram is shown as 8gb. But that much speed is not experienced.",
            "Bad Performance",
            "24 hours mai delivered\nNice 👍",
            "The product is awesome",
            "Battery back is not good . almost backup is there till 2 to 3 hrs only while using.",
            "Nyc",
            "Ok",
            "Best at this price range.",
            "Nice but slow",
            "Not Bad",
            "Highly heated iam confused wasted money",
            "Laptop battery is not good, it’s coming around 2 hours where as it should have been at least 4 hours though it’s mentioned as upto 10 hours",
            "Nice Quality",
            "Good",
            "Excellent working product",
            "Display is very small not as per given information\nPlease go with inspiration instead of it",
            "Best product",
            "Despite of the 8 GB RAM and fast processor (as claimed) this laptop gives only medium to low performance on applications.\nI am not using this one for high end gaming or heavy applications, still getting poor performance.\nSince build quality and battery backup are so good, just going with it...\nEven it takes around 4 minutes to show the desktop.\n\nGiving 1 Star for its performance, not for the product",
            "This laptop was a worst buy. It is slow and sometimes hangs. I requested refund which flipkart rejected. Instead Dell engineer came at 9 pm and he didn't have any idea about the latest configuration of this laptop.",
            "Not working properly. Hanging issues & excel not working properly.",
            "Dell is brand so pruduct performance is good",
            "I like it good product.",
            "Charge is heating & laptop is not opening with properly",
            "I purchased the laptop for my daughter. The performance is awesome. Best buy value for money.",
            "Very very slow... It takes touch of time get open for all the applications.",
            "Good laptop",
            "Good product",
            "Got more than expectations. This is my second DELL Laptop.",
            "Nice product",
            "Very good product..",
            "After few month laptop was very slow",
            "Good",
            "Device is too slow",
            "It's extremely slow.\nNot at all happy. Need to return this product",
            "wrost ever ...its battery backup is not good and its gets hot while using only 15-30 min.",
            "Not good not bad just okay.",
            "Very worst laptop, restart taken more time. Frequently hang",
            "Working very slow.",
            "Good budget laptop",
            "Very good quality. Good backup. Excellent performance. This shows why Dell is the leader in the computer market.",
            "Nice product ?",
            "Super",
            "Nice product",
            "Good",
            "Good product",
            "Awesome 😍😍",
            "Good",
            "Really great product in cheap price.",
            "Nice product",
            "Performance is became very slow.",
            "The product is very good, the only thing it lacks in is the size. 14 inch is the size. If the size increases little bit to 15.6 then it would be nice.",
            "Work good but very sensitive",
            "Nice product",
            "This is not a very good product for regular users. I am not satisfied with it.",
            "The keyboard is utter flop... Didn't expect such a worst quality. If flipkart is still encouraging this kind of sellers they will start losing the customers very soon.",
            "Good",
            "Good aesthetic but not the best!!!\n\nProcessing speed is somewhat slow and sluggish.\n\nUser interface is the best thing about Dell..need more to explore to this..",
            "Faulty display, and they don't cover in exchange / return policy by involving the tech team inspection fraud. Without proper resolution they updated issue resolved. I am still having the same problem in my laptop, why should the customer get faulty things when we buy new laptop. This was my 2nd laptop, first was good. Please buy relying on your luck.",
            "Delivery product by girl was good and fast thanks",
            "Ok for normal use but slow processor not playing games in normal graphics battery backup is also not good",
            "Size is looking small... As like playing laptop... Simple design expected more from dell but got fool",
            "Very very very slow… hanging multiple times… waste of money.. I’m returning this product…please don’t buy…actually I bought this even after seen negative comments.. I realised after I used this laptop… it is taking long time to open even for word document",
            "It was good product designed by dell and right time delivery. Thanks",
            "Battery and taking time during switch on",
            "Battery backup very bad",
            "Good one, worth buying it.",
            "Received in Good Condition as per the described specifications.. Recommend for work for Home setup",
            "Not bad",
            "Product is good for very slow processor.\nSuggest you to Go for i5 or i7 processor.",
            "Terrific product",
            "I am completely satisfied with the size, weight, display, speed, etc. I'm only disappointed with the sound. It's quite low.",
            "Takes too much to get started and processing is also slow",
            "Very good product",
            "Good laptop for education",
            "It's a very nice product . For a 10 mins the speed will be slow but after that it will be like a bullet left from a gun",
            "Battery back up is average....\nPerformance is average",
            "The laptop takes large time to start...After its on it works good...\nDell should work on its i3 processor and the hardware...",
            "This is a worst product. This is working very slow.",
            "Too slow n hanging issue. Suggest not to go with this, instead plan for other series",
            "Display is very good\nThin,compact size,\nPerformance is good\n\nSligtly heating issue\nBattery backup is not good .Hardly 3-4 hrs of battery backup.",
            "After the update software laptop is working good",
            "Nice only for beginners",
            "Screen size too short",
            "Liked it very much.",
            "Speed is very slow",
            "Very nice laptop, loved it",
            "Buy with ssd for better performance.",
            "Laptop working slow even their is 8 gb ram",
            "Excellent display full hd\nDecent fast , good build up\nNot much heat\nValue for money",
            "Nice",
            "System is good but processor is very slow and sometimes its operation is very slow....",
            "Nice",
            "Bettry is very poor.Do not buy",
            "Overall good 👍",
            "Good priduct in this range.",
            "Fantastic buy at this Price",
            "Battery backup very low"
        ],
        "likes": [
            "57",
            "33",
            "45",
            "134",
            "14",
            "85",
            "65",
            "61",
            "24",
            "44",
            "52",
            "3",
            "29",
            "8",
            "34",
            "2",
            "11",
            "7",
            "4",
            "5",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "6",
            "14",
            "8",
            "3",
            "3",
            "3",
            "9",
            "3",
            "3",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "18",
            "2",
            "19",
            "34",
            "1",
            "23",
            "19",
            "20",
            "5",
            "20",
            "26",
            "0",
            "15",
            "1",
            "22",
            "0",
            "5",
            "2",
            "0",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "17",
            "6",
            "0",
            "2",
            "2",
            "12",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1"
        ]
    },
    "qna": {
        "questions": [
            "Q:Can we use for online class",
            "Q:Details of battery backup",
            "Q:There is Ssd slot available in this laptop",
            "Q:can we add ssd after purchas",
            "Q:It is a touch screen laptop",
            "Q:C type port ?",
            "Q:Is RAM of 8 GB helps to maintain good speed?",
            "Q:Graphics Card available?",
            "Q:Is there sim slot is available??",
            "Q:Which genaration is this laptop ?",
            "Q:What is its RAM",
            "Q:Can we upgrade to 12gb ram?",
            "Q:Web cam available or not",
            "Q:Can i use this for coding purposes",
            "Q:Ms office life time",
            "Q:Can We play RDR2",
            "Q:Can we do Vedio editing",
            "Q:This laptop sutable for gaming???",
            "Q:Is it possible to inbuilt SSD AFTER PURCHASE .",
            "Q:Can we use Autocad, corel draw & Photoshop.",
            "Q:Can we add ssd",
            "Q:Charging cable available with laptop.",
            "Q:Is this laptop is good for Sketch up software",
            "Q:In this laptop numerical pad",
            "Q:Can i use 4tb hard disk in this device?",
            "Q:Does it have ssd inbuilt?",
            "Q:Can pendrive insert in it?",
            "Q:Can I run c or c++ program",
            "Q:Can we install our own apps Also like whatsApp etc.",
            "Q:This laptop have finger print sensor",
            "Q:I can install ios software?",
            "Q:Microsoft validity of the product?",
            "Q:its for editing",
            "Q:Bag is provided?",
            "Q:I can use SAP software?",
            "Q:Backlight keyboard is available in this laptop?",
            "Q:We can add SSD In this laptop after purchased",
            "Q:In this pc m.2 system are there",
            "Q:Ready to use once received ??",
            "Q:Is there function of Touchscreen?",
            "Q:In specifications it's mentioned expandable 16gb, did this mean I can't connect 1TB",
            "Q:Is Web camera available?",
            "Q:It is possible to use for a programming language .like c++ ,java , python.",
            "Q:Does it have wifi",
            "Q:What is the rom",
            "Q:Can be play gta 5 or free fire",
            "Q:Is this have fingerprint scanner",
            "Q:is it have seperate number keys?",
            "Q:Can we connect this laptop to Bluetooth headphones like we connect Bluetooth headphones with our phone",
            "Q:What is the graphics card memory given in here",
            "Q:CAN I PLAY CALL OF DUTY",
            "Q:Can I used outlook on this model?",
            "Q:Is it contains charger and adapter wire in its box?",
            "Q:How is it's web cam quality?",
            "Q:What the video ram",
            "Q:Can I upgraded this laptop with SSD after purchase",
            "Q:The body material is metal or plastic?",
            "Q:bluestacks work in this laptop smoothly",
            "Q:Can i download auto cad software??",
            "Q:Can i play free fire in this laptop abd pubg",
            "Q:Is this windows 7 or 10",
            "Q:Is there a dvd player in it?",
            "Q:Is it os provided r not",
            "Q:Antivirus is pre installed or not? If we have to install it ,it can be installed without Cd and how?",
            "Q:Is window licence version of lifetime"
        ],
        "answers": [
            "A:yes if u have good internet connection",
            "A:charging is faster. and battery backup is also good",
            "A:Yes, one NVMe SSD slot and one extra RAM slot are available in this laptop.",
            "A:Yes, you can add an NVMe SSD after purchase.",
            "A:No, not at all.",
            "A:No",
            "A:depend on your work, i am using normally office and photoshop software right. so speed is good.",
            "A:yes",
            "A:Yes",
            "A:10th generation",
            "A:8 gb",
            "A:no",
            "A:yes.... with hd quality",
            "A:Yes, u can but u can go for i5 generation cuz this is i3 which is not that comfortable.",
            "A:Yes its a life time activation,but its a home and student edition.",
            "A:No",
            "A:No",
            "A:No",
            "A:NO",
            "A:No",
            "A:no ssd only hard disc",
            "A:yes",
            "A:No there is no dedicated Graphic card so I think is slow for designing uses",
            "A:Yes",
            "A:no",
            "A:yes",
            "A:yes",
            "A:Yes you can run c and c++",
            "A:Yas you can",
            "A:No",
            "A:Hi, this model is compatible for windows",
            "A:Hi, Windows license is permanent for this model",
            "A:Yes we bought 2 laptop inthe last week.",
            "A:No",
            "A:Yes",
            "A:No, no backlit keypad in this laptop.",
            "A:Yes, you can add an NVME SSD, and I did so.",
            "A:No, it's very lag not working well, it's taking too much time to reboot system please do the needful",
            "A:no, you have to cook first.",
            "A:no",
            "A:No, You can coonect with 1 TB",
            "A:yes it is available",
            "A:Yes... You. Can",
            "A:Yes",
            "A:1TB HDD",
            "A:no",
            "A:no",
            "A:no",
            "A:Yes, I'm able to connect to Bluetooth headphones.",
            "A:4.GB( Intel(R) UHD graphics)",
            "A:yes",
            "A:I am not currently use outlook, because I have no outlook account, but it is acceptable as per my knowledge.",
            "A:yes ; )",
            "A:Good product",
            "A:8 gb and I have not add extra graphics card.",
            "A:yes",
            "A:plastic",
            "A:nope you need better configuration.",
            "A:Yes",
            "A:No",
            "A:10",
            "A:No",
            "A:operating system windows is provided",
            "A:anti-virus is pretty installed with validity of one month, you can download the antivirus software from the internet & then punch in the codes given by the provider eg. Kaspersky or quickheal.",
            "A:YES"
        ],
        "likes": [
            "17",
            "16",
            "44",
            "4",
            "6",
            "8",
            "7",
            "5",
            "6",
            "2",
            "2",
            "13",
            "3",
            "5",
            "5",
            "2",
            "2",
            "2",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "1",
            "2",
            "2",
            "0",
            "0",
            "56",
            "19",
            "21",
            "57",
            "5",
            "3",
            "2",
            "2",
            "1",
            "0",
            "2",
            "6",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1"
        ],
        "dislikes": [
            "3",
            "2",
            "16",
            "0",
            "1",
            "3",
            "2",
            "1",
            "3",
            "0",
            "0",
            "14",
            "1",
            "3",
            "4",
            "0",
            "4",
            "1",
            "2",
            "3",
            "11",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "2",
            "13",
            "5",
            "7",
            "43",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "12",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0"
        ]
    }
}