{
    "title": "MSI GP65 Leopard Core i7 10th Gen - (16 GB/1 TB HDD/256 GB SSD/Windows 10 Home/6 GB Graphics/NVIDIA GeForce RTX 2060/144 Hz) GP65 Leopard 10SEK-830IN Gaming Laptop  (15.6 inch, Black&Silver, 2.33 kg)",
    "product_specification": {
        "Sales Package": "Laptop, Battery, Power Adapter, User Guide",
        "Model Number": "GP65 Leopard 10SEK-830IN",
        "Part Number": "9S7-16U711-830",
        "Model Name": "GP65 Leopard 10SEK-830IN",
        "Series": "GP65 Leopard",
        "Color": "Black&Silver",
        "Type": "Gaming Laptop",
        "Suitable For": "Gaming, Processing & Multitasking",
        "Power Supply": "230 W AC Adapter",
        "Battery Cell": "6 cell",
        "MS Office Provided": "No",
        "Dedicated Graphic Memory Type": "GDDR6",
        "Dedicated Graphic Memory Capacity": "6 GB",
        "Processor Brand": "Intel",
        "Processor Name": "Core i7",
        "Processor Generation": "10th Gen",
        "SSD": "Yes",
        "SSD Capacity": "256 GB",
        "RAM": "16 GB",
        "RAM Type": "DDR4",
        "HDD Capacity": "1 TB",
        "Processor Variant": "10750H",
        "Clock Speed": "2.6 GHz with Turbo Boost Upto 5 GHz",
        "Graphic Processor": "NVIDIA GeForce RTX 2060",
        "OS Architecture": "64 bit",
        "Operating System": "Windows 10 Home",
        "System Architecture": "64",
        "Mic In": "Yes",
        "RJ45": "Yes",
        "USB Port": "1 x Type-C USB 3.2 (Gen 2), 3 x Type-A USB 3.2 (Gen1)",
        "HDMI Port": "1 x HDMI (4K at 30Hz)",
        "Multi Card Slot": "1 x SD (XC/HC) Card Reader",
        "Hardware Interface": "PCIe NVMe",
        "Touchscreen": "No",
        "Screen Size": "39.62 cm (15.6 inch)",
        "Screen Resolution": "1920 x 1080 Pixels",
        "Screen Type": "Full HD IPS Thin Bezel Display (45% NTSC Color Gamut, 144Hz Refresh Rate)",
        "Speakers": "Built-in Dual Speakers",
        "Internal Mic": "Built-in Microphones",
        "Sound Chip": "Realtek ALC 233",
        "Sound Properties": "2 x 3 W Speakers",
        "Refresh Rate": "144 Hz",
        "Wireless LAN": "Intel Wi-Fi 6 AX201 (2x2 ax)",
        "Bluetooth": "v5.1",
        "Dimensions": "357.7 x 248 x 27.5",
        "Weight": "2.33 kg",
        "Disk Drive": "Not Available",
        "Web Camera": "HD Type Webcam (720p at 30fps)",
        "Keyboard": "Per Key RGB Steelseries Keyboard",
        "Backlit Keyboard": "Yes",
        "Included Software": "SHIFT, SteelSeries Engine 3, Matrix Display (Extend), Dragon Center, GamingMode, VR Ready, Cooler Boost 5, Nahimic 3, Nahimic VR, Giant Speaker",
        "Additional Features": "51 WHr Battery",
        "Warranty Summary": "2 Year Warranty Term for Gaming",
        "Warranty Service Type": "Carry-In Warranty",
        "Covered in Warranty": "Part Failure",
        "Not Covered in Warranty": "Physical Damage, Burn, Liquid Spill"
    },
    "product_description": {
        "NVIDIA GeForce RTX 20 Series Graphics": "This sleek gaming laptop delivers an impressive performance, thanks to its NVIDIA GeForce RTX 20 Series Graphics card that offers real-time ray tracing, programmable shading, and artificial intelligence.",
        "10th Gen Processor": "This laptop runs on a 10th Gen Intel Core processor that ensures that your gaming experience is seamless.",
        "Effective Cooling System": "The CPU and GPU of this laptop have dedicated thermal solutions featuring up to seven heat pipes. These pipes harmoniously function to lower the heat while maximising the airflow. As a result, you can enjoy a smooth gaming experience without hassles or interruptions.",
        "Loud, Exciting Audio": "Upgraded speakers, an exclusive audio module design, and an independent sound chamber of this gaming laptop deliver a high-fidelity sound performance.",
        "SteelSeries Keyboard": "This gaming laptop features the SteelSeries’ per-key RGB gaming keyboard. You can customise every key, get real-time in-game status with the keyboard lighting, and also, enjoy the dance of the lights.",
        "144 Hz IPS-level Thin Bezel Display": "This high-speed gaming display offers a vibrant visual experience."
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "1",
            "4",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "2",
            "4",
            "5",
            "4",
            "1",
            "3",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4"
        ],
        "review": [
            "The laptop is a beast...can run all the AAA titles around high to very high, RTX 2060 is upto the mark.\n\nIn terms of video editing i7 10th gen along with graphic does a good job, rendered 8 min video in premiere pro in just around 1:30 min, and a composition about 40 sec in after effects took 18 min, which is a remarkable time limit I must say.\n\nDelivery might be late a day or two because of the time of pandemic but product will reach you\n\nREVIEWS AFTER 8 DAYS OF EXTREME USE\nPROS -\n1. RTX 2060\n2. Cooler fans\n3. i7 10th gen\n4. 16 gb ram\n5. Fast processing\n6. Per key RGB gives a great perspective too\n7. Audio is good (with nahimic software by msi)\n\nCONS -\n1. Battery life\n2. Lags rarely (not a major issue)\n3. Charger need a 16 amp power socket\n\nRest is all good...I can recommend this beast to anyone anyday...don't think about it twice....JUST GO FOR IT.",
            "After waiting for eternity to purchase a good Laptop at a good price, I had given up on i7+RTX specs under 1Lac but suddenly came across this product under 1 lac, did a bit of research and finally bought it. Have been using it for about a month and so far feels like a remarkable purchase! Laptop is very smooth, feels very premium, can handle many resource hungry games like a piece of cake, impressive looks, great RGB keyboard with amazing heptic feedback, touchpad is very smooth, heat dissipation is effective and yes, i7+RTX2060+16GB RAM+SSD just kills it!\nNote: 16GB RAM is divided into 8+8 with both slots occupied ; SSD has one M.2 slot and is occupied so any SSD expansion will require replacement of the existing one.\n\nOverall a very happy purchase for me!",
            "So this laptop is quite good at this range. Used it on multiple AAA titles like apex witcher warzone and most of them were running smoothly at over 100 fps .\nBattery is okay that is quite known for these laptop.\nCooling is quite good as temperature is low at even long gaming sessions.\nOverall a good laptop with decent value for money.",
            "I've owned this laptop for a few weeks now, and I can say at this moment that it's pretty cool. It has a nice premium look to it, I love the combination of the black and gunmetal gray, and the thin bezeled screen is wonderful; she's not kidding when she says the screen is decent. the color accuracy is remarkable and the 144hz refresh rate helps to keep everything crystal clear. Not to mention that this thing can be crazy fast when opening apps and such.\n\nYou'll love this computer from the moment you fire it up and are greeted by its cool keyboard which is vividly backlit with a scrolling light show of rainbow colors. It can be a bit heavy (obviously because of the high performance hardware in it) though. Nonetheless, it's interestingly more compact than your average 15.6 laptop due to the thin bezel around the screen.\n\nSo far, 1L (I upgraded the ram and SSD) well spent.",
            "This is the best that you will get it this price range. Superb display quality and top notch performance.\n\nBattery life could have been better.",
            "I'm really happy with this purchase... First, I received a defective product, after 10 days I got my replaced new product, but it is worth waiting for. The seller (CORSECA) helped me a lot with the replacement.\nI rate 5 out of 5 for Seller.\n\nLaptop Review: (After 2 Months of Usage)\nWhen it comes to performance, it's literally a beast. It runs AAA Titles and Professional software with buttery smoothness. Great gaming experience with 144Hz Display.\nThis CPU and GPU combo gives better performance. Thermal Throttling issues are present, but after under-volting it is good. Screen bleeding is present but not considerable when it comes to a gaming laptop with a 144Hz display.\n\nPROS\nCPU Performance (Boost Clock 5GHz)\nGPU Performance (6GB RTX 2060)\n144Hz Panel (Good Gaming Experience)\nSteel Series Keyboard (Easy to access)\nGiant Speak (Clear and Loud Audio Output)\nCooler Boost 5 (6000+ RPM Dual Fans)\n3-Way Heat Vents\nExtraordinary Battery Durability Features\nSupports Windows 11 With TPM (Trusted Platform Module)\nType C Port (No Thunderbolt Support But okay)\nHDMI and Mini Display Port (4K With 30 FPS)\n256GB SSD + 1TB HDD (Perfect Combo), Etc.\n\nCONS:\nLittle Screen Bleeding.\nLittle Noisy Sound in Cooler Boost mode.\n\nOverall, the best ever laptop I had. If your budget is 90k to 1L, then without a second option, purchase this one (based on my perspective).",
            "This is my genuine experience about this laptop and the journey of finding this machine\n\nI am a disappointed HP 15 laptop owner looking for a good laptop for long term use and msi wasn't in my mind at all....i used to look upon rog,TUF, Predator..etc but was never satisfied in one or the other categories but at one fine day my eyes went upon this laptop and did a whole 4 months research about the msi laptops and their reliability...and was shocked by seeing the heritage and tough build quality and mainly their thermals!! and finally bought this laptop and truly became a fan of MSI the build quality of this laptop is just mind boggling and it's thermal performance is just magical...i literally cried by seeing the outstanding performance in every aspect and they thought every possible to be the best while designing this laptop....\n\nFeatures that im fan of!\n*Cooler boost 5\n*We can turn off the trackpad while using a mouse..so, no accidental touches while gaming\n*We can flip the window key with the function key which was really thoughtful and helpful for those who are used to the left side windows key\n*Steelseries keyboard n number of ways to customise it\n\nIf you are thinking about the battery life it was pretty decent for its tier\n\nConclusion: JUST GO FOR IT!",
            "Using for two weeks now. My two primary needs was data science work and medium level gaming. Excellent performance in both the fields. coders will love typing in this keyboard.",
            "Ordered on 24/06/2021 received on 25/06/2021, was expected on 26/06/2021. Fast delivery within one day. Product package from flipkart was damaged. But internal package from msi was secure. The laptop was as per the specs . Booting is fast one time setup takes a few minutes but its for the first time only so no probs. Over all its awesome. Will use for some more time and give a detailed review",
            "This laptop has checked all the boxes and then delivered more in terms of software support and tricks which make it an overall amazing choice by date in my case.\nThe only drawback is a smaller battery, but even then they provide the option to undervolt the settings and change user profile to provide a better battery performance.\nThey did not cut corners to create this beautiful machine and I can easily say that if you want to experience top notch performance on a budget, this can easily give you all that and maybe a bit more.",
            "1.Good laptop. Got this at 97k.\n2.Battery good enough only for a couple of hours.\n3.Runs all games and softwares smoothly.\n4.Undervolt cpu while gaming to get reduced temp.\n5.speaker quality not very good. But you can't ask for a better config at this price.",
            "Its a great alternative for high-end gaming PC.i wasn't sure of MSI brand but the laptop has all high quality components and a great (at least online one that i tried) support. A great purchase for gaming with portability.",
            "The best you can get in price. Better than all the macs available even M1 is nothing compared to this beast.",
            "4.5/5\n\nHave cut a rating of 0.5 only because of a not very good battery. Discharges in just 1.5-2 hours.\nPerformance: Awesome\nDisplay: Awesome\nTurbo Boost mode: Awesome\nDoesn't heat at all at heavy gaming (GTA V and Fifa 21 at highest graphics)\n\nOver-all worth buying!!",
            "Adding my comment here after a 1½ Month usage.\n\n1. Performance was Awwwwsome.. Just loved it.\n2. Smoothness - Perfect no issue.\n3. I used to play high graphics game like Assassin's creed, Red Redemption - Graphics were awwwsome. Its really very very very very very very nice..\n4. It is easy to make changes on battery mode based on ur purpose of usage.\n5. Display - observed in many comments said like there is a bleeding on screen on dark / black screen, but it doesn't matter yet for 2-3secs max. It doesn't seems to be major effect as display switches on to password enter page / windows home page we don't see anything & display looks good & awesome.\n5. Coming to the main part --> BATTERY BACKUP, same thing as many said like battery backup is acceptable, ok, fine, not much stable.... It depends on the User. Below are my observations with Full charge 100 - 5 & Performance level in 'High'.\ni) Full charged - Mode changed to Super battery. Left idle without working anything and checked - Stood for 5hrs 37mins.\nii) Same on Super battery mode - was doing a game install process in background - stood for 3hrs 43mins.\niii) Switched to SILENT mode - no difference on Silent mode Super battery. Only thing the Cooler fans will be work on limit with slow run on both mode.\niv) Switched to BALANCED mode - here u can come to know from the word Balanced no need to explain it. Here u can observe on Cooler fans will start their job with bit faster based on ur work. Stood for 3hrs 12mins\nv) Switched EXTREME PERFORMANCE mode - Samewise u can understand from the name. Its mainly use of gaming purpose, Cooler fans start their job on 6000RPM speed, bit noise on silent room but its not a matter. Stood for 2hrs 4mins without charger plugged-in while playing Far Cry, Assassin's creed, Red Redemption. Without plugin observed a laggyness on high level graphics gameplay, after plugin asusual its ur time to rock.\n6. HEATNESS - I observed heatness after a bit long usage without a break on playing a high-level graphics games. But its not a matter to those cooler fans leave it idle for 5-10mins, back to normal.\n\nIt's my 1st personal laptop bought after loooooooooooong time. I choose this & am very happy with it now and am very satisfied with the system on this price range. Just go for it guys dont bother about the screen bleeding, battery backup, heatness blah blah blah, again am saying its depend on ur usage... Just go for it...👍🏻👍🏻👍🏻🤗😊",
            "This laptop comes with i7 and NVIDA RTX for 1 Lakh which is reasonable. Packed with great performance which will run most of the games in high graphics but still i recommend to tweak down the setting to keep laptop stable and also the fan is bit noisy. It has 16A power plug which may be replaced with 6A desktop computer power wire than buying cheap plug converters. It may melt during long gaming hours.",
            "We can't get such a laptop with these insane specs.\ni7 and rtx2060 just makes it an all rounder.\nColour accurate topnotch display make it suitable for gaming as well as creation..\n144Hz refresh rate is best for gaming\nCompletely customisable. RGB keyboard\nWe need to compromise battery life as it is normal for a gaming laptop..\nIt can handle intensive tasks like a piece of cake.\nSuitable for adobe after effects,davinci resolve, all adobe stuff😹.\nAlso web cam is given as an added bonus camera quality is good\nIt is much better than acer predator and asus tuf\n•MSI Motherboards are unbeatable and powerful\n•MSI RTX 2060 is way better than others\n•Top Notch colour accurate display\n•Best heat dissipation ever......\nValue for money..... True beast\nNote: buy a 16A switch board to connect to the charger{plug converters not recommended for long term use}\nJust proceed with it you can't get anything better in this budget range",
            "One of the best laptops i ever used. Good performance. Excellent thermal properties. Best in class cooling. only downside is battery life is too low.",
            "If you want to play games and watch movies and some normal work like photoshop or video editing then this is the best laptop under this range but if you are working in game development or 3d then i would say this is not the one which you should buy .. i work in unreal (game development software) so i was not even able to open the project which was of 16 gb it took 1hour or more to open then it just crashed . I did some more projects in 3d the result was the same so for playing games its good for working in 3d its not that good\nWho can buy this just giving rating out of 5\n1.Gamers (5)\nDid live stream of gta 5 full graphics no lag\nDid fifa 21 live stream no lag\n2.Web developer or software engineer (5)\nI worked on some projects it was fine as writing code is not performance heavy\n3.Streamer (5)\nDid streaming\n4.Graphic designer (5)\nI dont do this but it not that heavy\n5.video editor (5)\nDid some renders were pretty fast\n6.3d (2)if modeling a big scene\nWorking on a big scene in blender and facing a lot of problems like slow and laggy performance\n7.3d (4) if modeling a single object\n8.Game developer (2)\nCant work on big scenes for aaa games it keep loading shaders until the death\nWorked on 2 engines unity and unreal\nFor unity i cant say much it was working fine but for unreal its just unreal to run",
            "A amazing gaming Laptop in this range. Great specs, RTX 2060 is rocket like fast. Thin bezels make its dimension good.\n\nPro:\n1. Nice build quality and good looks\n2. Smooth gaming experience\n3. Amazing SteelSeries keys\n\nCons:\n1. Poor battery life, but can't expect more from gaming laptop\n\nOverall amazing product",
            "After 1 week of usage, I'm sharing my little experience...\n\nFirst of all Fast Delivery ( flipkart and it's courier partner ekart did great job )\n\nPro's:-\n* Performance is amazing as you can do multitask while playing AAA gaming titles\n* Cooling system love it ! You have to enable performance mode or can be turn on cooler booster manually to reduce it's temperature after heavy work or gaming\n* You don't need to worry about it's operating system if you feel operating system is not working well (rare chance), because you can reset to it's factory settings\n* Dragon Center let you monitor performance and temperature of your gaming laptop and steal series software to customize your glowing keyboard :)\n* Most of popular AAA gaming titles run above 60fps in high settings\n\nCon's:-\n* Screen bleeding ( visible only on black screen at high brightness example: when operating system boot )\n* Most of time fps below 60 while playing GTA Online but it's normal, no worry about game performance\n\nAfter all I can say that this gaming laptop is Best under 100K for Multitasking, Gaming and Heavy Work :)",
            "After use of 1 month I am writing this review\nDisplay is awesome,nura effect is there bt after some time it will gone\nPerformance is great RTX is best\nDesign is awesome\nSpeed is on it peak point,too fast and smooth\nSome heat issues bt only when use of high and long time",
            "Pros : Temps can be below 75 in balanced mode with medium-low settings and can play any AAA title at 60fps easily.\n\nIdle temp is 40-45\n\nI can see temps going above 95 only when gaming mode is on. Its better to switch it off unless you are playing competitive multiplayer.\nI suggest to change the maximum processor state to 97-98\n\nCons :\nDisplay is just ok .There's low to minimum screen bleeding\nBattery backup could be better\nAnd if you are opting for standard EMI there will be processing fee of 3k (not mentioned in product page) . In my case it is kotak\n\nInitially got one with heavy screen bleeding visible while playing videos and games. Happy that seller CORSECA has replaced it but still there is little bleeding but doesn't interfere with the videos or games . so I kept it.",
            "I bought this laptop for around Rs98000 and I must say the product is good. The built quality is very good metal top and optimum ventilation for cooling.\nPros:\n1. The screen is Full HD (1080p) is sufficient for editing and other jobs.\n2. I am a video editor so rendering speed are so great, it takes around 2-3 minutes to render a 10 min video 1080p video.\n3. It has backlit keypad, which looks attractive.\n4. The price is justifiable for the specifications.\nCons:\n1. The battery life could be improved, at power saving mode it gives 3-3.5 hours.\n2. The product is a bit bulky but sturdy so might not call it a con.\nOther wise perfect for this budget.",
            "Writing the review after 3 months of use\n\nBattery is draining so fast and its not lasting for 1 hr also.\nMSI support team replied like its a gaming laptop so its normal…\n\nWhen i kept the laptop ideal also the battery is draining so fassssssssttttttt…. 4% to 5% of charge ll get drained in a minute…\n\nWaste of money\n\nDnt trust MSI INDIA PRODUCT",
            "Very good product.",
            "needed a laptop that would cover my gaming needs for the next 2-3 yrs and 144Hz was must.\nSo, within 1 lakh budget I think this is the best gaming laptop to get.\nbattery life is average\nI was bit worried about heating issue but GP65 surprised me, heating management is way better compared to other gaming laptop",
            "Amazing Product 🔥\nJust go for it ☺",
            "Best for gaming and editing.. so far it's performance is good.. battery will last for 2.5hrs that's the only draw back. 256ssd will be filled soon if you download and install more games and apps so 512ssd should have been given with this. Speakers are ok but don't expect more on this. Screen bleeding was there but not more. I heard in all IPS display it will be there.. anyways we have 2 years warranty on laptop so thats not the issue for now.",
            "People will tell you about the Pros, let me tell you the Cons,\n\nA bit noisy and the system gets heated but what hell this is a Gaming PC.\nThe Plug is a a big plug and you need to find 15 watts holder, I myself have used a converter.\nThe new NVIDIA update makes the screen flicker so you need to roll back to the older version.\nScreen bleeding can be seen, but this is the problem with all gaming laptops.\nThe steel series Keyboard is pretty good, but the key alignment is bad, I would suggest you to get a additional mechanical Keyboard.",
            "Worth each a rupee.....\n\nPerformance 5/5\n\nStyle 5/5\n\nSurface 5/5 (Seems To be Metal )\n\nKeyboard 5/5\n\nCamera 3/5\n\nSSD RW speed 5/5\n\nHdd RW speed 5/5\n\nProcessor and GPU 5/5\n\nGeekbench score\n\n\n1237 Single core\n\n6270 MultiCore\n\n6064",
            "A beast laptop for gaming, video editing, coding and all multitasking purpose must purchase this if your budget is around 1 lakh",
            "Beast of a machine.\n\nAmazing Combo of CPU & GPU, very impressed. no words...!\n\nPicked it up at 97k INR, Its gone up now.\n\nNo other machine can match its performance even at the present price.",
            "Awesome laptop. Value of money and best under 100k",
            "A beast with value for money",
            "I got this for 97k worth for money",
            "I bought this laptop for deep learning applications, it is working well. In starting I got worried, as the battery was not charging above 90%, I was going to apply for replacement, then I came to know using internet search that i need to change settings from dragon center. Overall laptop is beast, go for it",
            "Absolute beast 🔥",
            "The new silver colour near keyboard area is very good.....Looking premium...I wish back also was same colour...Rest all same as GL6G",
            "Got it at a price of 97k, current price is 146k. I was shocked to see it rise that much. amazing laptop for high end gaming, with great aesthetics.",
            "Definitely a beast never had a problem go for it",
            "got it today.... looks sleek.... setting up....\nwill add performance specs later\n\nthanks flipkart!!..",
            "Awesome!",
            "Certainly a beast for any kind of performance you can do gaming ,video editing whatever you want. Go for it blindly",
            "Thermal throttling is present as cpu temps go as high as 95 on casual gaming.\nUndervolting can help in keeping the cpu cool.\nOther than that, it's a beast .",
            "Although the laptop is good ...there is a problem related to battery...i dont know its a problem or what because battery drain as fast as possible even it did not survived upto 1 hour without charge ...but this problem can be ignored because gaming laptops battery donot last long as when the performance mode is on the gpi starts working and we know it has a massive rtx 2060 gpu. But the real problem is when i shift laptop from performance mode to battery savings mode the laptop performance gets even worst as the dail or common work will also lag. so if you are heavy charged laptop user so this laptop is not for you go for the other one and if you can keep laptop in charging then its a beast which have no competetion in this 1lac price range.",
            "Good product",
            "One of the best gaming beast for the price !!",
            "Lovly to use it",
            "Super laptop, played Alyx : Half life on steam VR with a Acer WMR headset and it was super",
            "Love it",
            "Best product for gaming and cad and 3d",
            "Top performance",
            "Very nice",
            "Good to buy",
            "It's performance like a beast, but Battery is poor",
            "Love it",
            "Fastest delivery ever",
            "Value for money",
            "Good product with great performance but do note temps on this laptop's cpu will reach 95-96°c, which can be easily decreased using throttlestop aur intel xtu app. Played Doom eternal on ultra graphics 110-120 fps, Control with rtx medium and dlss on, gave me around 60-80 fps, some intensive areas showed drops around mid 40s fps. Advice- Get 3060 laptops if available in this price.",
            "Great laptop\nBut was getting frame droms after 2 to 3hrs of usage .\nBattery can be improved . Played valorajt and gta5\nTill date no complaints but frame drops do occur in performance mode after 2 hrs ... and it gets after for playing for around 4 hrs",
            "This product is exceptional and gives amazing performance.",
            "Nice purchase best laptop in this range. Will suggest to anyone who is into gaming or needs a performance laptop.",
            "PROS : 100FPS ON AAA TITLE GAMES ( High Graphics )\nHIGHLY EFFICIENT COOLING\nDECENT PRICING\nCONS : MINOR SCREEN BLEED\nPAM PLACING AREAS FADES WITHIN MONTHS",
            "Very good",
            "I have been using the product since March and it’s a beast 🔥",
            "Look is good..bt battery quality is very power and high heating issue is there",
            "Overall device is good only battery is not that much good it hardly lasts 2 hrs but performance is 🔥",
            "It's good product",
            "1 star removed because of screen bleeding is little bit.\nAnd bettery backup is also very less. About 1/2hour only",
            "1.Resolution is poor\n2.Speakers quality is very poor\n3.Battery backup is less than two and half hrs",
            "Everything is fine!\n\nExcept Battery and Heat Issue :/",
            "Good product in this price",
            "Good product 🥰",
            "Pros- Great performance laptop with great display quality\nCons- Battery backup is not so good coz it's a performance plug and play laptop.\nAfter all it's a gaming laptop.",
            "Super",
            "Writing review after 3 months of usage.\n\nThe product is amazing and performance is top notch.\n\nPros:\nPerformance\nLooks\nKeyboard quality\nDisplay quality\n\nCons:\nMura effect on display\nBattery\nFans sound\nMalfunction of RGB lights\n\n\nOverall I have satisfied with the purchase and but it's little expensive.",
            "Powerfull performance at all.",
            "Sexy laptop 😅😅",
            "Product is amazing only screen bleeding issue 😞😢",
            "Great Product, thank you Flipkart for the awesome deal!",
            "Good",
            "Disappointed with the battery backup and its too difficult to carry this bulky charger 😫.",
            "One of the best laptop out there.",
            "Love the laptop",
            "Great decision to buy this laptop , smoothly performance while using high graphics game as well as coding developing software",
            "Nice",
            "Need to improve the battery a lot it will give you a performance of 2 hrs max",
            "This product has been exceptional. This is performing very well, plus the looks are also very good. The only concern has been the battery life. Rest everything is very classy.\nRecommended for high end games or high computational activities.",
            "Got this at a cheap and affordable range from flipkart.",
            "Excellent laptop with very poor battery",
            "Laptop is very good . I bought for my office purpose.",
            "Good LAP with High End config",
            "Good performance laptop under 1L.\n\nPros:\n1. excellent display unit (better than acer series in/under 1L segment)\n2. The RTX card does what it should. Runs watch dogs 2, gta 5, star wars games at ultra resolution with ease\n3. I also use it for development for AR/VR applications using Unity, Android studio & Vuforia and I had less prob compared to my acer one(though the laptop does gets heated up with continuous andriod studio usage but which one does not?!)\n4. The RGB keyboard is good. I use it with a single tone color which suits my needs\n\nCons\n1. Sound is very less compared to acer or other series. Mic is not that good\n2. Tremendous heat buildup from prolonged usage either for gaming or high end programming.\n3. There's some noise which comes from laptop occasionally when we switch it on (which goes away after shutting down & restarting the machin) I am yet to take it to service center\n4. Worrying situation about service center availability\n\nBottomline, except for few cons, this is worth ur buy",
            "Nice product I loved it",
            "Best laptop for entry level gaming and content creation.\nEven though it has a smaller battery life but yeah we can't expect battery life from a performance laptops.\nAwesome cooling system.\nPer key rgb.\nAnd clicks and satisfying..\nRtx2060 with TGP 115W\nOverall best value for money in its segment.\nIf you ask me ,if you need a laptop under 1 lakh range close your eyes and go for it.better than predator and other laptop in its range.",
            "Laptop is thin and lightweight than i expected. Performance is so good. It is working smooth even while I'm using many rendering softwares.",
            "Review after 1 month of use.\n\nPros:\n- Superb performance (can play anything smoothly)\n- Amazing multitasking (can handle multimedia tasks)\n- Stunning keyboard (backlit and customizability)\n- Dragon center (handles how battery should be charged and other stuffs)\n\nCons:\n- Battery backup (with balanced, lasts only 1-2 hours)\n- charging port location (with a desk, it conflicts with mouse position)\n- Bad speakers and sound (MSI used to have dyna audio, now just cheap Chinese speakers :()\n\nGot at 82k after offer and exchange. So, happy with the game playing and coding, if electricity is there.",
            "Must purhchase",
            "This laptop purely based on internal hardware is amazing running most AAA with decent FPS, a slight heating issue but with a cooling pad it's not so bad.\n\nBattery is not as bad mentioned by online reviews and will last fairly long if kept in battery saver.\n\nSpeaker could be better but I use headphones mostly so not an issue.\n\nBut the keyboard light has started to burnout with my green LEDs in a few keys not functioning anymore. So that's something that you should watch out for.\n\nAll in all a good value for money buy.",
            "Mindblowing performance but battery backup is utter flop",
            "Battery issues is there. Battery drain with in one hour. Even dargon center is not working. I think I should return the laptop. I really disappointed with battery.",
            "This is a Power machine, 115w rtx 2060 is powerful, just turn on cooler booster in extreme performance user scenario in dragon center and it will keep temperature in checked.",
            "beast is here go for it",
            "Great gaming experience, got it at 97k , all the games are running smooth, only con i have experienced as pointed by others is weak battery. Hardly last 1 hour while gaming."
        ],
        "likes": [
            "190",
            "96",
            "44",
            "8",
            "17",
            "8",
            "7",
            "7",
            "10",
            "15",
            "9",
            "5",
            "7",
            "11",
            "6",
            "5",
            "2",
            "1",
            "2",
            "3",
            "4",
            "2",
            "8",
            "0",
            "2",
            "22",
            "55",
            "10",
            "9",
            "13",
            "11",
            "8",
            "7",
            "6",
            "7",
            "18",
            "21",
            "5",
            "7",
            "10",
            "5",
            "8",
            "3",
            "4",
            "7",
            "3",
            "5",
            "7",
            "4",
            "4",
            "1",
            "1",
            "2",
            "2",
            "2",
            "2",
            "1",
            "2",
            "2",
            "4",
            "3",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "32",
            "14",
            "5",
            "0",
            "2",
            "0",
            "0",
            "0",
            "1",
            "3",
            "1",
            "0",
            "1",
            "3",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "2",
            "1",
            "13",
            "0",
            "5",
            "2",
            "7",
            "0",
            "0",
            "2",
            "1",
            "1",
            "0",
            "0",
            "1",
            "4",
            "6",
            "0",
            "2",
            "2",
            "1",
            "2",
            "0",
            "1",
            "2",
            "0",
            "1",
            "4",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "5",
            "10",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:What is the maxTGP of rtx 2060",
            "Q:Core i7 rtx 2060 vs i5 rtx 3060 which is better",
            "Q:Can we customize the rgb light of keyboard ??",
            "Q:Laptop Display is 144hz or 120hz?",
            "Q:Can anyone tell me about the display panel used and how is it?",
            "Q:Can we play gta v and in this graphic mid high or ultra",
            "Q:which ram is used rx8 or rx16.",
            "Q:Is the ram 16×1 or 8×2 gb?",
            "Q:Can we edit 4k video on this laptop",
            "Q:Is it 115 W TGP",
            "Q:Is this laptop has anti glare display",
            "Q:Why lid design is different compare to Advertisment Photo and user posted photo? It's GL65 or GP version? Does this model support all key RGB, I mean separate color for every key?",
            "Q:Which I7 is this.?",
            "Q:How is the build quality of laptop, aluminium alloy or full plastic frame?",
            "Q:2060 or 3050 ti?",
            "Q:How long is the battery backup for gaming?",
            "Q:Is it good to buy now with these specifications or should i ho with other laptops?",
            "Q:What is the storage capacity",
            "Q:When upgrade SSD, HDD, Ram and warranty will be cut?",
            "Q:Does it has cooling fan ? And a separate key to activate the fan ?",
            "Q:Battery life in number",
            "Q:Dose it has fingerprint sensor",
            "Q:Does it support typee C charging input",
            "Q:What r the best laptops fro sketchup software",
            "Q:Use cd and dvd",
            "Q:What about sound quality and volume of the speaker.",
            "Q:i7 10th gen vs i5 11th gen",
            "Q:How many core processor is this? Does the laptop have a USB-C thunderbolt 4 port?",
            "Q:Does this laptop have a webcam?",
            "Q:Can it's usb type c 3.2 gen 2, be used for secondary display? In short can we use lenevo m14 type c monitor with it?",
            "Q:Does it has aluminium body?",
            "Q:Can we get second slot for increase SSD?",
            "Q:Can we increase SSD?",
            "Q:Can we get laptop bag with this?",
            "Q:BATTERY LIFE in normal use?",
            "Q:Can i play all heavy games",
            "Q:AutoCAD will run",
            "Q:can this laptop be upgraded in terms of 1. SSD. 2. HDD. 3. RAM.",
            "Q:Does the logo on the back of the laptop glow ?",
            "Q:Does light is bleeding when you see screen in black?",
            "Q:whats the battery life when gaming and is it better than the gf65 2020 version pls tell in detail",
            "Q:Is tha r ram is expandable??",
            "Q:Normally how much time battery life",
            "Q:Does it has inbuilt MD office",
            "Q:Is this have camera",
            "Q:How is the after-sales support?",
            "Q:Which is better? i5 11th gen with rtx3060 or i7 10th gen with rtx 2060",
            "Q:what is the difference between GL65 and GP65 Leopard?",
            "Q:Why prefer this over g65 with 6gb nvidia 3060?",
            "Q:Can we increase nvme ssd to 1 TB ?",
            "Q:Can I extend ram? If yes then up to what size?",
            "Q:This pc can run Autodesk power shape 2021 ??",
            "Q:what's the screen ms?",
            "Q:Do u get a bag pack with this laptop for this price",
            "Q:How many m.2 nvme slots are available?",
            "Q:Can I upgrade windows 11",
            "Q:What are the upgradable parts? Can we increase RAM to 32gb & SSD to 1TB?",
            "Q:Does the logo on the back actually light up? I've seen a few review videos but didnt see the logo at the back light up. And what is the power provided to the GPU?",
            "Q:which one is better rtx 3060 75w with i5 10500h or rtx 2060 115w with i7 10750h ?",
            "Q:Can I use USB type C headphone and 3.5 mm jack mic with it",
            "Q:does this device is consist of webcam ?",
            "Q:Do we need to use 16amp plug for charging?",
            "Q:It's come with wifi 6 or 5 and Bluetooth 5.0 or 5.1/5.2? Please confirm",
            "Q:Screen size of the laptop?",
            "Q:What is its battery backup for normal use or for browsing?",
            "Q:whats the difference between this(GP65model) and GL65"
        ],
        "answers": [
            "A:My system shows a boost clock of 1560MHz for the GPU and that confirms this is a 115W model.",
            "A:It all depends on which i5 model(4 core or 6 core, what TDP etc) and what is the power limit of the rtx3060 card. There is no short answer to this question.",
            "A:Yes",
            "A:144Hz With Optimized Calibration & vibrant colours (According To My Use).",
            "A:It's not good I'm facing a screen bleeding issue",
            "A:Yes we can Play GTA V On Ultra At Min 70+FPS & Max You Can Guess 😌. (This laptop maintenance it's constant performance with good thermal management).",
            "A:Atleast the one I got came with Hynix 3200MHZ modules 1Rx8, ofcourse this operates at 2933MHz as the i7 10750H only supports up to that speed.",
            "A:8x2",
            "A:Sure you can edit. The processor is very good and fast",
            "A:yeah",
            "A:Yes it is.",
            "A:It does support separate rgb colour for each key.",
            "A:10gen i7-10750",
            "A:Good",
            "A:2060. Very useful as per my req.",
            "A:3-5 hours",
            "A:Yes but its a problem that a line scratch on screen of keyboard when i close it",
            "A:1 TB of HDD plus 256 GB of SSD capacity total.",
            "A:Yes",
            "A:yes",
            "A:its about average 3/5",
            "A:no",
            "A:it support type c input but I never tried for charging.",
            "A:If you are planning to use multiple softwares on this Laptop like AutoCAD, SketchUp, Revit etc. then I would prefer any laptop with min. 8gb Ram, 4GB Graphics specs above this are okay but not below.",
            "A:No",
            "A:awesome",
            "A:i7 10th",
            "A:6 core 12 Thread processor. There is no thunderbolt port of any kind in this laptop. If you need thunderbolt 4, you need to look at laptops with 11th gen intel processors. This one has type c 3.2 g 2.",
            "A:yes.",
            "A:no",
            "A:not full body,bottom is made by plastic",
            "A:There is only one slot for SSD. However, you can replace the HDD with SATA SSD.",
            "A:yes u can",
            "A:No",
            "A:Around 3-4 hours",
            "A:All Games Including CYBERPUNK At High Graphics. (As long term perspective GP65 laptop is better than PREDATOR because of under the hood materials and well optimized system).",
            "A:Yes with ease",
            "A:Ssd yes, Hdd yes, Ram, - currently 16gb , 2 slots 8x8 gb,, can be upgrade upto 64 gb. 16x16 gb",
            "A:Yes it feels BETTER than Apple Macs Logo.",
            "A:yes",
            "A:Battery performance is very bad because of its 144hz display and rtx 2060…while gaming you can play for only 1 hour max to max.",
            "A:Two slots, both are occupied. However this supports upto 64GB RAM, so you can replace the existing modules if you need more memory.",
            "A:1.5 hrs",
            "A:nope",
            "A:yes 720p like most laptop have",
            "A:I bought on May 1st week. Till now no problems.",
            "A:Honestly Go for RTX 3060. i5 11th gen will be faster than i7 10th gen, both have same number of cores too, Trust me brother go for RTX3060 with i5 11th gen.",
            "A:Both are same",
            "A:build quality and features are way better than the g65. Also it's not much of a difference between 2060 and 3060. so build quality and other factors remain.",
            "A:Yes",
            "A:It has single channel ram of 16GB of 3200Mhz. 2nd ram slot vacant. Individual ram slot can take a maximum of 32GB ram. Hence technically the machine can hold a maximum of 64GB ram.",
            "A:Yes",
            "A:15.6",
            "A:no",
            "A:2",
            "A:yes",
            "A:Yes",
            "A:Yeah it will glow",
            "A:Higher Wattage generally means Higher Performance. But the 3060 being a newer GPU, would be better on certain tasks.",
            "A:Yes",
            "A:Yes,it comes with inbuilt webcam",
            "A:Yes",
            "A:wifi 6 and Blutooth 5.0",
            "A:15.6 inches",
            "A:45 mins to 60 mins...tops...",
            "A:Almost the same except the colour of keyboard"
        ],
        "likes": [
            "12",
            "21",
            "20",
            "4",
            "1",
            "7",
            "4",
            "5",
            "6",
            "10",
            "3",
            "2",
            "1",
            "7",
            "2",
            "4",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "23",
            "41",
            "38",
            "36",
            "7",
            "3",
            "6",
            "5",
            "2",
            "2",
            "3",
            "1",
            "1",
            "1",
            "2",
            "3",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1"
        ],
        "dislikes": [
            "0",
            "4",
            "5",
            "5",
            "0",
            "2",
            "1",
            "1",
            "4",
            "7",
            "1",
            "0",
            "0",
            "18",
            "1",
            "15",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "4",
            "19",
            "21",
            "1",
            "0",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "12",
            "3",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    }
}