{
    "title": "acer Swift 3 Core i5 8th Gen - (8 GB/1 TB HDD/128 GB SSD/Windows 10 Home/2 GB Graphics) SF315-51G Laptop  (15.6 inch, STeel Grey, 2.1 kg)",
    "product_specification": {
        "Sales Package": "Laptop, Battery, Power Adaptor, User Guide, Warranty Documents",
        "Model Number": "SF315-51G",
        "Part Number": "UN.GSJSI.001",
        "Series": "Swift 3",
        "Color": "STeel Grey",
        "Type": "Laptop",
        "Suitable For": "Processing & Multitasking",
        "Battery Backup": "Upto 9 hours",
        "Power Supply": "65 W AC Adapter",
        "Battery Cell": "4 cell",
        "MS Office Provided": "No",
        "Dedicated Graphic Memory Type": "GDDR5",
        "Dedicated Graphic Memory Capacity": "2 GB",
        "Processor Brand": "Intel",
        "Processor Name": "Core i5",
        "Processor Generation": "8th Gen",
        "SSD": "Yes",
        "SSD Capacity": "128 GB",
        "RAM": "8 GB",
        "RAM Type": "DDR4",
        "HDD Capacity": "1 TB",
        "Processor Variant": "8250U",
        "Clock Speed": "1.6 GHz with Turbo Boost Upto 3.4 GHz",
        "Cache": "6 MB",
        "RPM": "5400",
        "Graphic Processor": "NVIDIA GeForce MX150",
        "OS Architecture": "64 bit",
        "Operating System": "Windows 10 Home",
        "System Architecture": "64 bit",
        "Mic In": "Yes",
        "USB Port": "1 x USB 2.0, 2 x USB 3.0, 1 x USB Type C",
        "HDMI Port": "1 x HDMI Port",
        "Multi Card Slot": "SD Card Reader",
        "Hardware Interface": "SATA",
        "Touchscreen": "No",
        "Screen Size": "39.62 cm (15.6 inch)",
        "Screen Resolution": "1920 x 1080 Pixel",
        "Screen Type": "Full HD LED Backlit IPS Display",
        "Speakers": "Built-in Dual Speakers",
        "Internal Mic": "Built-in Digital Microphone",
        "Sound Properties": "Stereo Speakers, Acer TrueHarmony Technology",
        "Wireless LAN": "IEEE 802.11a/b/g/n/ac",
        "Bluetooth": "v4.0",
        "Dimensions": "370.5 x 255 x 18.9 mm",
        "Weight": "2.1 kg",
        "Disk Drive": "Not Available",
        "Web Camera": "HD Webcam",
        "Finger Print Sensor": "Yes",
        "Lock Port": "Kensington Lock Slot",
        "Keyboard": "FineTip Keyboard with Independent Standard Numeric Keypad",
        "Pointer Device": "Multi Gesture Touchpad",
        "Included Software": "Acer Care Center, Acer Collection, Acer Portal, Acer Hover Access, Acer Configuration Manager, Quick Access",
        "Additional Features": "3220 mAh Li-ion Battery, Ultra Thin 18.9 mm All Form Factor, Acer Bio-Protection Fingerprint Solution, Control Keys: Volume Up and Down Keys",
        "Warranty Summary": "1 Year International Travelers Warranty (ITW)",
        "Warranty Service Type": "Onsite",
        "Covered in Warranty": "Manufacturing Defects",
        "Not Covered in Warranty": "Physical Damage",
        "Domestic Warranty": "1 Year",
        "International Warranty": "1 Year"
    },
    "product_description": {
        "Design": "This slender and stylish laptop features an 18.9 mm profile and weighs around 2.1 kg. Work all night long without straining your eyes as it comes with a backlit keyboard that illuminates this device's keyboard keys.",
        "High-powered processing": "Its powerful processors ensure - low power consumption, better CPU performance and enhanced graphics for a better multi-media experience.",
        "Performance": "Equipped with 8 GB of DDR4 RAM, this laptop ensures a glitch-free multitasking experience. The NVIDIA GeForce MX 150 graphics offers a truely immersive cinematic experience on its Full HD display.",
        "Battery": "Are you always on-the-go? Enjoy up to 10 hours of uninterrupted usage with its long-lasting battery.",
        "Acer Fingerprint Reader": "Ensure maximum security and experience convenient logging in with the Fingerprint Reader. It scans and verifies your fingerprint to auto login to your windows account.",
        "Touch Display with IPS": "Its display comes with the IPS technology that makes for a wide viewing angle that helps you share content easily. Watch videos or movies in consistent and brilliant colours.",
        "Acer Color Intelligence": "The leading panel software technology dynamically adjusts gamma and saturation in real time to optimize screen color, brightness and saturation. It minimizes clipping and over saturation for an enticing viewing experience.",
        "Acer TrueHarmony": "The Acer TrueHarmony speakers are made of an advanced foam material and deliver a powerful, acoustic experience."
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "1",
            "4",
            "5",
            "1",
            "1",
            "1",
            "1",
            "1",
            "5",
            "5",
            "2",
            "1",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review": [
            "I was planning to purchase Apple MacBook but Flipkart offered me this best in class laptop on Valentine's Day sale @44k with no cost emi...\nFull HD display\nAwesome sound\n2gb graphics\n8GB ram best for GTA 5 players\nSystem boots within seconds due to SSD apart from 1TB storage\nFigure print sensor\nBuilt quality, premium quality\nOriginal windows 10\nThank you Flipkart for such a great deal",
            "First of fall, I bought this laptop for 45K.\nThis is a OUTSTANDING LAPTOP for 45K.\n\n.\n=> BUILD QUALITY\nMetal build, feels premium and quite heavy too though it weights just 2.1KG.\nTrack pad has really good response and large enough (supports gestures). Also having a Fingerprint, though its not good as your phone's one. Also have a backlit keyboard.\n.\n=> PERFORMANCE\nBoots up in 10-13 secs , thanks to 128 ssd.\nOpens Photoshop CC 2017 in 10 secs approx.\nPlaying GTA 5 on Normal settings, Some noticable lags are there though.\nAlso gets heats up very fast during gaming cause of metal body , Fans are below display but display won't get much heated although keyboard got heated on upper side.\n.\n=> DISPLAY\nGot a Full HD 1080p Display with good viewing angles (Better than my friend's HP pavilion). Brightness is low for if you are using in direct sunlight. Screen is very reflective for outdoor use But looks good too in indoor condition, as it having a pure black screen.\n.\n=> BATTERY\nJust okay okay. Normal use 5 Hrs approx.\nGaming 45 Mins( approx) .Plug power in while gaming.\n.\n=>FINAL VERDICT\nGo for this if available near 50K, best deal. But I don't suggest this for 70K.\nFor further information or queries, contact me via Instagram- @govind.2",
            "Anyone who want to upgrade to class one... I they must go for Acer swift 3, 2018 edition... I it is more than a Mac PC... Mac comes with SSD feature only, Any other model in windows come with Only SSD or HDD .. This Acer swift 3 is mixture of SSD& HDD,+2GB graphics... At most lowest price it is available ... If the same features were in MAC or other brand windows and doors and price will be more than 90000RS,, It is most cheapest class-1 laptop... I recommend, better and better for work, grapghics, education",
            "Wonderful Product! Can become a very high end laptop if we upgrade with nvme pcie SSD. It comes with 128 GB m.2 sata ssd, even though it is fast. I have seen the feedback about screen is negative, guys it's an IPS screen and it's perfect with enough brightness. Very thin but not lite weight it's more than 2 kgs. Only the thing I am concerned about is the metal finish it is very slippery please make sure you are holding tight. I got it for 43k with some promotional offers applied and for that ...\nREAD MORE",
            "Hi Guys ,\nHere i am writing whatever i feel after using this laptop for 1 week\nfirstly i got this laptop on big billion day by 45k . And as per my opinion its a best deal at this price .\nhere i'm not going to talk about the specification because it already a labelled on product.\nbut still i am making a birds eye view as this product keep updating every month .this i m saying because when i visited it last time there is difference in\ndisplay which updates to 15.6 inches from 14 inch and one more update is it's screen its previous version doesn't have anti-glare screen but current version have.\n\nSo quick review of Specifications:-\nCore i5 8th Gen -\n(8 GB(DDR4 2400 Mhz)\n1 TB HDD/128 GB SSD(SATA)\n/Windows 10 Home/\n2 GB Graphics(Nvedia 150mx GDDR5) SF315-52G\nLaptop (15.6 inch, display Sparkly Silver, 1.8 Newton weight)\nIPS Screen with anti-glare ,\nkeyboard backlit\n,Finger print scanner,\n\nlets start with PROS:\n1)laptop is madeup of aluminium including all planes.which gives it premium sleek look.\n2)battery backup is good enough more than 8 hrs on normal uses.\n3)Speaker is loud enough but don't expect much as its a laptop not a home theater\n4)display Quality is good enough.\n5)keyboard is awesome.you will feel premium while typing something.\n6)back lit keyboard is good for non lightning condition.\n7)touch paid is enough sensitive.\n8)Good built quality.\n9)wide viewing angle due to IPS display and clear visibility in sunlight due to anti-glare\n10)camera is good enough but don't expect 4K\n11)its boot time is around 5 second. because of 128 GB SSD(SATA)\n\nCons:-\n1)laptop heat while gaming but its fine not that much\n2)although its only of 1.8 kg but still its feel like 3 kg of laptop due to metal finish.\n3)heat vent is present on bottom so little heat if you are directly use it on mattresses due vent block air. but soon\ncool as vent open .\n4)Ethernet port is missing.\n\ni haven't face any issue till 7 days of uses.And one thing that i wanna mention , please must buy acer 3 year extended warranty. while buys this laptop.or later you can register yourself within 7 days of purchase .\n\nthis laptop is best suited for CODDERS,official use ,and also for moderate gammer,\n\nits a best deal for a student having budget less than 50K.on offer time .\n\nthanks a lot to read it ,\nHave a great time.",
            "I've used the laptop for about 2 months now and I can say it's really good!\n\nPros\nInsanely fast bootup time. Not even 10 seconds to start the laptop from a shutdown state. Windows updates are also are over in no time at all.\nMetal build. That feeling you get when it has that cold metal touch when you take it out...\nPretty good graphics performance. Can play GTA 5 with moderately high settings pretty easily. Can't play it on Ultra graphics settings but if you want to do that, why are you looking at this laptop.\nLots of storage. 1 TB hard disk in addition to the SSD for storage and in emergency cases, when you can't install a big application on the SSD due to storage limitations, you can do it on the HDD.\nApplications run smoothly. For a test, I used Premier Pro to render a 10 minute 4K video at max quality and it took just 13 minutes! Miles ahead of my old laptop.\nJust the right weight for me. It sometimes feels surprisingly light.\n\nMeh\nHeat management. This is both a pro and a con. The laptop does heat up when playing heavy games or using resource-heavy applications but it stays mostly on the bottom part of the laptop and doesn't affect the keyboard area. But since the bottom can heat up a lot, it's advisable to get a stand or a cooling pad to raise the laptop bottom so the heat can dissipate properly. It stays cool most of the time otherwise when basic web surfing or anything like that.\nSpeakers are just ok. They can get loud but a bit more bass/low-end would make this the perfect laptop speakers for me. They could be a lot worse since it's just laptop speakers so can't complain much.\n\nCons\nBattery life!! Acer claims it can last for 10 hours but it barely lasts just half that! I tried everything I can find to improve the battery life but max it can last is about 5 hours when just web surfing and normal use. Average is just around 4 hours. This is much lower than I expected when I brought it. But if you turn off the display or close the lid like when you leave it overnight for downloading something, it can last close to 10 hours. So that's nice, I guess.\nBacklight bleed. I'm getting bleed from most of the screen edges and it really weakens the otherwise premium feel of the laptop. It doesn't affect normal use since you only notice it when you're staring at a black image like during startup or shutdown but it's there.\nWish the screen was more color-accurate. Now I have to manually calibrate it to get the right color but even then it isn't perfect. The Asus Zenbook has 100% SRGB gamut if you're looking for that and isn't much more expensive than this at the current price in Flipkart.\n\nAll in all, if you're looking for a powerful laptop that can handle heavy tasks, and which isn't too expensive (not the price right now. Wait for offers.) this is a very good choice for a laptop. It's not perfect but it gets the job done very well.",
            "Yes it's a very nice product. Got this swift 3 at 45K on this Valentine's day. It has each and every feature like a smart phone. It is somewhat slippery, feels heavy weight, looks are superb, running smooth, no ethernet port as it is thin laptop, It has SSD that's the nice point. It doesn't have dvd drive. Backlit keyboard is nice. It is may not be the best at 70K but can be at 58-65K like Asus Vivo book. Full metal build and warranty comes under ITW so warranty works only in Bangalore and Delhi. Overall great product thank u flipkart and ACER.",
            "Best laptop in range. Looks cool, processor does good job.\nDisplay is awesome if you don't mind the glossy panel and mx 150 does decent job in gaming(better get laptop with 1050ti or above for gaming). Sound is okay. Fingerprint is just bonus feature which is rare. Best suited for students with less than 50k budget.\n\nAnd only choose one with windows 10 as this comes with 128GB SSD which can handle it very well.",
            "45k its best deal\nAll are saying display is not grate but we can't even get a 1080p display at price 45k and display is glossy display looks excellent for this price.And antiglare voting is personal preference I don't like antiglare so I won't complaine about Display.price its not good for study because it's not antiglare and have less brightness.it fells like Mobile display it good for movies.\nU can't use it on outdoor\nIt has some lightbleding to but you won't notice\nSound is excellent for this price no words.\nPerformance csgo at 110 to 130fps on ultra i did'nt tried gta5 frames\nSsd helps a lot\nLot of blotware but can be uninstalled\nDon't worry of Itw warranty just follow the steps given below u Will get onsite warranty\nDownload Acer care app on(iOS or android)\nNext signup\nRegister a product and follow the steps as it says later it will ask snid turn back your computer and scan on that's stickers on the backside of the computer it will register your onsite one year warranty\nFells bit heavy\nBuilt quality is awesome\nFor this price ididnt find any con",
            "I am very lucky I got this laptop on big billion day and I am little bit confused about performance of this laptop but but after getting this laptop I can say this is the beast under 45k 😍😍😍😍 just take this if it available under 50k .\ndesign of this laptop is new and aawsum from previous variant .\nit was totally new variant with all improvements from previous variant\n\npros\n- trust me design is really superb feel like premium\n-anti glare display\n-8gb ram\n-128gb ssd led to very fast book\n-really fast fingerprint\n-gaming performance - you can play gta 5 on higher setting on 30 to 40fps all game will run very smoothly\n-battery life if good if you are using battery saving mode it will last up to 7 to 8h on battery saving mode\n- aasum full hd display\n\ncons\n(wait i am finding some cons 🤔)\n- and I didn't find any cons in my point of view\nbut for you me be a weight will be the issue\n\nI highly recommend this laptop under 50k it's a beast 🔥🔥🔥 and it is really very different from her previous variant .",
            "WRITING THE REVIEW AFTER 2 MONTHS OF USE:-\n-I got this lappy for 45k.\n-The performance is super fast as it contains SSD.\n-It boots up in 10 seconds.\nABOUT THE BATTERY- I can see a lot of negative reviews about battery, but trust me the battery backup is really really good.\nAm getting around 6 to 7 hours of backup while watching movies.\n- The game run smooth( i have played only pubg).\n(make sure not to apply heavy load and games for 2 weeks of purchase)\n\n-The display is very good. Sharp and clear.\n-It exactly looks like a Macbook.",
            "I was fortunate to get this laptop at 45k (windows). I was looking for a laptop with SSD that could do average gaming with the latest generation i5.\nConsidering the price at which I bought this laptop, it would not be fair to say that the screen is not upto the mark. It is IPS LED but is glossy and reflective. Apart from the screen, the other thing is that it doesn't have the extra slot for RAM.\nApart from these two things there are only pros in the laptop. At 45k this was the best I could get anywhere in the world. Value for money!!",
            "After lots of searching, I finally choose this laptop because of the paper specification.\nReason for buying the laptop - Latest System Configuration under 50K.\n\nLikes\n- Price - Its biggest advantage. No one is providing this specification at this attractive price.\n- Build Quality.\n- Storage - 128 GB M.2 SSD and 1TB 2.5\" HDD\n- Descent Performance\n- Display. ( Satisfactorily Good)\n\nAbout Storage Partition - There are two drive. First one is SSD (Windows installed here) and second one is HDD (Totally Free).\n\nAccording my need what i dislike about this laptop\n1. Battery backup - Not even the half as mentioned in specification. Getting around 4-4.5 Hrs even on normal usage.\n2. Weight - Feels really heavy. Even its 2 Kg Laptop but its feels like 3.5 Kg.",
            "The Perfect Laptop In This Price Range\n\nPros\n1.Excellent Design Full Metal Body Gives It A Premium Look\n2.Full HD IPS Display With Nano Bezel\n3.Has Fingerprint Scanner\n4.128 Gb SSD Good Performance\n5.NVIDIA MX150 Graphics Big Games Can Be Played at Medium Graphics Settings\n6.Upgradeable Ram And SSD\n\nCons\n1.Battery Could Have Been an Little Better Not Bad On Average 4 To 5 HRs\n2.Keyboard Is Good But Not Perfect Key travel Could have been Better\n3.Sound Distortion At Higher Levels But Headphone Damping Is Good\n\nOver All A Great Deal",
            "I was looking for a mid range laptop for my office use to do some basic regular office stuffs.I had many options in 35-40K range with i5 processor and 4/8GB RAM. After going through few online research i just came across this Acer Swift 3 but the price was around 65K which wasn't the price segment i was looking for. But I just added it in wish list so that i may get it for a better price on Big Billion Day sale. When i check it later it was just 44,990 and it though it was 4-5K above my budget I booked it.\n\nAnd Kudos to Flipkart and Team they just delivered it on time and when I opened it,it was just awesome,\nWell packed, beautiful metallic built which gives very premium look,comes with inbuilt battery and when i power it on,it was just awesome, beautiful FHD IPS Display,nice keyboard layout and it didn't take even 15 seconds to boot up.\n\nAs it comes with 128GB SSD it's superfast,8GB RAM,intel i5 processor,1TB Hard Disk,15.6 Inch Full HD IPS screen with Gorilla glass protection and good battery backup.\nI got everything what i was looking for.\n\nYou can go for it without any second thought.\nGOOD DAY.",
            "The Product is awesome .. the pros and cons for this laptop is\n1.first laptop to provide both SSD ,HDD in this price..\n2.screen is awesome you will fall in love with the screen ,its so slim and it is giving a look as a costly laptop..\n3.latest NVIDIA MX 150\n4.Battery life is 4-5 hrs during multi tasking and for reading and just surfing 9-10 hrs\n5.finger print sensor is ok not too good..\n6.charger pin size is so small that if it is lost,your friends laptop charger will not fit into this and i...\nREAD MORE",
            "Loved the laptop. really amazing one.\n\n**things I loved the most.\n\n1 IPS Display\n2. slim +Metal body\n3. 1tb HDD drive + 120gb ssd ( amazing)♥️\n4. 8 gb ddr4. ram\n5. I5 8G processor\n6. finger print scanner\n7. Very fast in.booting\n8. Nvidia Geforce MX150 ♥️\n9. Genuine windows 10 (A really good thing)\n10. 15.6 inches laptop managed in Portable size compared to other laptops\n11. backlight keyboard.\n\n\n** things I don't love\n\n1. Battery is not that good for high uses.\n2. speakers are not so good. but not bad.\n3. camera is really bad. ( not a big deal by the way)",
            "Had horrible experience with delivery. I got out for delivery notification for three days, rescheduled my work to be at home (had to exchange with my old laptop), and no one came for delivery. Their customer service is good for nothing. In fact, their whole delivery model is flawed. Their out for delivery notification is valid for whole day, and they don't commit on time slot, so in most of the cases I have to waste full day to get my order delivered. Now I hesitate buying from the Flipkart because of their delivery model.\n\ncoming to the product, it has sleek metallic body that looks attractive (though on heavier side). Laptop turns on and shuts down within 10 seconds, a big thumbs up to SSD. 1080p is nice, so is audio. Did not try extensive computing yet, but configuration is good enough for day to day computing need. Definitely a grate value for money!\n\nCons : Speakers are placed on lower side so get muffled voice if laptop is placed on flat surface. There is no Ethernet slot.",
            "Bought this at 45K in big billion sale. Best laptop if you are getting this at 45K. Nice look, good speed and works good with heavy softwares like Android Studio.",
            "awesome product from Acer. no other brand provide these configurations at this price. super smooth performance. premium look, excellent delivery service from Flipkart. brand seal pack product. Flipkart packing was not good. battery backup is very good for normal use. bootup time is less than 10 seconds due to 128 gb SSD. can handle all heavy tasks. 45k is very good deal. Thank you acer and Flipkart",
            "Really a great laptop by acer.\nAmazing spec, amazing Display and Sound Quality, Great Performance with SSD, Fingerprint works Pretty well, Backlet Keyboard awesome....",
            "I don't like to write reviews but this laptop has gone an extra mile and ticked all the boxes of expectations one would have from a machine... I hope the statement is enough and will help to make a good buying decision ... Thanks Flipkart and Acer for a wonderful product...",
            "Awesome product bought it ₹69999 but still very happy with this because at this price it has all latest best facilities... And more than macbook pro of 2 lakh..\nFor Review in detail please visit youtube/THEAvinashRaj\nMy tech chanñel for detail review and more...\nAnd i love ssd and display of this laptop.\nI think it should must have some more accessories than it has for unboxing please visit to my youtube channel simply search \"THEAvinashRaj\" on google or youtube thanks",
            "recieved today..laptops is actually pretty good in design..had travelmate before..so its much better infact feels premium..its thin and sleek for a 15 plus inch laptop..boot speed is 10 sec and less..display is great..watched movies and youtube in hd crisp looking display..good viewing angles..\nbacklit is good keyboard is terrific..typed without any typo errors..webcam is not good..finger print sensor is passable..\n\noverall will give it 5/5 for my needs",
            "One of the best laptop. I have purchased this awesome laptop for Rs 38k in this big billion sale. Thank you FLIPKART , HDFC and RetailNET( the vendor ). The looks and performance both are unmatched..\nBut the battery back is not that good.. it last for 2-3 hours in normal usage",
            "oke there are many positive and negative review.. but this specs are just well worth 60k laptops..if you get it in 45k..then please dont loose the deal.. delete all those bloatwares.. if you can then over clock the processor and hard reset the windows... now you have a laptop worth 70k.. yes the fingerprint sensor just sucks.. bt who cares you have pin... which is much faster.... due to the metal chassis and unusual grill.. thermal aspects are there which may result in cpu throttle.. just use a cooling pad.. or undervolt the processor or redo the thermal paste.... then apps like autocad maya solidworks.. and gamea like gta v fortnite. will be a peice of cake... enjoy✌️",
            "I got it for 40k on dashera big billon sale... it was offerrd fir 45k but I got 10% off on HDFC card... so under 40k it's a awesome product nvidia mx150, i5 8th gen, 128 ssd for window fast boot up, full HD display with less bezel , 8 gigs of ram, slim design and also it comes with window 10 and aluminum body... only con is it's fingerprint scanner it's not reliable.. buts least of all... battery life is also good",
            "it's boots up very fast due to ssd... the performance is great ...but the only negative is tat it heats up very fast the cooling is not efficient",
            "Got this best under 45k on big billion deals. One of the best laptop you can get under 50k. Display is awesome and ssd is doing its job very well.",
            "The laptop has a great design overall. Looks like a MacBook only. Graphics and display are pretty good. I bought it for my Deep Learning research work mainly, though its not one of the best, but it certainly serves my purpose and to play some FIFA during my free-time.\n\nThe only cons from my side are:\n\n1) There's no ethernet port\n2) No port for fitting projector.\n3) The backlit keyboard switches off automatically after some-time and you can't choose the duration of the lights to stay on\n4) Audio is average not that good\n\nAt the end of the day its worth the penny, as I got it for Rs. 45k because of Big-Billion day sale.",
            "Good laptop and go for it if you are looking for a compact and high performance laptop. I got it for Big Billion day @40K and i would say its bargain price.",
            "I get this laptop in 45k and it is best laptop in this range...it gets boot in less than 10sec, every thing is good but it only heat during game play and battery drain very quick....but also charge quickly.....i like this laptop as it slim...",
            "Super speedy....boots in 15 secs. Fingerprint sensor is good...reacts quickly. Battery is awesome. i full charged it and used for 8 hrs continuously, still battery was 8% left..... haven't checked the graphic card performance yet. Will update it later. Speedy delivery and amazing deal from Flipkart.",
            "I have used it now for a few days and I love it.\nPros:\n1) nice sound\n2) multi guesture touch pad\n3) IPS display\n4) slim\n5) fast bootup and shutdown\n6) below 50k it is a value for money\n\nCons:\n1) no lan port\n2) 128 GB SSD will not be enough",
            "Build quality 3.5-5 , display 3.5-5 not much colour accurate , graphics performance-3.7-5 i saw minor thermal throttling while playing graphics intensive games there was significant fps drop. Its very good for daily usage and light gaming",
            "Pros:-\n1. Battery life:- 5.5 to 8 hours depending on the usage\n2. Keyboard:- backlight keyboard with numeric pad\n3. SSD:- Loads OS faster on reboot\n4. Screen:- Good Quality screen with 180-degree movements\n5. Touchpad:- Best in this segment\n\nCons:-\n1. Weight:- on the little heavier side\n2. Lid:- You need to hold keyboard panel when opening the screen-lid\n3. Heating Issue:- Not major but you'll find heating when heavy game usage\n4. Acer Service Center problems: If laptop comes under service, there are very few service centers in India.\n5. Sound quality could have been improved",
            "Display - 10/10 Best Display in this price\nPerformance- 10/9 Best for all basic worg and good for gaming in 720 P gaming\nBattery-10/8 6 hrs. in basic use and heavy use gives 3-4 hrs\nSpeaker- 8/5 gives crisp sound and low base overall good sound\nOverall laptop is good and gives the primum looks for the price of 45K the looks of the laptop is aussom u love this beautiful machine",
            "This is an awesome laptop . Best laptop at best price of Rs 40,000 .If you are looking for a high configuration laptop at affordable price with non gaming laptop look,this is it !",
            "Very good laptop with great configuration\nDelivered in couple of days from flipkart\nTouch id seems ok ;cant be compared to mobile\nSound is clear but bit low\n\nRest everything is cool, metal body finish sleek low weight , awesome purchase in this price",
            "For 40k bucks it is a steal, performance wise a great lappy, the inclusion of ssd does boost the performance and a reduced boot time to a whole new level. The metallic finish with full HD matte ips panel is a plus too. Tnx Acer and flipkart for this offer.",
            "Outstanding laptop for 45k\nGreat specs\nFull metal body\nHDD with SSD - a great plus point\nGenuine Windows 10 Home\nGreat performance\n\nMust buy. Superb deal!!! Thank you Flipkart!",
            "Just awesome 😍😍 I got this laptop around 40k at Big billion sale by applying HDFC debit card...",
            "One of the best buy I recently bought in Flipkart I got this product 45k on Valentine's day sale\nSuperb product\nBest disply\nBest looking\nBest SSD\nAll specifications are up to the mark",
            "IT COST ME 45K☺☺ IN FLIPKART BIG BILLION DAY. EVERYTHING IS WORKING VERY FINE",
            "Performance was good initially but after 4-5months usage of this laptops I had face some lag and since 1 months facing keyboard issue , keyboard button are automatically started working after switching on it.\nworst thing is that Acer is providing international traveller warranty (ITW) on this laptop but in my state (Bihar) there's no Acer ITW service centre.",
            "Bought this for 40K. It is an excellent product. It has everything one needs. Don't be fooled by fake reviews. This product is genuine and does not have issues.\n\nI have seen many people reviewing that it seems heavy. I am truly saying it does not at all feel heavy. It belongs to the ultra-slim series of ACER.\nSecond issue people say it has a poor battery backup. During fair usage i would say it lasts for around 5-6hrs and if you are on linux with NVIDIA disabled it gives a battery backup of around 10 hrs. So its actually great.\n\nGo for it under 50K budget.",
            "No. 1 Laptop under 50k..!😉 ALL GOOD Except Battery backup while playing games..!😁",
            "Best laptop at this price 180 ° rotation and more........",
            "best product within Rs 45000. This is my first Acer laptop. with comparison to other brand, in this price range, i thik, this is best. but battery backup is very poor due to full hd display. for work in autocad, or any other high graphics software, performance of this laptop is very nice.",
            "Flipkart delivery is good and fast. item delivered with in 2 weeks. But after one month one drive is not opening, showing \"Scanning & repairing in progress\" I contact Acer costumer care, they are saying that as per serial number they had given Linex PC and distributer change its operating system to Windows so warranty is not valid. Now am in touch with Flipkart to solve the issues",
            "I have got this laptop@ 45k on first sale,built quality is solid you are getting almost everything in this price point even the laptop regular cost is ₹65000 but still it manages to give more than its price point.and you can also compare the specs of this laptop from other companies definitely you can't find better than this!!",
            "For the price i bought i.e 45k it more than worth it. Its got all the features that a 50k laptop should posses. For 70k I'll give 4 stars",
            "Flipkart 1/5.\nTook 7 days to deliver the product in new Delhi.\nNo doubt, it is a pack of good specifications. But it's heavy. Design could be improved. Sharp edges on front.\nI dnt know its a new feature or a damaged product. But the touchpad can be pressed without even applying pressure on it.\nA bit mismatch in alignment between screen and lower panel.\nEthernet should be there.\nBut as per the price (45k) it's acceptable.\nNice screen. 4/5\nNice audio(Dolby) 5/5\nFingerprint. 5/5\nBattery, it is claimed as 10hrs on lappy itself but hardly 4 to 5 hrs. 3/5\nDesign 3/5\nBuilt quality 5/5\nBut HEAVY.",
            "It has keyboard issues.",
            "much better than Mac book Air in all sense.",
            "Got it in 40k on big billion day .....i got everything thing i want in a laptop...\ni5 8th gen processor\n128gb ssd + 1 Tb Hdd\n2gb ddr5 Mx150 + intel UHD620 graphics\n8 gb ddr4 Ram\nbacklit keyboard\nFull hd IPS display\n10 hrs of battery backup\nsuper audio quality\nMetal body with sleak and compact design\nbetter than 58k apple macbook....",
            "This is my third acer laptop. I really have to say all are awesome. Unlike most of the brands acer focus more on functionality rather than aesthetics and advertisement. I got this laptop for 45K thanks to Flipkart. They also gave 7500 for my old laptop.",
            "keyboard not working ...repeating x . i dont think itw will work . Dont buy",
            "Got it for 43K in first sale ?. Steal deal. Not worth more than 50K",
            "Please read it carefully. Never ever buy Acer laptop they make very low quality product and their support is horrible. My laptop stopped working after 2 months and they don't even have parts to fix it. Everytime I go to repair my laptop, they say they need to import it from another country. Worst support. Please do not buy it. If you don't believe me go search over internet you will see thousands of people complaining against them. Just don't ever buy Acer products . They make low quality cheap products and their support is worst.",
            "Excellent product .. Best leptop ever",
            "Excellent 😍😍",
            "A very beautifully built laptop from Acer. The only thing that did bug me is the unfinished metal frame which goes down to the bottom a little roughly and feels sharp. I would have preferred a more rounded and well finished edges. But then I can't complain about anything at this price point. It cost me Rs. 44,990, which is unbeatable deal given the specifications like none other. Thanks to the Acer and Flipkart team.",
            "Very good product Thanks to Flipkart",
            "Overall laptop is very good but fasing some prblm in conecting it to mobile via usb",
            "Best laptop in this price range. Got it for 40k.",
            "best laptop in this price range 🤟🤟 I happy to have it",
            "Great laptop for this price!",
            "Best laptop u can get for 45k . No words to say",
            "This is the best laptop if you can have this under 50k.\nAll the features are going to the pros section and the only one cons is its battery backup. It hardly lasts for 5hrs to 6 hrs.\nAnother thing those who have doubt about ITW, I can clear you about the concept.\nAll the Acer laptops initially have 1 year onsite warranty and the ITW(International Travellers Warranty) is the extra benefit you are having. Suppose you are going abroad and you face issues or your laptop gets damaged, in this situation you can visit ITW centre of that country. Likewise, if any foreigner comes in our country and he/she faces some issues he/she can visit our country's ITW centre.",
            "Great product from Acer!\nSuperb build quality and specs. Though the packaging from flipkart was worse and all torn up which maybe due to huge demand during big billion days.",
            "no word for laptop just awosome .... Flipkart thank you for such discount 20k you made my day .. everything is good except packaging . first time I feel bad about your packaging please get feedback from your packaging department , I don't know because of big billions day your company facing some issue or else .\n1) laptop 10/10 - look , build quality, camera, SSD HHD, weight, RAM , graphics , performance, style\n\n2) packaging 5/10\n3) delivery 8/10",
            "Good product with really good design.\n\ngood work Acer.",
            "nice laptop..must buy.",
            "Go for it got it on valentine day at 45k\nAwesome smooth run\nBattery life 8hrs",
            "Excellent pperformence and good offer under 45 k\nGreat deal and best product",
            "Excellent laptop in this price range but issue with the fingerprint scanner.",
            "Best laptop",
            "Best laptop at this price , amazing processor",
            "Best laptop...",
            "From unexpected hanging to hours of not working, it just is piece of garbage....\nRestarted it two times and it took full night to switch on..... I got for 45k and thought that i was blessed but they sold some non working piece of garbage ....also not miss, light bleeds from top....",
            "(After 10 months of use)\n\nLightening fast performance due to SSD and 8gb ram\nBoots in 2 sec\nGreat display/graphics\nRuns high end games smoothly, without lag\nNot very lightweight, but can't expect it to be light with an Nvidia graphics card and 1tb hdd\n\nReally amazing laptop!",
            "Backlit bleeding is pathetic from all the corners and edges even after 3 replacement and also in my friends laptop, Hinges makes irritating noice, chasis also not seamlessly fixed. SEVER QUALITY ISSUES CHECKED IN 4 DIFFERENT LAPTOPS OF THE SAME MODEL. Although Flipkart was very cooperative (and time taking also).",
            "every thing is good except gameplay lag with this configuration ....lag is also with PUBG",
            "Got it in 45k... Best price ever and best laptop ever... And if anyone don't want laptop in 45k then give me the laptop... I will give u 45k",
            "Very bad from Flipkart. They are selling this product from 45k to 68k, this is very wrong. Few customers got this at very high price and some at very low price.\n\nThe price of any product should not alter that much and there should be a common ground, +-5k is acceptable range.\n\nApart from that the product has a miniscule SSD and poor dim screen",
            "In acer swift 3 series, there is a big problem with motherboard specially in power section . So my advice is go for dell, hp, or lenovo laptops.",
            "very very pathetic Acer India support. They don't respond if your laptop has any issues. keyboard stopped working after 2 months.",
            "Previously I had given it a 3star rating but now I am going down to 0 Star my 2months experience. I was completely gone mad choosing Acer product for my business use. One of the main issue with acer is its Battery and Technical Support. These guys never respond you even via Call or Email. You just keep on mailing these guys but none of them will ever reply you back. And just within 2 months, my battery got dead and I complaint for it, and its been almost 14Days, But the battery is still not delivered from warehouse to Field technician,\n\nI highly recommend you all to stay away from Acer if you guys are planning to invest a bigger amount in a business laptop. Simply Go with Dell, HP or Apple because their support is amazing. They figure out any system issue within 3 to 4 days max.",
            "As a programmer, I would highly suggest that don't buy any laptop from ACER, this comes with tons of headache infact this is my genuine review after using it for more than 8 months and observing the same issues from other ACER users. Sometimes the battery charging will stop all of sudden, sometimes the keys won't work, sometimes the system will shut down unexpectedly and you will end up spending too much money on the hardware. I would suggest to go with a different brand if you are a avid user, because seriously you can't rely on this brand at all.",
            "One of the best purchase of my life....",
            "Best product ever, i nearly get 8-9 hrs battery backup even after 2.5 years, Blazing fast processor even though its 8th gen.\nGaming performance is not good, because of the slim design the system gets heated fast slows down the FPS.",
            "System crashing after 2 years of usage.",
            "Got Faulty product ,Hard Drive space was not showing up.Resolved the issue through warranty.But carefully check whether al the drives etc are installed.And return period is also a big concern",
            "This is the worst laptop I have ever used. Could not even play Asphalt 8 without latency. If you looking for gaming this is a big NO",
            "best of all the laptops.....\nfist of all I bought this laptop first time...\nand I trust this company & I hope this will we best\nand it's durability is much more...",
            "Best laptop under 50k",
            "Superb purchase",
            "Awsum product",
            "awesome product by acer it worth\ngreat performance and boot is just on click the only con is not provide carrying backpack"
        ],
        "likes": [
            "109",
            "99",
            "40",
            "12",
            "12",
            "13",
            "16",
            "9",
            "4",
            "9",
            "6",
            "5",
            "6",
            "4",
            "5",
            "4",
            "2",
            "2",
            "2",
            "2",
            "2",
            "3",
            "8",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "14",
            "29",
            "14",
            "8",
            "7",
            "6",
            "12",
            "3",
            "3",
            "7",
            "4",
            "5",
            "2",
            "3",
            "2",
            "3",
            "5",
            "3",
            "5",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "7",
            "2",
            "3",
            "1",
            "1",
            "3",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "18",
            "12",
            "17",
            "0",
            "1",
            "2",
            "4",
            "1",
            "0",
            "2",
            "1",
            "1",
            "2",
            "1",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "13",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "5",
            "5",
            "0",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "3",
            "1",
            "0",
            "1",
            "1",
            "5",
            "0",
            "0",
            "3",
            "1",
            "2",
            "0",
            "0",
            "0",
            "1",
            "7",
            "2",
            "6",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "11",
            "2",
            "7",
            "1",
            "1",
            "9",
            "2",
            "3",
            "6",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:What is the processor variant?",
            "Q:Is the screen too refelctive? and what about the display brightness?",
            "Q:is this laptop suitable for running engineering softwares like solidworks and creo?",
            "Q:How good is this for 55k Because I'm getting for it I know u all guys have brought for 43k but still suggest me can I buy it for 55k??",
            "Q:does it have cpu fan? if yes then where?",
            "Q:Does this laptop come in grey colour?",
            "Q:is anyone facing any problem in this machine? i am thinking to buy it,.plz suggest guys",
            "Q:Is it good for animation and graphic designing",
            "Q:is the RAM configuration 4GB*2 or 8GB*1?",
            "Q:does it has touchscreen",
            "Q:Has it another ram slot?",
            "Q:1. How much space you get 'to use' on the SSD of 128GB? 2. How much is taken by the OS when you buy it?",
            "Q:Does it support Windows Hello ?",
            "Q:which variant of the MX 150 is used in this laptop? MX150 1D10 or MX150 1D12?",
            "Q:how to get it 45k in this year",
            "Q:which version of graphics card it has ? mx 150.0 or mx150.1 ?",
            "Q:how is its gaming performance?",
            "Q:How much ram does it have Battery backup Can we play heavy games It is value for money",
            "Q:does it having fhd screen",
            "Q:What is the capacity of 128 GB SSD? Please see the drive and tell. 128GB in real life is won't be 128 GB, So, that's important for me.",
            "Q:does this particular model have narrow bezels...?",
            "Q:Does the SCREEN BLEED when you see a dark BLACK screen in a DARK room?",
            "Q:does it comes with Corning Gorilla Glass..???",
            "Q:Can we upgrade the graphic card from 2 GB to 4GB ??",
            "Q:can we add the ms office",
            "Q:What about doing Office work? How fast it is with loading & working with heavy software like - Visual Studio(2017) -Sql Server and other many software running simultaneously for longer period of time?",
            "Q:Can I attach docking station via USB type - C port for multiple display output? Does it work well with docking station.....? which docking station, name please?",
            "Q:Is the RAM soldered into the motherboard?",
            "Q:Does this laptop have screen bleeding issue? Did you check it with 100% brightness on and in dark room?",
            "Q:does it come with optane memory??",
            "Q:what is the device name of the mx150 GPU? is it 1D10 or 1D12?",
            "Q:does this model come with a black color variant... if yes , tell me how to choose and buy it.",
            "Q:how is the build quality? is it plastic or metal?",
            "Q:does this laptop have nano bezels for the gray version ?",
            "Q:does it support fast charging and usb type c has charging capabilities?",
            "Q:does it have an NVMe slot??",
            "Q:How to get in max off now....",
            "Q:what's the clock speed of the processor is it from 1.6ghz to 1.8ghz or 1.6ghz to 3 6ghz..?",
            "Q:Processor how mutch",
            "Q:Is this fully metallic? Or is the lid and chassis metallic and the bottom is plastic? Also can the 1080 HD sticker at the bottom of the screen be removed? Is acer domestic warranty available ?",
            "Q:can we upgrade ssd?",
            "Q:I am suffering from RAID 0 problem in this laptop my full capacity of the Hard disk is not visible. Can any one help me?",
            "Q:When this laptop is available?",
            "Q:Does the laptop has fingerprint sensor??",
            "Q:is this laptop fold 180° or not?",
            "Q:how is antiglare display? is it really antiglare?some people are talking it is glossy",
            "Q:does it have both ssd and harddrive ?",
            "Q:why wrong pics are displaying at the product page. real laptop is different from it.",
            "Q:is this 51g 2017 model or 52g 2018 swift 3 ?",
            "Q:according to new specifications the screen is anti glare , so can anyome confirm it ?",
            "Q:does it have a dvd slot?",
            "Q:Is this is black lit keyboard?",
            "Q:does it have finger print scanner",
            "Q:Does it is made up of plastic",
            "Q:How to get it at 45k?",
            "Q:backlit keyboard ? or just few illuminations",
            "Q:how is the brightness of this laptop screen I heard alot bad things about the screen brightness",
            "Q:How does 128 GB SSD helps in performance?",
            "Q:What is the real battery life of this laptop ?",
            "Q:which graphic card?",
            "Q:I want to buy a laptop for programming 12 languages and cyber security .this laptop is good or bad?",
            "Q:Is it suitable for video editing and if yes so how",
            "Q:Is MX 150 graphic card better than 940 MX ?",
            "Q:Can we upgrade the ram in this as the discription of this laptop states that the ram can be upgraded in it upto 32gb? and if yes how many slots are present?",
            "Q:This laptop have MX 150 1d10 or 1d12 variant of nvidia graphich card?",
            "Q:Does it come with pre-loaded windows?",
            "Q:can i use this laptop for gaming .pubg,fortnite,watch dogs or etc",
            "Q:Can we expand RAM in this specific model - SF315-52g? In the task manager it states that 1 out of 4 slot Used",
            "Q:Where and How to download drivers for your laptop?",
            "Q:what is it's actual weight?",
            "Q:tell me about gaming performance....can i see any lags when i play heavy games like FIFA 18, FARCRY 5, GTA V , NSF etc.?",
            "Q:how its webcan??",
            "Q:Does it have 14\" or 15\" screen?",
            "Q:what is the battery back up of this lappy ?",
            "Q:dual boot with kali linux is supported?",
            "Q:Can anyone help me out about the processor Version? I mean it has i5 8th gen processor but no information about model !! ( 8250U / 8350U / 8500U ) etc.",
            "Q:Does it have 2 ram slot? I mean the ram is upgradeble?",
            "Q:Does it have dedicated graphic card?",
            "Q:it's SSD is upgradeable?",
            "Q:Is MS Office in this laptop licensed?",
            "Q:Does this laptop has light bleeding issue?",
            "Q:how many hours it will take to charge fully? also how many hours we need to plug in for the first charge ..",
            "Q:what is the model number??",
            "Q:Is the keyboard backlit?",
            "Q:How are the speakers?",
            "Q:What's the battery capacity and the battery life of the laptop?",
            "Q:I cannot see 1 tb hard disk space ?",
            "Q:how is the packaging experience with this laptop and also with Flipkart",
            "Q:Can I dual boot this system with Windows as well as ubuntu?",
            "Q:How is the multimedia experience especially audio in this laptop?",
            "Q:How good is the trackpad?",
            "Q:in this available light keyboard",
            "Q:Does this laptop screen bleed?",
            "Q:is the swift logo written near the screen?",
            "Q:did i get backpack with this",
            "Q:does it have ethernet port?",
            "Q:what is memory slot? upgradable to 32 gb?",
            "Q:does it have fan? coz I don't see any ventilation..",
            "Q:is it also available in DOS version?",
            "Q:Does it have backlit keyboard?",
            "Q:Does it support fast charging?"
        ],
        "answers": [
            "A:Intel Core i5-8250U CPU @ 1.60 GHz, 1800 MHz, 4 Core(s), 8 Logical Processor (s).",
            "A:Yes it is...If you are using in low brightness then you can see ... Brightness is good..",
            "A:yes",
            "A:55k for i5 8th gen with MX150 and SSD you asking? You better grab that deal!",
            "A:CPU fan is situated in between the screen, at the center. An Air fondition is also available on the charger for cooling",
            "A:yes i bought it in gray colour 😊",
            "A:Not facing any problem, running fine. But if you're buying it for 70k, i won't suggest this. You can get better than this. ( I bought it for 45k during sale)",
            "A:Yes, I myself bought it for animation and graphic designing. But i bought it for 45K, If you are buying it for 70k, You can get better laptop than this.",
            "A:8x1",
            "A:no",
            "A:As much u know. NO. Ram is not expandable",
            "A:In new condition i got 90 gb to use.",
            "A:yes it does.",
            "A:MX150 1D10",
            "A:buy in the BIG BILLION DAYS.",
            "A:150.0",
            "A:using a cooling pad ...its a beast and more than sufficient for mid level gamers",
            "A:of course it has mx150 n videa graphic card",
            "A:Yes, it does.",
            "A:you'll get around 118GB",
            "A:actually all acer swift 3 laptops have narrow bezels but this particular model come with anti glare display with ips display",
            "A:yes lightly.. but considering the quality of screen its just a quirk... the screen is awesome.. better than its competitors like asus vivobook hp pavilion etc..",
            "A:no",
            "A:No",
            "A:yes",
            "A:The machine is pretty smooth and can actually handle software heavier than what you have mentioned. I have tried out SQL Server, Netbeans , Adobe CS and Solidworks and the experience was great.",
            "A:Dell DA200 I have used and working fine. it's having VGA port and can use both displays",
            "A:no. there are two ram slots in 52g model.",
            "A:No issue",
            "A:not needed ,comes with 128 GB SSD ,all system programme will run on it",
            "A:1D10",
            "A:no this does not come with black variant",
            "A:Built is good. Top is metal. Bottom is plastic but good quality.",
            "A:All versions have same width of bezels, and even though bezels are not very thin, they are thin enough to look likes this generation laptop.",
            "A:no fast charging.but compared to other laptops. it will charge little bit faster. type c has no charging capabilities.",
            "A:Yes. But One 128gb sdd is already installed in that slot",
            "A:wait for 1 year or big billion days.",
            "A:1.6ghz to 1.8ghz bro",
            "A:1.6 and 3.4 at overclocking.",
            "A:body is fully metallic and you can remove 1080 HD sticker and acer international warranty mins it will cover all over india service center and also out side of india international warranty center.",
            "A:noo , you can only replace ssd",
            "A:Best call up Acer helpline, register your warranty and get help.",
            "A:14th oct",
            "A:yes. it has.",
            "A:yess it open upto 180°",
            "A:It is glossy",
            "A:yess it come with ssd and hdd which make it perfect laptop",
            "A:nope",
            "A:52g 2018 model manufactured in June and July",
            "A:yes. it is anti glare",
            "A:noo , there was no any dvd slot",
            "A:yes",
            "A:yes",
            "A:No, it's not plastic. it has fully metallic body. Due to this it's little heavy.",
            "A:That was a special launch offer, when it was sold for 45K. Yiu might get this in 45K in maybe another sale. Wait for it.",
            "A:backlit keyboard",
            "A:screen bright ness is super no issues with screen brightness",
            "A:Dedicated SSD card help to boot faster. With 128 GB SSD card you can boot your system faster",
            "A:About 4hrs",
            "A:Nvidia Geforce MX150,which is a mobile version of GT 1030.",
            "A:Blindly go this.I am using for the same. Due to SSD programming applications are loading superfast. No bloatware.",
            "A:yes. it is suitable for video editing because it comes with nvdia mx150 graphic card which is really awesome. I have After Effecta CC 2018 installed in it and working really fine.",
            "A:Yes. MX 150 graphic card is far better than 940 MX in terms of support. You can play 4K videos and play all the games seamlessly with support of MX 150",
            "A:Yes you can, there are 2 slots present in which 1 slot is free. you can use this slot to upgrade the RAM capacity.",
            "A:Don't worry, It has 1d10 variant which is around 20% faster than 1d12 variant.",
            "A:Model with Windows operating sytem comes with pre-loaded latest windows 10. But for model with Linux operating system If you require you can install it in your system",
            "A:yes you can",
            "A:It should have 2 memory slots so you can expand the memory using the 2nd slot",
            "A:Visit Acer India Official Website->Click on Support Tab->Select Drivers&Manuals->Option1:Enter Model No eg: Aspire 315-21->Option2:Select �Category�,�Series�,�Model� from drop down->Download drivers",
            "A:1.8kg. feels even lighter",
            "A:u wont see any lags even when ur playing high end games in low setting",
            "A:It's not bad being 720p . It records with high fps too.",
            "A:15\"",
            "A:depends on your usage normal browsing watching video on youtube, the battery will last for 5-7 hours.",
            "A:yes upcourse",
            "A:it is 8250U @ 1.6Ghz- 18Ghz",
            "A:No it has only one ram which is onboard and the ram can't be extended more than it",
            "A:�Yes. It has one of the best dedicated graphic card MX 150",
            "A:yes there is a M2 slot. which is upgradable to NVMe SSD. the one which you get with the laptop is a M2 SATA SSD.",
            "A:MS office 2016 trial version installed in it. if you want to continue, then you need to buy licence.",
            "A:No as such issue i felt so far. Might be with earlier versions but display of this version is superb for indoor use. i hardly use even half the display brightness.",
            "A:it support fast charging and charge your laptop from 0 to 60 in around 50 min",
            "A:SF315-52G is the model number and it's all new variant with aawsum performance.",
            "A:yess it have backlit keyboard just go for it",
            "A:speaker are not good enough I produce low sound but earphone Jack is just amazing with mind blowing bass and audio quality",
            "A:4 -5 hrs",
            "A:it has 1 TB hardisk and an additional ssd of 128gb as well.",
            "A:The packing was secure. The laptop was 1st inside the companies box then that box was wrapped with bubble wrap and then it was placed inside flipkarts box.",
            "A:Yes u can",
            "A:audio is average but display is aawsum and mind blowing",
            "A:Pretgy good. Its large. Asus vivobook 15 trackpad is slightly better in my opinion. But keyboard is far superior here except for arrow keys. Acer arrow keys has always been bad.",
            "A:yes",
            "A:no",
            "A:yess it's written and font is really interesting like a gaming laptop",
            "A:no only laptop and charger",
            "A:noo, no ethernet port available but wireless connectivity is fast",
            "A:it means it chas a memory card reader",
            "A:don't worry about Colling system it's just amazing belive me I done very havy works like played gta in very high setting and also render a 3d animation for 6 to 7h and my temperature still below 65℃",
            "A:no",
            "A:yes",
            "A:Yeah"
        ],
        "likes": [
            "53",
            "3",
            "4",
            "10",
            "12",
            "6",
            "34",
            "0",
            "2",
            "3",
            "10",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "235",
            "7",
            "1",
            "36",
            "5",
            "6",
            "16",
            "15",
            "72",
            "2",
            "2",
            "56",
            "0",
            "3",
            "8",
            "2",
            "0",
            "1",
            "0",
            "0",
            "1",
            "2",
            "5",
            "10",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "6",
            "1",
            "0",
            "3",
            "6",
            "2",
            "34",
            "1",
            "0",
            "1",
            "10",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "1",
            "2",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "117",
            "1",
            "0",
            "28",
            "2",
            "2",
            "11",
            "11",
            "96",
            "0",
            "0",
            "81",
            "0",
            "1",
            "9",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "7",
            "21",
            "3",
            "3",
            "4",
            "1",
            "1",
            "1",
            "2",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "3"
        ]
    }
}