{
    "title": "acer Predator Helios 300 Core i5 7th Gen - (8 GB/1 TB HDD/128 GB SSD/Windows 10 Home/4 GB Graphics/NVIDIA GeForce GTX 1050Ti) G3-572 Gaming Laptop  (15.6 inch, Black, 2.7 kg)",
    "product_specification": {
        "Sales Package": "Laptop, Battery, Power Adaptor, User Guide, Warranty Documents",
        "Model Number": "G3-572",
        "Part Number": "NH.Q2CSI.008 / NH.Q2CSI.001",
        "Series": "Predator Helios 300",
        "Color": "Black",
        "Type": "Gaming Laptop",
        "Suitable For": "Gaming",
        "Battery Backup": "Upto 6 hours",
        "Battery Cell": "4 cell",
        "Dedicated Graphic Memory Type": "GDDR5",
        "Dedicated Graphic Memory Capacity": "4 GB",
        "Processor Brand": "Intel",
        "Processor Name": "Core i5",
        "Processor Generation": "7th Gen",
        "SSD": "Yes",
        "SSD Capacity": "128 GB",
        "RAM": "8 GB",
        "RAM Type": "DDR4",
        "HDD Capacity": "1 TB",
        "Processor Variant": "7300HQ",
        "Chipset": "Intel HM175",
        "Clock Speed": "2.5 GHz with Turbo Boost Upto 3.5 GHz",
        "Memory Slots": "2 Slots",
        "Expandable Memory": "Upto 32 GB (2 slots, each upto 16 GB)",
        "Cache": "6 MB",
        "RPM": "5400",
        "Graphic Processor": "NVIDIA GeForce GTX 1050Ti",
        "OS Architecture": "64 bit",
        "Operating System": "Windows 10 Home",
        "System Architecture": "64 bit",
        "Mic In": "Yes",
        "RJ45": "Yes",
        "USB Port": "2 x USB 2.0, 1 x USB 3.0, 1 x USB 3.1 Type C (1st Gen)",
        "HDMI Port": "1 x HDMI Port (v2.0)",
        "Multi Card Slot": "2-in-1 Card Reader (SD, SDXC)",
        "Hardware Interface": "SATA",
        "Touchscreen": "No",
        "Screen Size": "39.62 cm (15.6 inch)",
        "Screen Resolution": "1920 x 1080 Pixel",
        "Screen Type": "Full HD LED Backlit TFT IPS Display",
        "Speakers": "Built-in Dual Speakers",
        "Internal Mic": "Built-in Dual Digital Microphone",
        "Sound Properties": "Optimized Dolby Audio Premium Sound Enhancement, Acer TrueHarmony Technology, Compatible with Cortana with Voice",
        "Wireless LAN": "IEEE 802.11a/b/g/n/ac",
        "Bluetooth": "v4.0",
        "Ethernet": "Gigabit Ethernet, Wake-on-LAN Ready",
        "Dimensions": "390 x 266 x 26.75 mm",
        "Weight": "2.7 kg",
        "Disk Drive": "Not Available",
        "Web Camera": "HD Webcam",
        "Lock Port": "Kensington Lock Slot",
        "Keyboard": "Iron Red Backlit & FineTip Keyboard with Independent Standard Numeric Keypad",
        "Backlit Keyboard": "Yes",
        "Pointer Device": "Multi Gesture Touchpad",
        "Included Software": "Acer Care Center, Acer Collection, Acer Configuration Manager, Quick Access",
        "Additional Features": "Dual Fan Cooling with Metal AeroBlade 3D, 3220 mAh Li-ion Battery",
        "Warranty Summary": "1 Year International Travelers Warranty (ITW)",
        "Warranty Service Type": "Onsite",
        "Covered in Warranty": "Manufacturing Defects",
        "Not Covered in Warranty": "Physical Damage",
        "Domestic Warranty": "1 Year",
        "International Warranty": "1 Year"
    },
    "product_description": {
        "Playing with Power": "With a top of the line 7th Gen Intel Core i5 processor, this laptop packs enough firepower to tackle most modern games. You get four cores with multithreading, and with turbo mode, the processor can be clocked all the way up to 3.5 GHz under certain conditions.",
        "King of Multitasking": "A quality gaming PC requires high amounts of RAM, and the Acer Predator Helios 300 i5 doesn't disappoint. The large amount of RAM will help you zip across those load times on heavy games and let you multitask with ease.",
        "Hybrid is the Way to Go": "Why choose between an SSD drive and a HDD drive when you can have the benefits of both. The Acer Predator Helios 300 i5 Gaming laptop offers you the best of both worlds. Use the HDD to store all your games, while the SSD helps you with quick booting, faster load times and smooth game play as well.",
        "Windows Inside": "With Windows 10, you not only get the latest version of Microsoft's operating system, but also all its gamer centric features like native support for XBox controllers, ability to record your gameplay without lag and support for cross platform play as well!",
        "Super-charged Graphics": "With the latest Nvidia GeForce graphics in the Acer Predator Helios 300 i5, you get the company's latest architecture that promises desktop level gaming performance. So you get to enjoy gaming in high quality settings with smoother frame rates. All of it at Full HD resolution. Sweet?",
        "Big screen, Lots of Ports": "The large display on the Acer Predator Helios 300 i5 really helps when it comes to total immersion. Take into account the HDMI-out port and a multitude of USB ports, and you get a device that is well stocked up in terms of connectivity.",
        "High Resolution Display": "Displays matter a lot when it comes to gaming and with the Acer Predator Helios 300 i5, you get a Full HD LED display. On top of this, you also get an IPS panel based display that offers wide viewing angles and accurate colors.",
        "Backlit Keys": "With the Acer Predator Helios 300 i5, you get backlit keys. So you can continue gaming well into the night without having to worry about adequate lighting. The red backlighting lends a distinctive \"gamer\" feel to this laptop.",
        "Anti-Ghosting": "The keyboard of the Acer Predator Helios 300 i5 comes with anti-ghosting capabilities. This means that each and every key you press will get registered. An invaluable feature when you are in the middle of a match and can't afford to miss a single command.",
        "Keeping it Cool": "You need to keep your laptop cool during those heated gaming sessions and the Acer Predator Helios 300 i5 does just that thanks to dual fans that keep things cool. The all-metal AeroBlade 3D fan offer advanced aerodynamics and better airflow for quicker cooling.",
        "Game On!": "With such cool specifications packed into the Acer Predator Helios 300 i5, you'll have a blast playing games like Doom. The graphics will look great and the device has enough power to run the game at high settings while keeping things smooth."
    },
    "reviews": {
        "ratings": [
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "2",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "2",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review": [
            "Predator is the name given to Acer's gaming notebooks. Helio 300 is the latest offering from the company and it offers specifications we have not seen from any other brand at this price. Special mention to the thermal design with dual AeroBlade fans-these are custom, ultrathin metal fans that enable better and quieter airflow to cool the massive heat-generating components inside. The Helios 300 impresses with its stylish and sturdy design-it has a brushed metal finish lid and palm rest. On top are red accents with the Predator logo engraved in silver. Overall, the Acer Predator Helios 300 is a winner in our books. It offers great performance, top-notch specifications, stylish design and saves you some money.",
            "IPS panel with a matte finish which is always nice to have. It is sharp and colors look good thanks to the 81 percent sRGB color gamut coverage. Heat management is done thanks to two inbuilt fans. As soon as you turn on a heavy game or anything that requires higher performance, the dual fans speed up to cool the innards. Alternatively, you can control fan speeds manually thanks to the pre-installed Predator Sense app. The trackpad has a smooth surface and a red outline. It offers a decent size but the left and right clicks are a bit soft. The Windows gestures work good too and are very responsive. Acer has also added two easy access panels at the bottom to upgrade or replace the RAM or HDD.",
            "This is an excellent laptop by all means. I am currently testing all the things as I am excited about this new laptop. I promise to edit and write a full detailed review so that it can help all the future buyers.\n\nJust a gist for now - Great build quality, Fantastic WiFi - twice as range as my previous laptop, Great keyboard, nice trackpad, and surprisingly good display. I was kinda sad reading all the reviews saying it is a bad display, but that is not the case. It is a really really good IPS display. Just that its color gamut and brightness is not as best as other high end laptops. It is very usable and nothing to complain about. I ended up using 0% to 20% brightness most of the time as anything higher was too bright and straining for the eyes. Only time you need higher brightness is if you are outdoor or if you are facing a very bright light or if you are watching a movie.\n\nThe battery life also surprised me. It lasts atleast 6 hours in battery saving mode with normal browsing. I have not tested it properly, but I will do a full test and will let you guys know. Ofcourse it wont last more than an hour if you are gaming, but it is good to know as who games while on the go without access to power?\n\nThe build quality is excellent and durable, although the metal part is a finger print magnet. I am happy with the speakers as well, although it was another negative mentioned by other reviewers. I am not a music guy, but it is good for casual video watching.\n\nFlipkart's shipping was fast, and it was packed really well. My order was stuck in the ordered state for 4days but, still they delivered before the expected delivery date\n\n\nOne more thing - Buy the i5 version and not the i7 version if you dont know the difference between the both. i5 is more value for money as there wont be any noticeable difference in performance between i5 and the i7. The only difference will be about 5-30% when you do some heavy multi thread software like video editors. And, in that case also, only few minutes savings. Simply put, the i5 version is more cost efficient and i7 not worth it for 10k extra.\n\nI will edit this review after indepth testing and maybe even post a video.",
            "Review after 1 year and 4 month\nfirst of all I got this beast from 60000 in offer😄\nI am pretty happy with this laptop performance as expected almost all the games run smoothly. I have tested GTA V, battlefield 4, assassin creed origin and many more other none of the games were lagged or something. Backlit keyboard is good keys are visible at night but if you are looking laptop just for the coding purpose this laptop might not suitable for you. I took too long to feel comfortable with this, keyboard also there is no flex in keyword but little flex can be found in display. now things point wise.\n\n⏺Pros\n➡ Display is very impressive amazing viewing angle and 4k video plays so smoothly and anti glare display looks amazing. And the black colour looks very gorgeous it just look like the laptop is turned off.\n➡ Speaker are dynamic and produce very good sound and loud Dolby integration is just cherry on the cake.\n➡ Performance is good in the whole year once or twice it hanged for some second and only when some program misbehave. so not and issue with performance it take only 37 to 40 sec from power off to ready to use.\n➡ This beast does not produce too much sound while running but yes when you over clocked it and run its fan at maximum then it produce little sound.\n➡WiFi is definitely on the strong side I get always good speed while my friend not even we connect the same network also it support 5 ghz WiFi plus point normal laptop do not connect to 5 ghz they can only supports 2.4ghz\n➡Build quality is amazing from no where it's looks regular laptop and have a sturdy looks.\n➡ Touchpad is very good and responsive and multi touch features is very good u can compare it directly with the MacBook air.\n➡ Battery performance is good I will rate it 4 out of 5 while running games it don't go over 2hrs but while watching movies or surfing web it can go up to 4:30 hrs which I didn't expect from a gaming laptop some might not agree with me but surprisingly I love the battery performance.\n\n⏺Cons\n➡The first issue I faced with this laptop that when I turn it on\nand when the screen appears black there are little white area can be seen on the screen also when we flex the screen it become more visible but can we only seen while screen is pitch black but thankfully it's gone now.\n➡Sound are on the bottom side so while using in lap or not in solid desk it do not produce good sound but while using in a solid body the sound are very dynamic.\n➡Only 1 3.0 usb port is a disappointment for me rest of two are 2.0.\n➡ I think there is some issue with assembling process of Acer because even with good built quality I found flex(pressing from both side) in display frame at bottom right corner while not in left corner. and another issue written down.⏬\nTill now I found these cons if I found more I will update it\n\n⏺Some problem I found\n➡The biggest problem i and many more user get with this laptop after using 1 month is it shutdown random without any warning or something first I thought it is issue with some software so I tried various solutions but not able to solve the problems but no outcome I try to contact the Acer service center they responded but at the time the problem was temporarily solved so I cancel my appointment but problem occurs again after a huge time of research I found solution the actual problem with the laptop is \"their is button inside the ram panel and its pressed by rubber so when it lose a little it turn off the laptop \" so I open the ram panel and attached a little paper and closed the panel now the problem is solved.\n\nPS In whole life time first time I write this long review If it help give a like. and might have some spelling or grammatical mistake maf KR dena😅😅",
            "I Got it in my hand a few hours ago.Hence, performance wise it will be very hard to comment or write a review.I will just keep this review segregated in 3 segments.\n\nPacking: Flipkart packing surely is lacking quality.This seems agreeable for all reviewers here.They just put the predator box inside a cartoon and sent.The cartoon could have something foamy or bubble wrapped with a same size as of the predator box,making it a perfect sized and shaped package.They faultered,and faultered big. Luckily the Acer package is awesome and very hard for any incident to make any tear on it.Acer,+1; Flipkart,a -1 I believe here.\n\n\nShipping and courier: The courier company,named ecom express was pathetic. No one received calls in customer care,the tracking system is even harder than rocket science to understand where the package actually lies, and morover they up delivering the box 4 days after the promised delivery day,but the delivery centre attendant was very helpful and helped me to his utmost possible for getting a smooth delivery once it reached the delivery centre.\n\n\nMachine overview:Absolute gorgeous! The bright red backlight is so eye catching!Yes,display brightness is on a bit deemer side,but 1080P display coupled with smooth running processor makes up for it. Speakers with Dolby audio are really decent.no problem of any current flowing or anything while charging.Overall pretty impressed.I will update performance wise report after a few days of usage.",
            "I have been using the laptop for the past three weeks. My usage consists of moderate gaming, browsing and office work.\n\nI can say my overall experience has been positive. However, there are few things with respect to Laptop and Acer that i disliked.\n\nProduct Cons:\n\n1) Design of the track pad makes it usage difficult, i used Usb mouse to overcome this.\n\n2) The battery is mediocre and requires to be plugged in quickly.\n\n3) The display clarity could have been better especially during browsing documents and webpages.\n\n4) The product is overpriced at one lakh. This is part of the reason why Flipkart has some leverage to give some good discount on the product.\n\nI dislike Acer's strategy of introducing trimmed down products in India. The Helios 300 version in USA has a better graphic card along with more ram and storage space. After paying a premium price too Indian customers get a bad deal. This bias towards emerging markets need to be changed. Companies should treat all their customers equally worldwide.\n\nOverall its a decent laptop for gaming.\n\nP.S : Please avail the extended warranty offered by Acer to this product. You get three year protection along with 1 TB external Hdd for nearly 3000 rupees.\n\n\n\n\nT",
            "If you r getting shocks from the laptops body then plug in a socket which has earthing in it..if ur screen brightness fluctuates then go in intel graphic seeting and turn off power saving...I ran witcher 3 in ultra at 45 fps..Gta 5 on 55fps wildlands on 48 fps Rise of Tomb raider on 50 fps..all on ultra settings...maxed out...the laptop is a beast..packing was bad...i mean like super bad...the seal was intact though and laptop was fine..Go for it..Wenger out",
            "Packing was really poor. Flipkart, if you guys can't get enough bubble wraps atleast get the appropriate size boxes. Laptop till now has no physical damage yet. Going to use and see if needs to be replaced or not. I would like to emphasize again please improve your packaging. Product till now is working fine. Just lil issue in software.",
            "Its an overall good product and for the money it sounds good at-least on the paper. But when you start scratching it under the surface, you will realise how Acer has cut corners on India spec models. Following things are have been swapped to lower grade items when compared to USA spec models:\n1. Screen on it is from Che Mei instead of LG Philips, so it has poorer color reproduction(sRGB 69% coverage vs 82% on US spec model).\n2. SSD on India spec model is a Hynix version SATA3 drive instead of Intel 600p NVMe SSD. SATA3 SSD have 25-30% performance of NVMe SSDs, so we loose a lot here.\n3. RAM modules are from Micron instead of Kingston ones on US spec models. Reliability of these RAM modules beyond first year of warranty is of doubt.\n\nSome of the above problems could be solved by changing the components as RAM and SSDs, but that makes it pumping more money into a laptop which already costs twice the price in USA. I would have definitely given this laptop 5 stars if configuration was at par everywhere in world; but Acer is clearly fooling us in name of a good laptop.",
            "I have been using this laptop for the two months. Performance is really good. You can play AAA titles like GTA V and NFS Payback in ultra settings. The best feature in this laptop is that the GPU is overclockable and the fan speen can be controlled manually thanks to the Predator sense app. Cons- 1) Heat dissipation is the big problem because the gpu and cpu are situated side by side and therfore one gets easily heated up because of another ...\nREAD MORE",
            "This is a review after 1 day of complete usage.\n\nThis is undoubtedly a beast machine. Boot time is really low thanks to ssd. Functioning of laptop is top notch with 8gb ram no lags are seen except a few while closing google chrome. Graphics is great.\n\nEverything thing was working fine till i updated the windows to latest version (1803) after that update Windows camera app shows glitches, app opens but nothing can be seen this happens with only Microsoft apps like skype and camera app. I tried running my webcam after the update on other platforms like IMO video call app and it worked perfectly fine (reliefs).\n\nSo this LAPTOP - 10/10\n\nAs for Windows i am waiting for a new update so my windows camera app starts to work .\n\nPS . There is absolutely no problems with the webcam. Its just some software problem that Windows camera app and skype are not working properly.",
            "Its been 2 days since i recived the laptop. It is a so far kind of review. I will update after i check it all.\nPros:\n\nGood display quality. Good viewing angle. Sharp and crips colour. No light bleeding is there. There some minor bleeding bbut i think it is normal for IPS screens.\nUpdate: contacted service center about that bleeding they said it is pretty normal but if you insist then we can replace the display immediately.\n\nSpeaker sound is nice for a laptop. Sound quality is good and loudness is above average. More loud then the regular laptops.\n\nKeyboard is nice to type on. Red backlit is very helping at dark areas.\n\nBuild quality is the best on this segment. Outer layer is metalic as well as the keyboard deck. Other parts are plastic. The design is depend upon person to person. For me it is the best looking gaming laptop so far. The look and feel of this laptop cant be defined on pictures or videos or neither in reviews.\n\nProcessing speed is just awsome. It is as speed and as responsive as desktop having same specs as i5 7th gen and gtx 1050ti.\n\nSSD speed is very good. Boots up very fast. In just 5 to 10 seconds you will at the desktop of windows 10.\n\nGaming is just awesome. I have tried 7 games so far.\nBatman arkham city- at max setting its 70fps average and 63fps is the lowest.\nBatman arkham knight- at max setting its 35 fps average and 32 fps is the lowest. Turn some setting down and you will get constant 60 fps.\nAssassins creed unity- at max setting 35-40 fps average and 30 fps is lowest. Turn some setting down from ultra high to high and you will get constant 60 fps. Though the game is very buggy you may encounter some glitch if you dont install the latest patch.\nGhost recon wildlands- at very high setting 35-42 fps average and 34 is the lowest. Turn some setting down to medium and you will get constant 60 fps. It is a very demanding game.\nCall of duty ww2- at max setting its 68 fps average and 62 fps lowest. You will need to upgrade the RAM to 16 gb if you want to play this game at max setting cause at max setting game uses the full 8 gb memory and you will face some frameskip if you dont upgrade the RAM.\nSniper ghost warrior 3- didnt check the fps but was very smooth in max setting.\nThe witcher 3- 40 fps average on mixed high to very high setting. You can get 60fps constant if turn down setting to medium.\n\nThe best part of this laptop is cooling. You can adjust the fan speed manually. At full speed a bit noisy but isnt audible if you play games or videos or music even from internal speaker. Even after 3-4 hour of intensive gaming i didnt felt any heat no heat at the front end as well as the back of laptop.\n\nCons:\nThe outer package was a bit damaged but the product was intact and good. Though Acer's packaging was excellent.\n\nOther then this haven't found any cons till now. I will update it after i find something.",
            "Strap in cause this is going to be a good,helpful and considerably long review for Acer Predator Helios 300 G3-572.\nI'm writing this review after exactly 3 months experience with the device .\nso I ordered it on march 13'2018, receive march 14,till today the fastest delivery I've ever received.All thanks to Flipkart & E-kart for the snappy delivery.\nI had to pick up the parcel as they don't deliver in my area so i went to the pickup store and from out of the blue they(executives at the store) give me an extra large cartoon pack as large that one can't consider taking that with them and to my delight the box was perfectly fine not even a tear or wear sign , so i was relieved.Decided to open it right there .\nAfter opening..couldn't find the laptop box(so many air bags of plastic had to literally get into the box , box was big ).After getting the laptop ,I bid adios to the store guys and was on my way home from college( store is inside my college). Strange things started to happen.Things that I've never thought would happen.around 6-8 people made me stop and inquired/congratulated/were in awe/delighted about me getting a predator.Felt nice.I was very happy and was getting a good feeling about my order by their reactions that I've made a good choice .\nIf you have seen any unboxing reviews of the product then you would have seen how long it takes to get to it. So many boxes before you reach the final box.\nSo opened it..set it up.Updated windows(had only one update to go through cause the mfd was late february so the windows was completely updated out of the box.\nEverything was a charm. Snappy Performance,Fast boot-ups,NO HEATING(on normal to medium usage) with fans on auto,even While gaming you couldn't hear fan noises for most of the times but when it is a really gpu extensive then you will certainly hear it though not to loud and in comparison to MSI laptops its less than 50-60%(My room mate got a MSI with the same configuration).\nSo lets take this review in points.\n1.SCREEN\nBest display in the range(I bought it for Rs 59990)\nLED 1080p nice viewing angles ,top view,side views you name it..it has got em all covered up.\nBright and saturated enough for gaming delights.\n2.TRACKPAD\nIts a great trackpad.windows precision drivers..nice tracking,smooth and it feels good to use it.\n3.KEYBOARD\nLights up red..what else do you want.BUT seriously kidding aside nice to type travel distance is bit less or say on average but does the job without ant issues.\n4.SPEAKERS\nThey are loud ,clear ,crisp and great .NEED I SAY MORE.\n5.PERFORMANCE\nDay to day performance is great.Haven't had any issues so far.\nGaming is a delight.I've played many games through this period. Finished a few.\nSO lets get started with the fps count.\nDOOM Vulkan(on ultra):average 75-80 fps\nGTA 5(Ultra,yes it has ultra settings in newer repacks):50-55\nFORZA HORIZON 3(Ultra):38-45\nFAR CRY 5(ultra):38-50\nASSASINS CREED ORIGINS(ultra):40\nINFINITE WARFARE(ULTRA):around 60\nCOD WWII(Ultra):45-50\nNFS PAYBACK(Ultra):36-47 sometimes hit 55+\nMASS EFFECT ANDROMEDA(Ultra):35-40\nDYING LIGHT(Ultra):50+\nOverall Gaming experience is a delight and yes north indian summer is also a delight(sarcasm) so it did hit 80+ sometimes 90(cpu).\nFor Gpu heat stats it went around no more than 80 ever , may be due to the GPU fan rotates around 300 rpm more than the cpu fans(IDK WHY, may be giving gpu more cooling).\n6.DECK & BUILT QUALITY\nThe deck(the keyboard area ,except for the keyboard and trackpad) is all aluminium alloy and has great finish (brushed metal) same goes for the outer area of the lid.\nYES,thats why it is bit heavier than other in its segment but the finish and sturdiness is worth it.\nOVERALL great built quality and great textured finish.\n7.BATTERY\nIts surprising but yes it lasts 5h on some occasions while you game on it (you shouldn't on battery but even if you do) lasts 1h+ for media content lasts 2 movies each of 2h+.For daily typing and work lasts around 6+h.\nIN SLEEP MODE can go for over a 5day streak altogether without any issues.\n8.EXTRAS\nIts usb 3.0(single port,ONLY REGRET)can be used even in switch off mode for charging mobile phones so it helps on occasions.\nweight around 2.7kg but its worth it ,bit thick but if you want cooler game plays stick with the thick..helps in maintaining the heat as the space provided inside is more.\nWEBCAM is ok.THE SAME gamer cam.\nCONCLUSION:\nSO yes if you ask me ,I would suggest go for it if you can get it for 60k or less.Its very promising and reliable for gaming and day to day work.",
            "this is a best gaming laptop ever i see.it supports all game.without hang😎😎😎😎😎.The World best gaming laptop 😍😍 it support ultra high graphics.",
            "Now to start up this review I’ll be only reviewing the laptop and not the service that I got from Flipkart (that was just another havoc).Talking about this laptop it’s nothing but a budget gaming laptop that outperforms all its competitors. Well One thing worth mentioning is that I got this laptop in sale for around 60k and on any regular day it is priced around 80k-94k which is not worth the price . So I advise everyone to buy this laptop only when you are getting decent deal . So let’s start the review\n*PACKAGING*\nThe Packaging from the courier service was okay-ish but the packing from the manufacturer was phenomenal .The box was premium matte black cardboard box. Inside it contained the paperwork and the beast itself , also included was the enormous power brick . So overall packing was good.\n*Build quality and First Impressions*\nSeeing the beast for the first time leaves your mouth wide open .The Predator logo on the front and the two red strips really gives the GAMER vibes. The cooling vents are also very appropriately placed and looks very classy. The chassis is full metal except the area surrounding the screen and back of the laptop. The metal chassis is as you can expect a finger-print magnet so will require brushing with a cloth everyday couple of days. The bezels are decent and the logo beneath the screen is just awesome.\n\n*Display*\nOkay so I was a little indecisive about buying this laptop due the bad reviews which I read about its display but trust its not that bad at all , I mean it’s not even bad it is actually really good . The Full HD 1080p IPS panel really manages give wide viewing angles and accurate colors . The brightness is good but a tad dim for outdoor so that can be an issue . But if you are indoors it works just perfect. The gaming experience is awesome with the 60Hz refresh rate and anti glare and movie experience is also good.\n\n*Keyboard and Trackpad*\nThe keyboard is actually very nice on this laptop . It is a kind of chiclet style keyboard with adequate key-spacing . It is a full keyboard really good backlit that gives a strong gamer feel . The trackpad is a windows precision trackpad with all the usual gestures intact .It is also quite decent too.\n*Performance*\nAs I mentioned earlier this laptop is simply a beast . Boots up in 3-4 seconds ( there comes the 128 gb ssd). Handles all the AAA titles smoothly at ultra to very high settings without any lag . The cooling is also pretty well optimised in this laptop ,thanks to the inbuilt Predator Sense app that lets you manually control the fan speeds and also overclock the GPU. More I will advise everyone to disable Turboboost and use INTEL XTU for even better cooling (you can look up their tutorials on youtube )\nThe sound experience is pretty decent thanks to the dolby audio speakers. I would advise placing it on a hard surface because when you place it on you bed/lap the sound gets a little muffed and you are not able to get the true essence .Even then the speakers lag bass but overall the speakers are good . Camera and mic are decent\n\n*Battery\nIt’s not that good to be honest . IT’s definitely not meant for gaming AT ALL . If you are gaming on this laptop I would strictly advise to be always plugged in for the best gaming experience. Moreover for normal web surfing /youtube videos it gives about 4-5 hours of backup.\n\n\\\\Conclusion\\\\\nIt surely is a gaming barbarian with some genuinely great specs and an awesome built . If you get it for a decent price under 65k that it’s a steal deal . The MS office comes with a trial version so that’s a bummer otherwise I am pretty satisfied with this laptop.",
            "Awesome Laptop... Can run all games with Ease!\nThe outer seal on my package was broken, but thankfully all the contents were safe and sound.\nIf you have heating issues(high 80s), Undervolt your cpu by -110mV. It'll will work great!\nIf gaming is your number one priority, maybe try and get the one with the GTX 1060. If you want to maybe render videos and use it for other workstation needs and want to game on the side, go for the one with the i7. If you want the best of the best go for BOTH!\n\nBu...\nREAD MORE",
            "Recently bought this laptop from flipkart on the republic sale and was delivered this laptop after a week. Laptop worked and seemed fine in the start but the speaker grills had an issue in them and when i put it for replacement as it was mentioned within 10 days, i was told it would not happen and that only refund can be initiated. Called their help-line about it and asked to speak to supervisor , i was put on hold for a while and then disconnected, the terms are altered and hence i think the seller and flipkart as well are to be blamed not acer. Please don't buy it.. atleast not from here.",
            "PROS:-\n1] GTX 1050TI AND INTEL HD 630 will give you good fps(most of the game will run in betwwen high and med settings).\n2] CORE i5 (7TH GEN) is icing on cake.\n3]Excellent keyboard ,solid build quality and crisp FHD display.\n4]1tb HDD and 128gigs SSD(it give boost to loading and fps) .\n5]keyboard won't make noise.\n6]Premium design.\n7]predator software is easy to use.\n8]Steam s preloaded that's what is expected from gaming laptop.\n9]For the price it was steal the deal.\n10] premium packaging\nCONS:-\n1]Sound is low(dolby software will give boost to sound).\n2]Power button could have been placed at better place.\n\nif you want to buy don't think again just buy it this machine wont disappoint you.",
            "Packaging is not very good by the seller/flipkart. But the Laptop box pack is just awesome. Delivered before 1day from the expected date of delivery. Laptop built quality is just awesome. I purchased it from flipkart by paying Rs. 60490/- only and its actually price on the box is Rs. 85800/-. So, the discount is huge. In this price point of view with the built and performance quality I can say that this is will be the best deal that I got from flipkart and thanks for that to flipkart. Performance is just awesome you can say. Booting in less than 5 sec. Sound and display also very good. Looks, built quality is just like premium. Though it as a entry level gaming laptop but its best for the general people like me who will use this laptop for office work as well as some gaming in leisure time. I will write some gaming review after 1 month using. For now I am so much happy with it.",
            "Kudos to Flipkart for delivering within promised time. Laptop looks fantastic at first look. I found speaker sound quiet impressive. Initial boot took around 6 seconds. Overall no build relates issue, creaky sounds or any light bleeds on the screen identified. Manufacture date on my box was mentioned as April 2018 so, pretty new laptop. Metal finish is awesome but also a finger print magnet. overall happy with the purchase. Will put a detailed review in couple of days.",
            "I have purchased this product on 13th Mar'17 and guys I want to tell u that the product is actually not lacking anywhere.\nPacking from dealer end was awesome. A big carton box with air filled polybags.. The packing of tge product was up to the mark. The is no light bleeding on the screen.. I guess in semi urban areas the packing might not be that well so some sort of damage takes place while transpirtation but in my case pavking was awesome.. Below are the pros and cons\nPros\nTop Notch Performance\nBrightness Level is up to the required level. I have tested out in outdoors and finally can say that there is no problem using this laptop outdoors in bright sunlight.\nScreen is really crystal clear but colors are too sharp as in samsung phones\nViewing angles are great\nKeyboard is very responsive and comfortable\nSpeakers are great to hear with less base.\nAnd here comes the gaming part. Gaming experience is awesome above 60fps in all AAA titles when gpu is set to turbo.\n\nCons\nBateery is average\nFinger impression comes very easily on the body\nFans are loud...\n\nOverall the best product in this price range 60000 INR.",
            "I have got this laptop in early feb. Excellent performance. Keys are perfect and screen is awesome with TFT IPS. Booting speed is insanely fast. Dont purchase if the price is not less than 65k. I have got 63k .For 99k It is overpriced. Cool and Peace.",
            "One word \"amazing\". The machine is really good at doing anything you throw at it.\nBoots up in 8 seconds and rrad speed of ssd are about 550Mbps writes are how ever 130Mbps.hdd also has respectable reaf and write speed.\nConstruction is very solid and brushed metal gives it an amazing feel. If you are concerend about the look of this laptop trust me I don't remember a single friend who didn't appreciate it for its looks.its a bit heavy and thick measuring at around 2.7 kg and 27mm respectively but acer did a good job in hiding the thickness by giving an angle to the side edges ,so when viewing and holding from side it appears as slim as any other light notebook is ,so no issues there.\nNow the hardware- core i5 7300hq and 1050ti compliments each other well,all modern titles are playable at 1080p ultra settings at 25 fps and above note that games appear as smooth as movies at 25 fps.\nThe heating issues- none yes none.this machine was built to hold a GTX 1060 which is a 120 waat chip i guess but it has a 1050ti which is 75-85 watt chip so no heating issues at all. Fans at full speed jeep temps below 65°c anf even at auto mode 72°c max. You wont feel any undesirable heat on keyboard area whatsoever.\nScreen is 1080p ips panel very food viewing angles and contrast but, but a bit dim i mean have to keep at 75 or 100% during day. Colour accuracy is other issues the bright red appears a bit orangish no problems with gaming but can be problematic with video editing or photovraphy.\nNow comes battery-its small like 3 hrs with screen at full brightness and 4 to 4.5 hrs at screen at 50% with normal usage like surfing, youtube ,movies etc.\nSound is good gres resonably loud when dolby audio is on no bass but good and clear sound. Oh yes keyboard and trackpad way good than those 50-60k hp and dell.",
            "The best thing about this laptop is the GTX 1050 Ti and I was lucky to get it during the sale at an amazing price of 60k.... The boot time is just within 5-6 seconds due to the fast 128 GB SSD preinstalled in this beast... And Intel I5 7th Gen is the best value for performance you can get..... So don't look here and there get this best only you won't regret.... Rest the build quality is pretty awesome and the looks from behind as it looks like a Lamborghini Avendator... Will race you through those AAA titles like a beast! In short: don't wait go for it!!",
            "Update - There is a new BIOS version on Acer site that will fix the random Blank Screen and battery reset.\n\nThis review is specifically for Core i5 8th Gen Predator Helios.\n\nSpecification wise you already know it is a very good deal if you purchased it in sale in 60-62K in India but in US this is the normal price.\n\nPros -\n\nDisplay - This has new IPS Panel, people complained about older model having very less brightness, this one has sufficient brightness and blacks are very deep.\nRAM - Stock RAM is DDR4 with frequency of 2667 MHz so, Much faster.\nBoot Time - 8 to 10 secs due to SSD, Win 10 is installed in SSD\nKeyboard - Although only red back lit, It is very subtle and not over bright or bleeding red.\nProcessor - Intel 8th Gen i5 8300H, has 4 physical cores and more powerful than i7 7700HQ.\nNo Bloatware installed except for Norton trial which I removed\nEasy access to RAM and HDD.\nGPU performance is good\n\nCons -\nHeavy and Fingerprint magnet, even the smallest touch will leave its mark.\nAcer laptop management software is bad and lacks features, HP is far better in this field.\n\nProblems -\n\n1. Laptop suddenly hanged on 6th day, under normal usage. On restart only backlit light was on. No display. I thought of returning but did some research and tried resetting battery (small hole is there in back). That worked and I hope nothing like that happens again because now I have purchased the 3 year extended warranty from Acer official site and that can not be cancelled even if Flipkart accepts return of this Laptop (I doubt they will send replacements).\n\n2. I installed Far Cry 3 as 1st game on this laptop, played using NVIDIA recommend settings (everything ULTRA). After 10 mins of game play CPU 94 and GPU 75. It was really shocking to see such a high temp for a new laptop.\n\nI did some more research, installed \"Intel Extreme Tuning Utility\" and found that CPU throttles in 2 areas \"Power limit throttling\" when under heavy load and \"Thermal throttling\" when gaming under high temps. While gaming the processor was turbo boosting to 4GHz (i5 8300H works between 2.3GHz to 4Ghz by default) but limited voltage (power adapter supplied is 150Watts only, while i7 8th gen model has 180watts) and average cooling system was not supporting the full processor capability.\n\nTo fix this the only solution I found without opening up the laptop and changing thermal paste was to use \"ThrottleStop\" software. There is complete guide on how to do it by \"Hotel Hero\" on you tube and basic guide about ThrottleStop over net. Using ThrottleStop I was able to Undervolt the CPU and also reduce the Turbo boost limit to 3.2GHz. This is enough for gaming and other works without any performance change. Now while gaming the temperature of CPU stays below 80s and GPU 70s.\n\nI really hoped Acer would have done some software optimization from their side to improve gaming performance but that is not the case here. Also I noticed that users of 8th Gen models are facing more issues than older models. This shows that much was not invested in testing and optimizing these 8th gen laptops. But then again there are no other options in this price range and if this laptop works without any problems then it is truly a beast for gaming.",
            "I recently bought this for Rs 59,990.\nThe flipkart packaging was very unsatisfactory. The acer box was just put inside a flipkart carton without any padding and the carton itself was a little damaged.\nThere was a very thin sheet of bubblewrap which seemed like it was just shoved in along with the box hurriedly and provided absolutely no protection.\nThe padding inside the acer box were top notch and had ample cushion and shock absorption.\n\nI've only used the device for about a day and only played Dirt Rally so far. My CPU temperature exceeded 80'C while gaming and I'm considering to undervolt the CPU by about 0.120V to prevent such high temperatures.\n\nThere is also a very noticeable backlight bleed in all 4 corners as well as in the center of the screen. It really bugs me when the screen displays a black background and I'm wondering if I should get this unit replaced for this reason.\n\nOverall, this is a good device if you got it in offer but for the quality I dont think it justifies the Rs99,990 price point it usually sells at on flipkart",
            "I got this product on a flipkart sale on Dec,2017. Its been 8 months now and probably the right time to share my experience with it. I have faced zero issues with this laptop till date (touch wood). Its a beast of a machine and has really good cooling system inside. I am a regular Cs GO player and have had never faced fps drops below 230. Apart from csgo other high end games like battlefield, witchcraft, assassins creed origins will give you a smooth ingame experience with medium settings. The display could have been better but nevertheless if you are seeking a gaming laptop just go for it. Personally I think 1 lac+ is a bit more for this model. Have patience and grab it on a sale for prices as low as 59k and less.",
            "Exp with flipkart: . I paid full cash online and waited for 6 days to get the laptop.I was afraid to buy such expensive product online because everyone around me said it will be a refurbished or defective product. But my experience with flipkart was great. They Delivered product on time. The package was good. Overall great.\nLaptop:\n\nThis is a wonderful laptop.\n\nWith the 1050ti and the geforce experience app I am easily getting the 50 to 60 fps for all the game(GTA V,Watchdogs 2,Rise of tomb raider,COD WW2) I throw at it. This is amazing.\n\nExcept two things.\n\nThis laptop is a beast. acer has done a great work putting specs like a little high end gaming laptop and selling it as budget gaming laptop. The screen is not a bright screen but it is not an isssue. The build quality is good. The thermal management is great.\nNow those two things:\n\nthe gpu has g-sync capability, but the panel is not , its a budget gaming laptop so had it coming. Even if you have a g-sync external display and want to enable it external display o/p can't give.\n\nThe usb type c is also not thunderbolt so no external gpu.\n\nThe battery life is okay getting 4hrs for normal usage , for gaming i dont know because i play game mostly plugged it...",
            "using this laptop from last 1 month and here is the review\npros-\n1-colour quality and contrast is great\n2-performance is beast gta 5 on high/very high settings 60fps, tom clancy ghost recon-45 fps on high,witcher 3- 45fps on high/very high,battlefield 50fps on high\n3-price (if u get it around 60k in sale)\n4-keyboard is very tactile and responsive\n5-built quality is just awesome,very sturdy laptop.\n6-windows boots up really quick thanks to ssd\n7-predator sense app lets u to control fan speed and coolboost mode is also there.even with high temperature games never throttles,undervolting cpu will reduce temperature further.\ncons-\n1-as everyone is saying it's THE BRIGHTNESS.i want to say it will only be issue when u live in a very bright room(daylight),the brighter area in the game looks bright enough no matter how much sunlight is there outside,but the darker(shadows in game) looks more darker that's sometimes gets really annoying.but during night everything is fine\nit shouldn't be a deal breaker for u\n2-battery is average,not poor.u will get around 4 hours on youtube\ndust sticks too much,u need to wipe it every 2 days with cloth\n.\neverything else is fine rather great\ngo for it guys :)",
            "The Laptop is simply awesome. No issues whatsoever.\nIt heats up ever so slightly while heavy gaming but that's normal. Nothing too bad about it. Unlike other reviewers, i experienced no shocks from the laptop. It gives very slight shocks when connected to a socket without proper earthing.\nThe battery life is not as much as you'd want it to be. Drains faster when GPU is overclocked and CoolBooster is switched on. But it is still good enough for a laptop of this price.\n\nFlipkart Delivery was on time, no doubt, but the outer cardboard box was severely damaged. I was extremely worried when i got the box.\nThe inner box seal was open.\nThe innermost box was intact though.\n\nI had made up my mind to rate 3 stars just for the poor packaging and delivery but the laptop changed my mind! good laptop, got it at 41,000 off (special price: 58,300)\n\nEnd of the day, Satisfied Customer.\nSuggestion to Flipkart: Improve packaging quality please.",
            "Lots of people have reviewed the older generation Predator Helios with the Kaby Lake I5-7300HQ which had some drawbacks. This new model has an updated I5-8300H Processor which is on par with the i7-7700HQ Processor. So you are getting more cores now at the same price. Another area of complaint was the screen quality and the backlight bleeding on the previous model. I checked the panel on my laptop and its now made by AU Optronics. Search online and you will find that it has better sRGB and adobe rgb coverage than the Philips panel. There is minimal backlight bleed on my laptop. The colors are great, warm with deep blacks.\nProblems started when the Windows version updated to the April 1803 Update. Youtube videos wont play and there were cursor lags whenever a new program was launched. Had to rollback to the previous version of the windows for this to remedy. The cursor lag still exists but this doesnt happen while gaming. Rise of the Tomb Raider hovers around 40 FPS on the benchmark on High Setttings with Pure Hair and FXAA turned on. Decent enough for a laptop at this price. I paid 60490/- during the sale and I think its complete bang for the buck at that price. Acer needs to hurry up with their driver updates and Microsoft needs to release bug fixes to sort this out. Right now its best to stay on Windows 10 Version 1709 till all the problems are fixed.",
            "Every thing is good, in this laptop.\nPros:-\n1.Good Screen clarity,\n2.brightness in between medium and high.\n3.Sound is loud and clear,(put some thing under laptop from front to get best. also use dolby surround sound system to get best of it.\n4.you will get around 85 Gb of ssd for use. remaining will be used by system and windows.\n5.fan speed control can reduce temp from 61℃ to 49℃ in just 5 sec. also use cool boost.\n6.charging is medium but charges quickly till 90%.\n7.Almost every game can be handled by this laptop.\nlike:- Gta 5 (ultra setting), Forza horizon 7 (ultra hd),COD MW 3, etc.....\n\ncons:-\n1. sound is good not best.\n2.Norton security in these can remove your fav game's files , which is a loss of your money . i had faced that.\n4. nothing serious to tell about this...........\nbut i faced HANG issues five times after the purchase in 14 days. due to updating it to unstable version. now its ok and that update has been fixed and stable.\n\nOnly play game while Plugged in charging . other wise games like gta5 (ultra hd) can drain battery from 100 to 10% in 45mins",
            "I am writing this review after 6 months of the purchase.\nFirst the delivery part, I am completely satisfied with the packaging and delivery. (5 stars)\n\nBefore going into the detailed review, just want to clarify that this one is my first gaming laptop and I am extremely happy with the product. Really, \"the Dream comes true.\" :)\n\nNow, there are several detailed reviews available for this product with the specification, gaming performance, battery performance etc., so I am not going into that much detail.\nI just wanna say, this is the BEAST in this budget. You can play for hours on it and there will be no issue related to performance or heating.\nEverything is just perfect and SSD is the really a plus. You will find a big difference in performance with the SSD.\n\nSo, if you're having a tight budget like me and want to fulfill your Gaming dream, just go for it. No regret.\n\nThanks Acer and Flipkart.",
            "Worst ever packing by Flipkart. But Acer packing was simply awesome.\nPros:\n128 GB SSD.\nDesign\nDolby audio\nRest are similar to other gaming laptops\nCons:\nWorst camera\nBattery life\nDisplay not that much bright\nWhite color seems to be faded like an off white\nVerdict:\nDecent gaming laptop with few cons. Major drawbacks are camera and battery. For a gaming laptop like this they should provide at least 50+ wh battery. But it has only 48wh. You'll get around 3-4 hrs on normal usage.\nBut os is installed on SSD,so the processing will be better and boot time also.\nIt's your choice to go with this laptop or choosing other brands with similar configuration. I will prefer go for legion y520 or y720 if you want better display and camera. Additionally Lenovo has slim design which most of gaming laptops doesn't have.",
            "Awesome laptop with super awesome specs.\nIts great for gaming.\n\nLookwise its amaizing ill give it 9/10\nSpecs are great , but i the trackpad without buttons is something you will have a hard time using right clicks. So 8/10\n\nScreen is awesome (full HD) ,speakers are good but not great, so 7/10\n\nOverall costwise the specs are pretty awesome for a laptop, so if you are looking for a laptop with cost to performance ratio.Just go for it. You will be surprised.",
            "Superb product..... Awesome display...... Acer cool boost technology is best....... Best configuration.... Got it for 62k.... Amazing performance...... High class gaming.. Overalll... Best budget gaming laptop",
            "pros :\n1). nice built quality and packing by Acer .\n2). thnx to SSD the system boots within 6secs.\n3). have played few online games ( NT a hardcore gamer) such as CSGo, H1Z1, Fortnight ....it cld give 1080p he resolution with constant 50-60fps in epic graphics settings .\n4). on watching videos at 720p + resolution....battery backup upto 4-5hrs\n5). has an unbelievable speakers...which i believe no other laptops within 100k cld have ....I was just blown away by it's sounding\n6).has 3.1usb port so if u have enough power in laptop cld use as an emergency powerbank to other devices such as phones n tablets\n\ncons:\n1). packing by Flipkart's seller was bad....was just bubble wrapped in 2mts of it....which was pretty bad ....it came in a large carton wer in the acer box was moving inside the big carton\n2). heats up to 65°C on playing heavy graphics games on extreme graphics settings fr more than 1hr\n3). the laptop has a metal matte finishing ...hence ur fingerprints sticks all over the laptop ....\n\nSo as per my opinion ...after using it for 1month ..it's a very good n ideal gaming laptop .\ncome on no one gives i5 7th gen core+ grx1050Ti + 128gb SSD ....n all fr jst 60k !!!\nso watch out fr gaming Friday deals or any other special events....u might as well get a good deal!!",
            "Got this Laptop few days ago and believe me it's best in the range gaming laptop you could find\nPros:\n1)Heating is way less as compared to any other gaming laptops thanks to the new aero blade system\n2) Graphics is best in any of the budget range gaming laptops.\n3)ssd provided this drastically helps the gpu and speed.\n4)beast looks, color and keyboard leds adds the charm\n5)Ram and extra hdd slot is easily placed on the back panel so you dont have to open the whole laptop to uograde any of these.\n\nCons:\n1)the display is 1080p and the color ambient is a bit less\n2)the color saturation is a bit low but wont matter.\n\nExtras: I am personally very happy from the whole laptop feel and speed. Just installed gta5 and works very smoothly in iltra high quality.\nBest buy!",
            "Great laptop for the price. The outer(Flipkart's) box is in bad shape but the inner(Lenovo's) box was unharmed because of the bubble-wrap. In all the product was safely delivered.\n\nFor 60k, buying a 1050ti is worth every penny. I tried many games like GTA V, Farcry Primal/3/4, Assassin's Creed Series(all including origins), The Crew, Wildlands, splinter, fifa 18, COD black ops 2/3, watch dogs 1/2.....and all of them worked smoothly with an fps around 60 and up... I felt the need to overclock...\nREAD MORE",
            "Worked well for 1 day after that it is not turnings on. On starting it only keyboard backlight glow red with no display.",
            "Bought it during the laptop bozana offer for 64k.It got delivered within 5 days.At a 64k price point this laptop is must purchase.\nI am gonna list some Pros and Cons.\nPros:1- 128gb ssd recuces boot time to mere seconds.\n2.Gtx 1050ti,the name itself is enough to tell about go performance.Gives 50-60 fps on games like gta 5 at maxed out settings.But in some games like assassin creed syndicate and origins,the fps dropped to 30-35 on maxed.\n3.This i5 7 gen processer with 4 cores is good when paired up with such specs.\n4.1tb hdd is enough for storing data.\n5.This laptop has got some killer looks,probably the best looking gaming laptop under 1 lakh.\n6.8gb ram is enough for multi tasking.\nCons:\n1.The cpu and gpu decipitates a lot of heat when playing games but predator sense with max fans settings on take cares of it.\n2.There is a little backlight bleed issue at the top which is negligible,all ips display laptops have this issue.\n3.Windows 10 is an update magnet so it drains down all wifi speed.Stop all auomatic update and set network to metered will solve this issue.\n4.rRght clicking on desktop freezes the cursor for 1 sec, probable some software issue.\n5.Only 1 usb 3.0 port is provided.",
            "Good packaging, came in time.\nlaptop is awesome. Bought it in offer. using it for 10 days.\n\nCons are : battery is little less. could have been better. 4 to 5 hours for normal usage, 2 hours for heavy gaming. connecting the charger while gaming is advised.\n\nGets warm while heavy games like gta 5 in ultra high res. Can feel little warm on the keyboard and top part, as the body is brushed metal. But not the hottest as compared to other gaming laptops. Thanks to cooler master and custom metal blade fans.\n\nSpeakers are placed facing bottom. It would be nice if it is places facing front. Still the sound quality is good. but not great. Headphones gives better sound while gaming.\n\npros: Ips full HD display panel is just great. good color reproduction.\n\nLaptop body design is creative and cool for a gaming laptop. Stern metal body build. bottom is just plastic.\n\nEasy upgradable dedicated ram and HDD rooms. SSD is fast enough to boot windows in about 10 to 20 seconds.\n\n7th gen processors and gtx 1050 ti is the highlight. Graphics card is used only when needed for saving battery life.\n\nTrack pad and keyboard is smooth to use.\n\nGreat value for money. Buy it in offer around 60k.\nThank you.",
            "You can't get anything better at this price. I got for 63k in Republic Day sale. Windows 10 was installed on SSD by default so booting time is very less ie approx 7-8 sec, its very fast. I was worried about laptop but its good, its built quality is awesome. Till now only played Fifa 18 and played for 1 hr, no heating at all and no fan sound. In high end games fan will come into action but other than that its a quite laptop too.\nScreen quality is good, but at maximum brightness also its not very bright, although its good. Color production is also nice. Battery depends on what you use. It is also good(like any other laptop at this price) . And one thing, sound of this laptop is not so loud and speaker is at bottom corner so you need to place it on a flat surface for crystal clear sound, on bed you might not get clear sound output. Overall its a beast with whom you will fall in love with.",
            "If you are looking for a laptop to meet your gaming needs.. this is it. I received the product the very next day. Packaging was good.\nPros:\n1. Awesome design\n2. Awesome keyboard\n3. Awesome Performance\n4. Boots in 2-3 seconds\n5. Played COD WW2 full settings 55-60 FPS\n6. Screen is good\n7. Upgradable ram and ssd option\n\nCons\n1. Battery Back up is low. while gaming it last for about 1 - 1.5 hours\n2. I personally didn't like the trackpad. (Maybe cause i am used to use track pad on Mac Book Pro.) but who needs trackpad when you are gaming. You probably have a nice gaming mouse.\n\nSo far i have loved it.",
            "best laptop ever ... everything works perfect ..its price is worth .. no need to sell kidney,eyes or balls for this gaming monster its now or never.. its price is 99900 in amazon.\nso what are you wating for\nthe name predator is enough",
            "Excellent Product !! Acer packing is awesome !! Laptop is superb stunning look. Great performance. Over clocking is great. Display is crisp. Battery life is average and fine . Sound is the drawback . Sound is low. Otherwise no issues. In one word -Its A Beast !!",
            "Its a great laptop. just a issue with heating as its get upto 98°c when i play pugb. Also wanted to thank team acer for providing us the new bios for rectifying the black screen issue .\nif any one of you facing the black screen issue. kindly update you bios its available on the official website.",
            "It's been 6 months since my purchase of the laptop and here is my review-\nFirst of all the packaging and delivery by Flipkart was awesome and well maintained. Now coming to the laptop itself\n\nPros-\n1. It gets on sale frequently and you should purchase it then only and that time it is more VFM than competition.\n2. Performance is very good and it plays all AAA titles at medium to high graphics easily at 60fps.\n3. Temps are also under control and only the top part near hinge feels hot to touch.\n4. The fans are silent and only audible at their max which they only go by setting max in predator sense app.\n5. The track pad is smooth and responsive thanks to Windows Precision Drivers though a mouse is always recommended during gaming.\n6. Acceptable weight which improves portablity.\n\nCons-\n1. Horrible speakers with no bass and tiny volume. Even the max volume is pretty low.\n2. Subpar battery life, lasts only about 2.5 hours on balanced mode with no gaming. Though it charges decently quick.\n3. Build quality is not so great. There is a squeaky sound near hinges and the plastic over hinge makes noise with pushed.\n4. Average display. Decently bright but low colour accuracy and slightly dull IMO.\n\nBuy this laptop if you get in sale for below 70K INR otherwise there are better options available when it is available at it's regular price of around 1 lakh INR.",
            "hlo there,\ni am writing this review by using it for a month. if u r a person who wants a superb thing in a very low budget thn i am seriously saying go for it. i mean the speed of gaming and the specs are itself awesome. i got it for 59480 during sale and bank offer . wait for price drop during sales. and i drops for 1 or 2 days. so if u r lucky that grab it and buy it as i am very much happy from it. ys there are little bit issue with screen bleeding but its not that much noticeable too the sound level is low but quality is quite high. dont go for bad reviews. people dont even are happy from god. Go for it man. its really a different thing and persons notice it too much around you. go for it.",
            "Ok so this is a review from a 6 month old user.\nMy use 8-10hours/day\n\nEverything is good for this price.\n\nIf you are buying this for games,\nEvery game except AAA games at ultra runs at 60FPS, AAA games keep getting 30-60 at ultra and 50-60 at high settings.\nFans are quite silent than expected.\nThere is slight body heating near the upper side of keyboard while heavy usage.\n\nPort selection is top notch but missing thunderbolt which is not a big deal as it is mainly used to connect eGPU\n\nCamera...\nREAD MORE",
            "It was a good deal. I got this laptop for ₹61890.\n\nThe flipkart packaging was really bad. One could literally peep through torn areas and see what was inside. All thanks to Acer as you could be assured the safety of the product which could be seen in its packing case(5 stars).\n\nDo update the windows after getting the hands on predator cause the default version has few bugs which is addressed in the update.\n\nSpeaking about the performance this laptop is a beast. It can easily handle all the h...\nREAD MORE",
            "This is a good product specially with the discount I got it in flipkart. However the system gets heated up very quickly and the screen is not to bright . Also the volume is average . All in all a good gaming laptop but not the best in the market at this price range.",
            "So as soon as I got this. I upgraded the ram with one more 8 GB samsung 2400 MHZ for 5800k .. So not its been more then a month using heavy games in super ultra settings.it didn't even have a single lag .But make sure you have to plug your charger while in turbo mode..sound is good unless you not keep it in small table. As speakers are place underneath.when compared to my S9 plus this is too worst ..Build quality very average as u can fell sounds when your opening ur screen as if like its broken.Heat management is bit poor even with two fans you will feel the heat in the key board and key board I am not sure how much it will last for gaming..Better switch to wired or wireless keyboard and mouse for gaming..This one will not connect via miscast to TCL tv but for others after disabling defender its working fine .Battery it lasts max of 5 hours in normal mode and 2.30 hours max in turbo mode..Final words : buy this if ur getting any thing below 65000K else you have to think be for getting it..",
            "I got the product in 2days and with perfect packaging,the laptop is too cool.. really loving it.The only issue is overheating (the keyboard gets heated too)..so it becomes difficult to play games,but the adjustable fan speed is a awesome feature takes around 5-7mins to cool down the system,(if u haven't turned the max mode on while playing)..it is a beast..",
            "Best Gaming Laptop at this range. Compared to other laptops of same range and specs, this has a very good built quality, better screen and a decent audio. There is no excessive heating problems and when the fans are a bit silent too. Even at max speed the fans do not interfere with the laptop audio. The Gtx 1050Ti is the best thing in this. Latest high graphics games also give a decent frame rate at very high settings. The keyboard is good, not too hard and not too soft. The track pad is superb as compared to other laptop. The screen is too sweet at full HD. The camera is a bit decent. The red backlit of the keyboard gives it a very killer look. No one can beat predator at looks, built quality and performance. As a game enthusiast I do not regret buying this laptop in any sense.",
            "does its job pretty well. demanding games like gta v, witcher 3 run smoothly at 60 fps at high settings. no problems in everyday use as well, boots up amazingly fast thanks to the ssd. have not faced any overheating issues yet.",
            "Awsome product very good.... But the build quality is not that good... Accer says that battery backup is 8hr and 4 hr gaming its not true....battery performance is very poor... And on the screen size the pannels r loose.... It is for very accer laptops but i havent felt that good it make some sound after pressing a bit.. But laltop is good",
            "Its Beautifully Crafted, Good Looking, Fast, A Beast, A Monster For Games Runs like Ice Cube. Love the keyboard and the whole thing fits perfectly. 1080p Display just blends in with the aluminium Front.",
            "Laptop is just awesome with maximum features that can be provided at this reasonable price. Initially, i was worried about the low volume of the speakers as its speakers are the at bottom side of the base (i have portable speakers so i ignored it). Otherwise, Dolby sound quality is too good (you need good headsets to feel it, remember it has Dolby Sound and not Dolby Speakers so on laptop speakers you might not get that feeling). Metal finish and backlit keyboard are its key attraction points. Hail Predator!",
            "This laptop has the Nvidia optimus technology (Google it) .So expect some driver issues. Do not update Windows right after u got it, which caused mine a lot of driver issue.. so had to do a clean windows installation to get rid of the problems like small stuttering/lag. Display Drivers downloaded form Acer website failed to install. Customers don't want to go through this hassle. There is some light bleeding around the corner of mediocre looking display but it won't bother you that much. Speakers are average, not happy with the keyboard either. Cooling on this thing is ok, make sure u buy a cooling pad. Flipkarts packing was poor. Anyway I'm satisfied with the purchase since I got it for 46000/-\nIf you have the budget of around 70000 look elsewhere.\nLenovo y520 is a better purchase then this.",
            "The best e-shopping, the most reliable company and quick and quality products and best in this business is the delivery is really quick and the service is really cool most probably the best e-shopping in India👌👌👌👌👌👌👌👌👌👌",
            "it's an amazing laptop ,but there is some pros also. like, right click of touchpad didn't work properly and display is also freeze when system start .",
            "The Beast it is.\nReview after a week of usages.\n\nPros :\nBoot time is lit. Only 5 sec.\nSSD is fast as flash.\nPerformance is top notch.\nBacklit keyboard looks pretty awesome at night.\nSupport almost every type of heavy game and graphics rendering with smooth performance.\n\n\nCons :\nHeat as hell.\nA bit noisy machine because of dual cooling fan.\nSpeaker are low if you're using it in outer conditions.\nNo accesories were given with it except laptop charger.\nLaptop surface is fingerprint lover.\n...\nREAD MORE",
            "Close your eyes and buy it , many reviewers have written about the display and some issues with the laptop.. But honestly I don't think there is any problem, the display is gorgeous and yes it shows some white backlight at the corners of the screen if u play something totally black but it's not noticeable while doing any work on the laptop, games runs so smooth at very high presents that u will b surprised, doesn't heat up too... The aeroblade system works amazing, if u get this laptop for around 60 K, BUY IT, because the components in the laptop cost more than that if u buy individual parts in the market , totally worth it.",
            "Amazing product till now....Plays almost any kind of game smoothly on high graphics.....ultra graphics work too...... Perfect for gaming....Yet to try video editing on it and other different softwares..... Good battery backup\nDidn't think it would be 100% genuine.......",
            "got this one for 60k..\nit's a beast... just add 4gigs of RAM in the empty slot and it can deal with anything..\nBattlefield 4 and DOTA working good even on ultra..\nCS Go is buttery smooth on ultra..\ncooling is awesome..\nhowever, speaker volume is on the lower side.. doesn't matter for me as I use headphones\n\nupdate:\nmotherboard gone wrong after 15 days of use..\ntook it to Acer care and he gave it to me after 10 days..\nupdate:\nhave it back to me after just reassembling all the connections and removing and reinstalling the non removable battery... working good for now..",
            "I love everything about this laptop. I got it for a really amazing price considering all the hardware it has. The speed is amazing, SSD will definitely change the way you look at laptops. The 1050Ti Nvidia coupled with the Intel 8th Gen i5 8300H is a tough competition to any other laptop in this range and this one has the most value for money as a matter of fact.\n\nThe only con I see is that the metal frame is a fingerprint magnet. No matter how careful you are, you are bound to get it dirty. But if you clean the laptop with a cloth once in a while, it's good as new.\n\nI am really happy with this purchase. Thanks to Flipkart I got an amazing deal. :D",
            "Gradually after use, it's starts heating up so much that your fingers burn while using keyboard. Display went off after first 3 days so had to get it replaced and it took a long time. Better go for newer version of predator or better alternatives are there these days. When I bought it, not much alternatives were there or if there were pretty expensive. Hence I'll rate it 4, else in current market considering the options, I'll rate it 2. Display is pretty bad!",
            "I got it as I expected. Superb performance and gaming. Already many reviews so leave it. I suggest you not to go above 65k. It's nice but above 65k you will start getting better than this. Of course, you should wait for that price point. It is something you should buy in any offer, you will love it.",
            "There is no better laptop than this in this price range. No laptop comes close to this one unless you shell out more than 90000 rupees.\nThe combination of SSD and HDD with perfect capacity balance lets you run your OS and heavy software at superfast speeds using SSD and allows you to store your large games and movies on the 1TB HDD.\n8 GB of RAM allows you to use many heavy RAM consuming applications in parallel.\nNVIDIA's 1050 Ti graphics lets you run any game at high graphics settings and can also be used for Deep Learning and training.\nThe looks are also great.\nYou need to be a little careful about the screen though towards the hinge side.\nOverall a perfect gaming laptop.",
            "Simply Awesome!\nBeing a Developer I love this product. I brought it in 60k only and I am too happy. This Laptop gives 8hours battery backup if and only your drivers are not conflicting and firmware is updated. I did the mistake before I installed conflicting drivers and battery backup reduced to 1 hour and sometime battery got dropped in few minutes after that I fixed driver and update firmware Now everything work fine.\n\nSome issue users always experience:\n\n* Heating problem: to fix this always turn off or remove the background app using the GTX 1050Ti when you not are not using them. Secondly whenever you wanna play game or use GTX 1050 Ti then plug your charger and max the both fans speed.\n\n* Battery drop problem: to fix this issue always be up to date with drivers if new drivers are conflicting install the previous version and always make eye on release log for your latest driver. Update your bios and firmware also to get enhanced performance.\n\n====================\nI suggest you if you wanna do some heavy work always plug in your charger, trust me it will enhance the performance and speed of your work\n====================",
            "Using this Laptop for over 6 months now & it is actually beast for the price. Performance is excellent with 8GB RAM & SSD. I mostly only play Fifa 18 & use all software's for IT field required, it's worKing smoothly without any lags. Battery performance is so so but it's expected for such a heavy configuration.\nAll n all I'm very satisfied with this one.",
            "Acer predator helios 300\nyou all must know everything about the laptop from reviews and everything\nSo I will tell about the particular Acer predator helios package I received\nIt was packaged good not very good by Flipkart\nThe Acer packaged is awesome.\nI didn't receive the paperwork shown in the review that is the setup guide.\nI will write the review of the product after some months please stay tuned as I know this will be an important purchase and if you cannot wait please order from a seller which has the best rating",
            "well product is good with this configuration when you got it for 60k-70k but if you paid more than that then there's nothing you can do about it now 😂😂😂... now days gtx1050ti is no good for gaming and editing purpose..If you do lite gaming and editing or if you don't care about FPS when you are playing games 1050ti is enough for you.....\nNow review time for product... I got this product for 60k(Rs60000) my product configuration are i5 7300HQ which is quad core processor 8gb DDR4 2400mhz Ra...\nREAD MORE",
            "In terms of specs it is definitely a beast, not to mention each and every specs as it can be find on site itself, as far as i see there are no reviews for i5 (8thgen).\ngaming i would say it runs every game on ultra @ 49-52 fps for AAA games with cool boost ON and fans at max RPM.\nI'm little disappointed with the sound as it has Dolby audio but still lack that loudness which i had with Hp laptop with same Dolby audio.\n\nIt heats quite a lot i.e mine reaches up-to 95c , but i think that will happen as most AAA games are graphics intensive which will raise the temperature.\nIntel XTU saved this problem by undervolting mine went upto -110mv which is stable for i5, i guess.\n\nP.S. If you're getting this under 65k, go for it, as i bought it for 49k on sale (worth every penny)",
            "Product is good but attract dust. Run almost every game with heat issues. May be better to play in ac or in winters. Battery is good around 2.5 to 3.5 hours with normal use and 45 min to 1 hour for gaming.",
            "Awesome product and delivery was also great used for 6 month still work like charm",
            "This is going to be a comprehensive review of this laptop and Flipkart service in general. The review I'm writing for is a replacement, since the first ones adapter blew its fuse after three days. Thereafter my experience with Flipkart was abominably horrible. There techinal team can't be contacted by the customer so you have to constantly wait for their call, furthermore it took them ten days to initiate the replacement. I choose not to deduct stars because of my ordeals.\nNow, I'm going to devide my review into three or four categories.\n\nBuild quality 3.5/5\nThe upper portion of lid and keyboard section is made of metal, rest is plactic. Their is noticeable flex around the display, Acer could have made it stiffer. Generally build quality is decent.\n\nDisplay 3.5/5\nIt is a full HD IPS display, with good colours and decent brightness, though their is a little background bleeding but you won't notice it unless you're looking for it.\n\nSoftware 4/5\nIt comes loaded with windows 10, along with predator sense which is very useful for controlling fan speed and tweaking with your GPU and CPU. But then their is a remarkable amount of bloatware pre installed on the computer. Acer must realise that most customers could install whatever they need by themselves.\n\nPerformance 5/5\nWhatever faults there might be in this computer its hardware components, cooling system and performance are excellent. The configuration I bought had 128gb of ssd, where windows is installed and the laptop boots in less than 3 second, 1tb western digital hdd, intel core i5 8th gen cpu, Nvidia 1050ti with 4gb of ram, and micron 8gb ddr4 ram.\nAs is self evident this configuration can play any game on high setting at 30-60 FPS. Moreover if you manually change the fan speed to max (absolutely recommend for smooth gameplay) temperature won't rise beyond 80 degrees. I've played crysis 3, Witcher 2 and Witcher 3, some of the most graphically intensive games and with vsync on I was getting around 50 to 60 FPS. I'm particularly pleased with Intel's CPU, its remarkably fast and energy efficient.\n\nAt the price I bought this laptop it is simply peerless. It is a sweet deal for gamers who want a laptop that could do its job without breaking the bank. Go for it if you're in market for a laptop that could play games or can be used for graphically intensive work.",
            "the is best it works way faster than I imagined\nbut the problem is can't find suitable accessories for it any suggestions would be acceptable\nthanks",
            "Best purchase only at 61999 rs only on offer day. Best in performance, fully loaded with high configuration! Best buy! Build quality is great. As it has a extra memory slots to update your memory so its future proof!!",
            "Great product\nThe laptop is killer at it's price range.I got it in 60k in Flipkart's big shopping days.Gaming on this is awesome.the battery is also quite nice for a gaming laptop I got about 6 hrs on normal usage and 3 to 4 hr on playing offline games like Forza horizon 3 .",
            "Is working great till now. Will require some updates for the windows. Brought it for 62k, best in segment n most of all is a great value for money !",
            "Awesome laptop.Graphics are very good and plays all high graphic games.Gtx is 4gb card and I played GTA 5 in maxed out settings by using just 2.5GB.Battery consumption is more so you will get only 4 hours battery life.Overall best laptop in it's range.Wait till offer days to avail it for around 60k-65k.I got it for 64k",
            "This product got shipped really fast like in two days or less, so the shipping was satisfying and about the product as i got it for 61k which was the best part of Flipkart sale, packaging was breadth taking and product satisfy all the specification, works perfectly and no problems till now , on intense level of gaming it gets heated but cools down very fast . Worth the money in short.",
            "Very good laptop awesome graphics and fast booting time good looks very good laptop for gamers and also for students",
            "The laptop performs like a beast. the delivery was as scheduled, well packed and polite.\nfor the laptop, I couldn't have asked for more at ₹60k. It performs really well and I can play most of the games on it.\n\nIt does get heated on the pad above the Function row, but it's nothing to worry about.",
            "The box was opened . Shipping took unnecessary time.\nI guess the shipping crew opened it cause the seller had packed it well in 2 boxes. Rest all good hopefully.\n\nHad to return it for replacement, When off suddenly and dint turn on,\ntook 8 days for the replacement to come, this came well packed and is running great so far.",
            "The laptop is very very good and the gaming performance is awesome no Lag's and frame drop s .But the sound coming from the laptop ,is not that good it was okay .Except sound The laptop is awesome????",
            "BEAST!!!\n\nIts worth the money. I played farcry 5 on ultra settings and it works as smooth as butter .",
            "This is a very adorable product just because of its look. The gaming laptop with such specs like i5 7th Gen processor , 8 GB ram , 128 GB SSD , 1 Tb HDD , 4 GB Nvidia 1050 ti graphics is just awesome at this price range . Battery life is not as good as suggested on paper .\nDisplay , sound is good . The only problem is that the screen suddenly goes off ( specifically happened to me ).\nOtherwise it's a great price at RS.60000 or lower than that.",
            "I am giving bad review because my laptop is shutting down without giving any warning. I called flipkart and they escalated the matter instantaneously to acer. Acer technician has visited my premises twice and took the laptop with him for changing the motherboard after battery and power cable looks fine after testing. Awaiting for the rectified piece.\nComing to the Laptop, I have used it for a week and here is my review:\nPros:\n1. 1050ti is really killer, I have played Hellblade, NFS payback & Evil within 2 and all games worked like charm but you have to put Turbo mode if not frame rate drop will happen. Also without connecting your laptop to power socket, game wont work long and you will face frame rate drop very often, almost impossible to play.\n2. I got the laptop in 51500rs with no cost emi so i was pretty happy.\n3. Laptop screen is above average but not the best.\n4. Big screen will help you to get fully immerse in game. You will really enjoy playing all latest game on this laptop with neat clarity and graphics.\n\nCons:\n1. Black levels could have been better.\n2. Microsoft office is on one month trail version.\n3. It heats up very fast while playing game.\n\nRest all is ok with the laptop, if you are getting within 60k, its an awesome purchase but you need to be careful with its rebooting issue on battery. If found this issue, instantly contact flipkart and acer and the technician will do the needful.\nYah one more thing, i followed all the steps mentioned on this post for rectifying reboot issue but it didn't work out for me hence escalated this to flipkart. I will again re-write the review post getting the rectified laptop from acer technician.\n======================\nLatest Update: Laptop came back within a day and battery issue is no more. Technician told that some button relevant to the battery needs to be pressed continuously which was not happening. Issue has been rectified now and lappie working nicely. Thanks to Flipkart and Acer for taking this issue on priority and rectifying it.",
            "Buy this for Rs 59,990. What better I can get at this price?\nAfter 4 days, Enjoying the experience every moment . Awesome product design and exact the configuration I was looking.",
            "A great Gaming laptop at an unbeatable price all thanks to Flipkart. Got it delivered within 3 days flat in perfect working order, was very pleased with the packing.\n\nNow about the laptop:\nAmazing gaming performance with most modern titles running at 1080p high to medium settings at 60fps. The only negatives include\n1. The not so bright screen &\n2. The speakers, which completely lacks any base. ( Easily rectified with a good pair of headphones or external speakers)",
            "Got it delivered today at my home! It was just amazing packed with proper care and when I used it I was amazed by the performance it gave! At last, a must buy!",
            "Product is good, works well with games,but have some issues:\n1- Wifi connectivity issue, ane even when it gets connected, speed is comparatively less compared to other devices, i checked on both, hotspot as well as on wifi router.\n2- Video hangs a bit everytime you pause and play it.\n3- Brightness is low, so you cannot sit outside in a bright light to work.",
            "Best laptop at offered price (60k)\nFirst of all thanks to Flipkart for fast delivery within 24hrs\nPros:\n1.This beast handles games very well.there where slight fps drops for Black flag while I am playing i.e. at very high but it went after I adjusted some setting in Nvidia\n2.build quality is superb. Don't expect anything more than that at this price point.\n3.battery life: for a gaming laptop we can't expect 6plus hours of battery\nWithout gaming the battery life lasts more...while gaming it drains pretty quickly\n4.boot time: it just loads in a blink of an eye (it's that's fact)\nCons:\n1.audio quality: even though it has Dolby audio it lacks bass.\n2.screen: the color saturations are good.but display is not that bright in direct sunlight\n3.finger print magnet\n4. Loud fan noise: but is actually not a con as for heavy gaming it's usual.\n\nAnd finally for the end,those who are thinking twice whethee to buy this one....I say u can give it a go...it's the best in this range (60k)....there were many reviews that it has frequent shutdown etc.but I didn't notice anything.",
            "Got this great piece at a great discount on women's day. It can handle most of the big games without getting heated. Am loving it",
            "SHUTDOWN ISSUE ( RESOLVED)\n\nFirst of all, I would like to Praise Flipkart for the Great Packing.\n\nI took almost 15 min for me to unbox it.\n\nStarting From Very Beginning :\n\n1. Box itself Look premium.\n\n2.Very well Packed and protected ( By Acer )\n\n3. Then the Laptop Itself is very very Good looking.\n\n4. Not so heavy as mentioned by other users.\n\n-----------------------------------------------------------------------------\n\nNow next things to mention.\n\n1. Easy and very quick window registration and setup Thanks to SSD.\n\n----------------------------------------------------------------------\n\nI was using this Laptop with Changer in by the time I completed setup.\nThen after 30 min I un plugged it .\n\nThen What I saw is that laptop crashed or shutdown whatever you call it.\nI thought I might went on sleep.\n\nI restarted it .\n\nThe same thing happened 3 times in a row.\n\nI was annoyed as I thought I got defected Product.\n\nI searched online on Forums as many users were Facing the same .\n\nMy laptop was just 30 mins old , I was about to return It .\n\nBut before Filing the return I Tried couple of things and My issue got resolved .\n\nThe Steps are :\n\n1. The is a small Battery reset Hole/Point on the Backside or you can google it how to reset it.\n\n2. Use a pin to reset/press that button . ( For about 120 sec keep a hold onto it )\n\n3. Now most important step : Update BIOS.\n\n4. Goto acer Site and update is only 6 mb . ( Please read instructions carefully before doing it )\n\nMy issue is resolved by Doing these two\n\n-------------------------------------------------------------------------------------------------------------------------------------------\n\nComing to performance :\n\n1. Boots within 8 sec\n\n2. Looks Premium\n\n3. No lag at all.\n\n------------------------------------------------------------------\nCSGO : 200+ FPS on MED settings\n\nPUBG : 70+ on High\n\n-----------------------------------------------------------------\n\nAlso CONS ( As mentioned by other users )\n\n1. DIM screen : Not really , It is decent\n\n2. Fingerprint magnet : YES YES YES\n\n3 TRACKPAD : VERY VERY GOOD for me big and smooth\n\n4. HEATING : not at all while normal use : Yes While gaming : Fan are not that loud Even on MAX\n\n-------------------------------------------------------------------------------------------------------------------\n\nVerdict :\n\nBest laptop if you are getting it for 60k\n\n\nAlready wasted days searching online for better deal and laptop .\nThis is the best :)",
            "Best gaming laptop at this price range....62k....everything is perfect...cooling system is also good...high graphics gaming like assassins creed origins runs on ultra settings at fps of about 40 to 45....very nice...can run almost every game at high settings....audio quility is also nice due to dolby audio...over all very good experience....packing was excellent....and flipkart delivered this in 2 days...",
            "I am using predator from 3 months... Not good in high gaming like gta5 or modern combet 5 so go for other laptops...",
            "This best value for money laptop with this specs which have a i5 7300hq processor coupled with nvidia geforce gtx 1050 ti which gives a smooth and efficient gaming performance as well as a workstation. No heating issues,fans are little bit louder but its ok the maximum temperature i have seen after a 6 hours of continuous gaming in oc is about 62 degree Celsius.but a little problem is that that the gpu fps is locked at 30 fps but i can change by the game ready driver's by nvidia. Battery performance is not good after sometime of gaming batteries went down but it is Compromise able for this price point. Overall its a best gaming laptop in this price in comparison to other gaming laptops.",
            "I took this laptop during the Flipkart's big billion sale for 60k, at this price range it has the best features than any other laptops.\nREVIEW:\nI have been using this laptop since past 2 weeks I don't have any kind of issue's with the performance. In case of gaming I played GTA-5 and Battlefield 1 they ran smoothly with the 1050ti graphics card around 45fps. The booting time is also fast it starts up within 6-7sec as soon as u click the power button. The build quality is also good and sturdy with the brushed aluminum finish and the red keyboard backlighting looks good. Thanks for the inbuilt Acer predator sense that is really good.\nCONS:\nThe very few cons I felt during my usage was the battery it lasts max for about 3:30min with extreme gaming, video editing and Photoshop.\nDisplay is not extremely bright but not bad.\nWebcam is not so good if someone really do a lot of video conference's then I think this might disappoint them.\nOverall it is the best gaming laptop at this price range, Acer as made us tick almost all the features which we see in a gaming laptop and also Acer as a good customer support in my location. I suggest to buy this laptop\nAnd thank you Flipkart for the best price.",
            "A gaming beast. Super smooth perfomence in games and day to day usage. It gives 4-5 hrs battery backup if just watching movies or doing everyday stuffs. Gaming perfomence is awesome it can play all latest games in ultra setting with 40-50 fps and 60fps at high settings. Just an amazing laptop. Just go for it.",
            "One of the best Laptop to buy!! I love the logo of Predator,it's an SSD laptop.. smooth working..Go for it.. weight of the laptop seems to be a lot but it doesn't matter any laptop u need to take care all the time..But ultimately fantabulous... Excited a lot",
            "Great laptop for gaming\nWorks fine with almost every game\nBut you might need to reinstall the windows by resting the windows this could help to fix the 0xc000007b error\nAfter reinstalling it works fine",
            "Pros:-\nexcellent build quality\ngaming feels quite premium\nspeakers are above average\nkeyboard is very handy\n\nbootup time is super fast\naeroblade 3d fans are very useful and works awesome\n\nCons:-\nbattery backup is below average\nbig bezels\nthe panel is fingerprint magnet",
            "Awesome product. was waiting long tym to buy this. Flipkart helped me in buying this by giving awesome discount. purchased at 59990 only... just loving it...",
            "ACER Predator 300 is Very Good...\n\n7 ★ USB Port -: only 1 x USB 3.0\n8 ★ Battery - > Not Bad\n9 ★ Web Camera -: Good\n9 ★ Keyboard - : Good\n9 ★ Speakers ( Dolby Audio ) - : Good\n10 ★ Processor i5 7300HQ ( 2.5 GHz with Turbo Boost Upto 3.5 GHz ) -: Awesome\n10 ★ Display 1080p ( 1920 x 1080 Pixel ) Full HD LED Backlit TFT IPS Display -: Awesome\n10 ★ RAM 8GB ( 2400 MHz ) - : Awesome\n10 ★ 120 GB SSD + 1 TB HD - : Awesome\n10 ★ Graphic NVIDIA Geforce GTX 1050 Ti 4GB -: Awesome\n10 ★ Dual Fan Cooling System ( 38° to 77°c ) -: Awesome\n\noffer Discount this link =ACEER Predator",
            "Got this beast for 60k which is an absolute steal. Overall performance has been very good.\n\nPros:\nProduct packaging was great.\nGood build quality.\nSSD allows for fast booting and performance.\nGeForce GTX 1050Ti gives amazing performance for most high-end games.\nCooling mechanism is very good.\nGetting battery life of about 7-8 hours.\n\nCons:\nFlipkart packaging was bad.\nScreen brightness not that high.\nOffice license is a one-month trial version.\n\nAlso, for me after pausing and replaying a video, the sound of the entire system got distorted. This happened everytime until I did a driver update and now it seemed to be fixed.\n\nConclusion: I can't tell if there are other laptops in this price range that are better, but for the price I got it, the value for money is simply outstanding. Satisfies my personal gaming and work requirements.",
            "Got the order at a really great price and also the delivery was fast (just one day).\nThe specs are good, gaming is great on this laptop and overall a great one. Want a gaming laptop, go for it !",
            "Absolutely loved the product! The acer predator is definetly one of the best affordable gaming laptops that money can buy right now!\nYet to play any graphic intense game on this so that review will be later .. But you can google for more detailed reviews..\nthe flipkart packaging was quite good ! with all the necessary documents and papers inside\ni got mine for around 60k s there was adeal on it... So stay tuned to get the best price :)",
            "Ok The design is awesome ,it just look like beast ,I played gta 5 max setting at 55-60 fps , shadow of mordor at 60 fps , assassins creed syndicate also at 60 fps , so over all the gaming experience is very good ,the main problem is the smudges on the top of laptop ,the build quality is good ,it heats if playing game also make noise, if you are getting this at 60-70k don't waste time just buy it.the screen is ips so the viewing angle is very good.",
            "Zing zing Amazing ! Got this beast for 60k during big billion day sale thanks to flipkart.\n\nPerformance is great (9/10)\nGtx1050ti paired with i5 7300HQ can run all the games with med-high settings with 60fps\n\nBuild quality is great ! (9/10)\n\nBattrey could have been better ..but at this price no complaints on battrey .\n\nAlthough display quality is good brightness is just adequate to use outdoor not very bright...but again considering the price thats ok\n\nComming to main issue every gaming laptop\n\nthis laptop does not heat up much while gaming thanks to the dual fans thermal management is good on this laptop\n\nSo now should you buy it or not\n\nIf you get this deal for 60k its a great machine you can get there are no other alternatives\n\nBut i think gtx1050ti for 100k is not a great deal",
            "Got this for 60k and must say worth it but pls dont buy it at price more than 70k from any source at all because then it is overpriced.\n\nComing to performance expect good, snappy, smooth and lag free operation. The default ssd is slow but it is manageable.8Gb of ram is adequate for gaming and some amount of multitasking with the game running\n\n\nBuild quality is actually very good at this price eventhough the display is really average with a bit less brightness then expected but it works well because most of the time you will use it indoors due to its weight which is again ok for a gaming device.\n\nI played civilization 6 on this and was able to get constant 60 fps on ultra settings with 8×anti aliasing. However on battery the performance drops to 50% only and lasts 1 hr while gaming.\n\nI am happy with my purchase at the price of 60k but more than that i would reconsider something else.",
            "This is the best laptop ever... I am using this laptop for last 3 weeks ! I am doing gaming at ultra graphics and the fps is coming very well... The build quality is also very nice... The SSD helps a lot... It only takes 5 second to start my laptop...\nTHERE IS ONLY 2 PROBLEM WITH THIS LAPTOP!\n1: THE BATTERY LIFE IS VERY VERY LESS\n2: DUE TO ITS BRUSHED ALUMINIUM SURFACE LOT OF FINGERPRINT ARE THERE.\n\nTHATS IT INDEED THIS IS THE VERY GOOD LAPTOP I SUGGEST THQT GO FOR IT..\n\nAND PLUS I GOT THIS LAPTOP IN A VERY GOOD PRICE..\n\nONLY 63K",
            "Very good product. It works awesome, the boot up time is very less and in game loading time is also very less. There is very less heating due to the dual cooling areoblade 3d fan. Battery backup is a little less, though all gaming laptop comes with a low battery backup. However, it is the best laptop in it's price range.",
            "I have brought this product during big billion day sale.\nI'm so happy with the product right now I'm enjoying the feeling.\nI'll edit this review after few months if I have anything to mention",
            "If you are looking for a gaming beast then blindly go for it.\n\nI am reviewing this product after 1 month of purchase.Performance is super fast.No Lag or any uncomfortable situation found.\nPros:\n1.Super quality Full Hd display with IPS pannel.\n2.Back-light keyboard with premium quality.\n3.Super fast processor (i5 7300HQ)with premium quality GPU(NVIDIA GTX1050TI).\n4.Metal body with combination of good quality plastic.\n5.World thinnest bladed fan(AeroBlade 3D) for perfect air circulation.\n6.DDR4 Ram of 8GB inbuilt and comes with expansion of 32GB max.\n7.Big multi gesture support Track-pad.\n8.Audio quality is awesome with Dolby support.\n9.Preinstalled windows 10.\n\nCons:-\n1.Slightly heats up while gaming continuously for 2-3 hours.This is normal incident for all gaming pc/ laptop.\n2.Speaker sound could be louder.\n\n\nIf you are planning to buy this product, then don't think much just buy it...\nThanks.",
            "Best discount in price from Flipkart, awesome laptop, looks and feels great, worth every penny. The Icing on the cake is that the product manufactured date is August 2017!\nThanks a lot, Flipkart :)",
            "Awesome Quality and Performance got a great deal on Big Billion Day @ 49990 only. Thanks Flipkart. Been Using this laptop for 2 days till now all games even watch dogs 2 ran smoothly. Loving its performance"
        ],
        "likes": [
            "505",
            "645",
            "30",
            "59",
            "33",
            "32",
            "29",
            "21",
            "127",
            "13",
            "13",
            "13",
            "9",
            "14",
            "6",
            "4",
            "7",
            "7",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "5",
            "7",
            "3",
            "2",
            "2",
            "2",
            "3",
            "3",
            "3",
            "3",
            "3",
            "4",
            "4",
            "5",
            "3",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "5",
            "3",
            "3",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "903",
            "1248",
            "4",
            "4",
            "3",
            "5",
            "6",
            "6",
            "12",
            "1",
            "2",
            "2",
            "1",
            "3",
            "1",
            "0",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "3",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "3",
            "5",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "8",
            "4",
            "4",
            "1",
            "1",
            "1",
            "1",
            "2",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "2",
            "0",
            "1",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:does it have 4gb×2 ram or 16gb×1?",
            "Q:In the acer website and youtube review videos all Helios 300 (G3-572 Models also) have a GTX1060 Graphics card. Does this have a GTX1050Ti card . If yes, could you send official acer website link?",
            "Q:When is deal going to start again in which acer predator was available below 65000. I am eagerly waiting for that deal to come",
            "Q:I'm getting a frequent lag while gamming on this laptop (Not FPS issue).Its like the display and sound get stuck for a second while in a game. Really need HELP?",
            "Q:which is better.this or acer nitro 5 (i5 version)",
            "Q:Do we have an empty RAM slot in the model? I see it has 2 slots. Wondering if both are used or we have an empty slot for future expansion. Please confirm.",
            "Q:No audio output in speakers. What to do?",
            "Q:is this deal only for today or similar or better deals will be available on republic day sale from 21",
            "Q:what is the graphics speed of this laptop ?( in MB/s)",
            "Q:my baka brother is asking whether the charger is included with this product or not?",
            "Q:Why is this laptop so thick? It doesn't have cd drive, gpu is mobile too...",
            "Q:how is the battery life,is it suitable for college?",
            "Q:can we add seagate firecuda 2 Tb to expand the harddisk which is SHDD",
            "Q:H ow to reset the battery? my laptop is shutting down all the times.",
            "Q:Im actually looking for a gaming lap. This model comes with i5 and 1050ti. Should i buy this or i7 1050ti model. Is i5 enough for gaming.",
            "Q:can i install Windows or Linux using bootable pendrive??",
            "Q:what are the frame rate we get while playing GTA V on high settings",
            "Q:If i recieve a damaged product, whats the process to fix it, is the laptop serial no. s from acer usa, am i have to contact acer usa and not acer india?",
            "Q:Is it safe to buy laptops online?",
            "Q:dose this come with an anti virus software",
            "Q:Can i expand my SSD",
            "Q:can we play all games in uktra high graphic without any laggings?",
            "Q:in reviews most of them are saying that they have an auto shutdown problem in this device,what is the solution for it please reply asap bcoz i need to buy this laptop",
            "Q:is it good for video editing ? if so, of 4k editing supported?",
            "Q:can we run blender software without any lag? is this laptop good for video rendering and animation making?",
            "Q:can it support 4k+60hz output via hdmi (4k tv",
            "Q:What is the hard drive capacity? (not the ssd drive)",
            "Q:how to buy acer predator original GTX 1050 ti graphic card ?? pls tell me",
            "Q:How is its sound, its base",
            "Q:When will be the i5 8th gen model will be available ?",
            "Q:Is there another slot for SSD or we have to take out the 128GB one and install the new one?",
            "Q:Can we do net in to",
            "Q:Can i downgrade the OS to Windows 8.1 if i want?",
            "Q:Can we run VR games in it? Although it is not VR ready as other laptops do offer it...",
            "Q:Is this laptop available in i5 8 th gen or not ? In internet there is no 8th grn i5 varient available?",
            "Q:does it switch off automatically????",
            "Q:what type of ssd interface is the 128gb ssd of ? Is it nvme or sata ?",
            "Q:Is this laptop is better than dell 15 Inspiron 5577 ... plzzz clear?",
            "Q:it has fingerprint sensor or not ?",
            "Q:do we require m.2 ssd to install in it? and does this laptop comes with backpack?",
            "Q:How much fps can i get in cs go?",
            "Q:does it is useful for btech???",
            "Q:how much sdd space left after windows installation??",
            "Q:can I play a game like gt5 or call of duty on high settings ,there is any heating issue",
            "Q:what is the laptop's body made of ?",
            "Q:what is the difference btw i5 and i7?? please tell",
            "Q:what is the megapixel of the front facing camera of the laptop and is ok ok for video conference call",
            "Q:i have an Acer Nitro 5 with the same specs... i5 8th gen, 1050Ti etc. (bought it from Thailand). So which one is better?",
            "Q:does the laptop includes any AI programing......??",
            "Q:I can add extra graphic card???",
            "Q:So the only way to install games on it is through external hard drive?",
            "Q:Why are we not getting the 1060 version in India?",
            "Q:can I use it for vedio editing????",
            "Q:Plz ans it's really urgent. If I install all the windows update then will nvidia and other drivers will also gets fully updated or I have to do it manually? If manually then how can I do that?",
            "Q:Will i get 7th gen or 8th gen prosscer if i buy now in August/October 2018",
            "Q:mobile hotspot connect....",
            "Q:Can We Play Watch Dogs 1 and 2 on this Laptop",
            "Q:does it have a windows precision touchpad",
            "Q:Ram,ssd and hdd upgradeable upto?",
            "Q:Which is better. This or asus fx553?.. Also are acer laptops reliable than asus?",
            "Q:Is the processor 7th gen or 8th gen? I have heard that the recently manufactured laptops come with 8th gen processors.",
            "Q:can u upgrade the ram for me to 16GB. i can provide extra money for it",
            "Q:Is there any disc drive to put cd's?",
            "Q:How many logical cores does it have",
            "Q:This one vs Lenovo legion y520..Also what's the battery backup u get while playing heavy games in Both of them??",
            "Q:i have i5-8gen the screen Freezes and on rebooting screen doesnt turn on but keyboard lits up twice anf stays lit what to do?",
            "Q:Is this i5-8th gen laptop comes with lifetime windows 10 and Microsoft Office",
            "Q:Is this 7th gen or 8th gen?",
            "Q:What is the difference between ph315-51 and g3572 predator?",
            "Q:is it been updated to 8 th gen what are the recent changes made from previous 7 th gen",
            "Q:the description says its 8th gen..is it really 8th gen i5 or the plain old 7th gen?",
            "Q:does it support lumion software???",
            "Q:Is the processor Dual Core or Quad Core?",
            "Q:is it touch screen???",
            "Q:Is there any automatic shut down problem in this laptop? Many customers are complaining about this.. Is it true?",
            "Q:Does it's graphics card support direct x12??",
            "Q:how we download games on this laptop?",
            "Q:Does any one got a keyboard cover for this? if so which site?",
            "Q:Can i connect it to my tv and play games?",
            "Q:Whether this one or the acer nitro with the same specs is better ?",
            "Q:how much battery backup up in hours??",
            "Q:i feel the track pad is slightly losse at bottom cause i can feel some space.is it normal??",
            "Q:is there a microsoft office???",
            "Q:Is this laptop suitable for the use of heavy software's like coral draw and photoshop? What's the weight of the laptop??",
            "Q:Is that necessary to charge it first time before use? If it is necessary how much time we need to charge it?",
            "Q:How many have you faced backlight bleed?Answer this without hesitation, this will help others to know the truth.",
            "Q:Graphics is 1050ti. and whats its graphics memmory?how much gb vram?",
            "Q:is there any much difference btw i5 and i7?? please tell fast",
            "Q:can I play fifa 18 in the laptop??",
            "Q:Is there any ADP (Accidental Damage Protection) provided?",
            "Q:When will this model be of 60k plzz tell me",
            "Q:C'mon no sale on Valentines day ??",
            "Q:At what rpms does the hdd run ?",
            "Q:Can anyone plz comment on battery life in normal working situations ,not gaming?",
            "Q:how much watt charger comes in the box?",
            "Q:what GHZ it has",
            "Q:Could you please suggest which bag to go with for this laptop as the size is quite big due to which not all laptop bags are compatible.",
            "Q:what is clock speed",
            "Q:does the debit card option can be used if debit card limit is 49000?",
            "Q:do i can upgrade my graphics card into 1060??..please help",
            "Q:is it good for engineering or college student?",
            "Q:this laptop freezes randomely for a second. any solution?",
            "Q:i ordered this item today morning, till now my order is not approved. what can i do?",
            "Q:which one is best Acer Predator helio 300 or Asus gaming FX553?",
            "Q:Does this laptop has any heating issues? Heard it rises to 90 degrees",
            "Q:can we connect wireless headphones via bluetooth?",
            "Q:which one is better, this or lenovo y520?",
            "Q:can we update graphics card?",
            "Q:how many logical processor in this laptop and physical",
            "Q:how many logical processor in this laptop",
            "Q:what display does it have? TFT or IPS? And os it anti-glare?",
            "Q:is this i7 or i5",
            "Q:Why does the upgradable hdd secondary slot is not empty? Or is it the only HDD slot in the laptop?",
            "Q:Can You Tell Me Which Frequency RAM Does It Have.And Of Which Company RAM It Contains",
            "Q:can this laptop be used in abroad",
            "Q:when is the next sale so that i can buy it at 60K??",
            "Q:1050 or 1050 ti",
            "Q:is it i7 or i5 processor?",
            "Q:we want to install graphic card?or its pre installed?",
            "Q:when the next sale is going to happen for this laptop?",
            "Q:what is the processor count?",
            "Q:can I do programming in this laptop like Java Python C plus",
            "Q:How come external HDD slot is not an empty slot? How am I going to upgrade it without replacing the installed HDD?",
            "Q:can i run graphic software easily like solidworks, autocad and photoshop?",
            "Q:does noise is a problem around college or work areas ?",
            "Q:So I did not get to use my lappy for almost 40 days and the battery was fully charged and was inside. After turning it on now, I guess it Ran down from a full charge to 0 in around 40 mins. Help?",
            "Q:Is it just me or the laptop shuts down automatically? I was starting far cry 3 the battery was at 49% and it shut down automatically.. 1 day old?",
            "Q:It says 9hrs battery backup but it runs only for 3-4 hrs max ? why ???",
            "Q:can we use this laptop office uses",
            "Q:can we play watch dogs 2 smoothly with high graphics?",
            "Q:the price is includes GST?",
            "Q:can we insert a cd in it ??",
            "Q:how high can i upgrade the RAM?",
            "Q:can we play gta 5 smoothly at ultra setting?",
            "Q:Why does external HDD slot is not an empty slot? How am I going to upgrade it without replacing the installed HDD?",
            "Q:i7 1050ti 8gbram vs i5 1060 16gb ram, which variant good for not die hard but occasional gamer of gta, witcher,watch dogs, and computer programmer for future also",
            "Q:can i play fallout 4 ,dragon age inquisition in this lap smoothly ?",
            "Q:can somebody help me it's showing nivida 1050ti(inactive) first time buying a gaming laptop",
            "Q:does it have any hanging issues",
            "Q:can we clean it with mirror cleaners. i.e. collin etc.",
            "Q:when will this laptop be available for sale again?",
            "Q:does Microsoft's all windows workshops are pre-installed?",
            "Q:what about cooling ... I watched some reviews .. this laptop is not that good in handling heat.... but all those reviews are with gtx 1060 ... no review available for gtx1050ti...",
            "Q:Why does 16gb/1060 version has the same price as this one. Of course people will go for 16gb version.",
            "Q:sir can we open package before payment to see if product is there in the package or not ?? reply plz ??",
            "Q:does this laptop suitable for programming?",
            "Q:Why is this product not flipkart assured? and since its not flipkart assured does it mean that it is wither second hand or a bad product?",
            "Q:does the current selling predator i5 8th gen laptops comes with upgraded bios for hangup issues ??? or we need to updgrade bios after purchasing the laptop",
            "Q:Bro, please tell me that when will this Beast laptop comes atleast at 70K, If anybody know please answer me bro?",
            "Q:can i connect my headphone in this laptop . it has only one audio jack for headsets with mic.",
            "Q:How many Brightness Levels of Keyboard are there?",
            "Q:Description says it has i5 8th gen processor.is it true or it is having 7th gen i5 processor",
            "Q:In many reviews people are having heating issue while gaming gpu went to 95C and averaged around 88/90C according to Predator sense app. so please help if it is true ??",
            "Q:is their ms office.",
            "Q:Does it include G-Sync display?",
            "Q:Does the laptop come with a backpack?",
            "Q:which one is better acer nitro i7 or acer predator helios 300 i5 for editing photo,video n gaming?",
            "Q:The laptop is good.But if I play any game when it is not charging,then the game lags.If I play the game while charging, then gaming is fine.Why is it so?",
            "Q:it supports external graphics through usb-c port or Not?",
            "Q:Can I temporarily use a hp 65w charger of 19.5v-3.33A ? Plz reply it's very urgent.",
            "Q:where is ssd in my laptop , please anyone answer",
            "Q:how is the display...??",
            "Q:Is this laptop recommend for Autocad, 3Ds Max, Revit? i mean can it run all softwares without any lag? if No, then recommend a better option, Please comment on heating issue as well",
            "Q:When I recieved my order, it had white and yellow patches around the corners and edges( can be seen in dark room while watching dark colours say black). Does any one have the same problem?",
            "Q:Does this model include G-snyc display?",
            "Q:which is the best under price segment of 80000 is this a good choice for 60000.",
            "Q:i am concerned about recieving an empty box or defected product.....wil it happen? also please send me your email address",
            "Q:Is there a optical disk drive?",
            "Q:how much FPS frequency",
            "Q:This is a 1lakh+ lappy but during festival we will get it for 60k. My concern is is this a refurbished laptop or genuine. anyone let me know of the performance is good still after 6month or degrade?",
            "Q:Is this the 2017 or 2018 model and has this one got a brighter display than the 2017 one?",
            "Q:960mx or 1050ti which is best for gaming and i5 or i7 which is best for gaming???????? Plz reply",
            "Q:Can we download Nvida shadow play in this laptop",
            "Q:what's the screen Hertz??",
            "Q:I'm getting frame rate drops while playing CsGo, Dota, Gta V even at low settings. Solution ?",
            "Q:is RAM upgradable to 16 GB or Not???????",
            "Q:please some one answer my question that who are using this Acer predator Helios 300 laptop, That what is the exact (note this) exact battery backup while gaming from 100 to 0 percentage , ans me pleas",
            "Q:is it supported Optane SSD ?",
            "Q:Does it have Windows precession track pad?",
            "Q:what's the refresh rate of display on the Laptop"
        ],
        "answers": [
            "A:1X8 kingston ram",
            "A:it's Acer nitro 5 of US version .named Predator 😂😂",
            "A:I know how impatient u r waiting for the offer to come... look frequently for the offers, in this app. u will get this under 60K.",
            "A:The lagging issue while playing is probably dute to overheating of the cpu and gpu.I am facing the same problem during intense gaming.Though it has 2 fans but heat dissipation while gaming is pathetic",
            "A:wait for the offer and buy. It has the best specifications for a price upto 60k. And also U can be a predator boy...!",
            "A:Yes, empty slots to expand RAM upto 32 GB",
            "A:Claim your warranty",
            "A:The best time to buy a Gaming laptop is on Fridays as Flipkart gives sale on most gaming laptops",
            "A:its nvidia gtx 1050 Ti.It has 4GB ram.Bandwidth is 112 GB/s",
            "A:yes have this item with charger",
            "A:you won't regret of it's thickness....& come on dude....it's a gaming laptop",
            "A:Good, as long as games are not being played. Graphics card switches off itself when not playing games so helps save battery. Games suffer a lot when on battery though. May give you 1 and a half hour.",
            "A:yes, you can add.",
            "A:Turn over your laptop. There will be a small hole with battery indicator on the right side of the laptop. Just insert a pin into that hole and hold it for 5 seconds. Done.",
            "A:I5 is enough It can run any game without any sweating",
            "A:Yes you can but you should install or update the version you are installing to the latest version available or the drivers will not work. The graphics card works for windows version 1709 or above.",
            "A:it gives 60fps when I turn on overcloaking",
            "A:Its not an USA imported product, flipkart officially sells it here in India and you will get Warranty from Acer India itself.",
            "A:yes it is. Yet do a video recording while unboxing the package ;)",
            "A:No",
            "A:I have expanded to CRUCIAL P1 500GB 3D NAND NVMe , its working fine . if I am right you can got till 1TB NVMe",
            "A:High setting are possible for every game with the fans set to max. Ultra is possible for a few games but you will be limited to 30fps or less. Lagging usually occurs due to heat, so give it a rest.",
            "A:no there is no such problem in the laptop it is perfect with everything you can buy it,if it is happening with some laptops then they might try to update windows.",
            "A:yes it is",
            "A:I personally Use Blender with This laptop for Graphics Rendering It Can Handle It Really Nice i5 7300HQis A Capable Processor",
            "A:yes it can",
            "A:1 TB",
            "A:contact service centre",
            "A:good",
            "A:it will be available soon and it's totally awesome...",
            "A:you have to install a new one as there is no extra slot",
            "A:yes",
            "A:yes",
            "A:yes u can run VR but not the same experience as Vr laptops",
            "A:It has i5 8th gen. U can find it on Intel's official site.",
            "A:No, but it goes to sleep after sitting idle for sometime..",
            "A:NVME",
            "A:obviously...just go for it",
            "A:no",
            "A:nope its preinstalled and it doesnt comes with bagpack !",
            "A:At High Settings you get 90-110.",
            "A:Yes",
            "A:approx 80 gb free on ssd, one does feel the need of a 256vgb or even 512 gb ssd if high end engineering or video software is beingvused...",
            "A:NO SUCH ISSUE...I am playing Call Of Duty WWII for 4-5 continuous hours. Set the cool-boost on and enjoy your game.",
            "A:Brushed Metal. Feels really good but is a finger magnet. Still the way it feels and looks trumps it being a finger magnet personally.",
            "A:Intel i7 processors are their most advanced chipsets, and offer greater capability than the i5 CPUs do. With much faster CPU performance, this makes them better suited for multitasking.",
            "A:well the camera is just ok, if you are expecting crystal clear picture quality then you will be disappointed.",
            "A:Acer nitro 5 doesn't have SSD, predator do have 128 GB SSD and even predator have 4 gb 1050 ti,and may be acer nitro 5 do have 2 gb 1050(according to indian version).",
            "A:It does not include any other software apart from a Predator sense software which helps in over locking the GPU and to control the fan speed.",
            "A:No, only the RAM and SSD can be increased.there is an issue with the predator models about frequent shut down if you dont connect with power cable. I am facing it from day 3 and still waiting to fix",
            "A:It has 118 GB Boot drive (75 GB Free space) and 1 TB Hard disk, you can install games in either drive, if you are content with the storage.",
            "A:owning 1060 would be costlier and for indian gamers 1050ti is best",
            "A:I bought it at 49,999/- during BBD. This is an utter waste as frequently getting hang. High graphics mode is only available with certain games or force activation. Better buy MacBook Pro",
            "A:no manual update needed",
            "A:The specifications clearly state 7th gen. DO NOT BUY THIS PRODUCT IF YOU WANT 8TH GEN PROCESSOR. look for another product with 8th gen processor.",
            "A:perfectly..",
            "A:I have all latest games running as of 2019 sep ..all are running fine with a 16 gb ram upgrade from 8gb",
            "A:Yes, It have windows precision Drivers .",
            "A:ramb32 gig, any 2.5\" SSD / HDD and internal nand flash SSD nvme",
            "A:predator is a gaming series and has a better performance and has predator sense to boost the performance. It is much better but has heating issues.",
            "A:7gen",
            "A:First of all why do you need some one else other than an authorised service agency to upgrade the RAM, it can be done by yourselves.OR the ACER Service centre will happily do it for you almost free",
            "A:No",
            "A:it is having quad core processor.",
            "A:Well if you get the acer one for around then blindly go for it.",
            "A:I had the same issue once. When the laptop is turned on after the hangup (battery drained and powered on charger) download and update the Bios from Acer's website. It fixes the hangup issue.",
            "A:Windows yes. But Office no.",
            "A:8th gen",
            "A:this one has i5 8th gen and the other one is 7th gen!",
            "A:nothing much but you get 2 cores more in this gen and clock boost to 4",
            "A:It's i5 8th gen",
            "A:yes",
            "A:Quad core",
            "A:no",
            "A:Nope. Only problem is low battery backup.",
            "A:nope",
            "A:there are many official site for game are available, choose from them",
            "A:No",
            "A:Yes You Can Using HDMI or Screen Cast Method.",
            "A:Both are having same specs, you can go for that which is having lesser price.",
            "A:my max is 5 hours , playing games for sure you need to plug in .Else over clocking will be disabled.",
            "A:no its not normal.. the trackpad works perfectly fine on mine.",
            "A:no",
            "A:yes 2.7kg",
            "A:You can straight away start using it without charging. It is already charged atleast 50%",
            "A:Have been using the laptop for 2 months now....haven't faced backlight bleed",
            "A:4 gb",
            "A:for sure u will have a difference",
            "A:cake walk . i am playing fifa 19",
            "A:no",
            "A:Just wait for the big billion day.",
            "A:Sale every Friday. Check back on Friday",
            "A:5400 Rpm",
            "A:4.5-5 HRS",
            "A:135 watt",
            "A:base clock 2.5 GHz and can be over clocked to 3.5Ghz",
            "A:u could go with 15.6 laptop sized bag itself.. it sufficient.. Now i am using hp laptop 15.6 bagpack..",
            "A:2.5gz",
            "A:How can a debit card have a limit only credit cards have limits You can use credut card of limit 49000 and pay remaining by using debit card",
            "A:no you can't....",
            "A:Yes it is. You will enjoy the design as well.",
            "A:if its While Gaming Then Enable cool boost Technology and Plug in your Charger While Playing",
            "A:You better write to Flipkart Customer Service to know about the problem. Sometimes it might take time for order to get approved, once it took me around 2 days. Be patient for a while.",
            "A:predator",
            "A:to be frank , yes as the cpu and gpu fan are together , you will have a lot of heat at max fan speed ..my max cpu temp was like 92. but this happens only wen u play game",
            "A:Ofcourse yes as the laptop has Bluetooth",
            "A:surely predator",
            "A:only driver update no hardware",
            "A:4 physical cores only",
            "A:it has 4 logical cores",
            "A:IPS with anti-glare",
            "A:It is Intel 7th Gen i5 7300HQ. You do have 7th gen i7 variant also.",
            "A:it is the only slot !!",
            "A:2133 mhz",
            "A:with ease.",
            "A:that's an answer which only Flipkart can give",
            "A:1050 Ti",
            "A:I'm using the i5 one.",
            "A:it comes preinstalled with nvidia 1050 graphics processor",
            "A:No one knows exactly. But sales will be there frequently. Keep checking regulary. On festive season, more chances are there",
            "A:Its processor count is 4.",
            "A:Yes",
            "A:I still have not opened that slot but it comes with an pre installed HDD so you'll have to remove that or you can simply upgrade your SSD.",
            "A:yes, you can run these softwares easily on it.",
            "A:No noise issues. If you are talking about the fan spinning out loud, then this laptop would be perfect for you. This uses acers new metalic fan aeroblade tech which is super quite.",
            "A:sometimes it happens with batteries after some charging cycles problem should go away. if not you can always reach nearest Acer customer care.",
            "A:Plugged in charger while playing games no issues will happen.",
            "A:They mention max possible battery time, and it varys based on what you do with your laptop. I was able to get 7+ hours by putting it in low brightness, power saving mode, browsing in Edge, etc",
            "A:You should not get it for office use. regular office work can be done on lower powered notebooks that will give you better better life.",
            "A:yes",
            "A:Yes",
            "A:you can always buy an external cd drive",
            "A:there are two slots for RAM. each slot can support memory up to 16GB so total will come to 32GB.",
            "A:Yes, you can. I've tried various high performance games at ultra HD (4K) resolution.",
            "A:by default you don't have an option to expand HDD we can only expand SSD and RAM If you want extra storage then you can buy external hard disk",
            "A:You can go for this for all the games which you have mentioned. It handles preety well with no lag in full resolution.",
            "A:yes you need a cooling pad that can ease your gaming performance without using predator sense",
            "A:No one wakes a dragon unless going to fight with it. So be cool",
            "A:I have been using this laptop for 1 month and till now its working good sometime cpu reaches 100% but that will go of once you upgrade the ram.",
            "A:yes",
            "A:During next sale",
            "A:yea u'll get all workshops as u get in any normal pc . But for more u have to buy otherwise all others facility are provided.",
            "A:It is pretty cool most of the time but while heavy gaming it heats up but just turn up the fan speed from the predator sense app and it will work just fine.",
            "A:yes you should go with 16gb laptop. I bought 8gb one during laptop festival and got it for 60k. At that time, there was no offer on 16gb so I didn't buy that.",
            "A:no",
            "A:Yes",
            "A:I bought this becz i trusted flipkart. I believe that flipkart never give ASSURED batch for fake product sellers.I'm using this laptop fr past 150days there is no lag in performance,It's working fine",
            "A:We can download newer versions of bios from the Acer website and upgrade it ourselves. The product ships with earlier version of the bios I suppose.",
            "A:you need to wait for the sale, Dates can not be predicted. Mostly during festive seasons and randomly they go on sale. Keep checking the fk app.",
            "A:yes you can connect your headphones to laptop, it works just fine , I have a gaming headset with mic which is compatible and works without any problem.",
            "A:their no brightness level of keyboard.",
            "A:It has i5 8th gen processor.",
            "A:ya the laptop goes to high temperatures very soon. Change the fan speeds to maximum before u start playing and also turn on coolbost in the predator sense. use an extra pair of keyboard and mouse",
            "A:sadly no",
            "A:no it does have G-Sync display.",
            "A:No",
            "A:if your total purpose is for gaming then Acer nitro i7 best option. and if u want all multi purpose in low budget the predator is good option",
            "A:It happens with most of the laptops.. It is because the laptop's battery is unable to provide enough power whenever you play any high end graphic game.. Reduce the display settings of game.",
            "A:No. It's just normal usb c port. You need thunderbolt 3 usb c port to connect external graphics card.",
            "A:The outputs you specified are less than the half of the power output of original charger. This can permanently damage the battery or worse it can damage the pcb.",
            "A:open the lower she'll as per instructions, the SSD is located at 11 o clock direction to the memory slot. Remember it's a m.2 SSD...",
            "A:the display is a 1080p (Full HD) display with good viewing angles and brightness with good contrast.",
            "A:As the laptop has SSD it can run these softwares well without any lag .On heating part I played high end graphics game heat dissipation was good and even you can increase the fan speed.",
            "A:I'm also purchased same product..but I don't have any issue like u ..u have to contact with Flipkart team.. thanks",
            "A:No , this model doesn't have a G-sync display but it has a very good full HD display",
            "A:if you can get this for 60k it's a good deal. This plays all current games and you also have an option of adding an additional 8 gb memory in the future.",
            "A:In my case it doesn't happened. you can order it happily",
            "A:No",
            "A:depends on the game GTA V will run on 50-60 fps on ultra setting",
            "A:Well, I received a brand new laptop. Regarding the performance, not much of a lag, the power adapter stopped working after 4 months of usage. However, I claimed warranty and got the adapter replaced.",
            "A:2018 model with same brightness",
            "A:1050ti is best i7 and i5 both are great for gaming",
            "A:of course you can",
            "A:60hz",
            "A:Bro u can increase ur ram for gta v & dota for better experience and it helped me a lot im getting better graphics for both bt for csgo i don't know bcz im not facing any problems in it",
            "A:Yes..you can upgrade upto 32 gb..",
            "A:Laptop does have impressive battery.. it my go up to one hour when gaming..In normally it goes 4 hours",
            "A:yes",
            "A:Yes it does",
            "A:60hz"
        ],
        "likes": [
            "1",
            "15",
            "5",
            "0",
            "1",
            "59",
            "9",
            "17",
            "0",
            "15",
            "6",
            "11",
            "5",
            "0",
            "0",
            "2",
            "1",
            "2",
            "2",
            "0",
            "0",
            "0",
            "3",
            "0",
            "3",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "1",
            "1",
            "11",
            "3",
            "6",
            "5",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "217",
            "163",
            "14",
            "2",
            "39",
            "0",
            "36",
            "54",
            "8",
            "2",
            "0",
            "0",
            "39",
            "1",
            "0",
            "5",
            "2",
            "13",
            "1",
            "4",
            "5",
            "0",
            "1",
            "8",
            "0",
            "9",
            "3",
            "5",
            "4",
            "0",
            "8",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "0",
            "0",
            "1",
            "8",
            "4",
            "4",
            "4",
            "2",
            "0",
            "3",
            "0",
            "2",
            "1",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "0",
            "8",
            "1",
            "0",
            "1",
            "24",
            "1",
            "6",
            "1",
            "6",
            "1",
            "4",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "21",
            "3",
            "10",
            "10",
            "2",
            "3",
            "0",
            "0",
            "2",
            "0",
            "6",
            "7",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0",
            "0",
            "30",
            "23",
            "1",
            "24",
            "12",
            "0",
            "17",
            "30",
            "1",
            "3",
            "1",
            "0",
            "30",
            "0",
            "1",
            "1",
            "0",
            "8",
            "0",
            "1",
            "2",
            "0",
            "0",
            "7",
            "0",
            "9",
            "3",
            "5",
            "4",
            "0",
            "13",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "14",
            "5",
            "6",
            "6",
            "2",
            "0",
            "5",
            "0",
            "4",
            "1",
            "2",
            "2",
            "9",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    }
}