{
    "title": "MSI GF63 Thin Core i5 10th Gen - (8 GB/512 GB SSD/Windows 10 Home/4 GB Graphics/NVIDIA GeForce RTX 3050/144 Hz) GF63 Thin 10UC-607IN Gaming Laptop  (15.6 inch, Black, 1.86 kg)",
    "product_specification": {
        "Sales Package": "Laptop, Power Adaptor, User Guide",
        "Model Number": "GF63 Thin 10UC-607IN",
        "Part Number": "9S7-16R512-607",
        "Model Name": "GF63 Thin 10UC-607IN",
        "Series": "GF63 Thin",
        "Color": "Black",
        "Type": "Gaming Laptop",
        "Suitable For": "Gaming, Processing & Multitasking",
        "Power Supply": "120 W AC Adapter",
        "Battery Cell": "3cell",
        "MS Office Provided": "No",
        "Dedicated Graphic Memory Type": "GDDR6",
        "Dedicated Graphic Memory Capacity": "4 GB",
        "Processor Brand": "Intel",
        "Processor Name": "Core i5",
        "Processor Generation": "10th Gen",
        "SSD": "Yes",
        "SSD Capacity": "512 GB",
        "RAM": "8 GB",
        "RAM Type": "DDR4",
        "Processor Variant": "10500H",
        "Clock Speed": "4.5 GHz",
        "Graphic Processor": "NVIDIA GeForce RTX 3050",
        "OS Architecture": "64 bit",
        "Operating System": "Windows 10 Home",
        "USB Port": "1 x Type-C USB 3.2 gen.1, 3 x Type-A USB 3.1 gen.1",
        "HDMI Port": "1 x HDMI",
        "Multi Card Slot": "NA",
        "Touchscreen": "No",
        "Screen Size": "39.62 cm (15.6 inch)",
        "Screen Resolution": "1920 x 1080 Pixel",
        "Screen Type": "Full HD, 144Hz 45%NTSC IPS-Level",
        "Speakers": "Built-in Dual Speakers",
        "Internal Mic": "Built-in microphone",
        "Sound Chip": "NA",
        "Sound Properties": "2x 2W Realtek ALC233",
        "Refresh Rate": "144 Hz",
        "Wireless LAN": "Intel Wi-Fi 6 AX201(2*2 ax)",
        "Bluetooth": "v5.1",
        "Dimensions": "359 x 254 x 21.7mm",
        "Weight": "1.86 kg",
        "Disk Drive": "Not Available",
        "Web Camera": "HD type (30fps@720p)",
        "Read/Write Speed": "NA",
        "Keyboard": "Single backlight KB(Red)",
        "Backlit Keyboard": "Yes",
        "Included Software": "PCI-e SSD (NVMe) ready,Cooler Boost,Matrix Display (Extend),Hi-Res Audio,Nahimic 3,144Hz Panel,Thin Bezel",
        "Additional Features": "3 cell, 51Whr",
        "Warranty Summary": "2 Year Warranty Term",
        "Warranty Service Type": "Carry-In Warranty",
        "Covered in Warranty": "Part Failure",
        "Not Covered in Warranty": "Physical Damage, Burn, Liquid Spill"
    },
    "product_description": {
        "144 Hz IPS-level, Thin-bezel Display": "The high-speed display of this laptop offers vibrant visuals and is ideal for intense gaming.",
        "High-fidelity Audio": "The sound system of this laptop offers an immersive experience. Also, the hi-res audio is ideal for your pro headset.",
        "Silver Lining Print": "The SteelSeries silver-lining printing keyboard of this laptop features an intense red shade to visually make your gaming experience intense and engaging.",
        "MSI App Player": "This laptop has MSI’s exclusive Dragon Center software to let you control and customise this laptop as per your convenience. Using the one unified system, you can also monitor, adjust, and optimise this device. This software is developed in partnership with BlueStacks, and it allows a seamless gaming experience between the PC and mobile. You can also use the various customisable features, such as graphics, RGB keyboard lighting, and multitasking."
    },
    "reviews": {
        "ratings": [
            "5",
            "3",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "1",
            "4",
            "5",
            "5",
            "4",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "3",
            "4",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "3",
            "1",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5"
        ],
        "review": [
            "From past 10 months I'm searching for a best Gaming Laptop. Today I found it and I can say my choice is perfect. Mind-blowing Gaming Laptop at a reasonable price. Very fast booting(with in a blink of eye). Many people have a dream to become a gamer.. but due to high price everyone cannot afford a gaming laptop. But MSI made it possible with this low price and high specifications. Without any second thought we can buy it. I had a few doubts about the laptop and msi customer service cleared all my doubts without any hesitation in a easy manner. 5 ⭐ for MSI Customer service. RTX 3050 and 144hz display grabbed my attention towards this laptop. So far the performance I got with this laptop Is beast. I also upgrade to windows 11 with no cost (Free). I'm very happy that MSI provided free Windows 11 upgrade. I'm happy to be a member of MSI. Thank you MSI ❤️. MSI (TRUE GAMING).",
            "First thing first laptop is having awesome performance there is no doubt on that . Reviewing after 15 days with 15 pros\n1.RTX 3050 DDR6\n2.SSD P.S-512GB\n3.2933 Mhz DDR4 RAM\n4.i5 10th Hexa Core processor\n5.51Whr 3 cell\n6.WiFi 6 bt 5.1\n7.8 gb of ram and guess what upgradable upto 64 gb.\n8.144hz display optional obviously\n9.Dragon Center and Msi App Player\n10.120w charger in the box\n11.GF-63 Thin so you literally gonna love its weight its far light weight.\n12.Around 5 hour of battery life with moderate use.\n13.4.5 Ghz clock speed kidding me.\n14.Really Cooler and having all port you need.\n15.Most important only on 58,740 all thanks to BBD\n\nI am not writting essay here but still it has some cons .\n1.Red backlight may some need saridon.\n2.512 gb ssd isn't pretty enough storage but for this price range considerable.\n3.Battery backup while gaming, poor actually.\nOrher than this in this price range what else you need rashmika :) no offense..",
            "Received this just a few hours back. The things I noticed after some light usage like browsing and installing applications are-\nPros:\n1. SSD is fast. I've used only HDD before so this was the first thing I noticed.\n2. Temperatures are usually <60C for both GPU and CPU for light use. Note that this has only one fan but it is unbelievable how cool this system stays even in no air conditioning rooms.\n3. Pretty lightweight. Just marvel at how much this is packing but in so little space.\n\nCons:\n1. The material is so bad. Like the build quality is ok but it is a fingerprint magnet. Collects so many fingerprints that it can be used for official work.\n2. The keyboard doesn't have numeric pad. It is clearly mentioned in the description and the pictures so no complaints from msi side but still I miss it. It needs some getting used to but typing experience is decent-ish.\n3.The backlit keyboard light is hard on eye. But it can be disabled.\n\nI will update this review once I put it under some heavy load tomorrow.",
            "After testing 3 days\n\nMy points of views\n\nPros\n1. Gamings performance is so good considering price, you will not find the same performance laptop in this range. 👌\n2. Crispy display.\n3. Advanced BIOS by MSI for overclock , on software side its really good. You will get the other preloaded msi apps which i find useful for day to day task.\n4. Chasis is good. Thin and elegant.\n\nCons\n1. Power cord port should be in back, it is in left side of laptop.\n2. Single fan but thermal is good.\n\nConsidering the price i find it really good, it performing up to my expectations 🤍",
            "The machine is quite powerful and runs AAA titles upto 2018 effortlessly for normal usage. I don't stream or have massive external monitors, so can't say much about those scenarios... But if you're looking for a machine that does what it says by its own hardware, this is a simply a great investment. Also runs CAD/CNC software no problem.\n\nOne heads up: do NOT install the latest nvidia drivers from the Nvidia website.\nOnly download (if needed) the recommended Nvidia drivers from the MSI website.\n\nFor more info, the MSI website has a good FAQ for most of your questions so do check that out once.\n\nAnd yes, you CAN upgrade the RAM and Hard drive/SSD WITHOUT voiding the warranty. The factory seal sticker on the bottom lid is only to tell you that it hasn't been opened before you got it.\nThis upgrade/warranty info is from MSI's website (Q.18 in their FAQ), and it still states that if you screw ANYTHING up while doing the upgrade (yourself), that damage will be on you and obviously NOT be covered under warranty. This is a no-brainer so don't go yelling to MSI about it, in case you botch the upgrade.",
            "Cons :-\n1st - Doesn't support HDMI output through NVidia GPU but only through Intel GPU, so can't play games on bigger screen\n2nd - Thermals are pretty average, since MSI decided to show 2 fans in pic but in reality it only has 1 fan, Shame on you MSI for falls advertisement.\n3rd - GPU is severely underperforming even for a 3050 thanks to it being limited to 40 Watt TDP, 3050 can have max TDP of 80 Watt and achieve much higher clock speed, 60-65 Watt power should have been fine with 2 fans and an AC-Adapter of 135/150 Watt instead of 120 Watt.\n4th - 120 Watt AC adapter just isn’t enough, while gaming your battery will slowly drain cause AC-Adapter alone isn’t able to keep up with the power-draw.\n5th - You can feel a soft ting of static-electricity while hard pressing a key on side, if your skin comes in contact with internal part of chassis while typing with AC-Adapter on, I would say anti-static paint job wasn't done well in key-holes on chassis.\n6th - Don’t have access to HDD/RAM port without opening the whole case and voiding the warranty, if you want upgradability in future then only buy it you have an MSI certified service center nearby, but MSI have pretty bad coverage compared to other brands, they only good service for Delhi/Mumbai/Bengaluru etc.\n\nPros -\n1st - 10500H is beast of a processor with 6 Cores/12 threads, performance is easily comparable to an i7, also don’t go for MSI GF63 Thin with i7-10750H/RTX 3050 cause that CPU is even more power hungry and would leave even less wattage for RTX 3050, thanks to MSI giving same 120 Watt AC adapter with that one as well, again shame on you MSI.",
            "Great product by MSI at a steal price will run most of current AAA titles at high or mid settings.\nPros :-\n- Best deal for its price.\n-RTX 3050\n-Hexa core i5 10500H\n-2 year warranty\n-Great optimization by MSI\n-Light weight is a add on advantage for students\n-All of that for 58k is rare to find.\nCons :-\nCan't ask more for the price but battery life improvement and a rgb backlit would be appreciated.\n\nOverall happy with the purchase.",
            "Best in this price range",
            "Who ? And Why ?\n- If your Budget around 65k\n- You need laptop for daily work / studies and occasional gaming (720p / 1080p)\n- enough power for multitasking (6 cores / 12 threads)\n- good looks\n- medium work load (can run VMs, docker, integration servers etc - I am not talking full prod environment but you can present POCs)\n- video editing is possible 1080p - v easily can do almost anything. 4k - u can do basic if you add multiple layers then timeline will lag\n- games tested\nSkyrim special edition\nGTA - on high settings\n- 144hz screen\n- loud speakers\n- SSD storage\n\nso...so-\n- battery is ok - u can adjust performance in dragon center and calibrate battery\n- thermals are ok\n- Ram 8 GB\n\nLookout for -\n- color reproduction is not accurate\n- cooler booster 3 system is single exhaust meaning there is shared heat pipe between cpu and gpu\n- comes with windows 10 Home edition key installed on board. Windows 10 home is pathetic first thing\nYou need to do is install 10 pro. and reinstall drivers and softwares from msi, nvidea website - so u need some basic skills to use this machine to the fullest",
            "I needed the best performance and a good display at budget and I guess I have made a very nice decision 🔥❤️💯, This thing is a beast !!! Gaming and 1080p video editing is such a delight in this machine. WELL DONE MSI !!!",
            "I literally loved the product at the price point I have bought it during BBD. I just found one issue with my charger, It produces little bit earthing an as laptop is also made up of metal, it feels little earthing like touch all over. May be I can live with it.",
            "One of the best laptops, got it on sale and couldn't hope for anything better. The battery is a little bit on the lower side, but the display, performance, sound and the freedom to tweak the settings as per consumer's requirement is just amazing. The build quality is fantastic though there can be smudges. I was quite skeptical about the fan sound but it isn't too much as several other reviews have said, also on using headphones you won't hear any disturbance from that. Gaming and productivity wise it is absolutely amazing as long as you are not a competitive gamer.",
            "Works effortlessly in most of the aaa titles.\nPlayed rdr2, Ac valhalla and it gave stable 40-50 fps on med-high settings. Battery backup and thermals could have been better. Otherwise, a great deal at under 60k.",
            "First of all thanks to Flipkart and MSI for providing such a machine at 59K during sale period.\nDisclaimer:\nI'm a professional editor and my review will based on productivity usage and not gaming.\n\nIve been using this laptop for about a month now, and during the period I've used it in many scenarios such as on location during shoot for basic data transferring and proxy creation to editing rough cuts while travelling in a train. And overall I love this laptop. For the price I bought it, I can't think of any other better option as of now.\nNow let's get objective and present pros and cons of this machine:\n1. It is light weight and thin for a gaming laptop. My 4 year Asus ROG weighed 2.8kgs and carrying that around was pain in the back. But this thin laptop at 1.8kgs feels like nothing.\n2. The Hexa core I5 along with RTX 3050 give beautiful performance, frankly while editing 6k footage from Blackmagic cinema camera I didn't miss my main workstation. Davinci Resolve loves this laptop.\n3. This laptop allows you to upgrade the RAM to 64gb, by next year I'll probably utilise it.\n4. 144hz screen makes the day today task feel really smooth, I know it means alot for gaming but for me the smooth scrolling and dragging is just buttery.\n5. Speakers are decently loud and clear, exceeded my expectation.\n6. I love the fact that MSI didn't waste any ports on USB 2.0, all the USB ports support 5gbps.\n7. Webcam quality is pretty good. In normal room light the footage is clean and microphone along with Nvidia broadcast app is simply excellent with AI based noise cancellation.\n8. In Delhi, Service centre guys are super cooperative, I visited one near my house to get RAM and HDD upgraded, they did it smilingly. Try to visit HP or Lenovo for the same job, they'll give you thousands of excuses.\n9. 2 years warranty makes the whole deal sweeter.\n\nNow some cons:\n1. While doing heavy duty tasks the keyboard area warms up alot. My old laptop didn't have this issue, physically it was pretty thick and allowed better cooling option. Maybe the thin form factor limits the heat dispersion via fans, MSI could improve it in the next iteration. Please Note that there's no dangerous overheating.\n2. No 10 gbps usb port. It was very strange that MSI didn't include 10gbps port, it's 2021 and almost every gaming laptop above 50k has atleast one 10gbps port.\n3. MSI should offer better display option as this screen is colour inaccurate. An option for 100%srgb or 90% DCI p3 would have made this laptop perfect for creators. I mean I'm still ready to pay an extra 5-6k for upgrading to a better display.\n4. Laptop drivers are a bit unstable, there were times when I was just using Word and excel but for no reason discrete GPU ran in the background and battery went from 100 to 20 in 1.5hrs. On some good days I managed to watch Prime video for 5 straight hours on battery because internal gpu was active. MSI needs to fix this.\n\nIn all its a great machine for the price. Would recommend it even at 65k as it's powerful and light. Great job MSI.",
            "This is a great gaming laptop. I’m not a hardcore gamer but it suits my needs. If you’re looking for a casual gaming laptop that preforms as well as the more expensive brands this is a great pick. The graphics are crisp, sound quality is better than I expected and it connects easily with headphones and wireless mouse. I would recommend a full size keyboard for the laptop.",
            "I'm not gamer, I purchased this lappy for my editing purpose. Till now it's quit fair at this price. Value for money. Getting heat little bit during premier but that's fine.\nPerformance is quit good with this specification and the best part is it comes with 2yr warranty as MSI known for.\nI'm using from last one week and happy with that.",
            "Premium for sure.\nIn reality it's looks way more cooler than in image.\nValue for money product.\nMSI has done great job at optimization.\nDisplay amazing.\nSpeaker are clear and louder than most other laptop.\nWell I loved it 😘😘😘.\nPerformance is like a beast.\nBuild quality top notch.\nThat's it for now.\nI got this laptop today.",
            "144hz screen with a super fast ssd and a backlit keyboard along with a rtx 3050 is satisfying enough already but the thermals were a huge surprise.\nI played some demanding games and that too at ultra settings for checking gpu throttling but the temps remained as if i was playing valorant, under 80 degrees at all times. The idle temp was also super chill at around 50 degrees.\nThe games i tested were Gta 5, Control & Plague Tale innocence all at ultra. Although for the best frame rates notch it bit down to high settings or medium for AAA titles.\nI personally think, in this price range and with the brand name of MSI, this laptop is worth the buy.\nI got it for 59k @ big billion days sale.",
            "Though this machine is good but have a drawback, it has only dedicated graphics card output. If something went wrong with graphics card. Then display will not work on iGPU. In today's era, most of the laptops have graphics switchable from iGPU to dedicated and vica versa. It help in long battery backup and laptop usability in case of dedicated graphics Card fails.",
            "Very much value for the bucks product. It's super fast and except the fact that gpu is only 40w, I haven't found much of a con with this product. Suggesting you all to upgrade the ram to 16 gb and same with ssd also. It comes with a 512 nvme, you can purchase a 2.5inch ssd.",
            "One of the best laptops in this price segment.\ngot it @62k during big billion day\n\nPros:\n1) RTX 3050 with DLSS can get you atleast 60 fps in almost any game at med-high settings\n2) LightWeight\n3) MSI softwares are really good for monitoring perfomance and applying updates\n4) 144Hz panel , everything feels buttery smooth\n5) Decent webcam compared to other gaming laptops in this price segment\n6) Strangely laptop runs cool even after having a single fan\n\nCons:\n1) Touchpad is small and rough\n2) Inbuilt microphone wont catch your voice even if you are 100cms away\n3) Keyboard does not have numpad and also the red backlight makes you feel dizzy when you use them in the night\n4) Have to open the laptop if you want to add storage or RAM which voids warranty",
            "Best and perfect, since this is a gaming laptop use it while using an external laptop cooling pad which is available online, design is very cool and classy more than images and performance is best. I totally recommend it.",
            "Super Fast and Looks Classy Performance Oriented Machine Loved it ❤️",
            "The laptop is great and can provide a maximum of 144 fps even with a 3050 rtx because of other limitations. The web cam is not that good but so if you need to attend calls with this then probably not the best choice. For gaming purposes although it's good but it often heats upto 55-70° during gaming.",
            "This is awesome..this is my first laptop...and i choose msi because my friends suggested me and it is also most trusted brand..and i5 6core + rtx 3050 gpu is a beast in this price range and is a very affordable laptop..no other laptop will come closer to this in this price range...gaming performance is also totally satisfied..i recommend this laptop to all types of work...🔥good work msi❤️",
            "This is a good laptop 512ssd\n8gb ram\n4gb rtx graphics\nAre the best in the sell price\nGo for it\nBut the only problem is with fun and heating issue\nIf you can manage it, it is the best offer at 63k",
            "One of the best machines of MSI.\nI use this laptop for my data science projects and all the developer apps work flawlessly.\nIt is highly recommended.\n\nPros:\na) It weighs under 2KG.\nb) Hexacore Processor. (6C, 12T)\nc) RAM upgrade options available to up to 64GB.\nd) 144 HZ refresh rate screen and IPS level display.\ne) Dedicated shortcut key for the camera where one can disable/enable(secured) the camera in no time.\nf) Temperatures are well maintained.\n\nCons:\na) Only red-colored keyboard, no RGB.\nb) No full-size keyboard.\nc) Decent battery life.",
            "Let me start by saying this is not my first gaming laptop, this is the 3rd gaming laptop in my family, and the second MSI laptop in my family, have a Asus ROG G551jk which was My 1st gaming laptop , then a MSI GP75 Leopard 9SE-485IN which was bought in dec 2019, because of which I decided to go for another MSI Laptop which is this laptop \"MSI GF63 Thin i5 with Rtx,\n\nPros\n1).this laptop is a beast. I am able to run all the latest games without any problems, the performance of the laptop is awesome, not able to find difference in performance when put side by side with the \"MSI GP75 Leopard 9SE-485IN\"\n\n2).screen is bright and vibrant colors, 144 hz screen is just what you need for gaming, just awesome.\n\n3).the ram is upgradable upto 64gb ddr4 which is good.\n\n4).heat management is good on this laptop\n\n5).already windows updated to windows 11\n\n6). rendering works superbly as I use this for work \"sketchup v-ray\"\n\n7). sound is good and inbuilt mic is also good, people noticed the difference when I spoke ingame and also on discord, they were like you sound clear and asked if i changed my headset.\n\ncons\n1). considering this is not my 1st gaming laptop and unboxing experience, and also not my 1st MSI Laptop, my unboxing expectations was very high, so I received the laptop and to my surprise it was just the laptop and the charger in the box nothing else, with made me very disappointed, other laptops which I got previously the asus rog, the MSI GP75 Leopard 9SE-485IN had goodies like, gaming mouse, gaming headset, and a proper carry bag, now I carry this MSI Laptop in my Asus laptop bag to work -_-,\n2). no RGB keyboard only red backlight keyboard\n3). the logo on the lid does not illuminate\n\nSummary\nif all you are looking for is a capable laptop all rounder for gaming, work etc in 2021, then look no further, performance 5 Star, looks 4.5 Stars\n\nI would recommend this laptop",
            "Great laptop. Bought it for 63k on sale. Cpu's great. Gpu could have been better if it used more than 40 watt. Battery not great. 3 hour backup on all battery saving options on. It's using hynix 8gB 3200mhz ram which is sadly clocked at 2933mhz. Bought another 3200mhz 8gB ram for it. It has kingston nvme m.2 ssd. Don't know why fps is low on valorant. Avg -140 fps. Intel has done a good job on this 10500h cpu. It took me 2 hours and 6 minutes to install Red dead redemption 2 (DODI repack). Overall good laptop must go for it under 65k.",
            "Gifted this to my brother and touchwood its going fine till now. Hopefully everything is well as of now, was really sceptic as i have never placed anything online that too an expensive thing. Well done flipcart",
            "First off all the delivery was fast and perfect.\nDid all performance and basic tests, everything came out just good.\ni5 10th gen especially 10500h is great with the best single core score compared to other competitors at the same price range and may be above.\nRTX at this price even though it's 40w it outranks other gtx variant at this price range with ray tracing and dlss option.\n\nThe only thing I was concerned about is the thermal but with the cooler boost 3 on it gives me steady clock speed above 4100 mhz and a safe temperature below 75 celcius (sometimes it dropped below 40 celcius), Though the fan sound is a thing.\n\nOverall I'm happy",
            "Have you ever watched the movie 'Beauty and the beast'? Well this laptop by MSI is a beauty as well as a beast.\ni5-10500H along with the rtx 3050 4gb graphics works as smooth as butter. (As the i5-1500H has 6cores and 12 threads there won't be any bottleneck issues). We get a 144hz refresh rate screen, that too with an anti-glare display with 45% NTSC color gamut. At this price it's more than enough. The webcam could have been improved a bit, but well a lot of gaming laptops are doing away with the webcam.\nComing to the battery backup, it gives you 5 modes through the dragon centre (gaming mode 2.0) and you can also customise it to your needs. The maximum single charge return that I got was 8 hours (super battery + battery saving mode), and it's fine with me, considering that this is a gaming laptop.\nThe dual speaker is decent and gives a good sound experience. You can again customize it according to your needs through the Nahimic software.\nThe built of the laptop is good, and the top lid as well as the keyboard (Steelseries keyboard) doesnt have a lot of flex issues. In fact its the bare minimum.\nWith this laptop one will get the latest Wi-Fi 6 and Bluetooth 5.1 l, so you will be sorted regarding the connectivity. Also remember, along with this laptop you will be getting a free Windows 11 update.\nOne will get a 1x Type-C USB3.2 Gen1 and 3x Type-A USB3.1 Gen1 ports, 1 RJ45 port as well as a HDMI port.\nAlso I got a 2 years warranty with this laptop so it's a Win-win. The ram can be expanded till 64 gb and we also get extra slot for a hdd.\nSo considering all this, the laptop is quite good at the price range and is suitable for gaming as well as productivity.",
            "Best laptop in both price and perfermance. In 63k it was really a very good opportunity to buy this during big billion days. Really RTX 3050 gives a beast power to this. Finally happy to buy this.",
            "The laptop is good in this price point of 62k. The performance is really good....everything is good except the battery. At battery saver mode also it cannot work for more than 2 hours.....so always have to hook with the power plug.",
            "One of the best laptop at this price range.\n144hz will nail it. Battery backup is normal. Can't expect more on gaming laptop with these awesome features. Cooling is awesome in this. Once it gets heat it will get cool soo quick. Graphics are ultimate in this. Weight is good. Performance is overall awesome 🔥",
            "One of the best out there in this price point.Make sure to add an extra SSD or else you will run into storage issue..I would also recommend for 16gig ram.The performance is butter smooth. So far i have tried Valorant , warzone, Ark , read dead redemption and fifa 19. You can play with out any lags or glitches and the thermals are pretty good considering the price point. I will recommend it for sure ( it's a deal breaker at 56k) . Use credit card for extra 3000 off..",
            "Amazing laptop at a good budget price point\nPros\n1. Great display, 144hz really brings out the crispness in image quality\n2. Rtx 3050, this is a powerful GPU that was able to run cyberpunk 2077 at high settings\n3. i5 10500H is powerful processors and can handle all games easily\n\nCons\nRam is only 8 gb, at 65k they could have given us 16 or 12 gb ram\nProcessors heat up to 85 and sometime 89 celsius",
            "the performance is smooth and the compact form factor is awesome,easy poratability.\nvery good for playing csgo,valorant and dota 2\nu could add extra ssd and ram from msi service centre only,orelse the warranty will be voided\nregister the product at msi website as soon as u get the hands on it\nscreen is awesome,sound is good\nheat dissipation is decent\n40 watt tgpu rtx 3050....performs more than expected\nsimply go for it and save some extra bucks",
            "Been using for almost 10 hours right now. Satisfied with the performance but the fans are noisy when you're using GPU too much, like I was testing the raytracing with Minecraft\nfor raytracing and the fan sound went very high, Otherwise it's a great purchase.",
            "Metal body\n6 core and 12 threads processor\nRtx 3050 (even 40w gaving awesome results)\nGrest support by MSI Softwares\n2 year warranty\n144Hz refresh rate\nPerformance surely a powerhouse.Gaving 130-40 fps on maxed out CS-GO.It is running games released recently like mafia definitive edition and Marvel's avengers on high setting gaving around 30 fps I mean that what's ps5 did with raytracing and Display better than I presume very beautiful display even with gaming laptop\nBattey is not that terrible on battery saver mode while watching movie it runs whole 1 hour episode from 23 to 10 %. and don't dare to say it not gave batter performance on gaming, never do gaming without charging,it will degrade your battery life and nothing more. AND NOW IF I REALY WANT TO WRITE SOME CONS I WOULD SAY Trackpad is small and make sounds if you tap on it and my friend just bought realme book ,that one's trackpad is great but I would say go don't go for that one as compared to this,surely others things will kill that macbook lite 😂 and I can't figure out other cons everything seems to be great so far.",
            "All i see is a grt machine, light weighted, super fast hexa core i must say, surely need a little Hdd or ssd update because space kinda runs low after some time, and it does need a power connection soon as you start playing game, battery lasts good while doing normal usage , but is gone super fast as soon as u start playing game , and the only thing I hated is that the system starts using integrated graphics when the battery runs under 30% and turns off the RTX. Otherwise the machine doesn't have any cons at all ! Happy Gaming !",
            "No need to worry about to buy this laptop 😉",
            "One of the best gaming laptops out there in this price range. And no, you need not be a gamer for this laptop to suit your needs. Its heavy duty processor and graphics ensure that it can handle your daily multitasking, gaming and core intensive softwares with ease. Go with it if better display and performance are your topmost requirements, and all this without not burning a hole in your wallet.",
            "Perfect beast🔥🔥🔥🔥🔥🔥🔥",
            "Best laptop for the price. Very good performance and thermal management.\nThe cinebench score is very good.\nGeekbench score is also good\nSsd speed is very fast\nGames run very smooth, thanks to the RTX 3050\n\nOverall, this is unbelievable at its price range\nI will give a 5/5 in every way.\nThis is a \"PORTABLE-POWERHOUSE-PERFORMER\"",
            "Light weight + rtx 3050 best in its range",
            "There is no doubt about the laptop but in some games iam getting lower fps then GTX 1650 main valorant other than that laptop is awesome",
            "I loved this laptop the performance is really amazing with so low price. I am using this laptop for almost 3 weeks now and till now i haven't encounter any problem the rtx 3050 even though 40w performs really well",
            "I bought this at 58K during BBD sale, and it justified the price.\nIn the said price range, it is very competetive and affordable machine. I'll list the areas which I feel could be improved later in the review.\n\n1. 144HZ monitor - Awesome\n2. It is very light\n3. Build Quality is OK, does not feel cheap.\n4. Thermals - As soon as CPU Temp reaches 80, it comes down automatically. Same is for gpu too, but the temperature threshold for GPU is above 80 degree Celsius. Heat will not be noticed while playing.\n4. 3050 - despite being 40W, 4GB I played Hunt Showdown and Deadside both on highest setting and managed to get more than 60fps with refresh rate of monitor 144HZ. Everything is so smooth.\n\nNow things that can be improved:\n1. Brightness is less as compared to other laptops\n2. GPU sometimes suffer when the CPU temperature reaches 80°. You may feel kind of lag for few milliseconds when the hardware brings down the temp of CPU, but this can be ignored\n3. Trackpad tap is kind of ugly and clutter, use usb or wireless mouse\n4. We have to visit service center in case anything goes wrong or if we wish to upgrade RAM/ SSD/HDD\n\nOverall, for 58K this is the best bang for buck. Also, I missed to mention that both of the above games recorded on highest settings using OBS at 144HZ refresh rate at 60FPS if you are into game recording. I haven't yet checked the streaming but I think it will be smooth. I was tired of waiting for the GPU price to come down and it seems till 2023 there is no hope sadly, hence I bought this one and this really works for me (playing games, recording)",
            "Worth it",
            "Looking nice",
            "Awesome laptop but battery backup could be better",
            "In under a month the fan started making noise, sounds like it has been losen, and vibrating",
            "Great Laptop at this price range, only problem is that the battery is not good, even for simple usage. Could have given 1 TB of storage instead of 500GB( 500GB is what you get for a low price/spec laptop). But performance wise love it.",
            "Awesome laptop this price range ❤",
            "Purchased this for 58.5k, I couldn't have made a better choice. Although battery discharges first but that's common with every gaming laptop. Moreover, not doing heavy tasks and using it on low settings can give a battery life of 6-7 hours.",
            "Great performance and a real value for money pproduct if you want a gaming beast under 60k then you should consider this i am satisfied with this purchase but just want to know about its services because i heard msi have bad service quality after purchase just one sugesstion dont use google chrome because it will impact your gaming experience i know you all will think what am saying but in my case suddenly chrome started using high cpu and using cpu full potentiol and then games start lagging and then i searched and found that chrome is using 100 percent of cpu even if its closed and you restarted your pc so i switched to microsoft edge and best lapy must buy",
            "Good for 1080p gaming. Battery backup decreased after performing msi battery calibration. Also the laptop freezes randomly everyday during normal surfing load and i have to restart it",
            "Super laptop",
            "Looks fantastic... Lightweight nd very user friendly.",
            "What to say I'm totally satisfied with price and performance.\nWas waiting to buy an msi.\nNo comments",
            "Sooooo Good",
            "The best budget gaming laptop\nRTX 3050\ni5 10500H\n8GB Ram\n512GB SSD\n144 Hz screen refreshed\n\nthis is budget gaming laptop all over\n\nThank you Flipkart and MSI",
            "It's price worthy\nEverything is good at this price range its a beast ⚡⚡",
            "Fantabulous🔥RTX on 🔥",
            "Fabulous 🤩🤩",
            "Laptop is average if you hav a low budget you can go with it but if you have good budget please don not buy this.\n\nBattery Life is less than 1 hour while Internet Browsing and Services is not avilable. When you ask for service they even do not take your call.\n\nOverall Do not buy MSI Product.",
            "The performance was good no complaints about it. The only con is the poor battery life.. The laptop barely sustained for 3hrs with normal usage from being 100% charge.. I Hope these issue might gets fixed in the future.",
            "Such an excellent piece of machinery, I will definitely say that this is just best in this price range, it does all the normal day to day tasks easily and when it comes to gaming. . . It's damn good and with the help of msi dragon center software you could tweak the performance and cooling accordingly which brings out the beast out of the i5 6 core processor & the gpu",
            "This is one of the best designs when it comes to upgradability. It supports double sided NVMe drives so you can easily upgrade it to 2TB Gen 4 drives or beyond. Also it will clock down to 2933MHz if you place a 3200MHz RAM (tested it with 2x 32GB 3200MHz micron RAM)",
            "No cons\nThis is beast in price segment\nSomeone think about tgp of rtx 3050 is low but guys i tell that it perform even well that 75 watt tgp Nitro",
            "It has been a month and its working smoothly",
            "Best in this price range.best thing is the weight of it. Excellent sound quality.16gb ram would better for this system",
            "A \"Go Grab It' product 😎🤘",
            "Using since past 3 months mainly for gaming.\nPros: Smooth gaming performance even though it's GPU is 40w and less heat even under load\nLight weight and worth the price. Got it for 61k",
            "Gaming performance is really good but if you are looking for a battery backup get yourself something else. Its functions and built is really good.",
            "Avg",
            "Guys this laptop is good but only recommendation from me is that please dont upgrade to windows 11 mine laptop started freezing while running then i have to reset all the computer to get back to windows 10",
            "Good",
            "Awesome product. Value for money. Performance is as expected from i5 10500H with 6cores 12threads is the thing everyone will be looking for. Even though with 40w NVIDIA RTX 3050 gaming performance is quit smooth, which is unbelievable.",
            "I am using this laptop for last one month.\nPros:\n1) performance is awesome ,\n2) with 3050 rtx graphics for most games is better\n3) and everything is existed as good laptop\n\nCons:\n1) heating issue easily the gpu temperature reaches 81 degrees\n2) for simple games also there there is lot of change in change in temperature\n3) battery can't provide the supply for most games , we can feel high lags in games\n4) for most needed the ac power supply is mandatory .",
            "This is best value for money but it does not have PD type c charging",
            "Value for money,i like the design well",
            "Laptop is very nice only problem is battery but we cant expect it from gamming laptop",
            "Powerfull performance value for money",
            "Very much good,Handles everything properly,And Gaming performance is also good.....\nI had run FARCRY 4 AND NFS MW 2012 In high settings and it was no lag and 60 to 70 fps performance",
            "Awesome ❣️",
            "Value for money",
            "Best Lappy under 63k no doubt about performance absolutely perfect with display and CPU,GPU with good storage. Future upgradations will blow your mind .\nGo for it totally value for money product !❤️❤️",
            "First off all ,the important part the performance of this is awesome\nSecond genuinely saying ,the fan sounds is quite disturbing and it fell that there is a fan lubricating has not properly maintained in my case\nThird if uu see uu will get some lighf frinkling in the left sid of the laptop display..when ur laptop start\nIn my case..the problem I am facing\n\nSo msi must see that ....",
            "More than expected experience, high graphics gaming only at 75 degree celcius",
            "Good performance",
            "Amazing product",
            "Great performance from this beast. Don't expect high battery backup as it is designed for performance. Design is nice. Top part is steel and the keyboard area is hard plastic with metal finish. High quality speakers. 144Hz display is a delight.",
            "At this price range it is good product... You can go for it without any hassle.",
            "Received the product a week ago. A steal at the price in all ways. The laptop is a power house but lacks battery backup. And the single fan makes some noises often. Detailed review once I push it to the maximum.\n\nUpdate after a month:\nThe battery back up is pathetic. It's really worrying often times. If I run Fifa with the best settings, the battery hardly lasts an hour. Otherwise it's a steal. Really need to figure out something for it. Appreciate any tips if you have.",
            "The product is a beast at this price.No one can come even close.\nPerformance and display are too good.\nGreat work MSI💥💥",
            "Got one for my nephew who aspires to be an editor, video maker. Have not tested the laptop yet, but by the look of it, I can say the Laptop looks premium.",
            "Satisfied Completely 😎 Worth For Gamers & Video Editors 💯🔥 Loving This Brand MSI ❤️",
            "finally i found real budget rtx laptop",
            "1) This laptop have 40 watt gpu but still give performance similar to 60 watt of same varient.\n\n2) Battery backup is somewhat around 4 hrs. ( depend upon work)\n\n3) Heat, yes it heat while playing heavy game but manageable . I feel heat on keyboard but bearable. But i recommend cooling pad.",
            "Value for money champ",
            "Excellent laptop",
            "Delivered without defect and arrived on time..Best value for money",
            "Very bad battery backup only 2hrs\nScreen goes black\nDon't waste your money",
            "It is an amazing gaming laptops, no lags at all⚡",
            "Super as expected, finger print problem is true is sure does collect a lot of them",
            "Best laptop in best price but battery backup is lower. expect battery backup everything is Superb under this price range.",
            "Battery backup is very very very less",
            "excellent budget gaming laptop",
            "It's a wow material",
            "Good as expected",
            "fantastic go for it",
            "Powerful but battery backup is not up to the mark. Can handle most of the games at high setting though upgrading the ram would be a good idea. Overall, I am very satisfied with the performance and display, only two things that are stopping me from giving it 5 stars are battery backup and body of the laptop which easily gathers finger prints",
            "Best in this price",
            "The laptop is surprisingly capable for the intended tasks of gaming mid and high end games even though it has a lower watt Rtx 3050 GPU. Though it has only one fan, it makes up by providing options of cooler booster which does its job very well. It is well priced and good looking. It is a bit of a finger print magnet but that is not a major issue.",
            "Worth the 💰.",
            "Good",
            "Awesome product from msi",
            "Love it 🤗",
            "Great laptop, bought it on sale. But heating is an issue while playing heavy games",
            "Best laptop under budget",
            "Good product overall",
            "Performance i good.\nBut Battery backup is not good.",
            "After acer predator the laptop I like the most is MSI GF 63. Because it delivers such a great performance at this price level with RTX graphic card. Awesome deal",
            "Nice product",
            "Good product everything is at its level apart the battery but it's value for money and it's worth it",
            "The best laptop in the budget. Everything is the best but battery is just good.",
            "Good product in cheaper price.",
            "Good",
            "Well I did purchased this Laptop under 60k which is a good thing.. But after using it for my online study purposes (which is through Chrome) as I opened a video on particular site (the site where i had purchased the course), it gets stuck and Nothing happens, the whole system froze and I need to hard restart by pressing the power button(it happened with me 4-5 times Continuously)..\nLastly I got fed up by doing this Again and again, and just had to download Opera for the online videos streaming purposes..\nNow talking about gaming this thing sure Is Beast..\nBut as there are some pros, there are Some cons Too.. That is the Battery in this Case.. The Battery life is Not that great as It does have 144 hz screen and Rtx 3050..\nBut it is Manageable as If you are Buying it for the gaming purpose only...",
            "Good performance but low battery backup, good for gaming and casual use but battery life between 4-2 hours",
            "An excellent value for money, upgradable (only ram, storage) gaming laptop. 144Hz refresh rate, a GeForce RTX graphics card, 10th gen i5 hexacore 12 threads processor.... What more do you want at this price!\n\nOh and also the design is pretty slick with impressive build quality.",
            "Decent laptop\nVery compact easy to handle\nGood performance\nGood design\nGood build\nPremium look\n\n\n\nDisplay is little weak\nHigh heating on gaming\nSound drive is incorrect won't hear dialogue in some games",
            "Good product",
            "Nice Product as expected no complaints, RTX 3050 at this price is good also no compromise in any other aspects, delivered in a day",
            "The screen is amazing you can't compare with another laptop but Battery is not good as per my usage, only I have got Battery issue and everything is good.",
            "Good",
            "Arrived in just one day!\nSurreal performance probably the most value for money laptop out there. Upgrading RAM boosts performance significantly",
            "Best choice if your looking under 60k\nPro - SSD, 144hz monitor, RTX 3050, Speakers\nCon - Battery,",
            "Battery is a bit less. Other than that it's awesome",
            "ok h bro",
            "Very good product in every segments except battery backup 💖❤️💝",
            "Good product",
            "Awesome laptop with superb design. #RTX 3050 Graphic card is so cool....🔥.",
            "Everything is great with this laptop except for the battery life. Good for entry level gaming",
            "Gre8 delivery and amazing product",
            "SUPER JUST",
            "Yes it is very good performance as compare to other. It is very fast proceceer",
            "This is my first gaming laptop .I hope there is non other brand give this spec in this price range ❤️",
            "It's superb but think about battery it comes around 4.5 to 5 hrs only...and + point is it charges fast also",
            "Yep worth it. You can't get any better than this at this price",
            "Awesome laptop 💻 value for money",
            "Better than my expectations",
            "Good product",
            "Very good.",
            "nice as expected",
            "ONLY BATTERY WAS TERRIBLE\nOVERALL BEAST IN THIS PRICE RANGE",
            "Good choice",
            "Performance level Awesome",
            "Everything is really very good but this laptop is little bit over price for rtx 3050.",
            "Best laptop in best price ever.",
            "Awesome machine 🤛🤛",
            "liked the laptop very nice look and performance",
            "Awesome purchase.go for it",
            "Great Gaming Laptop",
            "Nice",
            "Best value for money i got this in BBD sale",
            "excellent",
            "Excellent",
            "First laptop....\nFully satisfied with it.....would have loved a bit more space but overall a good buy for me.",
            "Bought this product some weeks ago and I am just loving it !!! I did a lot of editing and gaming on this beast and it easily handles each task I recommend u all to upgrade ram for better performance 😉 . Gr8 work MSI !!!",
            "good laptop with worst battery backup.its heat going beyond when u paly any kind of game. service support is carry in is another drawback. battery drain very fast i backup is only 2 hours",
            "Msi gf63 i5 10 gen RTX 3050 is good laptop at that price they are providing fitting part for future expansion ram and SSD, it is provide true gaming experience, keyboard and touchpad are excellent it gives experience of using macbook, i am loved with msi DRAGON CENTER where we monitor user laptop condition, overall experience is very good",
            "At this price, the best laptoo।",
            "Overall great product in price range.",
            "Great product by MSI\n-144Hz Display\n-RTX 3050\n-Red backlit keyboard (I know many people think it hurts your eyes during night but works fine for me)\n-I would have preferred an AMD CPU but it will work since it's a 6-core i5\n-it can run a lot of new titles smoothly at medium settings\n-its a great deal in this price segments.\n-It looks cool 🙂\n-Don't expect much battery in a gaming laptop\n-Sound is good for a laptop\n-2 years warranty at no extra cost is quite a clutch for final decision making...",
            "Need a ram upgrade for smooth gaming",
            "Great for it's price, also pretty light weight for a gaming laptop. Satisfied with the purchase, buy it if you get this under 65k without thinking twice\n\nedit after 3 months of use:\nstill working great, survived tea spill over keyboard, only downside is the red backlit keyboard, white/blue/green would've been better, red is too harsh on eyes\nalso the battery is not that good",
            "good",
            "Superb for gaming",
            "Nice",
            "It's a perfect beauty and a perfect gaming machine at this price range.\nThe only thing that's annoying are that some keys in my laptop are slightly sunk.",
            "Good job msi",
            "Everything is perfectly fine ,it works well But the outer meterial of the laptop is not as expected",
            "Best product in budget of 63k..\nGaming, Coading at the top level.",
            "Performance: i was able to play games likes valorant and cs flawlessly. So no issues\nHeating: Every gaming laptop heats, so keeping that in mind, the thermals were good.\nThe Only thing i would like them to improve is speakers, they're good but I expected them them to be a bit louder.\nConcluding, it's a good laptop at this price point, you can go for it.",
            "Just want to tell you best at its price the beast it is🔥🔥",
            "The product is good and delivers what it promises only one issue is that it has single fan setup while in product description it states it has dual fan setup. Also the chasis heat up a bit on the escape key part. Overall the product is excellent and best value for money. It is light and has good build quality and best value for money laptop.",
            "Used for 2-3 days, performance is great, display is awesome, Ram is less but it's upgradeable, CPU and GPU are perfectly matched in performance so they don't bottleneck each other, battery life is good for a gaming laptop although I wouldn't recommend gaming on battery.\nFactory seal is big down point because without breaking that one cannot perform any upgrades. This is a very negative point for msi as it's known for gaming laptops so they should be easily upgradable.\n\nAll in all a good, value for money, entry level gaming laptop",
            "Design and Build:\nExcellent build. Slim profile for a gaming laptop. Keyboard is very nice with only Red Backlighting. Trackpad is bit small but that's okay for a gaming laptop.\n\nDisplay and Speakers:\nSmooth 144Hz display for competitive e-sports titles. Don't expect color accuracy here. It purely meant for content consumption and not creation.\nSpeakers are really crisp with decent bass. Webcam is poor but does the job.\n\nBattery:\nBattery is okay. One thing to note, if your battery drops below 100% and you immediately connect the charger, the battery won't charge. You have to discharge the battery below 80% then only charging will happen.\n\nPerformance and Upgrade:\nPerformance for the price is top notch. Don't listen to people saying it has only Rtx3050 with low TDP and go with numbers. Leave those people aside. You will have no problems in gaming. Tried Warzone, Fortnite, The Division 1 & 2, RDR2. Everything plays perfectly. Use a cooling pad while gaming as it heats near the WASD keys. Basic code compilation and designing apps work flawlessly.\nThere is a free 2.5 inch HDD/SSD slot and RAM can be expanded to upto 64GB. But you will LOSE WARRANTY! Since you have to break the warranty sticker to perform upgrade.\n\nALSO DON'T LISTEN TO THE PEOPLE SAYING BAD THINGS ABOUT THE CPU OR GPU! THIS IS A REALLY GREAT LAPTOP FOR THE PRICE.",
            "Best product i love it",
            "Does the job..\nThe best gaming laptop",
            "good performance",
            "Very good product.",
            "Battery backup is 3.5 hours in normal mode ,1.5 hour in gaming\nLittle bitt heating issues.\nPerformance is exceptional\nI think it's better to go this this laptop because of 3050 rtx graphic card.\nIt is significant better than the GTX series cards in terms of feature.\n3050 rtx is 10% better than 1650ti",
            "This Is the one I was looking for. Best performance as well as quality.loved it and above all giving me the best gaming experience",
            "Nice laptop with value for money specifications",
            "If you are looking for a budget gaming laptop then this is the best pick in this segment!!!",
            "Looks stylish and thin. Decent Display but 144z makes everything look faster.",
            "Everything is vey very good . Getting RTX at this price was so damn lucky . I bought at last big billion days till now no issues I played aaa games like valorant ,gta 5 ,resident evil 6 at high graphics, no lag till now. But the only problem is GPU usage is low if we make that gpu to use more this will be beast .... I completely recommend it . Can anyone know to boost GPU usage kindly mention .",
            "Beast",
            "Awesome laptop",
            "This is one of the best laptop in the price segment. Rtx 3050 is a steal real so far i have tested. All gramin laptops can have every thing packed in but the fact that this laptop is 1800grams makes it a monster with lightness",
            "Battery performing less 45 min on gaming",
            "It's absolutely nice product",
            "You love this. Very good. Go ahead. Display amazing.",
            "Pros :\nGreat looks\nGreat performance\n144 Hz display\nNice build\nValue for money\n\nCons :\nBattery life is too low. On balanced power option it lasts roughly 3.5 hours with chrome on.",
            "Definitely a good mid ranger with gaming performance.\n\nBuilt: Plastic but sturdy built, good ventilation (it doesn't heat near keyboard and touchpad). Thin for a gaming laptop. Doesn't look much premium (Mac user here, opinion might me biased)\n\nPerformance: Does play most current AAA titles with minimal gitter.\nNote: The gpu is set to use 40w max, I might overclock it later. Also another 8gb dual channel RAM would be great.\n\nScreen: Fast screen with 144hz refresh rate, Good for gaming.\nDon't expect picture quality as of a retina display. Anti glare is not that great, so outdoor use might be a bit troubling.\n\nBattery: Decent enough, its a gaming laptop don't expect much in the first place. I love the fact that it comes with Dragon center pre-installed. It has options to select optimum settings for overall PC performance and hardware health.\n\nOverall if you're looking for a mid ranger laptop for indoor Gaming it the best at the price(around 62k).",
            "Very good product in heavy load battary last almost 1.5 hours thought it could be batter but heavy gaming with max settings it's excepted very good product",
            "A bit of heating issues at the ultra setting and also lower setting, RTX is just superb, battery not much good, over all it's good and with for money",
            "This laptop one of the best laptop in this price segment 🤗",
            "Awesome laptop at this price range(58k). Ultra slim weighing just 1.86kg. superb backlit keyboard and awesome rtx 3050. Gem from msi at low price.",
            "Perfomance was 5% more of gtx 1650ti.",
            "Yes it's a beast."
        ],
        "likes": [
            "106",
            "180",
            "68",
            "31",
            "31",
            "56",
            "14",
            "9",
            "32",
            "61",
            "5",
            "9",
            "14",
            "16",
            "16",
            "9",
            "14",
            "7",
            "3",
            "2",
            "3",
            "4",
            "5",
            "6",
            "1",
            "3",
            "2",
            "4",
            "8",
            "1",
            "2",
            "0",
            "1",
            "1",
            "0",
            "2",
            "0",
            "0",
            "3",
            "3",
            "4",
            "3",
            "1",
            "1",
            "19",
            "8",
            "1",
            "4",
            "6",
            "3",
            "2",
            "3",
            "9",
            "2",
            "2",
            "2",
            "2",
            "1",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "2",
            "2",
            "5",
            "3",
            "2",
            "2",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "1",
            "12",
            "2",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "29",
            "63",
            "16",
            "3",
            "1",
            "96",
            "1",
            "0",
            "8",
            "27",
            "0",
            "0",
            "2",
            "3",
            "3",
            "1",
            "6",
            "2",
            "0",
            "0",
            "0",
            "1",
            "1",
            "3",
            "0",
            "1",
            "1",
            "2",
            "12",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "1",
            "1",
            "1",
            "3",
            "2",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "1",
            "6",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "6",
            "2",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "42",
            "3",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Can we use it as a cold drink tray",
            "Q:Which is better rtx3050 or gtx1050max",
            "Q:Rtx3050 vs rx5500m which is better",
            "Q:We can play free fire",
            "Q:Dose this have i5-10gen with hexa core?",
            "Q:Can I turn off backlight",
            "Q:Can we play games like death stranding or god of war in ultra settings????",
            "Q:Can I do coding and Gaming ?",
            "Q:Which is better rtx 3050 or GTX 1650 ti ?",
            "Q:Which is best asus tuf Or this",
            "Q:Have any another memory slot and can I add hdd ?",
            "Q:What is the frequency of the RAM? DDR4 2666?",
            "Q:It supports 1 tb hdd",
            "Q:Can I add add 16gb RAM with existing 8GB or I need to change both slot with 16gb?",
            "Q:Can we add another 8 gb ram of greater mhz like 3000 or 3200",
            "Q:Storage is upgradable?",
            "Q:Fingerprint sesor available",
            "Q:Does it need cooling pad?",
            "Q:How many heat pipes?",
            "Q:How long should I charge the laptop for the first time?",
            "Q:Does msi logo glow when turned on",
            "Q:Can I Use This Laptop For 6-7 years For C++ PROJECTS AND also Cs:go game ?????? Please Give Me True'Answer",
            "Q:Rx550m or RTX3050 (40W) which is better for fps",
            "Q:Can I do streaming and game recording",
            "Q:can I upgrade its storage HDD or SDD?",
            "Q:How about temps is there any thermal throttling in heavy CPU tasks?",
            "Q:WILL LUMION 11 WORK",
            "Q:How is the hinge quality?",
            "Q:Can it run at 8k Ray tracing on, in games like gta 5 or minecraft",
            "Q:Can I increase the grapic capAcity of this laptop",
            "Q:Whats the base frequency of this processor?",
            "Q:Is gst invoice available in this specific model?",
            "Q:Gtx 1660ti vs rtx 3050",
            "Q:How many core processor is this laptop? Also how many hours battery backup?",
            "Q:Which chipset (motherboard?) Is in their?",
            "Q:RTX 3070 or RTX 3050 which is higher",
            "Q:It will bottleneck ?",
            "Q:PS4 or this laptop",
            "Q:Can we upgrade ram and storage SSD in this laptop?",
            "Q:Can I play gta v and rdr 2 on it",
            "Q:In this varient can I get number pad keyboard also",
            "Q:Its HDMI support gpu output Or cpu output plz explain?",
            "Q:It's have nvme slots",
            "Q:is speaker loud or not?",
            "Q:can we play wwe 2k20",
            "Q:Will i get Hdd connector in a box",
            "Q:What's the display nits..?",
            "Q:Processor is upgradable ??? If yes, will it support i7 10th or 11th gen??",
            "Q:Which is best gf63 i5 and gf63 i7 10 gen",
            "Q:1.Is 120 watt AC adepter really a big issue? 2. What actually the issue is? 3. And is there any solution? ( I'm not a die hard pc gamer bt i want to try. )",
            "Q:can we connect a extra monitor in this laptop",
            "Q:Is there any hdmi port to connect a monitor in this laptop",
            "Q:Does it include 1 TB HDD hard disk.",
            "Q:Is it 1RX8 ram or 1RX16 ram??",
            "Q:Does the msi dragon logo glow?",
            "Q:What about for long time uses?? It's worth?? And heating problem?",
            "Q:Does this have a mus switch ?",
            "Q:Is ms office available?",
            "Q:What is the Tgp of GPU(rtx 3050)",
            "Q:Can I increase the Ram capacity??",
            "Q:Better than 1650ti?",
            "Q:Which is better, Ryzen 7 4800h or Intel i5 10500h?",
            "Q:How many fans in the system. Images shows two fan but i research everyonr mentioned 1 fan. Please confirm",
            "Q:Battery backup of laptop",
            "Q:What is the graphics card power usage in Watts.",
            "Q:I brought this laptop and I can hear small amount noise like scratching metal inside from exhaust fan,is that common in this model?",
            "Q:Is the audio and microphone is of 3.5mm",
            "Q:i upgrade ram or ssd , warranty expire or not ?",
            "Q:Can i change processer i5 to i7???",
            "Q:WHAT IS THE REFRESH RATE OF SCREEN",
            "Q:How many slot of memory ?",
            "Q:Is RTX 3050(40w) vs GTX 1650 which is best ?",
            "Q:How much time takes for fully charging?",
            "Q:Does it support 2 tb hdd",
            "Q:is RGB keyboard available?",
            "Q:Is there any screen bleeding problem after long time use ???",
            "Q:Can you add two sata ssd that means the one which is already placed and a seagate 480gb sata ssd",
            "Q:Can I upgrad it's SSD capacity ?",
            "Q:What is the laptop standby once it is fully charged? (In terms of days) plz reply",
            "Q:This laptop support ssd and hdd?",
            "Q:Is it suitable for heavy gaming ?",
            "Q:Is this laptop made of by metal or plastic?",
            "Q:can i use auto cad and other heavy software smoothly",
            "Q:can i add a 3200 mhz ram to this laptop ? please reply",
            "Q:Is storage upgradable?eAnd both hdd and ssd?And what type of SSD is upgradable and what's the limit? Please reply I'm buying this laptop need to upgrade the ssd,please reply if you are a buyer pleasee",
            "Q:It ha upgradable ram and storage or not",
            "Q:Is camera is available or not",
            "Q:Is Microsoft 365 free with this Laptop?",
            "Q:Can we use ms office",
            "Q:Does the battery completely drain to 0% in not used for 3,4 days?? Plz plzz plzz reply",
            "Q:Can this machine beats legion 5 1650",
            "Q:Can I use a 2666mhz ram with the current 2933mhz ram?? I am not able to find a 2933mhz ram.",
            "Q:Does someone hear any sparkling noise from the laptop back",
            "Q:Which is best rtx3050 or gtx1660ti?",
            "Q:Is the 8 gb ram dual channel (2x4) or single channel(1x8)?",
            "Q:Can this be used for 1080p video editing?",
            "Q:Is this a plastic build laptop?",
            "Q:Is there any anti virus included rather than windows defender and if yes then for how much time we get to use antivirus?",
            "Q:Can you give the 4-5 hours battery life for normal usage, once it charge full.",
            "Q:All apps are accessible",
            "Q:Does it have 144 hz display",
            "Q:While gaming, What is the dangerous temperature fo cpu and gpu in degree. And also normal temperature.",
            "Q:this laptop come with fingerprint sensor???",
            "Q:How is the viewing angle ?",
            "Q:What is the number of core and thread?",
            "Q:Battery duration after fully charged?",
            "Q:Does its track pad support multi gesture?",
            "Q:Is the display good enough for using 8-10 hours straight?",
            "Q:Will we get a game pass with it ??",
            "Q:What's the version of WiFi and Bluetooth ?",
            "Q:It comes with 2x4gb or 1x8gb ?",
            "Q:16gb ram with RX5500M or 8gb ram with RTX3050(40W) will RX5500M perform better in this case??",
            "Q:Does it come with bag or should we buy it separately ?",
            "Q:Does it come with bag or do we have to buy seperately ?",
            "Q:Can I add 16gb ram to the laptop with the existing 8gb one ? Please reply fast",
            "Q:Can i change colour of keyboard",
            "Q:What is better, this or Victus with 3050",
            "Q:It will get update to windows 11 or not ?"
        ],
        "answers": [
            "A:I have this laptop, and yes, I used it as a cold drink tray many times. Best gaming cold drink tray👌",
            "A:3050 obvious",
            "A:Rtx3050",
            "A:Yes, you can play. Also there is no need to download an emulator, it has built-in MSI APP PLAYER (android emulator) which is for gaming",
            "A:Yes",
            "A:If you're referring to the keyboard, yes you can. It allows setting up to 3 levels of brightness. But the keys themselves are bordered around the sides with light red colour and the letters as well.",
            "A:Yes, but you need to upgrade the ram first. You can play in ultra settings but the fps will not be very high, the GPU is of 40 watt, but no performance issue is there almost the same fps as 60watt gpu",
            "A:Absolutely you can",
            "A:RTX 3050",
            "A:This is way better than Asus tuf f15/a17",
            "A:Memory yes, HDD no, SSD yes",
            "A:DDR4 2933",
            "A:yes",
            "A:According to a video I saw on YouTube, both slots need to have same RAM, so 8 GB in both slots, if you want 16 GB RAM total. You cannot have 8 GB in one slot and 16 GB in the other slot.",
            "A:yes",
            "A:Yes, there is a 2.5\" expansion available.",
            "A:no, not available",
            "A:yes it will surely help in keeping the temperature low",
            "A:Three heat pipes,one for GPU and 2 for CPU.",
            "A:till the battery is 100%, perform atleast once a full battery cycle i.e run the laptop on battery and let it drain itself then charge it, do this regularly to prolong your battery life.",
            "A:no",
            "A:Yes. More than sufficient.",
            "A:Rtx 3050",
            "A:yes bro",
            "A:2.5\" SATA Port available you can add SSD (SATA) (or) HDD your wish...",
            "A:yes there is thermal throttling. it make noise very high. as this is a single fan laptop. recommended go for cooling pad or dual fan cpu models.",
            "A:I would recommend , it's a good laptop with best configuration on this price",
            "A:great",
            "A:Yes for sure extreme gaming is possible🔥",
            "A:Internally, we can't. External graphic card can be connected",
            "A:it is around 2.4ghz up to 4ghz maximum 12ghz",
            "A:yes",
            "A:RTX 3050. Even this one's lower TGP 3050 can perform better than 1660Ti",
            "A:6 cores, on battery saver you get 5 hr backup, disabling all background apps",
            "A:intelHM470",
            "A:RTX3070",
            "A:No.",
            "A:This lsptop has more graphics than ps4",
            "A:yes bro, Ram to 64gb and you will get an extra slot for HDD with inbuilt 512 GB SSD.",
            "A:Gta V runs smoothly in high graphic setting giving around 80 to 90 FPS",
            "A:nope,I don't think so but why do you need num pad when numbers buttons in 2nd row is pretty large so it totally replace the need of num pad also make msi design great and compact",
            "A:cpu",
            "A:It has only one m.2 nvme slot which is already equipped with a 512gB ssd.",
            "A:Yes it is really loud and has good sound quality too",
            "A:you should be able to in medium settings, high settings might not give you high fps.",
            "A:yes",
            "A:400nits + brightness",
            "A:No you can't upgrade ur processor in a laptop, only thing you can upgrade is ram (upto 64gb on this device)",
            "A:gf i7 10th gen is better than i5",
            "A:Not a big deal,there is nothing to worry",
            "A:yes , via HDMI port",
            "A:yup it is on the back side",
            "A:no",
            "A:8gb ram",
            "A:No",
            "A:Heating is thr ….. for long time use … but performance wise really good",
            "A:yeah",
            "A:no",
            "A:Dont worry about 40w its a beast its far far better than gtx 1650ti i payed AAA games on High graphics n it gave me aroud 65 to 75 fps.....its a fcking beast(40w TGP IT'S JST A NUMBER)",
            "A:yes, it is expandable upto 64gb.",
            "A:Yes in some games it beats 1650ti asus tuf, go for it, I personally checked few games.",
            "A:depends on usage Intel is better on single core while ryzen better on multi core",
            "A:1 fan and its handling well, cooler boost mode will remove all heat at once.",
            "A:Battery backup fully depends on usage. On battery saving mode and using it for internet surfing, playing video for some time it can give backup up to 4-5 hrs at Full charge.",
            "A:40 watts.",
            "A:I m getting d same noise bro bt jst chill it will not damage your laptop anyway bt if d noise is too loud u mst contact in my case it's very low",
            "A:yes audio and mic jack is of 3.5mm",
            "A:No it will not void warranty if you upgrade ram or ssd on your own.Only condition is that if any thing gone wrong while upgrading ram or ssd then it will not covered in warrany.",
            "A:No.",
            "A:144hz",
            "A:you have total of 2 slots.. 1 slot will be installed so you will have 1 slot free",
            "A:RTX 3050 without a doubt",
            "A:5 hrs",
            "A:yes",
            "A:Nope. Only red back-lit.",
            "A:no, have been using mine(gf63 rtx3050 one) for 2 months but haven't seen bleeding till now.",
            "A:Yes ,,we can but I didn't tried till now.",
            "A:There is already M.2 of 512 mb installed and there is another open slot for 2.5 inch ssd.",
            "A:You’ll hardly get 3 to 4 hours of battery life on full charge as it is a gaming laptop and doesn’t have a good standby so you’ll mostly have to use it while being plugged.",
            "A:It has m.2 NVME SSD",
            "A:it heats a lot and heating will affect ur gaming experience....but as per price reasonable...if u can afford more go to other options",
            "A:metal + plastic",
            "A:yes it's everything good .I use 14days .I think my experience to I'm say u here is many cse student each person keep minimum 1laptop and compare to other laptop this laptop value for money thanks!msi",
            "A:Even if you increase the ram speed, the stock speed will only be used. Only Ram capacity can be increased",
            "A:Yes you can upgrade",
            "A:Yes It Has",
            "A:yes but not so good okaish",
            "A:One month trial is free",
            "A:yes but its not free you have to buy it.",
            "A:No not at all. If you don't use the laptop at all battery drain is very very minimal (just 1-2%)",
            "A:yes 3050 is much better than 1650 and processor is also beast, weight is also less that is 1.8 kg, Full metal body",
            "A:Rather buy a higher frequency one. That will downclock itself.",
            "A:Sparkling noise means. Actually one sound comes from it that is its fan sound inside this.",
            "A:rtx3050 bro",
            "A:You can put two 8 gbs. One is already available. One more you can insert.",
            "A:yes",
            "A:yes",
            "A:No antivirus include",
            "A:No",
            "A:yes",
            "A:yes",
            "A:45",
            "A:No",
            "A:great",
            "A:6 cores 12 threads",
            "A:2hr",
            "A:Yes",
            "A:It would be good for 4-5 hours, can be 6 hours for the most but for 8-10 hours can be eye straining.",
            "A:Nope",
            "A:wifi v6.0 & bluetooth v5.0",
            "A:There are 2 slot for RAM. 8GB in one slot and other one is empty so you can add as per your need like 2×8, 2×16.",
            "A:3050 is better than RX5500M",
            "A:No bag.",
            "A:No Bag",
            "A:yes",
            "A:Not possible",
            "A:for the prices this is better if you know how to maintain it",
            "A:Yes it will"
        ],
        "likes": [
            "7",
            "25",
            "39",
            "17",
            "16",
            "6",
            "6",
            "1",
            "7",
            "26",
            "3",
            "2",
            "4",
            "23",
            "7",
            "7",
            "3",
            "3",
            "0",
            "4",
            "4",
            "5",
            "3",
            "2",
            "2",
            "2",
            "2",
            "1",
            "5",
            "1",
            "2",
            "2",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "14",
            "38",
            "15",
            "5",
            "19",
            "4",
            "4",
            "0",
            "7",
            "0",
            "3",
            "2",
            "2",
            "3",
            "2",
            "2",
            "3",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "2",
            "3",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "2",
            "3",
            "9",
            "3",
            "3",
            "0",
            "0",
            "0",
            "1",
            "13",
            "0",
            "0",
            "0",
            "16",
            "2",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "2",
            "3",
            "0",
            "0",
            "0",
            "0",
            "1",
            "21",
            "3",
            "8",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "7",
            "0",
            "4",
            "7",
            "2",
            "0",
            "8",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "3",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "2",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1"
        ]
    }
}