{
    "title": "ASUS VivoBook Ultra 14 Core i3 11th Gen - (8 GB/512 GB SSD/Windows 10 Home) X413EA-EB322TS Thin and Light Laptop  (14 inch, Bespoke Black, 1.40 kg, With MS Office)",
    "product_specification": {
        "Sales Package": "Laptop, Power Adaptor, User Guide, Warranty Documents",
        "Model Number": "X413EA-EB322TS",
        "Part Number": "90NB0RL7-M11060",
        "Series": "VivoBook Ultra 14",
        "Color": "Bespoke Black",
        "Type": "Thin and Light Laptop",
        "Suitable For": "Processing & Multitasking",
        "Power Supply": "65 W AC Adapter",
        "Battery Cell": "3 cell",
        "MS Office Provided": "Yes",
        "Processor Brand": "Intel",
        "Processor Name": "Core i3",
        "Processor Generation": "11th Gen",
        "SSD": "Yes",
        "SSD Capacity": "512 GB",
        "RAM": "8 GB",
        "RAM Type": "DDR4",
        "Processor Variant": "1115G4",
        "Chipset": "Intel SoC",
        "Clock Speed": "4.10 GHz Max Turbo Frequency",
        "Cache": "6 MB",
        "Graphic Processor": "Intel Integrated UHD",
        "Number of Cores": "2",
        "OS Architecture": "64 bit",
        "Operating System": "Windows 10 Home",
        "System Architecture": "64 bit",
        "Mic In": "Yes",
        "USB Port": "1 x USB 3.2 (1st Gen) Type A, 1 x USB 3.2 (1st Gen) Type C, 2 x USB 2.0 Type A",
        "HDMI Port": "1 x HDMI Port (v1.4)",
        "Multi Card Slot": "Micro SD Card Reader",
        "Hardware Interface": "PCIe NVMe M.2",
        "Touchscreen": "No",
        "Screen Size": "35.56 cm (14 inch)",
        "Screen Resolution": "1920 x 1080 Pixel",
        "Screen Type": "Full HD LED Backlit Anti-glare IPS Display (16:9 Aspect Ratio, 45% NTSC Color Gamut, 250 nits Brightness)",
        "Speakers": "Built-in Speakers",
        "Internal Mic": "Built-in Microphones",
        "Sound Properties": "Audio by ICEpower, Harman/Kardon Speakers, Cortana Support",
        "Wireless LAN": "IEEE 802.11ax (2x2), (Wi-Fi 6)",
        "Bluetooth": "v5.0",
        "Dimensions": "324 x 215 x 19.1 mm",
        "Weight": "1.40 kg",
        "Disk Drive": "Not Available",
        "Web Camera": "720p HD Webcam (without Privacy Shutter)",
        "Finger Print Sensor": "Yes",
        "Lock Port": "Security Lock",
        "Security Chip": "TPM",
        "Keyboard": "Backlit Chiclet Keyboard",
        "Backlit Keyboard": "Yes",
        "Pointer Device": "Touchpad",
        "Included Software": "Microsoft Office Home and Student 2019, Tru2Life, Splendid, My Asus",
        "Additional Features": "42 WHr Li-ion Battery, BIOS Booting User Password Protection",
        "Warranty Summary": "1 Year Onsite Warranty",
        "Warranty Service Type": "Onsite",
        "Covered in Warranty": "Manufacturing Defects",
        "Not Covered in Warranty": "Physical Damage",
        "Domestic Warranty": "1 Year"
    },
    "product_description": {
        "Work, Play, and More": "The ASUS VivoBook Ultra 14 is a stunning and powerful personal laptop with multiple attractive features, including the color-blocking Enter key. Powered by an Intel processor, this device lets you do various everyday tasks with ease.",
        "Color-blocking Enter Key": "This design feature ensures that the Enter key is highlighted and easily visible.",
        "NanoEdge Display": "The VivoBook Ultra 14 features a NanoEdge display that offers a big screen on a small frame. Hence, you get uninterrupted, immersive visuals without distractions. Also, the Full HD display along with wide-viewing angles and impressive colour reproduction delivers vivid and lifelike visuals.",
        "Light and Portable": "With a weight of about 1.4 kg and a thin profile, this laptop is easy to carry along.",
        "High Productivity": "Powered by an Intel processor, high RAM capacity, and PCIe SSD memory, this ASUS laptop helps boost your productivity.",
        "ASUS Intelligent Performance Technology": "The AIPT is a thermal design as well as a power-saving solution that ensures that this device delivers energy-efficient performance. By using exclusive ASUS algorithms, about five to nine smart sensors, and an aerodynamic IceBlade fan design, this technology intelligently improves the CPU performance while maintaining stability, long battery life, and quiet operation."
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "1",
            "4",
            "5",
            "4",
            "4",
            "4",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "3",
            "3",
            "5",
            "4",
            "4",
            "3",
            "5",
            "4",
            "5",
            "5",
            "4",
            "1",
            "4",
            "3",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "3",
            "5",
            "4",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "2",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "4",
            "5",
            "2",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "1",
            "5",
            "1",
            "4",
            "5",
            "4",
            "4",
            "4",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5"
        ],
        "review": [
            "Flipkart just took 2 days to deliver the product.\nI have used it now for just few hours, so here is the first impressions....\nBattery is great as of now.\nDisplay is great... vibrant and crisp.\ni3 11 th gen handles everything too easily.\nSSD is toooo fast...i have made a partition of 175gb for c drive.\nDesign is also great.\nComes with genuine windows 10 and ms office home & student 2019.\nAs of now.... everything is great. Now let's see what happens after some time, I'll edit the review after that.\n\nMy thoughts after almost 15 days of usage.\n\n1) battery- 4.5/5, definitely very good.\n2) sound quality - 3/5, very low & bad.\n3) display+ build quality+ processor+ssd speed + fast charging+ ram quality everything is great.",
            "Everything works with very fast speed due to i3 11th Gen, 8 Gb RAM and 512 Gb Nvme SSD. FHD display is awesome. Sound quality is also great. Light weight (only 1.4 kg). Battery performance is very good. Backlit keyboard and fingerprint sensor make it more valuable laptop.\n\n✍️ Surjya kumar Das, Assam",
            "Good morning.\nIt is a nice product.\nI used it for a day, and it is strong and muscular. Works just as a Bugatti but looks a bit like an Audi .\nYou can go for it if budget below 45000.\nBacklit keyboard is also strong and useful.\nFingerprint scanner is fast and powerful.\n\nSo go for it. But do a bit research befor buying .\n\nThankyou.",
            "Performance of the laptop is good. Login screen appears in ~9 seconds from power on. Fingerprint sensor works like a charm. Sound is ok.\n\nDisplay port/charging using Type C port is not supported. Laptop looks good but not satisfied with the build quality. Power button is integrated to keyboard and it looks like a normal key. Display quality is average.\n\nAfter initial setup laptop, it showed some sort of glitches. It was not turning on for a couple of hours. Later somehow it turned on and now its 1 week, as of no issues.\n\nAbout Flipkart's replacement policy: I deducted 2 stars for this. When i asked for replacement they said, a Flipkart's technician will visit my place after 2 weeks and on his approval they will start processing my replacement. I don't want to waste that much time, i cancelled the replacement request. I don't know how long this laptop will run.",
            "Very Good and better in that price Range .\nI ordered on 3 May 2021 and got delievered on 5 May 2021 ,only in 2 days.\nI got i3 11th gen 8GB RAM 512 GB SSD at only on 38990.\nBest laptop i ever got in this price range.\nPower plug and Adapter wire is also very soft and Adapter wire is long as sufficient .\nPackaging is also very good, it is available like a suitcase for the laptop.",
            "Got it 40k,and at that particular price it's just amazing...Went onn with many other models in this category but some or other features used to be missing...but asus gives us a laptop which fulfill all our requirements...\nCompact Design\nAwesome Speaker(Note- Initially the volume was low but later on called asus and then they guided me with an update after which sound got increased)\nVery Nice battery backup, additionally it shows how long the battery would go depending upon the usage.\nOmg! That Speedy Charging..Just 45min or less than that will go for 5-6hrs on normal usage..\nPre-installed Ms office is handy and reliable..\nCortana is mind blowing,very speed due to ssd,my asus app connects with laptop and we can share photos feasibly..\nVery Nice! Especially for coders,not for gaming purpose,small games would work very easily..",
            "It's a best laptop in this price range. I have bought this in summer sale for Rs38900.\n1. Talking about performance it is upto the mark.\n2. Battery backup is also good it give 7-8 hours backup if you are using continuously.\n3. Camera is also good, but it doesn't have privacy sutter.\n4. Talking about the boot up time it takes only 2 seconds.\n5. Speakers are also good and have relevant sound. It has 2 speakers, right and left side.\n6. It also have backlit keyboard.\n7 it has plastic body.\n\nWait to buy it if the price goes up above Rs. 40000",
            "It's best value for money laptop. Don't think about HP i3 11th because after 1 year HP will be slow definitely but not Vivobook. Battery is very good. Performance is awesome. Display is more awesome. Every thing is awesome in the budget range . You can buy it blindly. Its quite better than ryzen 5 3500u because it's a latest processor. I love it so much.",
            "This is good product but speakar quality is not good\nAnd battry life is normal and build quality is very\nGood and this is not gaming laptop but I am impressed\nThis laptop . thanks Flipkart",
            "*Updated after 7 days of use\nReceived this yesterday. Got it for 37.5k\nNice performance in mid range. Seems very delicate. You have to use with care. If you are ruff and tuff user, should avoid. Very slim and light weight.\n\nBattery is good. 4 to 5 hours\nCam is average.\nSound is good. Not very loud but clear.\nKeyboard look is nice but build quality is delicate. Use keyboard guard.\nFinger print scanner excellent.\nSpeed excellent for day to day usage. Played morden combat 5 and worked good.\n\nValue for money for 38k.",
            "Good laptop..\nBetter deal if you get it below 40k\nPerformance is better.. Works well with programming and basic users, not tried for any gaming\nDisplay is good\nSound is average not loud but good quality\nCamera is good\nOverall better package in this price range",
            "Very good laptop aaj he mne buy kia h display quality is also very good\nsould quality is okh\nfingerprint sensor is very good\nits very great laptop in budget\ni think vivobook just work on lil bit speaker\nother all is good\nspeaker is good not bad",
            "Used for one month...It's a delicate laptop for students and office workers ...slim..good looking...and really compact MUST BE IN GENTLE USE ....Best for coding and student works...NOT FOR GAMING Loaded with backlit keyboard fingure print sensor compact 65 watt charger and 42 w battery....with fast charge support",
            "Ultra lightweight and portable. Backlight keyboard is a great plus. Performance is ok for i3 11 gen. Overall laptop build quality is good. Size is quite small than expected. Heats up after continuous long use. Sound quality is satisfactory. Good for regular work like browsing, checking emails, coding and onscreen reading.",
            "Received it on 6th May, 2021..\nI think this is best laptop (with \"the\" features) at this price for daily users like office workers & students..\nTruely value for money.. just loving it..\n*14 inch thin & light\n*Intel i3 11th gen\n*Backlit Keyboard\n*Fingerprint Sensor\n*Security Lock\n*Office Home and Student 2019\n*8 GB RAM, 512 GB SSD\nWhat else do you want at this price!?",
            "I have purchased this product one month ago .\n\n1.I didn't face any issue with the performance or getting laptop hang or overheated .Overall performance is very good .\n2.Battery backup that we are getting around 5 hours . When it comes to charging , it is getting charged 75% within one hour . Overall battery is very good.\n3.Design of the laptop is quite look so awesome with color, light weight laptop\n4. Display of the laptop is around 14 inches that we can HD videos quality .\n5. Reboot of the laptop is quite very fast that it takes around 3secs\n6. Keyboard design look so awesome with key lighting feature .\n6.We have SDD of 500GB and ram 8GB . Overall laptop price is best price that we are getting under this all features.",
            "This is my third mid range laptop purchase and absolutely loved it.\nReview after over a month :\n\nPros:\n1. Great boot up speed within seconds\n2. Extremely fast response with multitasking\n3. Decent audio quality\n4. Plays multimedia/editing like a charm\n5. No heating/audible system noise at all\n6. Amazing Lightweight build/sleek\n7. Fingerprint response is great\n\nCons:\n1. Very sincerely, haven't found any yet. I have used the system for my office work and coding which happens on VM mostly, so for people with gaming requirements - please check other reviews as well !",
            "Budget King right now, it is having 8Gb RAM, i3 11th Gen, and 512 SSD in this much amount.\n\nThe battery is also good in normal usage, it gives 4.5 hrs of backup and thanks to 65w fast charging also.\n\nBootup is very fast, in 5-7 secs only.\n\nThe sound is Normal because speakers are placed downside of it, but it sounds ok and clear when you place it on the table.\n\nThe display is also good and the overall design is so light to carry.",
            "Have been using this laptop since a few hours and everything is great so far\nDisplay is very good though speakers are average not too loud\nKeybard is nice and is easy to type\nWebcam is average like 8/10\nThe fingerprint sensor is also pretty accurate\nThe backlit feature is also nice\nBattery lasts up to 4-5 hours max\ngot this for 37.6k and its totally worth its price\noverall rating : 9/10\n\nAfter a month: it's still working fine but the fn+f hotkey doesn't function properly i mean it dies work but ut doesn't show what mode it is in right now which is very confusing. And the speakers are also cracking voice (if you know what I mean) which is very annoying. I'm watching a movie and even if it's a silent scene with just air in background , the music cracks and that just ruins the whole experience. Aside from these two problems, everything seems to work just fine.",
            "We bought Two! That itself should tell you how happy we are with this product!\n\nAn outstanding machine! Superb build quality, ultra fast response, fantastic features, hyper smooth functioning. You cannot get a better machine (branded) at this price. Go for it without a second thought!",
            "Just received the product today. While start up and shut down it takes a very small time compared to old models. The boot up time is quick. The Performance of the Device is pretty good at price range of 38.5K.\n\nI am writing about helping people extend the warranty at INR 99 for additional 1 year and INR 999 for additional 2 years.\nInstead of buying warranty from flipkart or ASUS app in the Laptop buy it from ASUSPROMO.IN.\n\n\nSome people have written about small laptop. But they should be ensured that it is a 14 inch screen irrespective of size of computer.",
            "Writing this review after 3 days. This laptop is amazing and working very good till now, laptop with these specs make itself a very Worthy product for students...I would definitely recommend it to buy if you're a student.It has met all my expectations but the issue why I gave it 4 - Stars was it's battery issue,, seriously believe me it drains quickly and gives you around 3-4 hours..Though I understand that there are always sacrifice and compromise in order to gain something better...overall it's a WORTHY LAPTOP...",
            "I am using the laptop from April. After heavy use of this laptop . I am giving the review . So you can prefer my review whether you should buy or not .\nFirst come to\nBATTERY 🔋🔋🔋 - This laptop hardly gives 3.5 Hours of battery . It's Very disappointing thing . I am a student . And in my case battery backup is a major thing.\n\nPERFORMANCE - well performance is quite good . It will not disappoint you . Specially the SSD increase it's performance .\n\nSTORAGE AND RAM - I bought a version of 8gb Ram and 512gb SDD . BUT you will get only 6gb Ram for use and 2 GB uses the system . You will get only 472gb .\n\nGraphic card - I haven't do editing and play games . So I can't give review regarding this .\n\nDesign - Design is awesome 👍👍👍. And it's very light weight laptop. It's backlight good and senser makes it out of the box.\n\n\nNOTE - overall performance is quite amazing expect battery life 😔😔😔....\n\n\nYou can go for it surely but keep it in your mind regarding the battery life.",
            "Apparently, I'm running out of words to describe it so I've given rating. At first blush, I got fascinated with the backlit keyboard ✨ that was so enchanting and then arrives the touch experience of the trackpad of the laptop, it was smooth as silk. Overall it's a worthy product at such an affordable price & a non-regrettable purchase in today's life. ❤🤘",
            "Nice laptop . The look is awesome. Though plastic is used but it is a good quality plastic. The keyboard is very clicky and the backlit keyboard is extremely good. The photo that i have shared is the middle backlit u can go also one level up than that. Ya it is not for gaming. The display is also very good.",
            "I've brought this a week ago when only 11 ratings were there and it was 3.8 stars on average.\nThis laptop has the best looks and it's super easy toh handle as it is 1.4 kgs only. The charge stays well for like 4 and half hours. It can game a bit. The keyboard looks very cool. It has that premium feeling when you work on it. The booting time is like 4 or 5 secs. I got it for 39990.\nThe only drawback is that it doesn't have a lab port as it is a sleek book. Go for it.",
            "Hi all, I'm using this laptop for last few days. As I was looking for sleek laptop with good performance it satisfied both. Laptop design was really cool. Performance is good and fast. Really enjoying the experiance with this laptop. Value for money.",
            "Good display with decent viewing angles as well as battery backup. It is quick due to SSD and 8GB RAM, Camera is decent for an laptop. Keyboard is good. Fingerprint sensor is quick to recognize. Only thing which bothers me is it hinge. It is delicate and display part shakes a lot while typing in hand or kept under fan. Laptop is running cool so cooling solution is good compared to other laptops I used. Durability wise need to be very careful while handling. 8GB of RAM is good for now but there is no upgradability options so it will be like an mobile phone with fixed RAM and only storage can be upgraded.",
            "It's an amazing product in the range of 44k and specially it's good for multiple tasking and things and very fast things happen in secs. I would recommend everyone to buy this one if you have the budget of 44k kinda ..",
            "I bought this laptop 3 weeks back and it has been working brilliantly. Boot is super fast, display is awesome and the performance is unbeatable! I literally waited for this model for weeks and I'm happy I waited.\nWill update on the performance a month later.\nThe white colour variant is out of stock so you shouldn't wait and get the black one as at 39k this is the best laptop since all other laptops under this performance segment is around 45-50k.\nMy usage includes wfh and it has been serving me well. It's backlight too and the asus people gave some cute stickers which look super cute",
            "Dear Customers,\nPackaging from Flipkart was really worst, it was just packed in a box, bubble wrap could have been added to avoid shaking, overall disappointed with the packing.\nI'm really happy with this laptop, I have been using this laptop from past 20 days, laptop is really very fast due to i3 14th generation, 8GB Ram, 512 GB SSD, Clock Speed of 3.0 GHZ which boosts up to 4.0 GHZ etc.\nBacklit keyboard is very attractive, design of the laptop is awesome, battery backup is also very good, My Asus pre-installed app is also an advantage, Windows 10 home and MS Office home and student 19 are pre-installed, Mcfee antivirus comes with 1 year subscription, and Cortana artificial chatbot is also pre-installed which makes it stand out, overall it's a good laptop with this price range.\nI'm a working professional and also I'm persuing my Master's, so Asus Vivobook has helped with my professional work.\nSo I would like to recommend this product to those who are working professionally and also for the people who are looking to buy the laptop below 50 K.\nCheers to Asus Brand.",
            "Looks like a good laptop at first impression.\nWord, excel and PowerPoint is included with the laptop.\nWill update the laptop after few months of usage.",
            "The laptop looks awesome.\n\nVery fast shutdown and boot up.\n\nSound of the speaker is very clear.\n\nBattey backup could have been better.\n\nRam 4gb for CPU and 4gb for GPU.\n\nFinger print sensor very fast working.\n\nSSD drive work really fast.\n\nOverall Value for money for student and office usage.",
            "Blessings Fast Nvme SSD + 8GB Ram you want find any leg. Good battery backup. If you want thin and light laptop with backlit keyboard with good performance go for it. You want regret.",
            "Laptop design is compact.\n1. Display very good\n2. Sound good and clear not loud\n3. Laptop speed awasome\n4. Battery backup 5 to 6 hours normal use\n5. Build quality very good",
            "Great laptop for the price.\nPerformance is great. Build quality is superb. Looks stylish, very light weight and easy to carry arround. Keybord and touchpad all working fine.\nPerformance - 9/10\nBuild quality - 9/10\nDesign & Looks - 10/10\nKeyboard - 8/10\ntouchpad - 8/10\nDisplay - 8/10\nSound - 8/10\nWifi, bluetooth - 10/10\nbattery backup- 7/10\nCharging time - 9/10\nports - 8/10\nValue for the money - 10/10\n\nFew negatives -\n1. Power button beside delete button\n2. no indication of battery chargin...\nREAD MORE",
            "At this range it is the best laptop because it give all the specifications.\nIf you are student and u want to coding programming then it is best and you can play normal games also but not heavy games. It is a fast latop it takes only approx 9 sec to open beacuse it have 512ssd.the combination of 8/512 is perfect for this range.\nSound quality is little bit slow.\nNot for gaming.\nBattery is normal.\nIf you are simple user then it is perfect for battery.\n\nThe best part is -\nPerformance is great very much\nAnd speed also wonderful.",
            "At 40k this is a good buy. As all competitors are not that great looking and portable friendly ( obviously no comparison to macbooks) though with similar specs. It has a good amalgamation of hardware and software.. the display is good but not that vibrant and the webcam needs improvement as with all others out there.. rest assured and enjoy the beauty in the beast.",
            "Laptop is good. But display is small. I also have LG laptop 14 inch and it's display is bigger than asus which is also 14 inch. LG laptop display height is 1 inch bigger. Also they should've provide num pad too and navigation key is too small not able to use properly. Battery backup is low. Performance is okay.\nNo dedicated key for volume. No bag with laptop. SSD helps for faster operating and booting.no Ethernet port. Body get scratches easily so take good care.not ideal for media consumption. Only for work\nAll this cons I have mentioned according to its price",
            "Asus vivobook ultra 14 is better than expected product. Audio quality is super thanks to harman/ kardon. Camera is really HD. Fingerprint sensor is so fast. Backlight is awesome. Super fast OS.Overall a 5* product undoubtedly. Also got windows 11 update within a week.",
            "Just superb. Display ,,,",
            "Overall performance is good. You can go for without any doubt.\n\n1.Booting in 5 to 8 Second.\n2.Nice display.\n3.Smooth keyboard with backlight.\n4.Battery may need to improve.\n5. Light weight.\n6. Design is great .\n7. Multitasking laptop.\n8. McAfee is taking more resources. If you replace with light anivirurs system will be maintaining speed.",
            "Perfect choice for Office, students and business use.🔥🔥🔥🔥🔥\n#sexy🔥",
            "Light laptop with good performance... And looks very good. Keyboard buttons are smooth.",
            "Awesome product",
            "awesome slim body..",
            "Superfast Speed due to i3 11th gen , 8Gb RAM and 512 Gb ssd\nGood display quality , sound is also great\nbattery performance excellent\nLight weight and easily portable\nProblems - need to be careful with the hinge system",
            "So it arrived in 2 days, finally got it all set-up and ready. So far so good. The design, the colour and the asthethics are amazing. The performance seems great, SSD is from Intel. Every specification is exactly as mentioned. The model is just 2 months old. For long term review I'll have to use it for a few days, but till now it seems a great deal.",
            "Till now it is ok...but I will update a review again after use 3 months....",
            "Got it for - 39,990\nPerformance - is excellent\nDisplay - is great\nBattery - is ok ok u can get 4-5 hrs depending on usage\nDesign - is good, light weight\nOverall value for money deal around 40k\nTip : U can extend product warranty to 2 years by going through asuspromo.in website by paying rs - 99.0",
            "Value for money very thin and attractive",
            "Light weight...nice 🔋 backup, great performance",
            "Worst experience ever.\nNot expected this type of product.\nOn the first day screen gone. 👎\n\nWhen you have many hopes & expectation from your 1st new laptop & finally when you received the order and within a few minutes you come to know that the screen stopped working.....\n\n\"Never accepted this from Flipkart\"",
            "1. Design is some how looks cool.\n2. Battery is not good as expected.\n3. Fingerprint response on/off is terrific.\n4. Backlight brings eye catching look to laptop.\nI purchased 512 GB SSD at 40000 .",
            "product is Good working too fast due to ssd.....screen size is small but sexy.",
            "Frist of all I'm impressed with the design, however the trackpad is below average. Performance justify the price. No doubt you can go for this laptop with budget 40k",
            "At first , the screen showed some glitches ,but after the update its been working fine , although there were some cracking noise coming every once while using it ! But now noise frequency is minimal ! So overall its good , and what u want more in 40k .. i mean 512gb ssd , 11th gen i3 + fingerprint unlock .. its more than expected ! So i m good with the purchase !",
            "Battery is biggest issue apart from that this lappy is very light weight excellent performance on this range fast enough ...",
            "Microphone not working after 1 month don't know why but apart from this it is awesome and yes battery could be better",
            "The system gives solid performance...but its not for those who work while commuting, as battery backup is of around 5 hrs (normal use).",
            "After 10 days use....overall performance are good in this price 40K, but battery backup disappointed about 3 to 4hr...",
            "Purschaed for my girl and best part of this machine is it turns on within few seconds it boots up more quickly than my macbook...she is damn happy... thankyou flipkart☺️",
            "Good product💯💯",
            "overall good laptop\nThanks flipkart",
            "As compare to hp this is really better machine... Backlit keyboard, FHD screen, 512 ssd, 8 gb ram, premium body, narrow bezel sides, light weight, finger scan lock...Really lightning fast..You just touch the finger scanner and it will take fraction of second to Start Windows desktop.. Really awesome!",
            "Just awesome\nBest for students.",
            "Best one below 40k",
            "Works like a charm.\nLooking forward for years ro to come.",
            "Must buy for everyone",
            "It's a really good product.👌\nThis laptop is just awesome.",
            "Best in Performance Fingerprint Scanner Backlit Keyboard in this price segment Thank you Flipkart and Asus",
            "I have been using couple of week.its very fast..Take 4-7 sec to start and fingerprint is also very prompt, less than a second I guess. It comes with win 10 with MS Office 2019 and 1 year mcAfee.",
            "For Programmer this is very good. Recommended",
            "Perfect",
            "One of the best laptop I have, work smoothly and efficiently.",
            "Good",
            "Best",
            "Classic one...light weight and easy to handle",
            "Nice product and manages day to day operation well",
            "Before ASUS VivoBook, I using Dell laptop (i7 8 generation with 8 GB RAM).\nHonestly said--performance of ASUS Vibobook is much higher than my earlier laptop.\nVery light (1.4 kg), excellent look, mindblowing performance.",
            "Battery back up is not so great and heating very much.",
            "Value for money, good performance & screen quality. Sound quality is average. But very poor packing from the seller. My package had a dent on the corner.",
            "Amazing",
            "Fantastic laptop. It will take few seconds to reboot. Fingerprint unlock is awesome. Average battery backup. It will come around 3 hours for regular work.",
            "Good laptop for students but , when I power of laptop on after 4 to 5 minute",
            "Everything things looks great untill I don't monitored battery backup, it's only 3 to 3.5 hours on light use.\nI don't think I can watch a complete movie of 3 hours on this laptop.\nNot used any heavy app still battery drained too fast.\nTurn off backlit keyboard, on battery saver and for that they need their technician to visit. For battery issue what technician can do.",
            "It's good product at this price range . Very slim and size is like a4 page .",
            "Good ok",
            "Very comfortable and best performance for this price range.\nGo for it without any doubts🤟",
            "Slim and light laptop Performance was also Good.",
            "Very bad battery backup. You will hardly get 3-4 hour battery backup that too on battery saver mode. But everything else is very good.",
            "Dear sir\nThis product has not good as per some major issues like bettery Hiting issues and speakers not working properly",
            "Laptop is very good. Performance is upto mark. Only NO ethernet port which is bad.",
            "HEATING ISSUE. TO MUCH HEAT WHEN USING THIS LAPTOP. battry is also die early.",
            "After 8 days, not switching on. Don't buy this product.",
            "Nice product thank you Flipcart 🥳❤️",
            "Nice display\n4.5 h battery backup\nPortable\n14.inch (easy to carry) , lightweight\nbest for office work,coding & for beginners ..\nBest laptop in this range\nWith fingerprint also\nbut Microsoft has only word,excel,powerpoint for lifetime !!\n🤧🤧simply go for it!!!🤧",
            "Using this one for the last 3weeks...\nexecllent performance with the i3 11th gen processor\nworking on ssd feels smoothy\ndisplay is fantastic\ncamera quality decent\nspeakers are on average\nfingerprint works fast and perfectly\nbattery is good..not great actually\ndesign and looks are great\noverall..Worth buying",
            "Good one",
            "Awesome",
            "It is a good one, I baught it for 44000/- which is costly if you look 3 months before price, which was around 38000-39000. But as of now this is the best laptop in this segment and in this price.",
            "excellent performance",
            "Value for money",
            "Battery is really very weak... 2 -3 hrs only backup.. Rest everything is awesome..",
            "Overall the product is good ...but the packing from flipkart was not so good ...\nGood perfomance\nbattery backup not upto the mark\nExcellent backlight keyboard",
            "Nice one ☺️",
            "Must buy in offer better than i5 9th gen in this range..",
            "Nice",
            "Awesome performance and looks very premium",
            "Everything is better. But heating issues occurs",
            "Awesome .good laptop in this price range.little small but good .very fast performance.",
            "Not feel that much satisfaction, but it is not bad in that price range.",
            "Trust me in this price this is the best laptop ever.",
            "Just next level very very very vet very value for money",
            "Very good prodect but battery performance only good",
            "excellent product, must buy",
            "Well if you are looking for a laptop with media consumption and normal daily casual tasks then go fot it.",
            "good product, value for money",
            "Go for it gya",
            "Best in segment",
            "Good Laptop",
            "Running well",
            "Good enough at that price point",
            "Good",
            "Good Product but heavy software not working fine and filmora 9 use battery low very fast",
            "Nice look and feel. Speed bootup...finger sensor also fast",
            "Great laptop for coding and browsing with all the required specifications.",
            "At first , the screen showed some glitches ,but after the update its been working fine , although there were some cracking noise coming every once while using it ! But now noise frequency is minimal ! So overall its good , and what u want more in 40k .. i mean 512gb ssd , 11th gen i3 + fingerprint unlock .. its more than expected ! So i m good with the purchase !",
            "Just awesome for online class ,daily works.I have never played game,so can't tell about that,looks is great.",
            "I really Love this Laptop. Value for Money in all respect. I bought it after so much digging up through internet , and am happy to made this decision. (Putting this review after 1 week of purchase) . Thanks Flipkart & Asus. I think Asus has raised its standards with this product.",
            "Appearance is best\nFinger print is overall good\nProcessor is fast\nBut one prblm is that sound is low tried to work on it.\nAt this price range it is good enough!",
            "Very elegant design and handy one.",
            "Overall good under 40,000k",
            "Initially when i started booting it i felt like this laptop is wort 70k ,but\nReally good value for money\nDisplay op\nPerformance op",
            "Laptop was good enough for this range, but Flipkart delivery experience was very bad it takes 5day to deliver this...",
            "This is my first laptop that I purchase and that was really have excellent performance let talk about processor that was good all things are good",
            "Good product,exceptionally good speakers and IPS display.Will update if something goes wrong in long run.",
            "Best laptop in this price range and it is beast for students",
            "Satisfied",
            "All is well",
            "Product is so good 🧏",
            "Very nice. Very light weight, good looking and very fast.",
            "Good product\nPerformance was gud👍",
            "Works good, config are great at usage...",
            "Right now the product is worth for it. I am fully satisfied",
            "First impressions is best and look and design is nice.",
            "Super product I'm very much happy with this prodect value for money",
            "Design and build quality is excellent\nThanku flipkart",
            "Super",
            "Best laptop in this price.",
            "Its value for money product but battery backup 🔋 is not that much good .",
            "Excellent laptop for business users, eLearning students, and regular users not looking for gaming or programming laptops. i3 ensures longer battery and less heat and coipled with SSD and 8GB ram its impeccable for all regular use.",
            "Reviewing after 10days of usage. Keyboard is backlit and fingerprint sensor is lightning fast to log u in. Sound is decent. Came with Windows 10 Home. Charger is a compact one and u do not get anything else in box. I use it for online classes and college works.",
            "I gpt it at 39990 because its has all the features that u need.\nShop recommended u about hp,the cost of hp is higher 7k-8k in this features.go for asus its performing really well,i love the design,features,configuartion,colour.\nBoot time is 2-3 secs",
            "Best laptop I bought for the money it comes in.",
            "Laptop is slim and nice looking. Performance also good. But better if screen should be 15.6 inch. In 14 inch looking small",
            "Fabulous\nNice product\nBattery is also decent\nAll over good",
            "Very good Asus Vivo Book Ultra 14. Like to use. The storage device just ssd c drive show. But not as slim as I thought.",
            "Asus vivobook ultra 14 is better than expected product. Audio quality is super thanks to harman/ kardon. Camera is really HD. Fingerprint sensor is so fast. Backlight is awesome. Super fast OS.Overall a 5* product undoubtedly. Also got windows 11 update within a week.",
            "Product is Very worth full and reliable.",
            "Nice Laptop. Good battery and better performance.",
            "perfect",
            "Very nice product. Low weight suitable for easy carrying. Very handy for office work",
            "Dont buy this after 3 months iam facing these problems.\n1)battery over conconption\n2)over heating\n3)display glaring\n4)high sound by fan inside the laptop\n5)somtimes disconnecting to wireless headphones\nI waste my 45k😫😓 better to go hp or lenovo",
            "Wow good performance for my requirement...loved it..best in this price",
            "Loved it",
            "Amazing looking laptop, I think love of first sight I just saw colour of the laptop, now I am proud of my choice this laptop is amazing for looks, for performance, fast SSD , fast touch pad etc perfect!!!",
            "This is very good product in this rate very good display, battery is good and performance is better\nNice this product for students and office works",
            "I'm very happy with the product and deal was great I happened to get it for 39k of 8gb variant and I'm happy so that I can gift it to my father and he is absolutely happy with it ..",
            "Superb quality 👍",
            "very fast booting ,good for every day office work ..sound is too low..but sound quality is very low.i am very satisfied..",
            "First product through my first salary......value for money,,🤗",
            "Fingerprint is not working properly I hope it will fix with an update\nBateery backup is 5 hours on heavy use\nPerformance good\nOverall good experience till now 👍",
            "Good",
            "Great laptop at this price range",
            "Product was good..",
            "Good one for value",
            "search option not working... battery says 10 hr but coming for 4-5 hr with office work...",
            "First look awesome this product very premium and your hand and I love to use it disappointed with the battery",
            "Product all over good but bettery is little bit poor, performance also to much good",
            "Perfect Laptop\nvalue for money",
            "This product was damaged and does not come with a proper display. Please avoid buying from this seller. Waste of both money and time.",
            "Good Quality And Best Performance",
            "Really Good.. Antivirus not good enough. Otherwise this is superb ..",
            "Excellent experience. Superfast booting. Value for money",
            "Superb one.\nIt's really thin and has lesser weight, so very comfortable to carry anywhere.\nAverage performance and average battery.....\nOverall worth the price.....",
            "Good product",
            "Its good for the price....and do's all the work.....not if you are gaming....2015 and behind games work fine",
            "Performance is good but battery performance is not better.",
            "Super",
            "It is really a good lappy. Such a slim and sexy look it has . I really love it",
            "Laptop display is making issue while moving hinges",
            "Superfast laptop, but screen was small but ok, light wt.",
            "It was a good laptop.\nQiute fast SSD.",
            "Superb one.\nGo grab it.",
            "Best performance🤑🤑",
            "Awesome",
            "One of the best laptops at this budget. I got this for 44000 Rupees and it's the best in segment. If you have budget around 40k then this is the best product for you. I researched a lot about laptops and finally landed on this one.",
            "Worth for money",
            "Awesome in all aspects after 15 days of use just one thing that dedicated num key is not there rest all is superb",
            "Dear all,\nMy point of view\n1.Performence-5\n2.bettery-3\n3.display-5\n\n*Need Improvement on SSD Partion, it have a single partition which not need. actual need at list two partion.",
            "Nice.",
            "Display looks amazing and compact size laptop",
            "I Loved it",
            "Everything is good in this price range as compared to other brands but the cheap plastic body that should be changed by the brand.",
            "Very nice product. Great value for money",
            "Excellent performance, lightweight laptop with very good battery life. The 3 year Asus warranty program would be a good idea considering SSD. The size is similar to HP elite books which come with smaller screens",
            "Camera not working after 3 days only.",
            "Great project",
            "Pathetic battery backup",
            "slim and light weight laptop too campact.....\n.\n▶️PROS:-\n-Light weight\n-Easy to carry\n-Performance is Outstanding 👌\n..\n▶️CONS:-\n-Battery drains too fast\n-Heat too much but becomes cool fast too.\n-Brightness is little bit low but Okay..",
            "I am very happy with this product. You won't regret after buying it. Value for money.",
            "Laptop is very good for this price point I got it at 42,000 .battery should have been better although overall it's a good laptop when compared to hp at this price it offers better configuration .",
            "One of the best option at this price range",
            "Asome product.\nNice build quality\nDescent bettery backup\nGood processing speed\nLess boot time\n\nOver all quite interesting deal. Go for it if you're avarger user.",
            "Fabulous\nreviewed this after three months of usage\nNice laptop at this price\nPros\n1.display\n2.8 gb ram and 512gb ssd\n3.build quality\nCons\nBattery backup is 4 hours only",
            "I am using lenovo 14 inch i3 8th gen 8gb RAM 256 SSD and comparing this model of Asus with it:\n\nPROs:\n\n1. Performance\n\nCONs:\n\n1. BATTERY : Only 2 to 3 hrs at max which is great disappointment at this price point. The claim of \"Long Lasting Battery\" is just absolute FALSE.\n\n2. SCREEN : it has little yellow tint and looks very dull.\n\n\nConclusion: Not at all worth at this price point. Go for HP",
            "The looks and the feel is spot on thought the processor is a lit on the slower side but it is value for money..\n\nAfter a month of usage- the laptop starts in less than 9 secs which is commendable. It offers 3 fan speed mode for better performance and you would hear absolutely nothing even during heavy usage.\n\nThe battery lasts about 5 hrs with backlight on and moderate usage which is a bit low but it's still absolutely worth it.",
            "Delivered two days before. Finalized hp i3, 257ssd, 8 gb, initially. But this laptop blowed away HP. What a masterpiece. Hope it doesn't lag in heavy programming. Though it looks a bit smaller than in picture, it's very thin and elegant. Go for it when price is around 40k.",
            "Best in class and budget!!!",
            "Just awesome go for it\n\nI got it for coding and it's sensible 🥶🥶",
            "Good laptop for students",
            "Penning this down after 1 week of usage ...\nPerformance is good sound is good and I loved it .\nThe product is upto my expectations ❣️",
            "Since using 3 moths. Value for money. Sound and video quality is great and suitable for multitasking. Slightly heavy for graphical work when using Adobe software. Recommend for beginner users.",
            "Nice performance, in this budget very good features laptop. I am recommending to everybody for this one. Really I am happy and satisfied. Value for money and fast delivery service. Thanks Flipkart",
            "Good laptop from Asus in this price point. Speaker loudness and battery performance could have been better",
            "Nice product....",
            "value for money!",
            "Very fast",
            "Best laptop"
        ],
        "likes": [
            "184",
            "308",
            "58",
            "34",
            "24",
            "24",
            "47",
            "33",
            "46",
            "64",
            "9",
            "18",
            "8",
            "12",
            "12",
            "4",
            "3",
            "3",
            "18",
            "7",
            "8",
            "6",
            "10",
            "4",
            "3",
            "4",
            "2",
            "2",
            "2",
            "2",
            "1",
            "0",
            "0",
            "1",
            "2",
            "2",
            "2",
            "2",
            "0",
            "1",
            "35",
            "52",
            "16",
            "16",
            "7",
            "15",
            "7",
            "16",
            "9",
            "5",
            "6",
            "8",
            "18",
            "5",
            "4",
            "8",
            "1",
            "7",
            "3",
            "3",
            "3",
            "3",
            "3",
            "4",
            "3",
            "3",
            "3",
            "3",
            "3",
            "5",
            "3",
            "3",
            "3",
            "2",
            "2",
            "2",
            "5",
            "8",
            "5",
            "2",
            "1",
            "2",
            "2",
            "1",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "2",
            "2",
            "3",
            "3",
            "16",
            "3",
            "2",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "17",
            "59",
            "16",
            "10",
            "6",
            "4",
            "9",
            "14",
            "6",
            "14",
            "2",
            "1",
            "0",
            "2",
            "2",
            "0",
            "0",
            "0",
            "14",
            "2",
            "5",
            "3",
            "8",
            "2",
            "3",
            "3",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0",
            "2",
            "2",
            "4",
            "0",
            "0",
            "7",
            "1",
            "2",
            "0",
            "2",
            "0",
            "3",
            "1",
            "0",
            "0",
            "1",
            "5",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "3",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "2",
            "26",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "1",
            "1",
            "2",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "5",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Does it come with MS office, is it trial version?",
            "Q:Which variant is better Dreamy White or Bespoke Black ?",
            "Q:We play GTA v on this laptop on medium graphics reply fast",
            "Q:Can we upgrade the ram like is it soldered or detachable?",
            "Q:Does it heats up and hows the battery life in general?",
            "Q:Is this have webcam ?",
            "Q:There is an image showing this have mx330 2gb nvidea graphic card...but in the details section it's not showing??? Clarify that",
            "Q:Can I play BGMI in this laptop??",
            "Q:Can I use while charging?",
            "Q:Can i get laptop bag with this",
            "Q:When this latest model launch in India",
            "Q:CanI play Free fire init?",
            "Q:Can i connect creative 5.1 wired sound system by this laptop?",
            "Q:Is it touchscreen?",
            "Q:What is the battery life ?",
            "Q:Does it have inbuilt web came...?",
            "Q:Can we upgrade RAM?? Some videos showing we can't need answer from seller",
            "Q:What is the key travel of this laptop?",
            "Q:Is this laptop looks too small in compare with 15.6 inc laptop?",
            "Q:How many colours in this",
            "Q:Is i3 replaceable with i5",
            "Q:Can I Play Cricket 19",
            "Q:What about upgradibility of RAM and storage about the laptop? If yes then how much?",
            "Q:Does it have ips display?",
            "Q:Is it 64 bit or 32 bit?",
            "Q:Does it support only Wi-Fi 6? What about older Wi-Fi versions, Does it support all these, For Example 802.11n/g/b?",
            "Q:It has simcard slot?",
            "Q:Windows 11 updrade in this leptop?",
            "Q:What is the maximum ram support after upgrade",
            "Q:Does this laptop have anti glare screen ?",
            "Q:Bluetooth is available or not",
            "Q:Is there one 8gb ddr4 ram or two 4gb rams?",
            "Q:Can we upgrade ram What is the maximum support ram?",
            "Q:Ok s facial recognition avaible",
            "Q:Which company ssd is there Samsung or any other brand ?",
            "Q:Can we upgrade the ram upto 16 gb",
            "Q:Is this laptop come with NVMe M. 2 SSD?",
            "Q:It is having editing Apps",
            "Q:What is screen dimension Of Asus vivobook ulitra 14?",
            "Q:Is HDD available?",
            "Q:Does this laptop has hinge lift?",
            "Q:Can I do Coding In this lap..",
            "Q:Ms office for lifetime?",
            "Q:It have a extra slot for SSD",
            "Q:It has metal body or plastic",
            "Q:Wether ram & ssd is upgradable or not????",
            "Q:It has backlit keyboard light?",
            "Q:it has backlight keyboard or not?",
            "Q:What is battery backup time",
            "Q:Can i extend ssd to 1 tb",
            "Q:Which is better i3 or i5..... both with same specifications.... Plz reply fast",
            "Q:battery will be drained so fast is it real?",
            "Q:Is Ms office valid lifetime",
            "Q:May I use it for Auto cad and 3D max ??",
            "Q:Has it not camera?",
            "Q:Built of this laptop? Metal body or plastic body?",
            "Q:Ssd included or not",
            "Q:Is it gaming laptop if this laptop is not gaming laptop so decent game can play like pubg lite.and asphalt etc.",
            "Q:Does it have fingerprint sensor for open or far?",
            "Q:does it comes with genuine windows 10 OS?",
            "Q:Can we add sdd in this laptop in future to increase the memory ?",
            "Q:How much gb graphic card is available in this laptop",
            "Q:Can I ply pubg lite in this laptop",
            "Q:It is come with ms office?",
            "Q:Is hinge/led move to 180 degree??",
            "Q:Can I use for Android development on this laptop?",
            "Q:Can we upgrade Ram because I did not found any related information belong to it ?",
            "Q:How is its speaker?",
            "Q:Will there be any problem because of screen size I mean if some software doesn't support because of small screen?",
            "Q:How's the sound quality?",
            "Q:Can we use both ssd and hdd",
            "Q:Can I use wireless mouse and wireless keyboard togther",
            "Q:It has LAN cable",
            "Q:Can we upgrade ram? If yes then what's the limit?",
            "Q:What is the Ram frequency in this model",
            "Q:Is bespoke black and dreamy white are the same laptops having same specifications or they both are completely different laptops? Suggest please its very urgent",
            "Q:This laptop comes with antivirus or not",
            "Q:Can I do heavy coding",
            "Q:How to activate mcafee software .",
            "Q:Is this laptop durable? Can anyone share their experiance with it. I am expecting it to be useful for atleast 4 years.",
            "Q:Can i add any extra hard disk??",
            "Q:Can I use it for online classes in zoom and ms teams app...????",
            "Q:It can be used for coading?",
            "Q:Can i do CDA software in it?",
            "Q:Dedicated graphic slot is available in this laptop?",
            "Q:Mouse on and off option not",
            "Q:Can I run visual studio community ?",
            "Q:Is Ram is unbearable ?",
            "Q:Does this laptop have screen cast options",
            "Q:How is the built quality of this laptop.",
            "Q:Does it have ethernet port?"
        ],
        "answers": [
            "A:MS Office Home and Student 2019 is pre-installed. The same can be activated from any MS Office App like Word etc.",
            "A:both are same ... just the outer color is different... I my opinion , Which one is in low price at the time of your order you would buy that",
            "A:yes but on lower graphic because it has dual core and the gta v is such a heavy game. i prefer you go for i5 10th aur Ryzen 5 3600h or 3600U WITH graphic card",
            "A:it's detachable",
            "A:a little bit but on heavy usage, battery backup is about 3-4 hours",
            "A:yes",
            "A:Nope, no dedicated graphics card. Only intel inbuilt graphics!",
            "A:Yes, you can do so with ease...it is not a demanding game and all you need is atleast 4gb ram coupled with 5gb free disk space.",
            "A:yes , but i prefer not to do this normally because it would eventually decrease the durability of the battery life in long term",
            "A:No you can't. U will get packed seal.",
            "A:This is the latest model launched in 2021",
            "A:yes",
            "A:Yes ofcourse you can",
            "A:No.",
            "A:heavy use 5-6hours",
            "A:yes",
            "A:No",
            "A:2 kilometers",
            "A:yes..and it can't support many software because of small screen",
            "A:usually one is only available, dream white. but it looks amazing",
            "A:Should be replaceable with addition price difference",
            "A:yes ofcourse .",
            "A:yes you can upgrade ram upto 32gb and also add hdd and SSD is also upgradable",
            "A:14 inches",
            "A:64 bit",
            "A:support older version toooo",
            "A:No, it has micro SD card slot",
            "A:yes",
            "A:16gb",
            "A:yes",
            "A:yes",
            "A:One 8 gb ddr4 ram",
            "A:yes it is upgradeable. 16 Gb you can extend",
            "A:no",
            "A:any other brand",
            "A:yes",
            "A:Yes",
            "A:It is not for editing, this is best for medium level use",
            "A:14 inch",
            "A:It's full SSD laptop",
            "A:no",
            "A:iam doing HTMl, css, js, django, python, sql in my lap, bro mulitasking laptop bro",
            "A:Only word ,excel and Power Point is for lifetime",
            "A:yes",
            "A:Its plastic, but a a good quality one. Laptop certainly doesn't feel cheap.",
            "A:yes",
            "A:Yes",
            "A:Yes it has a Backlight keyboard",
            "A:3.5 to 4 Hours.",
            "A:Yes",
            "A:i5",
            "A:not good as expected... will get around 3 to 3.5 hours",
            "A:yes",
            "A:Absolutely.",
            "A:Yes, it does have a camera..the quality though isn't that great..but it gets the work done.",
            "A:Polycarbonate",
            "A:Yes, it has 512GB SSD.",
            "A:it's not gaming laptop. but you can Play light game",
            "A:yes it has fingerprint sensor on upper right side of touch pad and it works very well..",
            "A:yes,it comes with genuine windows 10",
            "A:yes i has emply 2.5 inch sata slop for ssd",
            "A:Integrated graphics available",
            "A:Easily",
            "A:Yes, MS Office 2019",
            "A:no",
            "A:yes you can do it",
            "A:No, it doesn't have extended memory slot",
            "A:Speaker are also compact as laptop is compact....but sound quality is good .... Speaker can do whatever it supposed to do...no sound issue",
            "A:no...there shouldn't be any issue.",
            "A:Very good",
            "A:only SSD",
            "A:yes,u can use both without any issues.",
            "A:Yes ,it's having LAN Port",
            "A:Yes 1tb ssd",
            "A:Availabe physical memory 3754mb, total physical memory 7885mb",
            "A:it's not complete different but look vise definitely it's different.",
            "A:Yes it comes wid antivirus",
            "A:Yes ....",
            "A:Actually it’s free of cost. First you have to open mcafee app and sign up using your email id or any other dtls. Its pre installed on your device. No need to download any application",
            "A:Yes of course 😃",
            "A:No",
            "A:Yes, you just need to install the Team or Zoom software which is free as well. My kids are using both if these in the Vivobook.",
            "A:Yeah you can use it for coding.",
            "A:as it doesn't have a CD-ROM hence I don't think you can install CDA softwares",
            "A:no.",
            "A:Yes available",
            "A:offcourse",
            "A:For normal internet surfing and bacis task like MS Office works fine",
            "A:yes",
            "A:average",
            "A:No"
        ],
        "likes": [
            "16",
            "9",
            "15",
            "3",
            "6",
            "9",
            "5",
            "2",
            "2",
            "3",
            "3",
            "1",
            "1",
            "1",
            "2",
            "2",
            "0",
            "2",
            "3",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "19",
            "71",
            "44",
            "38",
            "34",
            "20",
            "30",
            "14",
            "6",
            "10",
            "14",
            "4",
            "3",
            "4",
            "3",
            "6",
            "12",
            "3",
            "3",
            "2",
            "3",
            "3",
            "3",
            "1",
            "2",
            "1",
            "1",
            "2",
            "2",
            "1",
            "2",
            "1",
            "3",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "5",
            "3",
            "7",
            "1",
            "1",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "10",
            "0",
            "2",
            "10",
            "21",
            "8",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "14",
            "7",
            "6",
            "5",
            "3",
            "7",
            "4",
            "0",
            "3",
            "5",
            "0",
            "0",
            "0",
            "0",
            "1",
            "6",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "17",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    }
}