{
    "title": "ASUS VivoBook Ultra 14 Core i3 10th Gen - (4 GB/512 GB SSD/Windows 10 Home) X413JA-EK267T||X413JA-EB302T Thin and Light Laptop  (14 inch, Bespoke Black, 1.40 kg)",
    "product_specification": {
        "Sales Package": "Laptop, Power Adaptor, User Guide, Warranty Documents",
        "Model Number": "X413JA-EK267T||X413JA-EB302T",
        "Part Number": "90NB0RC7-M03600||90NB0RC7-M05340",
        "Series": "VivoBook Ultra 14",
        "Color": "Bespoke Black",
        "Type": "Thin and Light Laptop",
        "Suitable For": "Processing & Multitasking",
        "Power Supply": "45 W AC Adapter",
        "Battery Cell": "3 cell",
        "MS Office Provided": "No",
        "Processor Brand": "Intel",
        "Processor Name": "Core i3",
        "Processor Generation": "10th Gen",
        "SSD": "Yes",
        "SSD Capacity": "512 GB",
        "RAM": "4 GB",
        "RAM Type": "DDR4",
        "Processor Variant": "1005G1",
        "Clock Speed": "1.2 GHz with Turbo Boost Upto 3.4 GHz",
        "Cache": "4 MB",
        "Graphic Processor": "Intel Integrated UHD",
        "Number of Cores": "2",
        "OS Architecture": "64 bit",
        "Operating System": "Windows 10 Home",
        "System Architecture": "64 bit",
        "Mic In": "Yes",
        "USB Port": "2 x USB 2.0, 1 x USB 3.1 Type A (1st Gen), 1 x USB 3.1 Type C (1st Gen)",
        "HDMI Port": "1 x HDMI Port",
        "Multi Card Slot": "Micro SD Card Reader",
        "Touchscreen": "No",
        "Screen Size": "35.56 cm (14 inch)",
        "Screen Resolution": "1920 x 1080 Pixel",
        "Screen Type": "Full HD LED Backlit Anti-glare IPS Display (250 nits Brightness, 45% NTSC Color Gamut, 16:9 Aspect Ratio)",
        "Speakers": "Built-in Speaker",
        "Internal Mic": "Built-in Microphone",
        "Sound Properties": "Audio by ICEpower, Harmon/Kardon Speaker",
        "Wireless LAN": "IEEE 802.11ax (Wi-Fi 6)",
        "Bluetooth": "v5.0",
        "Dimensions": "324 x 215 x 19.1 mm",
        "Weight": "1.40 kg",
        "Disk Drive": "Not Available",
        "Web Camera": "720p HD Webcam (Without Privacy Shutter)",
        "Finger Print Sensor": "Yes",
        "Security Chip": "TPM",
        "Keyboard": "Backlit Chiclet Keyboard",
        "Backlit Keyboard": "Yes",
        "Pointer Device": "Touchpad",
        "Included Software": "My Asus, Splendid, Tru2Life",
        "Additional Features": "Li-ion Battery",
        "Warranty Summary": "1 Year Onsite Warranty",
        "Warranty Service Type": "Onsite",
        "Covered in Warranty": "Manufacturing Defects",
        "Not Covered in Warranty": "Physical Damage",
        "Domestic Warranty": "1 Year"
    },
    "product_description": {
        "Work, Play, and More": "The ASUS VivoBook Ultra 14 is a stunning and powerful personal laptop with multiple attractive features, including the color-blocking Enter key. Powered by an Intel processor, this device lets you do various everyday tasks with ease.",
        "Color-blocking Enter Key": "This design feature ensures that the Enter key is highlighted and easily visible.",
        "NanoEdge Display": "The VivoBook Ultra 14 features a NanoEdge display that offers a big screen on a small frame. Hence, you get uninterrupted, immersive visuals without distractions. Also, the Full HD display along with wide-viewing angles and impressive colour reproduction delivers vivid and lifelike visuals.",
        "Light and Portable": "With a weight of about 1.4 kg and a thin profile, this laptop is easy to carry along.",
        "High Productivity": "Powered by an Intel processor, high RAM capacity, and PCIe SSD memory, this ASUS laptop helps boost your productivity.",
        "ASUS Intelligent Performance Technology": "The AIPT is a thermal design as well as a power-saving solution that ensures that this device delivers energy-efficient performance. By using exclusive ASUS algorithms, about five to nine smart sensors, and an aerodynamic IceBlade fan design, this technology intelligently improves the CPU performance while maintaining stability, long battery life, and quiet operation."
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "3",
            "3",
            "4",
            "5",
            "4",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "1",
            "3",
            "4",
            "5",
            "5",
            "5",
            "1",
            "4",
            "4",
            "2",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "2",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "4",
            "3",
            "1",
            "5",
            "1",
            "1",
            "4",
            "5",
            "5",
            "5",
            "2",
            "4",
            "5",
            "5",
            "5",
            "1",
            "1",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "3",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "3",
            "5",
            "1",
            "1",
            "1",
            "4"
        ],
        "review": [
            "I was in confusion before order, when I received my lappy really loved it. Asus should we go this, yes of course in this process segment fingerprint unlock, compact design, backlit keyboard and superb display etc.. I really like my asus app for getting my laptop updated and healthy. Fast Charging is available. Battery i have not checked but fine decent packaging fast delivery thanks flipkart.",
            "After using 15 days I would say product is good to buy.\n1. Sleek design.\n2. Light weight.\n3. Good battery backup.\n4. Good performance according to configuration.\n5. Sound and display is average.\nHowever my experience with flipkart is horrible but rating is given here to product - Asus Vivobook X413JA. I found it value for money and would suggest to go for it.",
            "Best compact laptop but build quality is not metalic!\nBattery backup is good sound quality is descent and display is very bright 250nits",
            "Excellent performance\n1.nvme m.2 ssd blazing speed\n2. Light weight\n3. Compact design\n4. Touch pad and finger lock feel like mobile touch and many features include\n5. Decent battery backup",
            "It is as I expected. Light, sleek, compact and decent quality. I really like its white colour glossy finish.\nI recieved this on 8.03.2021 in 36240 rupees.\nAnd I think in this price range no product exist today. And its specs are awesome.",
            "Worth purchase for students and who have just lite work .Everything is top notch except the battery I can't say its worst but it is less then the other laptops which are available in this price segment.",
            "This is nice laptop and performance are very smooth and looking is very pretty this is a light laptop and i got this in diwali sell and price this laptop 32737 and battery backup around 4to5 hour\nThis review after 8 days",
            "The laptop is thin and handy.. due to SSD booting speed is around 6 seconds. The ms office key is not included. Processor fan is close to display ,so you will feel warm .\nBacklit keyboard is advantage. I dont see in any other model under 38k.\n\nBrought it for 33250 including bank offer and serve the purpose.\n\nIf you look for a stylish ,handy and daily use laptop..go for it . !!",
            "After one month of use ASUS VIVOBOOK 14/15 i3 core laptop value of money and good performance.\nIn this laptop there is baklit keyboard, which gives good typing experience in night and a finger prit reader for the security.\nThere is 14\" antiglare display and tracked is also good and fast.\nThis LAPTOP is good for daily work and also for student..\nNumber of ports:-\n1 HDMI\n1 Charging port\n1 USB type C\n3.5mm earphone jack\n1 memory card reader\n3 USB type A",
            "Camera quality of this laptop is very bad. It is like 1990's camera with lot of bubbles. Even the a 5K mobile will have better camera. If you are planning to use this for video calls as a presenter, then this is not the choice.\n\nAlso the customer support is very bad, not able to connect with them through call or chat properly.\n\nApart from this all other features are good",
            "My Lappy....\nDREAM COMES TRUE",
            "Its light, looks sleek, display is awesome (it gives you those matte screen vibes) and performance depends on your usage. If you are a student, perform basic coding and need a laptop for your school/college assignments (ppt, doc etc.) under 40k which comes with a BACKLIT keyboard!! Just go for it!!\n\nNow coming to your main concern, is 4gb ram enough?\n1st, yes! It is enough, if you are not editing videos or playing games ( it's not a gaming laptop tbh)\n2nd, you can increase the ram upto 12 gb. Yup!! It comes with a second slot. So, if you feel like you need to increase the ram, buy one (2,4,8 according to your need).\n\nNow, about the battery backup. It's about 3-4 hrs if you are performing a lot of tasks. Kinda disappointing┐(￣ヘ￣)┌\nBut it's fine if we look at the price we are getting it.\nOther two cons:\nNo MS office ( they have already mentioned)\nSlows down if you install skin (〒﹏〒)",
            "Best Laptop in 35k.. Looks premium and attractive.\n\nPros:-\n(1) It comes with 14 inch Anti Glare Ips screen... Which u can not found in any laptop in this price segment.\n(2) premium design, Good build Quality.\n(3) Best combination of Windows 10th gen with 512gb makes working super smooth.\n(4) Hermon Cardon spekars are not so much loud but pleasent to hear...\n\nCons:- Battery... It has almost 4 hrs battry backup with medium brightness level.\nBuild Quality:- Build quality can be more better as compare to HP Brand laptops.\nRest is fine... A Good deal in 35k.",
            "First I was very confused which laptop I have to purchase. As I am master's student so I have to do a lot of assignments and presentations. I was searching a laptop which is good enough for all the parameters light weight, fast, good design, decent memory. As I am not a heavy user. For my type of persons it will be best & it is unbeatable. Because 1TB HDD can not beat 512 GB SSD & SSD is very fast as compared to HDD. Laptop boots in just 7-8 Seconds. Best feature is fingerprint sensor. It is best in its class no company is offering it under 40K. Secondly it have backlight display which appears very beautiful while working in night. Other features includes its weight that is very very light. Hardly equal to a medium size book.\nI will give you premium and decent look when you will saw it to anyone. Although battery is average but not a hurdle. I think it is best laptop for study. You will find everything good in it. It somewhat gives you feeling of MacBook. You will lack MS office which you can easily get online or anywhere else. One also very good feature it have its speakers i.e. Harmon kardon which is parent company of JBL & it have inbuilt antiglare night display which will be good for everyone.",
            "Best laptop for students and working professionals. Finger print sensor is just awesome. Decent battery life. If you are looking for a laptop for regular office works or if you are a student, then you can go for it. But, I've not played heavy games yet.",
            "Good product by Flipkart and it work so fast and smooth.\nBattery Backup upto 6 hrs with Internet + Display on use.\nOverall it was a awesome product by Asus.",
            "Wonderful, nice product.\nPros =\n1. Wonderful design & build quality\n2. Smooth & fast performance\n3. Nice Display\n4. Backlit & smooth keyboard\n5. Light weight\n6. Surprisingly super fast fingerprint sensor\nCons =\n1. This type of blue color. I personally like blue color, but not this cobalt blue. Peacock blue is more attractive than this. I recommend black color of this model.\n2. Microsoft word /excel not included, only 15 days trial pack included. This is disgusting.\n3. This model comes with harman/kardon sound effect. But honestly I don't understand the difference of sound quality compare to a ordinary sound quality laptop, both like same. No option or app for harman/kardon sound effect.\nOverall this is a nice & good looking laptop for medium work.",
            "1.Elegant design, light weight , performance is good.\n2.Harman Kardon audio is very good but no difference with sonic master or other.\n3.Average or say below average camera- maxi 0.9mp HD camera but better than other brand(in other brand generally 0.3 mp hd cam) at similar price range.\n4. Battery : max 4 hrs to 4 & 1/2 hrs backup\n5. Very attractive coloured Enter key. Like a sweet smile of that girl of a classroom who attract everyone eyes.\n6. Keys are soft to press but touchpad left and right click key sounds which I dislike.\n7. Black color is awesome. General use Lappy.\nOther detail ,I will post later\n\nKind atten: Flipkart : Please improve your delivery , I got this in 15 days.",
            "The product is amazing and this product is delivered today and i am software engineer and i have a lot of works such as compiling the project and much more work so this is faster for compiling the project dont escape for gaming performance.,,,,",
            "I ordered the cream color version but got the black one...(one star less for that)\n**Battery backup is averege\n**Display is awesome considering the price\n**Sound output is really good\n**I assumed it a bit faster in processing before purchasing it(my personal experience)\n**Built quality could have been better\n**Have some handy features (one can insert sd card without card reader and so on.....)\nOverall its a balanced Laptop for students and I got it at 36890",
            "I have got this for my wife and its perfect for her light usage.\n\n1. i3 10th gen is around 6% slower than i5 8th gen.\n2. nvme m2 sdd is an plus.\n3. small, sleek light, just like a notebook it can fit in your bag.\n4. Harman Kardon (:D) okay, this branding is good for satisfaction. You will not find any much difference when compared with sonicmaster.\n5. silent machine.\n6. that yellow return key is an added advantage (you know, Girls :p, that is what her colleagues noticed first)\n\nPeople demotivate you for buying an Asus. so why did I get one?\nAnswer is simple, Personal experience.\nI am using ROG Since past 2 years,\nI got its main board blown due to moisture in just 2 months. (due to my mistake, I kept it packed in its box in the cupboard after usage. NEVER DO THIS.)\nI just contacted Asus Support, I got my board replaced hassle free.\nOption to Avail service onsite or carry in.\n(My experience applies to Pune's service center, Data care corp. in deccan )\n\nNote: If you requirements are slightly moderate to heavy, then you should not go for systems with i3, or else you will end up complaining.",
            "*Product quality:*\n\nBooting Process: Very fast\nBattery: 5-6 hours constant working without charging\nDisplay: Good\nSound: Not loud but clear and sweet to listen.\nBacklit Keyboard: Unbelievable at this price.\nTouch pad: Smooth\nHeating issue: NO\nCamera: Sufficient at this price.\nPorts: Mainly now a days we all work through USB PORTS. It comes with two USB ports, which is sufficient.\nStorage: It comes with 500GB SSD, in which approx 400GB can be use as personal storage. Rest storage will use for Application software and OS.\nOperating System: PRE INSTALLED Windows 10 Home Single Language.\nMS OFFICE: NOT PRE INSTALLED. Original version is highly recommended to purchase.\nAntivirus: NOT PRE INSTALLED. I am using MCAFEE purchased version. Running good.\nProcessor: Intel(R) Core(TM) i3-1005G1 CPU @ 1.20GHz 1.19 GHz\nInstalled RAM: 4.00 GB (3.70 GB usable)\nWeight: Light weight\nDesign & body color: Decent and cool.\n\nRating: 4.6 OUT OF 5\n\n*Product performance on official works:*\n\nFor official work purpose (excluding video editing or any photo editing / media editing) the performance is outstanding.\nIf you work on MS OFFICE, EMAILS, WEB SURFING, Media Player, Messaging application at a same time then also it will provide a excellent performance with Zero percent hanging issue.\n\nRating: 5 OUT OF 5",
            "The laptop is very handy and light weight. I have used it for around 10 days and it is working perfectly fine. The battery is not that good, when I have used it for online class and switched on the video, in full charge it gave back up of 2 hour only, whereas if we use it normaly for typing watching movie or pdf reading the back up was about 3:30 hr. Overall I am having good experience with the laptop.",
            "I have got this few hours back. The packing was awesome. These features and price is juz a fab combo.the nly thing is u can't upgrade ram. This is perfect for basic users like me. I mean for small programmings n codings. This is not a gaming laptop. This is perfect for average and below average users.",
            "I can tell u exactly that it is the best laptop under 40k . It has all the features a nrml laptop should have. Amazing design and display. Loud and clear sound. Powerful system with no lag. Good battery and charging. Well suited best for me bcz i do online classes and got it with offers in 37k.",
            "Products is very awesome in this price. But battery running time is approx 4-5 hours display is also good . Flipkart deliver this product is delay 2 day after promise date is 18 day . flipkart is very poor delivery service so not buy any product very important and fast needed on flipkart",
            "The laptop features a core i3 processor with 4GB RAM that handles the tasks quite swiftly. Overall a good buy.\n\nPros:\n1. Handy\n2. Lightweight and portable\n3. Good build quality\n4. Good performance in the budget range\n5. Good battery life (around 5 to 6 hours)\n\nCons:\n1. Display (although it claims to be an IPS panel, the viewing angles are not good and the display looks pale)\n2. Speaker quality is not good out of the box (although it can be modified and tuned later through Asus AudioWizard app that is provided in built)\n\nOver the current shortage in the stocks of laptops, this can be considered a good buy at 36990.",
            "1) Display is ok. Viewing angles are not too good not too bad. Under 40k it is good.\n\n2) Battery is not good. Don't expect it to last more then 3 hrs. Charging takes almost 3 hrs from 15 %.\n\n3) Performance is good. Ssd is too good. Boot up timing is less then 7 sec. Performance is also good for normal day to day usage.\n\n4) Camera is ok . Under good light it is better then the rest under 40 k\n\n5) Sound is not loud enough. But the quality is good.the tuning is good.\n\n6) Build quality is good.\n\nOverall good buy under 40k .",
            "Item has been delivered on 25th. Editing it after 5 days.\nEven though it is i3, it works pretty good.\nThe only con i feel is its top portion always get dirty and our finger marks remains there like oily. And a Little low brightness.\nThe display and perfomance is pretty good. But feels like too small laptop, because it has narrow side and all. But it is light weight\nFingerprint sensor is pretty good.\n\nThe webcam is too worse, very noisy and reddish. It is 0.9 MP cam and it is very worse.\n\nOverall 7.5/10\n\nIf you want to go for work purpose, study etc.. go for it.\nNot recommend for entertainment, gaming etc...",
            "I m writing this review after 2 days usage , Nice product only good for low to moderate usage , battery backup is also good 5hrs (non-stop) usage , Best for commerce student and office purpose . Don't opt this laptop for video editing ,coding as well gaming .",
            "Extremely compact product. The back lit keyboard is pretty amazing. The keys are very well laid out. The battery back up is decent too. The fingerprint sensor works very well .\nThe SSD makes the computer really fast , which is a huge plus.\nDefinitely recommend if you are on a budget.",
            "Really a good product\nI felt every feature is ok or good at this price segment\nIm only disappointed with the size(13\"),and its a personal matter only... Else it is very compact and easy to handle.. Worth for the money",
            "This product is good but due to misinformation, it is not getting attention. first of all this is asus vivobook 14 model. now talk about specification.\n\nHere is some differences from others\n\nDisplay-display is good, not best\nPerformance - good\nBoot up time 9 sec only\nKeyboard - backled keyboard is very good\n\nNot for gaming\n\nBattery - if you are not going to use heavy tasks in it then it gives you more then 6 hours easily. Yes, you will be face disappointment at the first time. ...\nREAD MORE",
            "Good for it's price range.. and has way better build quality than HP or Lenovo in this price range. Good for simple office task (excel, powerpoint, browsing, etc). Don't buy it if you want to play games. Increase your budget and buy better asus rog laptop.",
            "This is laptop for People who looks for elegant design, great disay and for normal usage like browsing, excel & two apps in background.\nIt's good for students and people who begins to work in laptop.\nThe performance is good enough and battery backup is good to last for 5 to 6 hours based on usage.\nYou won't get Microsoft 365 access which is to be noted.\nI liked it for the display, design and some features like backlit keyboard & fingerprint scanner in this price segment.",
            "As far as best product in this price range, 512 gb SSD, keyboard backlighting, fingerprint crips display i3 which is more than enough for regular work and programming.\n\nReally stylish look and light weight",
            "Good Product but if you are using a bigger size laptop and are going to upgrade to this one then you will feel it smaller. But it is very good . Sometimes it creates some noise due to its fans but it is very compact able and the storage speed is good as it comes with SSD the performance is also average at all it is a multi-purpose laptop. It had no graphics card as it is not a dedicated gaming laptop but some games like minecraft , gta sa , gta vc etc. Run very smoothly. You can buy this laptop for basic work and bit little gaming.",
            "Excellent 👌 it's totally worth of money and if we come about ram it SSD so super fast and friendly usable and easyly carried .",
            "awesome wonderful just wow I love this laptop very much display,keyboard all are good impressibe all of things\nand this night view is wow",
            "My 2nd Asus laptop. Lightning fast thanks to the SSD. starts up and shuts down in a flash. No lag. Good screen. Better than average battery life. Reliable quality",
            "I got this machine at an offer price of 34k during Big Billion Days. I received it on 08th Nov'20 and I am giving my comprehensive review after a full day of extensive usage. In short, this is a superb laptop at such low price and students/professionals can definitely buy this if they don't require heavy memory/graphic usage.\n\nComing to the detailed review now:\n\nUSP: This laptop is a steal deal at 34k due to the 512GB SSD available, which runs super smooth.\n\nPros:\n1. Design: The look and finish of this laptop are immensely attractive. You may go for the blue colour variant as it looks amazing.\n2. Weight: The laptop feels really light and easy to handle\n3. Speed: The SSD really gives a big push to the performance as this system boots up and shuts down really fast. The average time for starting-up being 8-9 seconds and for shut-down, it's just 2 seconds.\n4. Touchpad and finger-sensor: Both of these work like a charm\n5. Keyboard: The board feels really smooth and the backlight option is like a cherry on the cake\n6. Battery: While continuously streaming videos, the battery drained completely in 5 hours, which is pretty decent. Do not expect a longer backup than this while heavy usage\n\nCons:\n1. Display: The display is not very vibrant but at such a price, the display offered seems quite good\n2. Sound: I had honestly bought this laptop with no expectations with sound (as per the older reviews), but the sound is actually not that bad. The volume is definitely lower than my old Lenovo laptop, but it is still pretty decent in itself. There no Harman/Kardon software provided though, to control the sound quality.\n3. Camera: The camera is pretty decent during the daytime, but it gets a lot of grains during the night. It could definitely have been better.\n4. MS Office: This comes just for a free one-month trial\n5. RAM slot: The RAM is soldered onto the motherboard and with the absence of additional slots, one cannot increase the memory in future\n\nOverall, this laptop is a superb machine at this price with various top features. If you're not expecting a very high-end gaming performance from this machine, you may blindly go for it.",
            "Ordered this laptop on big billon day… Looks and feel is awesome. Listen below pros n cons\npros:\n1. Very light weight which makes it easy to carry n easy to handle.\n2. Blue colour gives it a fantastic look.\n\nCons:\n1. Touchpad makes little bit of sound, which is annoying\n\nNote:Performance is ok…need to see how it behave when i use it extensively",
            "I have been using this Laptop for minimal usage and thanks to it's turbo boost technology and it's SSD which is prefect for any kind of tasks the SSD covers the speed considering ut has 4GB soldered RAM(cannot be upgraded), I'm happy with the product for normal to moderate usage and Yes it has slight heating issues even after SSD, if you connect the adaptor and use it gets very warm sometimes very much and good thing is th fan doesn't make much sound but not much effective to cool it faster.\n\nThis Laptop would be good for Normal to Moderate work even the office work, Battery is quite low but sufficient, Speakers are amazing by Harman Kardon and Really Good display can handle 4K video playing very smoothly and easily.\n\nUnder 35, it has best Value for money with Backlit keyboard and very decent stylish Design.\n\nHighly recommended for office and students work purposes!",
            "After two months usage,i definitely recomend to you\n\ndon't panic for RAM..it supports upto 32 gb\n\n100% upgradeable\n\njust go to command promt on this lap\n\nthen paste this on comnd\n\nwmic memphysical getmaxcapacity, memorydevices\n\nthen enter u get\nmax capacity and max slots available",
            "Best for light uses",
            "Best laptop in segment ❤️🥰\nBuy without any single thought",
            "Awesm product..",
            "Sleek,Slim, Fast, super light, just wow.\nThanks Flipkart.",
            "The laptop is awesome! Too fast delivery by Flipkart. The speed is also good. Really impressed by the product",
            "Valu for money 😍",
            "Super laptop slim and stylish design",
            "Good",
            "Good laptop as according price\nLight weight\nGood speed\nAluminum body premium look",
            "Good product",
            "Best laptop in the market in this range. I am using this laptop since 5 days, no any issue we faced. Light weight , touchpad is very smooth. Battery backup up to 5 hrs. 14 inches Size is perfect for me. Sound is good.\nFast delivery by Ekart. Within 24 hours we received it. 👍👍",
            "NICE Laptop with full of features.I bought this for 34700",
            "I had taken this laptop for office work only but after few months its touch paid stopped working. In my opinion Lenovo, HP, Dell is the only reliable laptop and should always buy laptops of the same company.",
            "All thing is good\nBut battery is too poor 😔",
            "Everything is ok but battery and camera is not that muchh as expected but still ok in this price and performance is so good reboot in just 6 sec",
            "Very good product 🤠",
            "Best laptop for students\nPerformance is awesome.\nFor study, can buy without tension.",
            "It's almost that much good as which i am expecting the colour i saw on website while i was purchasing this laptop and when i finally got this i have some another colour which is more surprising and this is exactly the same which i want.\nTHANKS TO FLIPKART FOR THIS ONE !",
            "Firstly they are send used product i dont know why\nAfter that product also faulty After start only blank screen show ..\nVery very disappointing customer care service .\nThey are show 7 day replacement police on this product but they are reject your request ...\nDont buy this product , totaly money waste\n\nTheir only paid revise on this product so don't belive in revise",
            "The best part was it came with some very cool stickers.",
            "good looking...nice performance till now...not for gaming",
            "Listen 👂 Guys\nPlsease don't buy this product ....stop wotking any time battery backup is totally bad\n😡",
            "Average laptop.. Desing is super, screen okkk only... Sound is not good..... Overal rating 3.5",
            "Honestly the best possible model to get in this budget. My niece is super happy with this 🎉",
            "Best laptop in 35490\nBattery backup is okay, almost 5 hours\nvery fast SSD performance in this segment.....👍👍👍",
            "Stylish\nLight weight\nEasy to handle\nCool for Clerical works and for students\n\nFound problem with Bluetooth (some time need to restart to get the bluetooth ON)\n\nBetter if we get in built Microsoft Office Software",
            "Excellent",
            "Very smooth and great performance.",
            "Very slim design.",
            "One of the best laptop within this price",
            "The laptop is fast. Complete loading time from switching on is 14 seconds precisely. Apps also start fast. Battery life is average, charging is fast. But the web camera is of entry level, expected a better camera.",
            "I am full satisfied with asus product.\nReally,its incrediable...",
            "Awesome processing\nSmooth to use\nLight weight",
            "Touch pad and battery disappointed me. Touch pad becomes irresponsive all at once..",
            "Best laptop for students... All is well",
            "It is a flagship killer. the user experience in a while was superb.",
            "Best At This price ❤️💯👌🏻✌🏻",
            "Just go for it 👍👍👍",
            "Lap performance is ossam, battery backup is not well good. Worth buying, thanks flipkart.",
            "Awsome product colour was very beautiful loved it.",
            "It's good and value for money.",
            "Laptop is running smoothly.. nice product at this range",
            "Best laptop under this price range\nBacklit is awesome\nSounds is low but perfect for this price range\nPerformance is awesome",
            "I want also MS Office...",
            "Good product",
            "Good product , colour same as in picture",
            "After a week's of research I go for this laptop.Design is absolutely premium I just loved it. Price was decent according to the quality. Later I will give the review about the performance though it is not much time that I bought it.first impression 👌👌👌👌.low budget macbook😁😁😁",
            "Fast booting due to ssd...Excellent fhd display....light weight.....decent battery back up...Overall very good....Would have been a 5 star....But gave it a 4 star because of the Price.....Otherwise looked a very good product..",
            "It looks nice,but in starting it had some problems then after a service it works awesome and the finger print is too awesome",
            "It's a classy Product, good for basic usage. Battery and sound are a big disappointment.\nOne full charge lasts only for 2.5 to 3 hrs in continuous usage.",
            "Stopped working within 7 days..faulty bluetooth too",
            "It's more than expectations. You'll definitely be surprised after receiving the colour of the laptop. (Backlit keyboard + finger sensor ) is quite amazing.",
            "After Using of 1year it showing automatically battery drainage and it restart automatically.\n\nVery Unhappy with this product.",
            "The laptop looks and performance is fine. But i am not happy with the touchpad. The curser pointer jump and flicker unnecessary. Which happen after few days of use. By now i hv lot of database and i hv lot of project to finish. I dont how to rectify the problem without hampering my job.\nThis review is the ext of earlier review after 3 month of use. The touchpad is not responding. Curser is not moving. Very bad exp with asus vivo.",
            "Laptop is overall good . But one thing you need to know RAM is only 4gb which is soldered that means we can't upgrade it.\nRam management is somehow poor.\nYet this lappy is eligible for windows 11 but trust me you can't use windows 11 in it , it crashes all the time.\n\nSo better go for other model or with higher ram.\n\n\nPros:\nvalue for money\nPremium look and feel\nI3 , 10th gen is good\n512gb ssd\nFingerprint reader ( its most amazing feature)\nDue to ssd booting time is awesome\nBattery backup is nearly about 4-5 hours\nDual nvme m.2 slot for 2 ssd\n\nCons\nCan't upgrade it later, i mean to say you can't upgrade ram.",
            "Awesome Laptop for Business Presentations and Meetings",
            "Appreciable and worth.",
            "Awesome product, i totally loved it. Value for money",
            "Bought this laptop recently. Initially it was good. I used only for checking emails and my son's online class.\nSuddenly few times the mouse cursor would disappear. Mouse wouldn't work only. Then I had to attach a external mouse and it works.\nAfter showing it to service guy checking if mouse pad is disabled or something. But figured out everything was intact. It happened couple of time\nI noticed this happens if I keep it in sleep for 4 or 5 hours or more keeping files and applications open.\nNext thing happens is cursor goes missing and mouse wouldn't work.\nI hope the asus customer care provide some solution for this",
            "I am giving this honest review after using the Asus vivobook laptop for 1 month.\nSound quality is better\nBattery work maximum 5hour or minimum 4 hours\nFull HD anti glare display\nWeb camera is 720 slightly photo quality is good not best.\nDue to SSD it is very fast, take only 5 second to start\nI am purchased this laptop from this Flipkart RS 38990. It is is something costly for me.\nPacking is good.\nI hope the service of this Asus laptop will be better\nBecause I have not experience any services of this laptop.\nThank you everyone",
            "Excellent product 👍",
            "Awesome",
            "Terrific Purchase.",
            "Worst product ever touchpad not working after purchase of 7 days,dont buy this laptop",
            "This product have battery related issues, camera quality is wrost not suitable for online meeting, system freeze related issues & no on-site service provide by asus poor quality don't purchase",
            "Best laptop",
            "Ram upgradation can be done or not is the only concern otherwise it's a superb machine.....",
            "Go for it ....",
            "Best laptop with this price range, writing this review after a month usage\nBattery usage ~4 to 5hrs in normal usage\nMcAfee & MS Office tools comes with only 1 month free subscription\nBacklit Keyboard is nice\nSpeakers sound is very good\nWeb Cam quality is nice\nOnly Cons I have observed so far is, even in normal usage with charger connected the Fan makes some noise",
            "Love the design! Works smoothly",
            "Superb in this price . Very fast",
            "Awesome product",
            "It's really good 👍 value for money 💰......\nIt is the best and most obvious for everyone...",
            "Guys if you want to increase your battery backup then switch off the keypad light when not necessary. Trust me you will get the better result.",
            "Close your eyes, take this laptop. Just amazing 💙. I'm using it 10 hours a day, still working too fast. Design is looking premium.",
            "4 months of very average use and boot time is amazing and didn't face any heating issues inspite of using it for prolonged hours(4-5 hrs). So far good.",
            "excellect product",
            "good laptop really asus so fast\nfinger print so fast\nand display size so big and bazzel so thin.",
            "Having issues in screen brightness.unable to increase or decrease brightness and volume.",
            "Trust me, I'm not flipkart guy,\nIts good product.",
            "Good..... Only normal working..\nNot using multiple apps at a time..\nCamera is avg...\nRam is fixed....",
            "Battery good.\nCamera normal.\nLight laptop.\nPerformance little bit slow.\n\n\nIssue-charging point is not perfect.",
            "Very good performance..but screen size is not sufficient",
            "Booting time really fantastic...,\nSimply superbb lap.",
            "Booting fast and looking very nice",
            "Display is good\nBattery is decent\nPerformance is awsume",
            "Everything is Good ....in this price range",
            "Super product.. every thing is great( performance, screen, design, quality n NVMe ssd is ultimately fast)\nGo for it\nBest laptop in 37k\nBlue colour is best",
            "Very nice laptop",
            "Fingerprint scanner of laptop is working stop after 4 days of purchase.\nWhat to do?",
            "After my 3months usage battery got weak....some software issues also almost ok..but heavy usage cannot manage",
            "I plan on giving 5 star but then i thought i received this product after 1 month... So flipkart is wasting a lot of my time.... Anyway the product is good but 1 star for poor delivery...",
            "Good for basic use. Not for gaming",
            "Overall best in class.",
            "Very nice",
            "Camara is not too good but all performance are awesome",
            "Except for viewing angles for the screen, there is nothing you can complain about in this laptop. Extremely lightweight and it takes only 3 seconds to boot! Pre installed Windows 10 seems genuine however Office - you have to purchase.",
            "Overall laptop is nice. For normal usage it's a good purchase.",
            "Awesome 👍 light weight, everything is good\nIt taken 17 day's to deliver\nIt taken too much Time to start",
            "Sound quality is not good\nThis colour is more dust catching but design is so good\nBattery performance is not so good\nOverall performance is good",
            "Very bad experience.\nAfter product delivery the price was immediately reduced by Rs. 2500.\nComing to product.\nAs expected Design is good but very delicate.\nPerformance is average.\nCamera quality is very poor.\nNot useful for online classes and training.\nStudents pls don't buy it.",
            "Thanks to the seller for fast and safe shipping. Product is so good, till now no issues and working fine",
            "Working stopped after using of 4-5 days",
            "what is the use of any laptop if there is no microsoft office ....wasted my money on this...",
            "Bad product start hanging after two month usage",
            "Loved everything about the laptop except the front cam, I bought it for online classes and interviews but the quality looks unsatisfactory."
        ],
        "likes": [
            "453",
            "84",
            "42",
            "20",
            "25",
            "22",
            "20",
            "38",
            "137",
            "10",
            "9",
            "5",
            "15",
            "18",
            "6",
            "6",
            "19",
            "13",
            "16",
            "7",
            "16",
            "3",
            "3",
            "3",
            "5",
            "7",
            "6",
            "5",
            "10",
            "6",
            "3",
            "4",
            "4",
            "3",
            "1",
            "1",
            "4",
            "3",
            "2",
            "1",
            "1",
            "0",
            "0",
            "8",
            "11",
            "7",
            "6",
            "9",
            "26",
            "6",
            "9",
            "9",
            "11",
            "15",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4",
            "12",
            "2",
            "2",
            "3",
            "5",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "1",
            "2",
            "2",
            "2",
            "2",
            "2",
            "1",
            "2",
            "2",
            "2",
            "2",
            "1",
            "2",
            "2",
            "1",
            "1",
            "3",
            "3",
            "3",
            "2",
            "3",
            "2",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "2",
            "2",
            "2"
        ],
        "dislikes": [
            "141",
            "10",
            "7",
            "4",
            "5",
            "7",
            "3",
            "9",
            "27",
            "1",
            "1",
            "0",
            "0",
            "4",
            "0",
            "0",
            "5",
            "3",
            "6",
            "2",
            "10",
            "0",
            "0",
            "0",
            "1",
            "3",
            "3",
            "3",
            "9",
            "3",
            "1",
            "1",
            "2",
            "2",
            "0",
            "0",
            "5",
            "3",
            "2",
            "1",
            "6",
            "1",
            "2",
            "0",
            "1",
            "0",
            "0",
            "1",
            "7",
            "0",
            "1",
            "1",
            "2",
            "5",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "2",
            "3"
        ]
    },
    "qna": {
        "questions": [
            "Q:Can i play free fite",
            "Q:Is it good for programing? Like Java, python",
            "Q:Doest it have Backlit keyboard",
            "Q:What is the boot time of this laptop",
            "Q:Can I play free fire without graphoc card",
            "Q:Can I upgrade RAM of the laptop in future?",
            "Q:Cam we upgrade its ram to 8gb?someone is saying yes and other saying no....please give correct information",
            "Q:How many percentage gst on this laptop",
            "Q:Does it supports autocad 3D software ?",
            "Q:Battery backup time?",
            "Q:Can we run free fire",
            "Q:Does it have DIMslot",
            "Q:MS office is included in this laptop",
            "Q:Can i add 1TB HDD to this laptop? is that possible?!",
            "Q:Is it in ryzen 3 processor",
            "Q:Connect wireless mouse ?",
            "Q:is 4 gb ram is enough for student use or office use",
            "Q:I get Windows Ten free for life time?",
            "Q:It can work AutoCAD",
            "Q:i can play pubg in this laptop?",
            "Q:Is it good for software development like javascript,css,html and programming languages?",
            "Q:Can we use this laptop for solidworks and ansys purpose?",
            "Q:Is it really have anti glare display coating??",
            "Q:Storage capacity is only 510 SSD or +1TB as well. Can I add extra 1TB with 510 SSD",
            "Q:It's dual ram slot?",
            "Q:Can I increase the ram to 8gb instead of 4gb?",
            "Q:How it is for study",
            "Q:It is suitable for editing and blogging",
            "Q:Does I take unacdemy classes in this laptop",
            "Q:Is it's storage expandable or not. Does it have any empty slot for expansion.",
            "Q:It can perform office work",
            "Q:Can i upgrade RAM in future ???",
            "Q:It says windows office is included..where is the key to activate?",
            "Q:Is the type c port support charging",
            "Q:Is it possible to add RAM in future? Is there any specific slot for that?",
            "Q:Extra ram slot avilable ?? And hdd slot ?? In thish laptop",
            "Q:Can i play gta san andreas? Pelease reply it by today...",
            "Q:Does it have metal or plastic body?",
            "Q:Can I upgrade the Ram? Is there any extra slot for ram upgradation and if not so is it possible to replace ram which is already given in laptop?",
            "Q:Lio ion battery 35Whr Can we change the ram",
            "Q:Can I upgrade 12gb ram",
            "Q:Is Microsoft Office included in this laptop?",
            "Q:Which type of ssd support?",
            "Q:Any extra slot for ssd",
            "Q:Can I Use GoogleChrome?",
            "Q:How many RAM slots are there? Can I upgrade it to 8gb?",
            "Q:Can we run visual studio code properly in this laptop",
            "Q:Does it have stereo speaker for good sound?",
            "Q:Is ram expandable in this laptop to 8Gb",
            "Q:its this laptop suitable for coding",
            "Q:Can i install windows 11",
            "Q:What is the sound quality of",
            "Q:Can it run Autocad 3d",
            "Q:Does it come with activated Microsoft 365 or buyer have to puchase like Microsoft Words, Excel?",
            "Q:Can i update this laptop to windows 11?",
            "Q:Is it metallic or plastic body? Genuine answer please. (Drop a safety pin on it to check :-P)",
            "Q:Cast screen or project from mobile is available ????",
            "Q:Can I use windows 7 in this laptop...?",
            "Q:Can i install and use Microsoft word for free in this laptop?",
            "Q:I hear from my friends that Asus has only one demerit that is keypad problem.....No other fault....",
            "Q:Can I play Free fire smoothly",
            "Q:Does it have touch screen???",
            "Q:Can i play san andreas",
            "Q:Ie this leppi ms office included",
            "Q:This is a worthfull gaming laptop and editing, streaming, and online class, and other use this is good for all works??",
            "Q:Can I play free fire or bgmi",
            "Q:Specifications of Graphic card ??",
            "Q:What is the frequency of ram is it 2666?",
            "Q:Can we connect wired earphones to this laptop??",
            "Q:Is it suitable for the profession HR?",
            "Q:Does it have any cover type bag",
            "Q:Is it have disk drive?",
            "Q:It have I gpu?",
            "Q:Is there any fan noise issue?",
            "Q:Can i run Asphalt 9 on this laptop?",
            "Q:What is its weight",
            "Q:Is it good for programming",
            "Q:Can I expand storage if I want to add hdd in this laptop so the internal slot of hdd is available or not??",
            "Q:External rom solt",
            "Q:It will come with webcam",
            "Q:Metallic body or not",
            "Q:Do this laptop looks smaller as compared to other 14 inch laptops?",
            "Q:Can I play gta 5",
            "Q:I just order this laptop it will worth my money?",
            "Q:Can I upgrade RAM in this? Is there another slot for RAM? Some people are saying yes and sone are saying no what is it?",
            "Q:Can I get software",
            "Q:Can I download ms office in this laptop",
            "Q:Can i attached HDD in this laptop??",
            "Q:Battery backup of this laptop in hrs?",
            "Q:Does this laptop come with genuine windows 10 and can I add extra ram or hdd",
            "Q:Is this laptop have 2 ram slot or not how much upto can I upgrade",
            "Q:Does it gives good battery backup??????",
            "Q:Weather laptop stickers will come with this in package",
            "Q:Can I render video at 1080p smoothly???",
            "Q:Can I upgrade ram? Is there another slot? Or dedicated single slot?",
            "Q:Ram can increases with this laptop",
            "Q:Can we edit video in premier pro cc?",
            "Q:Is it refurbished or new?",
            "Q:Can i upgrade ram in future. Only answer who know the truth",
            "Q:Van I upgrade ram in future?",
            "Q:Doe sit have backlight keyboard?",
            "Q:have a m.2 slot ? or can i increase hard disk memory",
            "Q:Can i upgrade RAM in this laptop? Dimm slot",
            "Q:how is the camera quality, please send a camera photo...is it good for online classes",
            "Q:I need geniune answer whether can I increase ram?Some are saying yes and others are saying no.It is very confusing.",
            "Q:Can ram be increased? From 4GB to above¿",
            "Q:Extra sloat for upgrading the RAM in future? and how much RAM can upgrade?",
            "Q:Is there anyone who has upgraded the RAM of his laptop? Please tell honestly.",
            "Q:Is there fingerprint sensor",
            "Q:Os it refurbished or new?",
            "Q:Can i play freefire and use video editing software like after effects or Adobe Premiere Pro??",
            "Q:Year of release",
            "Q:Does it provide MS office???",
            "Q:Microsoft office available if yes or lifetime or trial",
            "Q:Is use full for codeing and java python and c++ program learning perpose",
            "Q:How to install windows in these laptop.",
            "Q:Can this laptop run fifa21/22",
            "Q:Paint is applicable in this pc ?",
            "Q:Is i3 is better than ryzen 5 ??",
            "Q:Is it upgradable tov11 th genaration",
            "Q:Which laptop is best asus ultra vivabook 14 or hp14s for programming , coding",
            "Q:I want to use virtualbox and vmware , will it work fine on this?",
            "Q:Does it have TPM 2.0 which is needed for Win 11?",
            "Q:Is it support photoshop and premiere pro",
            "Q:CAN WE UPGRADE RAM IN THIS LAPTOP GENUINE ANSWERS ONLY",
            "Q:Is it good for coding?? Honest answer",
            "Q:Can we use it for coding and programming?",
            "Q:Will it be windows 11 compatible",
            "Q:The battery capacity is how many watt hour ?",
            "Q:Is there any port for lan cable?",
            "Q:Is it's ram upgradable? Genuine answers please...",
            "Q:does it have web camera?",
            "Q:WiFi dual band support ya not WiFi 2.4g and 5g support able ya not",
            "Q:In this lapto can we use sim or not is there sim slot present or not plz inform le",
            "Q:Can we use adobe softwares ?",
            "Q:Can i attach a hdd inside the laptop",
            "Q:Is finger print sensor is inbuilt in this??",
            "Q:It ha graphic card",
            "Q:Can we insert an extra storage capacity?",
            "Q:Can I added extra slot for HDD??",
            "Q:how much the sound quility ?",
            "Q:Is it upgradebl ?",
            "Q:Is there any space/slot for HDD ?",
            "Q:What u had got with this laptop ? Any bag and mouse ?"
        ],
        "answers": [
            "A:u can.. but i would not recommend as it is just 4 gb variant. unnecessary load on ur laptop with reduce its life. And and and.. pdhayi likhai kro.. ias vias bno.. kin chkro me pd gye ho.. 😉",
            "A:yes, of course",
            "A:yes it has Backlit Keyboard, but is not rgb.. it has decent blue colour backlit",
            "A:4 to 5 sec",
            "A:Yes You can play free fire on this pc using an android simulator. you can play the game at medium setting with lagfree experience",
            "A:You can upgarde to 32GB",
            "A:yes",
            "A:18%",
            "A:Yes it may",
            "A:4- 5 hour for online use...",
            "A:sure",
            "A:No.. it doesn't have a extra DIM (dual in line memmory) slot.. one 4 GB RAM module is soldered to the M. board so you can't upgrade the RAM in future..",
            "A:No",
            "A:There is an extra slot to add HDD.",
            "A:No, it's Intel i3 10 gen. processor . For your kind information you must see the Specification.",
            "A:yes",
            "A:Yes for low to medium usages. Don’t expect to an unhindered",
            "A:yes",
            "A:yes",
            "A:I think pubg lite will run fine",
            "A:Better to go for i5 or i7",
            "A:it's only for personal use and light work.. can not use for heavy games and solid works .. it's good laptop, slick design , easy to use ..",
            "A:yes",
            "A:yes",
            "A:no",
            "A:No, extra RAM slots aren't available.",
            "A:it's very nyc , no problem",
            "A:yes with ease",
            "A:yaa u can",
            "A:no it has space to insert micro sd only and 512gb is a huge space",
            "A:yes. but, it is not that fast.",
            "A:Yes",
            "A:Office is not included",
            "A:No",
            "A:RAM is not Upgradable..",
            "A:NO",
            "A:Yes of course",
            "A:Plastic",
            "A:Yes",
            "A:No, you only can install another RAM in 2nd slot not more than 16gb",
            "A:yes u can",
            "A:Yes it is included",
            "A:1GB SSD",
            "A:yes",
            "A:yes why not",
            "A:Yes",
            "A:Yes",
            "A:yes",
            "A:No",
            "A:Yes. Just upgrade the ram to 8 gb. Or more",
            "A:Yes. This laptop has original Windows 10 installed. I got the free upgrade to Windows 11 around 10 days ago. You will get a notification or you can check in the windows update tab in settings.",
            "A:not awesome but nice means for sound i will give it a 4.5 star",
            "A:yes",
            "A:purchase",
            "A:yes option is available",
            "A:Metallic",
            "A:Yes",
            "A:Yes",
            "A:Install but not use.",
            "A:no that's not true. i am using this from last 8months",
            "A:yeah someimes you can play but not always..or you can uprade the ram also..for more smooth experience..",
            "A:No this is not a touch screen model",
            "A:The game can be played but it will hang too much. The laptop will not work.",
            "A:Trial version for 1 months, not life time.",
            "A:not for gaming, rest you can use it for.",
            "A:No you can't play free fire or btmias it does not have integrated graphic card... you can play angry birds and all that 😊😊",
            "A:Intel UHD Graphics card in built",
            "A:Ya offcourse frequency of ram is 2666",
            "A:Yes offcourse it has 3.5 mm jack and also a C-type port.",
            "A:It is having a good processor for daily usage. You’ll have no lag while running office, meetings, and browsing. It is pretty compact and lightweight. I think it’ll be a good choice for HR works.",
            "A:No, will get only laptop and charging adapter.",
            "A:no. it has ssd instead.",
            "A:No dedicated gpu",
            "A:you will hear the sound,, but i don't say it 'noise'.",
            "A:yes",
            "A:Light weight, actual numbers are there in the specs.",
            "A:yes",
            "A:yes you can",
            "A:No",
            "A:Yes",
            "A:yes",
            "A:yes but display is average",
            "A:I don't think so as there is no dedicated graphic card and integrated card is not capable of running a game + i3 is too slow for a game.",
            "A:Yes ofcourse...if u are casual professional user..it is worth...if u are in editing or high end gaming choose another",
            "A:Nope......i already visited asus service center for this query and after open laptop there is no ram space and the existing memory is fixed with mother board...no one can able to change this one also.",
            "A:You will only get original windows 10 os nothing else friend so you have to buy software of your choice from Microsoft store or get it for free also",
            "A:Yes...why not..",
            "A:Not inside.",
            "A:4 hrs minimum Maximum 4.30 hrs you any mode",
            "A:yes,it comes with genuine windows 10 Home and you can increase the ram or the SSD/HDD capacity.",
            "A:yes , it have 2 slots and upgrade upto 16GB",
            "A:around 5 to 6 hours on medium brightness",
            "A:yes",
            "A:Yes, U Can play Video at 1080 smoothly....",
            "A:No",
            "A:Yes, you can increase it upto 12GB",
            "A:s....u can but in 4gb ram the speed may not be optimal....",
            "A:it's new and too good",
            "A:yes",
            "A:no",
            "A:yes",
            "A:yes off course you can.",
            "A:no",
            "A:yes... camera quality is good as compared to ordinary laptops..",
            "A:no",
            "A:Nope",
            "A:no bro",
            "A:No",
            "A:no",
            "A:new",
            "A:No.",
            "A:2021",
            "A:no",
            "A:yes it is available but it needs to buy",
            "A:Yes it is",
            "A:Windows 10 is pre-installed in this laptop.",
            "A:yes",
            "A:yes",
            "A:It's difficult to say but it's Quite different than that",
            "A:wdym ? R u asking whether you can upgrade it's CPU to 11th gen after buying ? If that's the case , then NO. Its impossible to do , and If you somehow do tht , chances of mistakes are really high.",
            "A:Asus ultra vivobook 14 is better",
            "A:Yeah its work in good.",
            "A:No",
            "A:yes it supports ,but better upgrade it to 8 GB ram for best performance",
            "A:Performance is good with the ram already installed in it..but for long term u should upgrade Ram.",
            "A:yes",
            "A:Yes",
            "A:no",
            "A:3 hours",
            "A:no",
            "A:yes",
            "A:yes",
            "A:yes",
            "A:no",
            "A:Yes, it's not pre install, you have to install as per your need.",
            "A:no",
            "A:yes.",
            "A:No, only integrated graphics. If you are not a hardcore gamer it will do the job",
            "A:yes",
            "A:yes",
            "A:sound quality is good, enough for one room.",
            "A:Yes",
            "A:No",
            "A:No"
        ],
        "likes": [
            "407",
            "94",
            "120",
            "56",
            "19",
            "3",
            "6",
            "7",
            "7",
            "9",
            "15",
            "31",
            "20",
            "12",
            "3",
            "5",
            "2",
            "2",
            "3",
            "8",
            "4",
            "4",
            "5",
            "5",
            "6",
            "5",
            "1",
            "2",
            "2",
            "3",
            "0",
            "9",
            "3",
            "3",
            "5",
            "1",
            "2",
            "2",
            "2",
            "2",
            "2",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "34",
            "105",
            "91",
            "15",
            "17",
            "3",
            "5",
            "3",
            "7",
            "13",
            "4",
            "5",
            "3",
            "20",
            "19",
            "3",
            "1",
            "1",
            "0",
            "4",
            "3",
            "2",
            "1",
            "2",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "30",
            "13",
            "27",
            "18",
            "4",
            "0",
            "0",
            "0",
            "0",
            "1",
            "5",
            "15",
            "17",
            "3",
            "0",
            "1",
            "0",
            "1",
            "0",
            "6",
            "1",
            "1",
            "1",
            "5",
            "7",
            "7",
            "0",
            "0",
            "1",
            "2",
            "6",
            "17",
            "1",
            "4",
            "19",
            "2",
            "1",
            "8",
            "2",
            "8",
            "12",
            "25",
            "30",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "2",
            "0",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "5",
            "0",
            "12",
            "4",
            "40",
            "39",
            "2",
            "4",
            "0",
            "0",
            "1",
            "1",
            "6",
            "0",
            "1",
            "0",
            "33",
            "27",
            "2",
            "0",
            "1",
            "2",
            "5",
            "2",
            "4",
            "1",
            "5",
            "3",
            "10",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "1",
            "0",
            "0",
            "5",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0",
            "0"
        ]
    }
}