{
    "title": "ASUS VivoBook K15 OLED (2021) Core i3 11th Gen - (8 GB/256 GB SSD/Windows 10 Home) K513EA-L302TS Thin and Light Laptop  (15.6 inch, Indie Black, 1.80 kg, With MS Office)",
    "product_specification": {
        "Sales Package": "Laptop, Power Adaptor, User Guide, Warranty Documents",
        "Model Number": "K513EA-L302TS",
        "Part Number": "90NB0SG1-M14030",
        "Model Name": "K513EA-L302TS",
        "Series": "VivoBook K15 OLED (2021)",
        "Color": "Indie Black",
        "Type": "Thin and Light Laptop",
        "Suitable For": "Processing & Multitasking",
        "Power Supply": "65W AC Adapter",
        "Battery Cell": "3 Cell",
        "MS Office Provided": "Yes",
        "Processor Brand": "Intel",
        "Processor Name": "Core i3",
        "Processor Generation": "11th Gen",
        "SSD": "Yes",
        "SSD Capacity": "256 GB",
        "RAM": "8 GB",
        "RAM Type": "DDR4",
        "Processor Variant": "1115G4",
        "Chipset": "NA",
        "Clock Speed": "3.0 GHz Upto 4.1 GHz",
        "Cache": "6",
        "Graphic Processor": "Intel Integrated UHD",
        "Number of Cores": "2",
        "OS Architecture": "64 bit",
        "Operating System": "Windows 10 Home",
        "System Architecture": "64",
        "Mic In": "Yes",
        "USB Port": "1 x USB 3.2 Gen 1 Type-A, 1 x USB 3.2 Gen",
        "HDMI Port": "1 x HDMI 1.4",
        "Multi Card Slot": "Micro SD Card Reader",
        "Hardware Interface": "PCIe NVMe",
        "Touchscreen": "No",
        "Screen Size": "39.62 cm (15.6 inch)",
        "Screen Resolution": "1920 x 1080 Pixel",
        "Screen Type": "Full HD LED Backlit OLED Glossy Display (16:9, 220nits Brightness, DCI-P3: 100%, Color Gamut, 85% Screen-to-body Ratio)",
        "Speakers": "Built-in Speaker",
        "Sound Properties": "Audio by ICEpower",
        "Wireless LAN": "802.11ax",
        "Bluetooth": "v5.0",
        "Dimensions": "359 x 235 x 17.9 mm",
        "Weight": "1.80 kg",
        "Disk Drive": "Not Available",
        "Web Camera": "720p HD Webcam",
        "Security Chip": "Trusted Platform Module (Firmware TPM)",
        "Keyboard": "Backlit Chiclet Keyboard with Num-key",
        "Backlit Keyboard": "Yes",
        "Included Software": "Office Home and Student 2019 included",
        "Additional Features": "42WHr Li-ion Battery",
        "Warranty Summary": "1 Year Onsite Warranty",
        "Warranty Service Type": "Onsite",
        "Covered in Warranty": "Manufacturing Defects",
        "Not Covered in Warranty": "Physical Damage",
        "Domestic Warranty": "1 Year"
    },
    "product_description": {
        "Add a Touch of Flair": "Add a pop of colour to your daily life with the bright colours and visuals of this laptop. The presence of the colour-blocking Enter key adds a touch of flair to your computing. Powered by an Intel Core Processor, this laptop is stylish and powerful.",
        "Unique Enter Key": "The special colour-block Enter key of this laptop stands out from the rest and makes for an interesting centrepiece during long work hours.",
        "Expansive Display": "The thin-bezel design of this laptop’s NanoEdge display helps provide an expansive viewing experience. The thin bezel ensures that you get a large screen encased in a narrow frame, making for immersive viewing.",
        "Stay Productive": "Powered by an Intel Core Processor with up to 8 GB of RAM, this laptop is sufficiently equipped to handle your daily operations. It also comes with up to 512 GB of SSD storage to safely store and recall all your documents, media, and other files.",
        "Get a Power Boost": "This laptop comes with ASUS Intelligent Performance Technology (AIPT) to efficiently manage the power and cooling of the device. It makes use of ASUS exclusive algorithms that combine with five to nine smart sensors, an IceBlade fan design, and a power supply to increase the performance and stability of the system. This results in improved battery life and a quiet, cool laptop. You can use AIPT to ensure that your laptop stays in its high-performance mode all day."
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "4",
            "5",
            "5",
            "2",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "3",
            "1",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4"
        ],
        "review": [
            "Thanks to asus ,this is a very nice laptop.It's display is awesome.No confuse you will impressed by this awesome oled display.Battery backup is enough to use (apprx. 6-8 hr of normal use,browsing..).It comes with harman kardan dts sound ,which is loud and give a new experience.build quality also nice.I purchased i3 processor but it also very powerful,\nI purchased i3 processor at 46k but, if its cost would be 50k then also i will give it 5 star.No exception this is the best laptop about 50k at this time.\nGo for it !",
            "Pros - 1) Bright oled display as there is no backlight it reduces eye strain\n2) adequate total 4 usb ports, soft keyboard\n3)get asus power manager from windows store and keep settings at 60 percentage to reduce number of battery charge discharge cycle\n4) good for web browsing with tab sudpender extension i can open upto 150 tabs.\n5) excellent value for money as last year 15.6 inch oled laptop is to cost more than 1 lakh.\n6)good n loud dts sound with stereo mix and enhancement. I use voicemeter banana to drive multiple external speakers.\n7) very fast usb 3.0 copy from external pocket hdd\n8)fast boot up time n fast fingerprint sensor and fast hibernate.\n9)soon windows 11 drivers will be released by asus\n10) oled saver, pixel shift n refresh can be configured from myasus app\n11) battery drain is less, core i3 11 gen is same performance as core i7 8th generation i m using for office laptop\n\nCons- no speed control of cpu in battery power plan i use granola power manager for the same\nNot able to go to bios inspite of pressing f1 n f2 furing startup\n16gb memory model should be available for core i3.\nNot able to connect external 4k display using usb type c port adapter..need to use hdmi port.",
            "This laptop is insane. its single core cinebench r23 score is higher than some very high end cpu's (1200) because of high clock speed. Display is super bright and speakee is super loud.Battery performance is also decent, i saw a movie of 3 hour duration with 80 percent brightness and using bluetooth earphone baterry dropped only 30 percent. so i guess i would get atleast 6-8 hour battery backup also it charges 100 percent under 1.5 hours. wifi 6 and Bluetooth 5 works just fine. my asus is very helpful.\n\nPros- Powerful cpu, Gorgeous display, loud speaker, nice battery, good built , fast fingerprint scanner , fast charging, bezzels are small\ncons- only issue is heating because of high cpu speed which you can control using throttlestop and disable turbo so your cpu won't go beyond 3 Ghz which will reduce temperature and save your battery as well.\nNote- dont judge display with the image i have provided.",
            "Amazing laptop , I'm just awestruck seeing the oled display 🤩 , smooth performance , design is perfect & I'll update abt the battery backup after using for some days . Once again , display is just alluring .",
            "Awesome product 💯 Bought it after lot of research and I am happy that i chose a best laptop in this price range❤️ At first i had a doubt before buying while seeing reviews about glitches on screen but nothing like that. I am using it since a week, it is working fine and oled screen is fabulous. If you want it then go for it.",
            "Worth every penny, also there is an extra slot for hdd, which is a big thumps up. Best laptop that you can buy under Rs.50k hands down.",
            "Gorgeous screen..premium look...MS office...got W11 updated on same day. Got it at a very good price..Thank you ASUS ..thank you flipkart",
            "Thanks ASUS and Flipkart for this amazing laptop.. 🤗🤗very nice and awesome... Must buy 🥰.. In this range this laptop worth the money.. good for students and professionals also..",
            "Writing this after using for almost one week....the best laptop under 50000.... Display is obviously the show topper 💕 performance is also amazing 😍 if you're looking for a laptop with best display and day to day work performance blindly go for it 💕💕",
            "if you are looking for a display then this is the perfect laptop for you to buy..\nelegant design with it's premium finishing..\nOled display with great colors\nhdd kit available in the package\nfor office work it's perfect and for media streaming it's more than perfect 😍😍\njust love this laptop\ni purchase black color.. for me the backlight keyboard is very good .. three level brightness which will provide you a great experience..\nperformance is very good but not for heavy gaming\nbattery is great but not that much great.. in battery saver mode you can get 3-4 hours but with performance mode you'll get around 2-2.5 hours\nfast charging available so no problem\na must must buy deal from asus 😍😍",
            "Asus did it right!!\n\nI am writing this review after using this boy for a month.\n\nLets start with Display 😍:: Amoled display with true to life enhancing technology will blow your mind..Dont worry about any pixel burning issues.It has the inbuilt functionality like pixel shift and pixel refresh to optimise the picture quality.\nBlue light emission control is a bonus.\n\nBattery:: You will get around around 4 hrs in general 🥲\n\nPerformance:: Intel i3 11 gen will handle most of the daytoday task..i haven't encounter any issues in running multiple applications at a time. I have seen that it can handle 1080 seamless edit in premier.Task first capability will helps in prioritise network bandwidth depending upon the task u execute like multimedia streaming, productivity ect.\n\nNvme helps in fast bootup and fingerprint is pretty nice.\nHarman Kardin integrated speakers are really impressive.\nI can talk about this boy for hrs 😄\n\nLong story short..Its so good..glad i have made a right choice.\n\nThankyou Flipkart for the quick and safe delivery !!",
            "Awesome product from ASUS. Perfect deal for the non-gamers. Outstanding form factor with brilliant display. This is my second ASUS laptop and I am living with it. Both silver and black color seems elegant and I go with black. Initial impression is grand and let see how it performs with time. Absolutely recommend.",
            "Delivered within 2 days..... Prompt and nice delivery...\nPros.... Excellent display... Deep blacks... Colourful fantastic screen... Never seen before on budget laptop..\nGood for day to day office work and multimedia consumption...\n\nCons.... Sound big letdown... Even after giving such beautiful Oled screen you could not enjoy mulltimedia due to poor sound quality of downfiring speaker... U need bluetooth wireleas speaker to resolve this issue....\n\nOverall good product in this budget range fo...\nREAD MORE",
            "Recieved in this morning...and I am very satisfied with the laptop...the display is like omg😍💯..and performance is also very nice and smooth ...typing feels very smooth and nice for the chiklet keyboard..\nSo as a student I find it awesome in this price range..\n\njust one con of this laptop is that the battery drains quite fast than usual..that is 3 -4 hours approx..\nBut I'm in love with the display and the overall performance 🥰",
            "it's very useful laptop for students, I'm a medical student and my lots of stuff about ppt, pdf, books and net surfing. for all that it's perfect fit and in free time watching movies web series it's display was amazing the brightness couliu composition are beyond price, i haven't tried games yet",
            "The major positive with this laptop was its display, You will never disappointment with its display, if you need a laptop for entertainment purpose just close your eyes and buy it and you can do casual office work if you need performance go for i5 variant, you can get 5 hours of screen on time while watching movies , and the built quality was good at its price, verdict - if you consume lot of ott apps like netflix, prime video, hotstar just go with it.... the best display in its class nothing can come close...",
            "Best leptop and best body best display overall best product",
            "One of the best display amazing viewing experience better than anyone in this Price range you can do day to day task very easily quick Boot up it's give you OS Window 10 ,MS office,McAfee antivirus with VPN a complete entertainment pack for watching shows, movies, prosseser is powerful enough to complete any task , finger print sencer working fine",
            "Looks awesome, my uses is mild so I won't write about that but it's boot up within seconds. Picture quality awesome.. I Selected matte finish for the keyboard in black color keyboard is nice than silver (as per my view) Rest I will write after few months...",
            "Very nice",
            "Nice Laptop the only problem I'm facing is the screen is glassy and reflective",
            "Everything was established excellent",
            "Best Laptop in 50k range",
            "This is one of the best laptop with oled you will feel that your eyes were colourful and enjoy the every frames.\n\nAt starting I got little worried that lap got heat and trackpad mouse response is very less and sometimes that the mouse pointer is not moving after that I realised that all because of windows background updation after that, runs smoothly.\n\nNo more heating issues and mouse pointer issue.\n\nAnyone have that same issue no need to worry it will be alright after the updates.\n\nThe only thing is that color black is only Available am really interested to buy gold or silver colour.\n\nThe laptop is really smart and am doing little heavy task supports well.\n\nThe performance is really great. It takes less than 3 seconds to open. If you restart the lap you can't see it's shutdown and restart it simply and on all in seconds.\n\nYou can blindly buy this laptop its awsome.\n\nAm giving this review after the two days of usage I will give more things later with images.\n\nAnother thing want to say that it's not 220 nits it's 400 nits but if you find anywhere it's given 220 nits display.\n\n\nNote my cons :\n\nAm giving review after one month of usage\n\nMy touch got problem from beginning guys if have the same problem replace immediately.\n\nI got this prob from beginning and after the complaint to the asus they said driver prob and to update I saw updates and updated everything done, after that also the same problem exists after the one hour usage or sometimes from starting the touch pad won't work properly the mouse pointer will dance up and down also from the centre of the touch pad it won't work.\nIt worried me lot in this updation i thought the problem is solved but not solved so the replacement date crossed. After that again i made a compliant they authorised to service center they came to my site and changed my touch pad, after the I also the problem remains same but this time touchpad little okay because it worked in centre but the mouse pointer dancing prob and slow moving sometimes the pointer won't move even the same problem.\nAgain I made complaint and asked for replacement they are refusing to do that they said they will change any parts in the laptop but not replacement.\nAm worried lot because I brought this lap for the purpose of work and now am spending time to customer care.\nThis is the only problem with my lap I don't know this problem is for everyone but it came for me.\nOther things were awsome in this laptop.\n\nIf the customer care replaced my laptop I will be happy.",
            "Best for 46k",
            "If ssd is 512gb in this price this becomes a valuable purchase",
            "Excellent in Budget... .",
            "If you want to watch movies and do some basic work then go for it blindly. Love it",
            "Just Recently launch..I used for whole day.. Especially OLED Experience..wow....Blindly buy..Go for this.. highly recommend..",
            "Wonderful machine. I have never seen anything like this before.OLED technology is mind-blowing.🔥🔥🔥🔥🔥",
            "If the battery was a little better and SSD was 512 GB. This product would have been a masterstroke",
            "good",
            "Overall this laptop is very good. But only the problem is that this black colour catches fingerprints.",
            "Awsum product. Worth its price",
            "This laptop is awesome 👍👏😊\nFor Daily uses and online classes highly recommended laptop😃😄",
            "Amazing display 👍🏻",
            "Nice Product 🔥✌🏻👍🏻",
            "Laptop display is very nice and fast. Battery comes only for 3 hours.\nFlipkart is not paying offers for purchase through ICICI BANK debit card.",
            "Display started having issues within 2 days returning it.",
            "Best screen quality",
            "Touch pad not working properly and screen blinking while moving cursor so fast on application",
            "believe me in this price range you will never get this type of Display\nDisplay is very good\nperformance is very nice\nprice is good\neverything is good\nbattery can be used for about 4 -5 hours\nspeakers were nice\nbut camera is not that good\nJust go for it,",
            "Must buy🔥🔥🔥",
            "Best in price, good design, excellent display",
            "good laptop",
            "OLED is fabulous. (10/10)\nLaptop is great if you spend lot of time consuming HD media.\nSound is loud but clarity is not at par with premium laptops.(7/10)\nKeypad feel is okay (6/10)\nBuilt quality is Average(6/10)\nBattery Life, above average(7/10)\nTouchpad, Average (7/10)\n\nUpgradable to Windows 11 and Office Student is there.\n\nBuy it just for the display.",
            "I bought this just to watch movies and the screen is so damn good. Above average speakers. Average performance.\nCheapest oled laptop. Buy this just for the screen.",
            "Amazing.",
            "Best display.loved it",
            "Amazing product. Value for money. Full marks for the display❤️",
            "Ultimate display 👍",
            "Awesome product by Asus...",
            "Laptop is good battery life is good performance is best value for money.",
            "Laptop screen is flickering.",
            "Blindly go for this...Only negative s 256gb ssd",
            "Just awesome",
            "Just display is asowme",
            "NICE",
            "Super smooth functioning with a great OLED display",
            "Baap level...",
            "Good laptop at this price",
            "Super amazing laptop from Asus.",
            "A laptop with amazing diaplay",
            "Overall good",
            "Highly recommend",
            "Everything is just WOW...display n design❤️🔥🔥\n🚫INITIALLY DISPLAY FLIKKERING\nbut FIXED WITH MINOR DISPLAY SETTING UPDATE.🚫\n\nEACH N EVERYTHING IS MUCH BETTER THAN OTHER laptop.\n\nALL ARE *****5 STAR\nBATTERY ONLY ****4 STAR.\n\nBEST FOR DISPLAY FOR ENTERTAINMENT,STUDENT,CHILDREN......eye ls never tired...\n\nJust bought at....42500 ...on 9 jan 22\n\nBest laptop ❤️Go n buy blindly❤️❤️",
            "Good",
            "Excellent laptop with premium quality... What a speed and performance OLED display is superb.",
            "Good",
            "Outstanding simply the image sharpness is just great",
            "This Product is awesome But Low Battery Life!!!",
            "Nice product I like it 👌 👍",
            "Over-all good",
            "On of the finest under 45000. It's not for raw power just some casual usage and you'll love the Netflix experience cause of the oled display",
            "Fir study perpose it's very very use full",
            "Very Nice Product. Value for Money.",
            "Best laptops in price",
            "Just awesome 🔥🔥",
            "Display is just lovely",
            "Its many scratches... And old laptop",
            "BEST DEVICE FOR Students.",
            "Really impressed with the laptop in terms of every aspect oled display is the show stopper solid build quality and performance is all rounder",
            "Recieved Yesterday, by far its very good. Suits my purpose: AutoCAD 2D for sometime and nothing much.\nWith Harman kardon sound is goo by can be improved.\nRest all is really well. Windows 10 is Perfect don't switch to 11.",
            "Some time display not working.",
            "Best peice in this price🤯🤯🤯",
            "I like this laptop\n1. Display Awesome- loved the screen only for 8k ulta hd videos, we can't get this awesomeness in hd videos\n2. Performance is descent, don't update my asus drivers, after update I have observed small lag and sometimes screen gets hang\n3. SSD is fast\n4. Battery as expected, but I am not a heavy user, lasts for 3 hrs\n5. Keyboard buttons quality is felt average\n6. Finger print sensor is fast\nI have got for 40k after all discounts, over all value for money and works fine my requirements",
            "Nice Laptop and Delivery is very Fast... 🥰",
            "Everything is good but battery backup is not so good",
            "The best product from asus performance is ok for this budget and that gorgeous display is a selling point of the product",
            "Value for money",
            "Nice",
            "Decent laptop considering the price point",
            "Amazing experience\nValue for monev\nVery low blue light as shown",
            "Very sturdy build with best display under 50k. Battery is average not too bad either depending on the use.",
            "Best laptop this price range",
            "Excellent product with an amazing OLED display.If you are buying for programming this is best at this range!",
            "I strongly recommend you to buy this laptop superb performance and very good looking overall I like this laptop,\nThanku asus India and thanku flipkart.",
            "Pros :-\nAmazing Display\nDecent Look\nPerformance is Good\nSound Quality Awesome\nCons:-\nBattery Backup average\nssd capacity i.e 256gb\n\nOver all verdict- value 4 for money",
            "Very nice and good in working.",
            "Fantastic product. Machless top notch oled panel...nice backlight keyboard ...every thing works perfect. body a bit slippery from outside...",
            "Excellent.",
            "It's amazing",
            "Dont worry\njust go for it\nworth every penny in this price range\nfast boot time,insane display",
            "It's an amazing laptop.",
            "Most of our fellow members have given great detailed reviews and I can't add anything to it. However would like to try and help if you still are on the verge of decision making.\nSo, if you love a great crystal clear bright display, spend lot of time binge watching movies or series and are ok to spend some extra bucks, this laptop is for you. Just go for it! You will not regret. It may be a tad slower (boot up) when compared to similar configuration models but makes up more than enough for it with its display.\n\nOnly challenge I faced was to upgrade to win11, had to do a clean install even though this laptop meets all the requirements.\nAlso, I got a cracked display in the box so had to get a replacement. So be careful when unboxing.\nHope this helps.",
            "Nice products but delivered was too late and it comes with intel i3 11gen 8gb ram and ssd so it is too fast and best display at this range oled 😍😍👍👍",
            "Great Display with decent performance",
            "Asus vivobook k 15 has a great display superb performance i am loving it. Windows 11 running smoothly",
            "Best device for this price range for now",
            "Worth for money. Good performance and great display",
            "Excellent display",
            "Perfect laptop for students damm display and workers very smooth thanks Asus,I really appreciate flipkart for a good price but the thing which disappointed me was being a seller you should provide GST as per the govt. norms",
            "Good",
            "Just nice product 😊",
            "Nice",
            "Best",
            "superb product",
            "good",
            "Windows 11 not supported.",
            "Best laptop in this price segment with best in class display,very good sound quality, good elegant design, good build quality and with good performance, bought this after very much research and comparisons this is the best in this price segment,u can blindly go for this...writing this review after using it for upto one month.",
            "Perfect product",
            "Awesome 👌",
            "gorgeous screen",
            "Really awesome display and performance is up to the mark. It's a classy laptop just go for it.",
            "just go for it , if you want good display",
            "Nice product",
            "Best for regular work at home office"
        ],
        "likes": [
            "148",
            "90",
            "67",
            "44",
            "13",
            "4",
            "4",
            "3",
            "10",
            "12",
            "6",
            "13",
            "12",
            "2",
            "7",
            "1",
            "1",
            "2",
            "2",
            "1",
            "1",
            "20",
            "12",
            "52",
            "14",
            "13",
            "8",
            "5",
            "12",
            "4",
            "5",
            "8",
            "20",
            "4",
            "3",
            "3",
            "2",
            "3",
            "15",
            "5",
            "2",
            "2",
            "2",
            "2",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "4",
            "3",
            "3",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "3",
            "1",
            "1",
            "3",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "22",
            "19",
            "11",
            "26",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "4",
            "4",
            "0",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "10",
            "1",
            "1",
            "0",
            "0",
            "2",
            "0",
            "0",
            "1",
            "8",
            "0",
            "0",
            "0",
            "0",
            "0",
            "11",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "2",
            "2",
            "2",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "1",
            "1",
            "9",
            "6",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "12",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:Is this laptop good for coding and programming?",
            "Q:Does it have SSD and HDD memory slots?",
            "Q:Ms office validity?",
            "Q:Can we increase ssd storage",
            "Q:Can i play GTA 5 smoothly?",
            "Q:Battery backup while coding",
            "Q:Is full body made of plastic?",
            "Q:type c charging?",
            "Q:How many camera in this laptop",
            "Q:Is its screen flickering",
            "Q:Is it good for editing photos and making websites or handling social sites like Instagram, twitter, youTube, etc?",
            "Q:Is there windows 11 update available right now or If not available right now when we will expect for windows 11 update on this device",
            "Q:It has fingerprint scanner...??",
            "Q:Can i play free fire and edit video in this",
            "Q:Does it have microphone?",
            "Q:Watch 4k video",
            "Q:This laptop support the very heavily editing software, like after efects?",
            "Q:Does it have LAN cable port?",
            "Q:Is there any problem on keypad and touchpad in this laptop??",
            "Q:It has back-lit keyboard",
            "Q:It have a cd driver",
            "Q:What is its refresh rate ?",
            "Q:can i use my bluetooth wireless headphones while watching movies in it?",
            "Q:Is this laptop have Bluetooth",
            "Q:Can i use Google meet app",
            "Q:Does it have metallic body",
            "Q:Can I upgrade to i5 processor ?",
            "Q:photoshop or illustrator use smoothly",
            "Q:Is ram can be expanded yes ya no",
            "Q:Please tell me that is it worth the money? Means for a regular usage is it so called oled for multimedia good?",
            "Q:How many color variations are there in this laptop?",
            "Q:Can I use unacademy in this?",
            "Q:Its made of plastic or Alluminium",
            "Q:Can I play free fire in this laptop?",
            "Q:I want to know about nits of this laptop",
            "Q:Does it have extra slot for HDD?",
            "Q:How many watt speaker does it have please tell",
            "Q:Gta 5 support",
            "Q:what are the temperatures when used for general browsing and watching movies? does it heat much to the keyboard or bottom part?",
            "Q:Is external hard hard disc cover available in the box?",
            "Q:There are another model in description silver colour write there 200 nits brightness of this model and 400 nits silver model . Any ine tell me what is truth",
            "Q:Does it have backlight",
            "Q:Is ms office valid for lifetime?",
            "Q:Is the ram and rom expandable",
            "Q:it can be upgrade to window 11",
            "Q:Can I use it while charging?",
            "Q:Is there any burning issue with this display???",
            "Q:Can we play lightweight games like CS:GO ?",
            "Q:Does it support wifi 6?",
            "Q:if i get this laptop should i upgrade my hdd or SSD?",
            "Q:What is c port used for ?",
            "Q:can we put any software in it",
            "Q:Is this laptop rotatable, if it is then upto what extent it is rotatable ?",
            "Q:Does it have internal mic?",
            "Q:It was tux paint",
            "Q:Can i use for accounting like Tally prime software.?",
            "Q:It has detected Graphic card",
            "Q:Which feature is come in laptop in place of dolby atoms"
        ],
        "answers": [
            "A:beat laptop for coding and gaming also",
            "A:yes",
            "A:lifetime",
            "A:yes offcourse . you can easily upgrade it up to 1TB. SSD or HDD . you have to use SATA SSD",
            "A:yes",
            "A:on heavy uses it can last only 3-4 hours and on casual uses 6-7 max.",
            "A:Yes,but plastic quality is good",
            "A:No.",
            "A:One",
            "A:Yes it do flicker at 50% brightness",
            "A:Yes",
            "A:yes available",
            "A:Yes .",
            "A:yes you can play freefire using Android emulator, and yes you can use this laptop to edit your videos as well",
            "A:Yes",
            "A:you can adjust pixel higher than 2160 ... at full brightness tear drops from eyes . awesome display . recommended",
            "A:I don't think so, as it hasn't got a dedicated graphics card...it might do the work, but would be slow I guess...",
            "A:No it doesn't.",
            "A:No, the keyboard and track pad works well.",
            "A:yes it have",
            "A:No.",
            "A:60 Hz",
            "A:Yes",
            "A:Yes it has Bluetooth V5.0",
            "A:Indeed, it very much supports Google Apps perfectly",
            "A:The lid is metallic...the body is plastic. However,I found that the build quality is good enough.",
            "A:no",
            "A:Yes no problem at all",
            "A:Yes. It can be expanded. Keep in mind, 4gb of ram is built in. So I added 16gb ram single stick. Now I got 20gb ram.. Works fine for me",
            "A:It's worth the money. You get Win OS 10 upgradable to 11 MS office and Mcaffe Antivirus for 1 year and OLED screen with minimised blue light emission. So far I haven't watched movies on it.",
            "A:2 :Silver and Matte Black ...",
            "A:Yes, absolutely.",
            "A:Plastic",
            "A:Yes",
            "A:400 nits brightness but no profit 😕 it prohibits not to use brightness more than 50% otherwise the display of this laptop will start burning n cause permanent damage and it will not come in wrnty",
            "A:yes,it contains.",
            "A:1.5 W Most Probably that's the output rating and it has dual speakers. So, basically the total output is around 3 watt and it sufficiently good for basic needs. The audio quality, is however excellent",
            "A:yeah works nice 👍",
            "A:normal",
            "A:yes",
            "A:Peak Brightness is 400 nits.",
            "A:Yes",
            "A:Yes",
            "A:yes upto 12Gb",
            "A:Yes. Ofcourse",
            "A:Yes, but be ready for jhatka b'coz of metal body",
            "A:no that's not. if burn (although 0 chances) customer care help you the customer support from asus great .",
            "A:yes,but not for long duration like 3-4 hrs",
            "A:Yes, it supports WiFi 6",
            "A:yes. we can upgrade .",
            "A:You can use it for anything except charging the laptop.",
            "A:yes please add Adobe photoshop",
            "A:No it is not rotatable, it goes to a maximum of around 120-130 degrees",
            "A:Yes",
            "A:yes",
            "A:Yes",
            "A:Yes,it has 4 gb shared integrated UHD graphic card",
            "A:DTS app is preloaded...however, it might not support bluetooth earphones (as in my case), then you might need to install DTS Unbound or Dolby Access from Microsoft Store (both are paid apps)."
        ],
        "likes": [
            "17",
            "18",
            "16",
            "16",
            "11",
            "7",
            "4",
            "2",
            "2",
            "6",
            "2",
            "1",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "14",
            "15",
            "15",
            "3",
            "3",
            "14",
            "6",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0"
        ],
        "dislikes": [
            "2",
            "2",
            "2",
            "7",
            "6",
            "2",
            "1",
            "0",
            "0",
            "8",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "3",
            "3",
            "3",
            "0",
            "0",
            "7",
            "3",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0"
        ]
    }
}