{
    "title": "SAMSUNG Galaxy Tab S7+ 6 GB RAM 128 GB ROM 12.4 inch with Wi-Fi+4G Tablet (Mystic Navy)",
    "product_specification": {
        "Model Number": "SM-T975NDBAINU",
        "Model Name": "Galaxy Tab S7+",
        "Color": "Mystic Navy",
        "Connectivity": "Wi-Fi+4G",
        "OS": "Android",
        "Operating System Version": "10",
        "RAM": "6 GB",
        "Voice Call": "Yes",
        "Display Resolution Type": "Quad HD",
        "Video Call": "Yes",
        "Supported Network": "4G LTE, WCDMA, GSM",
        "Display Supported Network": "LTE",
        "Processor Type": "Qualcomm Snapdragon 865 Plus",
        "Series": "S Series",
        "Additional Features": "Quad Speaker Sound by AKG and Dolby Atmos, 45 W Super Fast Charging Support",
        "Display Size": "31.5 cm (12.4 inch)",
        "Sales Package": "Tablet, S Pen, Travel Adapter, USB Type A to Type C Cable, SIM Ejector Tool, Quick Start Guide, Warranty Card",
        "Display Resolution": "2800 x 1752 Pixels",
        "Primary Camera": "13 Megapixels",
        "Internal Storage": "128 GB",
        "Processor Speed": "3.09 GHz",
        "Sim Size": "Nano SIM",
        "Multi-touch": "Yes",
        "Sensors": "Accelerometer, Compass, Gyro, Light, Fingerprint Sensor",
        "Sim Type": "Single Sim",
        "ROM": "128 GB",
        "Battery Capacity": "10090 mAh",
        "Document Editor": "Yes",
        "Document Viewer": "Yes",
        "E-mail": "Yes",
        "Secondary Camera": "8 Megapixels",
        "Video Recording": "Yes",
        "Full HD Recording": "Yes",
        "HD Recording": "Yes",
        "Other Camera Features": "5MP (F/2.2) Ultra Wide Rear Secondry Camera, Night Mode",
        "2G": "Yes",
        "3G": "Yes",
        "3G via Dongle": "Yes",
        "Bluetooth Version": "v5.0",
        "USB": "Yes, USB 3.2 Type C (1st Gen)",
        "Browser": "Android",
        "Other Connectivity Features": "Bluetooth Support",
        "Other Display Features": "Quad HD Super AMOLED HDR10+ Display (120 Hz Refresh Rate, Ultra-low Latency S Pen Support, 266 PPI, NTSC Color Range, Eye Care Certification)",
        "Display PPI": "266 PPI",
        "Display Colors": "16 M",
        "Display Type": "Super AMOLED",
        "Full HD Playback": "Yes",
        "HD Playback": "Yes",
        "Video Playback": "Yes",
        "GPS Support": "Yes",
        "GPS Type": "A-GPS, Glonass, Beidou, Galileo",
        "Map Support": "Google Maps",
        "Expandable Storage Capacity": "1 TB",
        "Memory Card Slot Type": "microSD",
        "Memory Card Support": "Yes",
        "Warranty": "1 Year",
        "Warranty Summary": "1 Year Warranty Provided by the Manufacturer from Date of Purchase",
        "Warranty Service Type": "Carry In",
        "Domestic Warranty": "1 Year",
        "Covered in Warranty": "Manufacturing Defects",
        "Not Covered in Warranty": "Physical Damage",
        "Warranty Period": "1 Year"
    },
    "product_description": {
        "Seamless Work and Entertainment": "The fast 120 Hz display of this Samsung smart device offers smooth and seamless visuals. Furthermore, the low-latency S Pen makes work, play, and creativity fun and effortless.",
        "Impressive Display": "The 31.5-cm (12.4) Super AMOLED display offers an immersive visual experience. Furthermore, the fast responsiveness of this display makes your visuals come alive. This display adjusts the refresh rate intelligently as per the content to help save the battery life.",
        "Impressive Viewing Experience": "The Super AMOLED display along with a Quad speaker sound from AKG and Dolby Atmos offers an immersive viewing experience on the move. You can enjoy shows continuously for up to 14 hours on this tablet that features low blue light to protect your eyes.",
        "Fast Processor": "This tablet is powered by the Qualcomm Snapdragon 865 Plus mobile platform to offer you a seamless and fast computing experience. This is an intuitive and intelligent chipset that lets you play intense games and do multitasking easily with minimal lag.",
        "Intense Gaming Experience": "This tablet offers bold colors on its display to let you enjoy exciting visuals of your favourite games. Also, the Quad Speaker Sound ensures that you feel the excitement of your favorite games.",
        "Intelligent Battery": "This Samsung tablet features a 10090 mAh battery that lasts for a long time. Also, the Fast Charging technology ensures that your tablet is always up and running.",
        "S Pen": "This S Pen offers a comfortable and solid grip to let you work for hours without discomfort. Also, its low latency ensures that this pen keeps up with your imaginations and thoughts. Furthermore, it offers a true writing experience. Also, you can magnetically attach the S Pen on the backside of the tab when you are not using it.",
        "Clip Studio Paint": "Using the S Pen with the Clip Studio Paint, you can bring your imagination to life. You can illustrate, make comics, do inking, and much more using the various tools of the Clip Studio Paint. So, you can create art effortlessly on this tablet.",
        "Mark on PDFs": "This tablet lets you import PDF files, make memos, sign documents, and even leave comments on them.",
        "Design Effortlessly": "This tablet comes with pre-made templates as well as you can make your own templates using the intuitive editor. So, you can make marketing materials, social media posts, and much more on this tablet.",
        "Noteshelf for Your Thoughts": "Using the Noteshelf, you can take notes the way you want with the S Pen or through typing. Its fluid note-taking feature offers the liberty to take notes easily.",
        "Ultra-wide Camera": "The rear camera system of this tablet features a 5 MP Ultra-wide camera and a 13 MP Wide-angle camera with 4K at 30 FPS recording facility. There are also additional features, such as the Night Mode, Screen Optimizer, and AR Doodle, for improving the quality of your photos.",
        "Thin, Light, and Durable": "This is a stylish tablet that features a dual-color anodizing technique for a stunning exterior. Also, it has exquisite aluminum textures that are created using polycrystalline diamonds and along with a micro-sandblasted finish, it is a soft device to touch."
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "2",
            "3",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "2",
            "1",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "2",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "2",
            "3",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5"
        ],
        "review": [
            "I was using this tab for past 1 week, my experience is literally great.\nFirst of all the display, it was so good bcoz of the 120hz refresh rate, Ram I think samsung show provide 8gb variant in India, Sounds are really awesome...quad speakers, Camera is ok, For regular use battery stands for 6-8hrs, stand-by is good. S pen is awesome with low latency, over all truly it is a multi tasking monster can't compare with ipad pro but still It can compete with apple through some 3rd party applications",
            "Must buy\nGreat device with beast performance and ultra smooth writing experience with super cool S pen.\nit's always better to write on this except papers.\nI have been completely fallen in love with it.\nAnd yeah i haven't found any cons for this particular device but this one has a decent camera don't expect too much for camera results\nPros.\n(Display) there's no comparison.\nIt has Quad HD resolution with 120Hz screen refresh rate.\n(Processor) it has latest and greatest processor Snapdragon 865+ on 3.09 ghz clock speed with based on 7 nm architecture",
            "Straight out this is a really amazing product. I had done almost a month of research before narrowing down on this piece of hardware. I have a unique use case but i think most of what i do is what is done by most out there. I wanted to save on my expenses for a laptop and a phone. Specifically wanted to have a move around phone plus laptop. There are some options out there but nothing with the sheer power of this 865 plus chipset with that many cores.\n\nI log into remote servers, edit and update documents, attend tons of zoom and GOTOmeetings and web exes. And i also consume media. Not so much gaming or into photo graphs at the moment. But maintaining 2 separate devices for these use cases along with the usual android mobile banking and ecommerce applications, is a real pain. The phone is not sufficiently powered if i need a huge battery and if it does have a heavy battery and very good specs, it costs a bomb and Icant do office stuff on it.\n\nBOOM! Enter Tab s7 plus. A tablet with 4g and 865 plus processor. snap a keyboard cover on with a 45 watt power brick and u have a mobile workstation that doesnt cost like the HP dragonfly and at the same time can put the macbooks or asus laptops in the proce brackets to the shame. I dont have a gaming requirement so the adreno is just fine for any graphic requirement. I cant expect a similar performance from a chromebook at the pricepoint. I believe i have just landed the perfect marriage between performance, pricepoint, utility for a laptop and a phone.\n\nBefore I thank you there are 4 CONS.\n1. The price should have given me a 8GB variant.I am sorely pi$$ed\n2. the rear camera and the mics can definitely be upped a coiple of notches.\n3. There needs to be a 3.5 mm jack for all my legacy devices.\n4. I need to defiinitely get a hdmi connector jack from a USB C like the one u shipped with the S10 e.\n\nOtherwise, you nailed it samsung.",
            "Excellent tablet from Samsung... display is super premium...and ultra smooth . Can't complain about battery as it has a 10000 mah battery . I was surprised with its camera ...as a tablet it shoots wonderful pictures . & I'm in love with the Dex mode.",
            "Great product and great performance. UI is very smooth. very good battery life. And the best pact is it doesn't heat. Samsung should have provided a 25W or 45 W charger in the box.",
            "Flagship Tablet for a reason. You will simply enjoy the super AMOLED screen which is crystal clear and the feel of touch is simply superb. Dolby quad speakers produce loud high quality audio and you will definitely love to watch action movies with high volume.\nI mainly bought this for reading purpose along with occasional entertainment of movies, games. SPen is definitely the highlight here and it simply makes Note taking more enjoyable. Battery life is boon when you want to read for longer ...\nREAD MORE",
            "Pros - Amazing Display , Great Battery life , Smooth motion with 120 Hz refresh rate , Slim and lightweight , Ability to operate in Dex mode like a laptop , Sim and Micro SD slot, S-pen included for notes.\n\nCons - Fast Charger not included , Samsung Dex does'nt support all apps like Netflix, Prime etc properly. Work needs to be done to optimise them. Could have given 8 GB RAMand 256GB storage at this price.\n\nKeyboard Cover has to be purchased separately .",
            "Giving my honest review after using it for a week :)\nI found some pros and cons.\n\nPros:\n\n• Display, the amoled pannel is the best in the market & the 120hz refresh rate just makes its buttery smooth\n\n• Battery, the 10090 mah battery will easily last you 1-2 days of use and 1 day of heavy use (i would suggest use dark mode to save some battery)\n\n• Performance, the snapdragon 865+ just takes it all without any hiccups. Plus, there is no heating at all\n\n• S-pen, it is the main reason many would buy this over ipad air. The latency is near to none, and it just take 2-3 minutes to full charge it and it increases the productivity by a lot\n\n• One UI Software, it is smooth with no lag-stutters and it's well optimized for tablet, and the feature list is endless\n\n• Speakers, the AKG tuned quad speaker setup just makes it a multimedia beast\n\n• Design and build, the all metal build and the flagship design makes it oh so premium and the weight distribution is good which makes it fell lighter than it is\n\n• The keyboard cover, you don't get it in the box and it cost around 17k, but the productivity and the flexibility of the tab increases by a lot and with the DEX mode you get a laptop like experience\n\n• Fingerprint scanner, the in-display fingerprint scanner works like a charm. It's works like 9-10 times (Unless you put a screen gaurd)\n\nNow, for some cons....\n\n• No 3.5 mm jack, it is the main con of this device, you just feel the need of it many times. (Sure, the problem can be solved by buying a adapter, but it just makes it cumbersome to use)\n\n• It's Thin, this would sound lame but from a practical point of view it's not great. The tab is just 3/4th of the size of the S-pen which makes it a bit fragile.\nI would highly recommend to use a good cover with it\n\n• S-pen position, the position of S-pen while charging (below the rear camera) makes it a pain, and sometimes irritating. You can't keep your device down, it also comes in the way while holding the tab in the potrait position\n\n• Charger, the tab supports 45w, but still samsung gives you a meak 15 watt charger in the box which takes more than 3 hours to charge from 0-100\nI would recommend you to buy a 45watt fast charger\n\nNow some things which could be improved (not a pro or con),\n\n• Camera, ik camera doesn't matter in tablet, and it clicks decent photos. but from a flagship product you expect everything to be good\n\n• optimization, it's not samsung fault rather it's androids way of optimizing apps. Some apps only work in portrait mode only\n\nOverall you can blindly go for the tab. It will just create a smile on your face :)\nPS: i would highly recommend you to go and check this product in a offline store before buying",
            "One of the best tabs available in the market currently. Super display so it's a eye catcher for those who binge a lot of OTT content. Sound is fantastic with Dalby surround. Processor works absolutely without any lag. S Pen is included which is a big relief and works amazingly well. Touch response is super good. Keyboard and book cover pricing could have been a bit cheaper.\nAlso has a Dextop mode for office work.\nOverall mighty impressed and a must buy",
            "The best Multimedia device in the market..\n\nThanks flipkart for the wonderful deal.. got it for 41k.\n\nWatching movies is this 12\"oled is so satisfying and the speakers are damm good\n\nGetting only 4 hour screen on time in full brightness and takes 2.5 hours for full charge with 25watt charger",
            "I was using this tab for past 1 week, my experience is literally great.\nFirst of all the display, it was so good bcoz of the 120hz refresh rate, Ram I think samsung show provide 8gb variant in India, Sounds are really awesome...quad speakers, Camera is ok, For regular use battery stands for 6-8hrs, stand-by is good. S pen is awesome with low latency, over all truly it is a multi tasking monster can't compare with ipad pro but still It can compete with apple through some 3rd party applications",
            "Must buy\nGreat device with beast performance and ultra smooth writing experience with super cool S pen.\nit's always better to write on this except papers.\nI have been completely fallen in love with it.\nAnd yeah i haven't found any cons for this particular device but this one has a decent camera don't expect too much for camera results\nPros.\n(Display) there's no comparison.\nIt has Quad HD resolution with 120Hz screen refresh rate.\n(Processor) it has latest and greatest processor Snapdragon 865+ on 3.09 ghz clock speed with based on 7 nm architecture",
            "Straight out this is a really amazing product. I had done almost a month of research before narrowing down on this piece of hardware. I have a unique use case but i think most of what i do is what is done by most out there. I wanted to save on my expenses for a laptop and a phone. Specifically wanted to have a move around phone plus laptop. There are some options out there but nothing with the sheer power of this 865 plus chipset with that many cores.\n\nI log into remote servers, edit and update documents, attend tons of zoom and GOTOmeetings and web exes. And i also consume media. Not so much gaming or into photo graphs at the moment. But maintaining 2 separate devices for these use cases along with the usual android mobile banking and ecommerce applications, is a real pain. The phone is not sufficiently powered if i need a huge battery and if it does have a heavy battery and very good specs, it costs a bomb and Icant do office stuff on it.\n\nBOOM! Enter Tab s7 plus. A tablet with 4g and 865 plus processor. snap a keyboard cover on with a 45 watt power brick and u have a mobile workstation that doesnt cost like the HP dragonfly and at the same time can put the macbooks or asus laptops in the proce brackets to the shame. I dont have a gaming requirement so the adreno is just fine for any graphic requirement. I cant expect a similar performance from a chromebook at the pricepoint. I believe i have just landed the perfect marriage between performance, pricepoint, utility for a laptop and a phone.\n\nBefore I thank you there are 4 CONS.\n1. The price should have given me a 8GB variant.I am sorely pi$$ed\n2. the rear camera and the mics can definitely be upped a coiple of notches.\n3. There needs to be a 3.5 mm jack for all my legacy devices.\n4. I need to defiinitely get a hdmi connector jack from a USB C like the one u shipped with the S10 e.\n\nOtherwise, you nailed it samsung.",
            "Excellent tablet from Samsung... display is super premium...and ultra smooth . Can't complain about battery as it has a 10000 mah battery . I was surprised with its camera ...as a tablet it shoots wonderful pictures . & I'm in love with the Dex mode.",
            "Great product and great performance. UI is very smooth. very good battery life. And the best pact is it doesn't heat. Samsung should have provided a 25W or 45 W charger in the box.",
            "Flagship Tablet for a reason. You will simply enjoy the super AMOLED screen which is crystal clear and the feel of touch is simply superb. Dolby quad speakers produce loud high quality audio and you will definitely love to watch action movies with high volume.\nI mainly bought this for reading purpose along with occasional entertainment of movies, games. SPen is definitely the highlight here and it simply makes Note taking more enjoyable. Battery life is boon when you want to read for longer ...\nREAD MORE",
            "Pros - Amazing Display , Great Battery life , Smooth motion with 120 Hz refresh rate , Slim and lightweight , Ability to operate in Dex mode like a laptop , Sim and Micro SD slot, S-pen included for notes.\n\nCons - Fast Charger not included , Samsung Dex does'nt support all apps like Netflix, Prime etc properly. Work needs to be done to optimise them. Could have given 8 GB RAMand 256GB storage at this price.\n\nKeyboard Cover has to be purchased separately .",
            "Giving my honest review after using it for a week :)\nI found some pros and cons.\n\nPros:\n\n• Display, the amoled pannel is the best in the market & the 120hz refresh rate just makes its buttery smooth\n\n• Battery, the 10090 mah battery will easily last you 1-2 days of use and 1 day of heavy use (i would suggest use dark mode to save some battery)\n\n• Performance, the snapdragon 865+ just takes it all without any hiccups. Plus, there is no heating at all\n\n• S-pen, it is the main reason many would buy this over ipad air. The latency is near to none, and it just take 2-3 minutes to full charge it and it increases the productivity by a lot\n\n• One UI Software, it is smooth with no lag-stutters and it's well optimized for tablet, and the feature list is endless\n\n• Speakers, the AKG tuned quad speaker setup just makes it a multimedia beast\n\n• Design and build, the all metal build and the flagship design makes it oh so premium and the weight distribution is good which makes it fell lighter than it is\n\n• The keyboard cover, you don't get it in the box and it cost around 17k, but the productivity and the flexibility of the tab increases by a lot and with the DEX mode you get a laptop like experience\n\n• Fingerprint scanner, the in-display fingerprint scanner works like a charm. It's works like 9-10 times (Unless you put a screen gaurd)\n\nNow, for some cons....\n\n• No 3.5 mm jack, it is the main con of this device, you just feel the need of it many times. (Sure, the problem can be solved by buying a adapter, but it just makes it cumbersome to use)\n\n• It's Thin, this would sound lame but from a practical point of view it's not great. The tab is just 3/4th of the size of the S-pen which makes it a bit fragile.\nI would highly recommend to use a good cover with it\n\n• S-pen position, the position of S-pen while charging (below the rear camera) makes it a pain, and sometimes irritating. You can't keep your device down, it also comes in the way while holding the tab in the potrait position\n\n• Charger, the tab supports 45w, but still samsung gives you a meak 15 watt charger in the box which takes more than 3 hours to charge from 0-100\nI would recommend you to buy a 45watt fast charger\n\nNow some things which could be improved (not a pro or con),\n\n• Camera, ik camera doesn't matter in tablet, and it clicks decent photos. but from a flagship product you expect everything to be good\n\n• optimization, it's not samsung fault rather it's androids way of optimizing apps. Some apps only work in portrait mode only\n\nOverall you can blindly go for the tab. It will just create a smile on your face :)\nPS: i would highly recommend you to go and check this product in a offline store before buying",
            "One of the best tabs available in the market currently. Super display so it's a eye catcher for those who binge a lot of OTT content. Sound is fantastic with Dalby surround. Processor works absolutely without any lag. S Pen is included which is a big relief and works amazingly well. Touch response is super good. Keyboard and book cover pricing could have been a bit cheaper.\nAlso has a Dextop mode for office work.\nOverall mighty impressed and a must buy",
            "The best Multimedia device in the market..\n\nThanks flipkart for the wonderful deal.. got it for 41k.\n\nWatching movies is this 12\"oled is so satisfying and the speakers are damm good\n\nGetting only 4 hour screen on time in full brightness and takes 2.5 hours for full charge with 25watt charger",
            "This is the best product samsung has ever made....Such an amazing tab..Such an amazing performance...\nSeriously Loved it..:)\nThe Amoled display, the screen size And the Dolby sound gives you the theatre movie experience... I suggested this to my friends and after i bought this...5 of my friends also bought this ..and they are happy too..\nThis is the best in the market...Even better than Ipad Pro and its a fact. :)",
            "Very good tablet with value for money. It's very good for productive work with samsung dex and main highlight is you can use this as second screen with windows laptop,it can easily replace laptop who are normal users with surfing and typing",
            "Pros:\n\n1. The OLED panel display with 120Hz refresh rate is a treat to the eyes.\n2. The S-pen stylus is a joy to write with and glides butter smooth on the screen. (Definitely better than the Apple pencil which feels much heavier to use and comes with an additional price of around 12k)\n3. The AKG tuned quad speakers project crispy clear sound with just the right amount of bass. ( The Dolby Atmos option gives a surround sound experience)\n4. Battery is enough to last you one whole day of using DEX, editing, multi-tasking and watching videos. (I don't play games so not considering gaming)\n5. Camera quality actually exceeded my expectations. (Athough nobody uses tablets for photography)\n\n\nCons:\n\n1. Expected 8GB RAM with 128GB ROM variants too.\n2. The DEX software that mimics a proper desktop needs upgradation.\n3. As of now, the Android tablets have lesser pool of App availability than their iOS counterpart.\n4. The 16:10 aspect ratio might be an issue for the one's who have been used to Apple's 4:3",
            "Omg, it's the best Android tablet one can get. Best mentions would be the display(everything just pops out :p) and the quad speaker setup(fkin immersive sound tech). The display is byfar the best display I have ever used and after 15 days I still cnt get enough. The speakers are just insane. I wonder what kind of engineering have been done in collaboration with akg, but the loudness, the clarity and the 3d surround sound cinema like effect these speakers generate is just INSANE. I actually stopped using my 12w Bluetooth speakers, because these are god speakers on any smart device ever, period. Talking of multimedia consumption, multitasking or simply scrolling through social media is utter pleasure. I literally spend like 10 hours a day on this tablet since it has arrived🤣.",
            "This is a great tab. Whoever said that android tabs aren't good for productivity may change his mind after using this one. For my use cases of gaming, media consumption and online classes, this works great. The display, multitasking interface and speakers are just delightful. The camera is so-so in indoor conditions but works great with natural lighting. The phone is very snappy and apps open without any lag owing to the SD 865+ processor. The multi-tasking possibilites are immense props to Samsung DeX (turns UI into desktop-like interface) and also the multi-window features. I hardly use my phone or laptop for productivity purposes after I bought this. (Except for calling and gaming ofcourse.)\n\nGo with this without any second thoughts as there isn't any alternative at this price point.",
            "Great product. A true IPad competitor for Android fans. Amazing integration with Windows OS and Samsung mobile. You can receive video calls after connecting with Samsung phones, file sharing between Windows and Samsung smartphones is seamless and very fast.\nDisplay best any day.\nProcessing is Amazing with 865+ with zero heating.\nSPen is very powerful and realistic.\nBuild is very very premium.\nSamsung has optimized OneUi, especially for Tablets and any application which is in portrait or not full screen yu can force it to landscape and it works nice but its still in Labs so mightnot work with all the application currently. Also, Dex is super useful.\nSo just give a try over Ipad for android users one will surely love it.",
            "Super fast and smooth experience. Handles all day-to-day tasks with ease.\nSamsung could have provided the 8GB RAM with 256 GB ROM in India.\nAdditional Memory card slot is a plus.\nThe camera module could have been better (not important for tablet users).",
            "After one month of use this is An Absolute beast got it for 56k in Big Billion Days. As a pro iPad user I can truly say, A true iPad Pro Killer and more better screen than iPad pro. 120hz screen makes a great experience and an artist expert. Including a pen is a masterstrok by samsung and believe me it's amazing to use it as it has low latency which makes the experience more better. If you are looking for something pro as an artist or for entertainment or gaming, this is the best choice in great budget.",
            "I baught this on holi sale .\nPro's\n1. best display at this segment.\n2. Best camera\n3. Fast face or fingerprint unlock\n4. Best performance but...\n5 . Spen\nCons\n1. Camera is not top notch like ipad air\n2. S pen glitch on side screen\n3. Performance is good but not good for gamer because\nof Android\n4. Heating issu on screen horizontally",
            "I got this on the 5th march and writing revuew after 15 days,\nIf we talk about the camera,\nI havent recorded the video but clicked the pictures,\nThe are amazing after the processing,\n\n2. If we talk about display that is its one of the strong side,\nDisplay is huge and too much impressive,\nAnd as I am Samsung user so addicted to the samsung super amoled displays,\nDisplay is too much comfortable tp use you can use it like the mobile whole day,\n\n3. If we talk about performance it has a superstrong 885 + it can easily handle the BGMI AND PUBG LITE.\nAnd smoothly operate the video editing software.\n\nIf we talk about value for money then it is much better then Ipad air 4,\nWhich along with apple pencil cost about 62 k.\nSo it is performing just amazing",
            "The Quad HD super amoled 120 hz refresh rate with combo of Snapdragon 865 plus is just a treat .One of the best tablet that the market can offer in the current market .The battery life too on cellular network with promotion lasts around anywhere between 6 hrs to 7 hrs .And the camera are way more than average for a tablet .",
            "Hardware is top class... Software needs a huge improvement... Apple ipad pro comes as a winner only because of its camera and operating system.... Can't blame Samsung because it has no control over the android operating system... Anyways great work samsung.... Keep it up...",
            "Loved this product especially for the price i got it\nI am an artist and I needed a digital medium for my art\nThis tab is simply amazing and fits my requirement perfectly",
            "The device really keeps end of its bargain. The display is so fluid, buttery smooth and if you are someone who consume multimedia in Netflix and Prime, you get a whole of HDR + capabilities for rendering videos/pictures giving you top-notch experience. The 120 hz refresh rate just adds up to to the spice.The engine Processor 865 plus is still one of the best in the market and takes gaming experience next level. Although at this price point IPad with M1 Processor is available in the market but you get a limitation of 64gb internal storage. So overall with snapdragon 865+ with 120hz refresh rate, 6gm RAM & 128gb storage brings a much better deal at this price. I use this device for notes writing as well and S pen is the magic wand. There is absolute no lag while you write and it has also on air action features.",
            "I got it for diacount in sale for 55k so considering that its a very good value for money tablet. Sound and display are great. Not taking and drawing are my primary use and overall experience is good so far. Battery backup is also good. I have note 20 5g,that small stylus pen also work with this display. I dont play games so no comments but it can handle general games. Of 6 gb, 4 gb is used and 1 gb is available. Overall i like it and though its launched 2 yrs back and s8 will be launched soon, this tab is still worth it.",
            "Its a nice tablet.\nEsp display..\nI have seen & used 2018 ipad pro.. But the display here is much.. Much better than those..\nEven though they dont match ipad in terms of raw performance. Still its the best android tablet u can currently get on the market..\nIf your needs includes powerpoint presentation & all.. This can replace ur laptop.\nAll though dex mode is oly a half baked cookie( many apps still doesn't support it including instagram), v hope that samsung adds further optimised future updates..",
            "Awesome display. Performance smooth. Especially 120 hz makes it flawless and beautiful. Slim and sleek design. And clear and rich sound delivered by AKG. Value for money.",
            "The display is beautiful. Battery life is about 7 plus hours which is fantastic. Dex works great with keyboards. Honestly the power of this tab is plenty to replace a laptop but the software lacks great applications for photo/video editing. I found no complaints in my one week use. Large and heavy to hold with one hand for longer duration. Reading Kindle books is a treat on this device. It is still expensive if you are looking for a laptop because you need the keyboard cover for proper computer experience. You can easily connect any Bluetooth keyboard mouse with a dongle. No heating issue. Very sleek. Great for media consumption like Netflix and Prime video.",
            "Amazing screen.\n\nThe Highlight this tablet is its screen, it has really vivid display with great contrast and good Color saturation. The 120Hz refresh rate makes an awesome experience to consume media on this screen.\n\nAwesome S-Pen\n\nThe S-Pen is really responsive and feels like writing with real pen on a piece of paper.",
            "If you're a student and want to write notes then apple offers good apps than android, especially if we consider synchronisation but Samsung notes is manageable, it's not that bad.\n\nS-pen: It has a rubberized nib which seems prone to damage but its working fine. For writing notes, actually its good when compared to Apple. Because apple got a plastic tip which is slippery , thanks to s-pen for a rubberized pointed tip.\n\nDisplay: Amazing display. Amoled has its own advantage, vibrant colors but nowadays ips ans lcd displays are too good. Normally one can't find difference unless compared side by side.\n\nPerformance: 865+ is a quite capable processor and Samsung One UI is well optimised.\n\nCamera: Although in a tab camera has not as many functions as in a mobile but at this price range it is average.\n\nSound: Quad Speakers optimised by AKG with Dolby sound- You can't expect more than what it has. It's fantastic.\n\nScreen protection: You will need screen guard because gorilla glass 3 is prone to scratches. At this price range it should have offered a better screen.\n\nCharging is quite slow, thanks to the slow adapter in box.\n\nIf you want to replace your laptop for official work, you need keyboard and mouse. Dex mode is good to work with.",
            "First time flipkart delever on time.\nTab s7 plus - best Android tab, great performance\nGo for it guys",
            "Superb product. Go for it without any hesitation. Display is tremendous.",
            "Great Performance, Marvelous Display, Massive Battery, Decent Camera's and Great Build",
            "Great Product ...\n\nBest value with Excellent specs for professionals and content consumers too.\n\nPre-ordered on launch date .. Thanks flipkart for great service.",
            "I'm loving it",
            "Just amazing.Performance and display is top notch",
            "Excellent tab size is almost equivalent to a laptop touch feel sound everything topnotch, above this i got this in 41k so happy",
            "It gets warm quickly on a regular use near the centre bottom around keyboard connector area. Not sure if this is just mine or a general issue.",
            "Battery is not good.I think I got default product.",
            "Display Good Camera as well as good battery was pathetic and price little bit high",
            "Better than buying new tab s8 plus at this price",
            "I loved it",
            "There is heating problem on touchscreen of lower area. Is there any solutions for it?",
            "A well maintained and optimized device. If u love android then this one is for you guys.",
            "Super Good.",
            "premium product..... exceptional quality.... for those who wants top notch performance and tech crazy..... only downside is camera performance and Android app support......",
            "Perfection redefined. Technological elegance.",
            "Excellent Tab",
            "Most powerful Android tab\nNice performance\nSuper display\nToo good ....",
            "Best Android tab!no doubt about that. Display, Speakers, performance, build quality everything is topnotch. Samsung hasn't made any compromises to make this tab. So, if you are ready to spend and want a android tab or any tab for that matter then you should definitely consider S7+.",
            "Display is top notch and most smoth experience of 120hz and snapdragon 865+ and speakers are very loud and crisp very happy with the product",
            "compare to other E-Commerce online store. The price is very good at Flipkart. The table it self is beautiful. The Viewing experiences is wonderful. Little bit heavy for long use but I am happy with the product.",
            "Excellent product.",
            "One of a kind, in love with display. Stylus is added advantage, got s7 plus wifi version at 49k in big billion sale. Keyboard is useless, better get Logitech k400 plus, cheap and effective. Peace.",
            "Value for money! Performance wise i will give 5 stars.",
            "A beast indeed!!!...be it portability, media consumption or display, this tab will be a prime product in its genre for a long long time to come...don't want to pull out your laptop???...don't worry...tab S7 plus at your rescue...seamless performance and brilliant display...pair it up with a book cover and there you go!!!...and interestingly the battery performance is not bad either...i get upto 8 hours of high performance(wifi on, netflix hd mode, brightness at 80 percent and bluetooth connected) on any given day...a tad reduction in the weight is suggested...but no complains if they don't!!!...if you have the budget...close your eyes and hit that order button...trust me you won't regret it!!!",
            "Awesome product",
            "Excellent tablet! However, Samsung could have given the 8GB/256GB variant at this price.",
            "Close your eyes and grab it. Trust me you won't regret.. 😍😍❤❤",
            "Don't think just buy",
            "The best tab love to use for trading and for AutoCAD",
            "SuPeRb..\nTotally BEAST in Android TabLet",
            "Stunning display and extraordinary sound quality, must to have gadget",
            "Just amazing",
            "Display and battery back up is outstanding.\nPerformance is great. Didn't find any lag so far.\nCamera quality is ok type. Good is outdoors but poor and pixilated in night.\nSound quality is good but lacks heavy bass as compared with ipad pro.\n\nOverall must buy product. As 3rd party apps also can be easily installed and also comes with expandable memory storage which is not there in ipads.",
            "I just loved it.\n\nAmazing screen.\nAmazing sound.\nS pen works nice.\nPremium feeling.\n\nIf you have budget go for it instead of tab 6 or 7 lite.",
            "Product is very Good.\nGood I Pad alternate.\nSamsung could have given 8GB RAM and a Keypad for this price.\nCamera is Just OK.",
            "4 stars cause the delivery was horrible, but the device is just awesome, especially 865+, would have loved to have 8gb ram for what we are paying",
            "Excellent product. Much better than iPad",
            "Superb and ultimate and dasoon tab ,better than iPad pro.12.9.....kya display and kya speakers.",
            "Best and only Android option\nIf u have the money buy apple\nElse this is more than enough\"",
            "This is a review afyer 2 month,\nAfter playing pubg continuous for 2 week my screen got permanent scratch mark,\nSamsung used cheap coating on screen\nMy technician said that the oleophobic coating has been gone by continuos movement of finger on screen.\nI also use 30k Rs phone but in that phone i dont have such issue.\nPlease after buying this tablet please use tempered glass as well.\nIm very disappointed now.\nNex time i will go for Ipad for sure.",
            "Digitizer overheats when using the pen. You can feel the heat near the pogo pins, around the usb c port. Overall mediocre tablet.",
            "Amazing product and value for money",
            "Beast of the android tablet, first thing to notice is the gorgeous screen.\nWill update more after use",
            "Value for money!\nEverything is on top notch.\nBeast Sd 865+ Processer, RAM and storage.\nSPen great for writing, notes and graphic designing for beginners as well as pro.\nWonderful display.\nGood battery.\nBeautiful look.",
            "It is certainly a very good tablet by Samsung. The battery back up is good, s-pen works well. They could have provided a 45 watt charger instead of 15 Watt given in the box",
            "Best tablet except costly. 5G should have been given in lieu of 4G.",
            "Display quality is awesome sound is also good.most magic is s pen it's amazing. Battery back up is excellent. BAD THING IS THE FLIPKART PACKAGING IS BAD.",
            "Really great product.\nValue for money 👍🏻👍🏻",
            "Buy this product without hesitation\nGo for it, all instructions are provided along with contact / support number",
            "Awesome tablet",
            "Super screen,good camera,long lasting battery",
            "I am using this tab for my electrical consulting business. Some pdf files I open will have 500mb in size. Amazingly those large files are loading without lag. It's a best companion to all site engineers.",
            "Best tab in the market. Especially if one is a student and wants for note making, pdf annotation , multitasking etc. Only drawback is no headphone jack. Review is after 1 month's usage.",
            "Superb",
            "Superb 😊",
            "Really worth the price..great for binging series and watching movies...",
            "It's camera is best when compared to all others tablet whether ipad or iPad pro.",
            "For me this is better than ipad",
            "Stunning display..ideal for binge watchers",
            "Good product",
            "Amazing product with excited offer",
            "Most powerful and lovely tab , just loved it 😻",
            "The display 2as really topnotch. You should must go for it.",
            "good",
            "awesome.......no words..\ndisplay is very very nice",
            "Amazing performance and display is also stunning... Va",
            "After using only 10 minutes,the place where keyboard gets connected there display gets warm very quickly.",
            "Product is good but the problem is lagging .. i was used samsung produt in 2017 for one year only .. with experience i was not buy a earphone of samsung made .. 2nd product is s7 plus .. same issue now also\nMobile i was using is iphone 10 since 2 years , still today i was not observed any lag",
            "Best of best🦾\nPower of beast 💥",
            "Best in the segment till now....",
            "If you are especially looking for the overall experience or performance ipad is the way to go, else for any other its the best👍",
            "Nice",
            "Awsome tab from Samsung, but battery life is very power",
            "Perfect tablet and at reasonable price during sale",
            "Best tablet right now, better than ipad.",
            "Great product. It suitably replaced my laptop.",
            "The best product front samsung",
            "Best tab with great performance",
            "Very good product",
            "excellent and performance is good",
            "Worth Every Penny",
            "Everything about this tablet is sooo wonderful that it defines the word \"perfect\" in every manner whatsoever... Got it in a sale for around 53k so please watch out the sales and do not overpay.",
            "Camera quality below average 👎👎👎",
            "I can give it 5 but. When i am trying to open apps side by side. Its showing msg like ' You tablet is hot to open multi window. let it cool'.",
            "Pubg has no 90 FPS",
            "Touch is not efficient.It should be improved.Writing experience is Bad.",
            "Best",
            "Sound Quality n Screen is top notch",
            "Awesome",
            "Overall all best purchased",
            "Does samsung release the Android 12 update for tab S7 plus wifi model??",
            "Pen is not working on everywhere on screen\nAnd no refund and no one solve my problem",
            "Excellent 👍",
            "The perfect One...💻",
            "Value for money. Go with this instead of tab s8 which is TFT display and more costly.\n\nOnly if you need updates then go for tab s8 series",
            "Awesome. Cons and Pros = Display size is Huge",
            "It's a beast. Better to buy this one rather than S8 or S8+",
            "Pros -\n1. Excellent Display, Touch n feel of the screen is Amazing as it uses SuperAmoled display with 120hz refresh rate.\n2. Performance is Good with Snapdragon Processor and 6Gb Ram. As it is new i found no lag in performance, will get to know after some time of usage. Hopeful that performance will continue to satisfy.\n3. Speakers are amazing. It has Quad Speakers tuned by AKG, which are really Great. Gives an amazing experience. Watching movie or vids gets better with the dolby atmos sound. As already the display is great combined with grt sound it becomes a perfect match.\n4. S-Pen also comes in the box, which is a grt deal, it becomes easier to take notes. S Pen performs well, there is no issue in that.\n5. Front Camera or Selfie Camera is Good. It does the job of video calling perfectly.\n6. Battery backup is good. On Moderate usage battery will last for more than a day.\n\nCons.\n1. Battery charging takes a lot of time, almost 3 hrs for a full charge. This is bcoz of the charger given is of only 15watts and the tablet supports upto 45 watts. So you will have to buy a fast charger if you want fast charging.\n2. Back camera is very poor. At this price it should be better. None the less people don't use tablet for taking pictures. It is just used to take the images of the documents.\n\nWorth the buy even in 2022.",
            "Worth buying",
            "V. Good",
            "Like everything about it. Except the very very reflective screen.\nThings I loved: s pen air actions, I don't use it for navigation but controlling music and volume with it is amazing for a lazy person like me.\nDex mode. Though it would've been nice if it didn't close all apps everytime you get in and out of it.\nThe in display fingerprint. Kind of a weird thing to mention, but I didn't even know this had a fingerprint sensor let alone an in display one.\nThe only complaint I have with Samsung is the trackpad keyboard for this tab is nowhere online. When I contacted samsung about this, they said it's currently unavailable and that I should try my luck in offline stores.",
            "Nice product",
            "Overall very good one but need fast charger in the box......",
            "Excellent one",
            "Nice product at a good price",
            "Very Slim & looks amazing..\nBut its heating very quickly at the left side..",
            "What a masterpiece crafted by Samsung.Perfectly Display.Only thing I miss is that it should come with spen slot for storage.",
            "I love this tablet, but it has heating issues.",
            "nice experience!!",
            "Excellent",
            "Good",
            "Happy for my purchase and could get very good price",
            "The picture quality is epic. You can watch 4 k or even 8k videos with excellent quality. The speakers are amazing.\nIf you are into photography this is not the device and they are not to be blamed for it cause nobody uses tabs for taking pictures.\nIf you are into drawing this is one heck of a canvas. The display is huge with 12.4 inch display and it feels good.\nGaming fells good too. It's just that I felt that it is difficult control such a huge device but with some practice it is highly possible.\nOverall it is a must buy.",
            "Amazing product.",
            "Amazing performance",
            "Super duper",
            "Excellent device from samsung and very best price by flipkart.\nPros:\nAll\nCons:\nNothing",
            "Good but at this rate sim slot should be there",
            "It's good",
            "One of the best Android tab that has a potential to replace your laptop.\n\nThe only show stopper is frequently app crashing as they are not meant for tab size screen, hope we will see some improvement with growing popularity.",
            "Everything is fine, but battery draining fast",
            "Gr8 product. Best android tablet available. No brained if u r ready to spend this money.",
            "best",
            "One of the best tablets.",
            "Fantastic",
            "Excellent tab, value to money\nDisplay and sound is excellent\nOnly concern is that SPen is very delicate.",
            "Very use full and value for money",
            "Well no doubt it’s the best in its category with its SPen with IPad too I got it at best rate of the season thanks to Flipkart",
            "Good product",
            "Display and performance are outstanding\nBattery and camera is ok",
            "Quality and performance is good (actually you cannot make any question) display is awesome. Camera not upto the expectations. Battery is pretty good.",
            "Really superb tablet which can be used as both tablet and mini laptop..may be after coming this tablet i don't require laptop as it can do all work....",
            "Superb tablet,i really love this tablet",
            "The best deal on the best tablet.",
            "great",
            "I bought this for its display, as it's the best in market for tablets. This tablet is amazing.",
            "Very good product",
            "Best table",
            "It's costly but very good mobile..",
            "The most best display of any tables on ios and android uptill now",
            "Very nice and value for money. Best Android tab for study, gaming, multitasking.",
            "Superb and satisfied with each and every aspect of this beast.",
            "Performance -10/10\nSound - 10/10\nBattery - 10/10\nS-pen- 10/10\nDisplay - 10/10\n\n\nBest tablet available in the market at this price premium segment",
            "Gorgeous screen, stylus function very useful, overall very good performance! Real value for money.",
            "Good as described.\nBest Android tablet as on date...\nNo complaints..",
            "Best android tablet in the world",
            "Good product.",
            "Supb tab ever...",
            "Very exemplary tablet.",
            "Super amoled, 120Hz, 10000+ mah battery and snapdragon. Perfect combination and this tab is a beast",
            "Except for initial hang problem...still working smoothly",
            "I love everything about this tab especially the display and s pen, I am a normal user of this tab",
            "Excellent product",
            "Great product with such price tag.. valuable",
            "Huge in size and excellent in performance and display. The 120Hz is screen makes your experience even more smoother.",
            "Awesome display, fast performance.",
            "Best tablet one can buy got on sale value for money 😎 better than iPad as they don’t have amoled displays 😂",
            "Worth it",
            "This is an amazing product. The S-Pen is incredible in fact I'm writing this review with the S-pen itself. If you're not fight on budget definitely this is your goto option any day.",
            "Awesome!!!",
            "One of the best tablet out there. I’m very happy with the performance and the product aesthetics.",
            "Best tab awesome tab",
            "It has so many features😍",
            "Best tablet",
            "I loved it.. It becomes a completely usable asset with the Keyboard cover. You may use it as a tab or as a laptop, choice is yours.",
            "Nice",
            "Very good",
            "Nice tab"
        ],
        "likes": [
            "308",
            "229",
            "193",
            "22",
            "20",
            "47",
            "18",
            "9",
            "13",
            "9",
            "308",
            "229",
            "193",
            "22",
            "20",
            "47",
            "18",
            "9",
            "13",
            "9",
            "5",
            "5",
            "19",
            "11",
            "7",
            "13",
            "6",
            "6",
            "2",
            "2",
            "2",
            "6",
            "3",
            "4",
            "4",
            "2",
            "0",
            "1",
            "1",
            "1",
            "134",
            "61",
            "47",
            "84",
            "56",
            "27",
            "7",
            "7",
            "5",
            "20",
            "9",
            "8",
            "4",
            "4",
            "4",
            "4",
            "17",
            "8",
            "5",
            "6",
            "11",
            "3",
            "3",
            "5",
            "4",
            "5",
            "4",
            "4",
            "2",
            "2",
            "2",
            "1",
            "2",
            "2",
            "2",
            "3",
            "4",
            "4",
            "4",
            "5",
            "3",
            "34",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "4",
            "4",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "7",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "75",
            "70",
            "66",
            "20",
            "1",
            "5",
            "2",
            "1",
            "2",
            "1",
            "75",
            "70",
            "66",
            "20",
            "1",
            "5",
            "2",
            "1",
            "2",
            "1",
            "0",
            "0",
            "7",
            "3",
            "2",
            "7",
            "2",
            "3",
            "0",
            "0",
            "0",
            "5",
            "0",
            "2",
            "2",
            "0",
            "0",
            "1",
            "2",
            "3",
            "11",
            "5",
            "4",
            "15",
            "9",
            "3",
            "0",
            "0",
            "0",
            "5",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "7",
            "1",
            "1",
            "0",
            "4",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "1",
            "3",
            "1",
            "83",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "10",
            "9",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "84",
            "4",
            "6",
            "10",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:In the box content",
            "Q:Does it support whats app , Instagram, other social media and .... Games like call of duty ???",
            "Q:whether it support 4g or 5g. can it support wireless keyboard and mouse ?",
            "Q:We can get a key pad for tab?",
            "Q:can we add keyboard",
            "Q:Is 90 FPS available in the PUBG ?",
            "Q:can we use pc application like C language, python,etc?",
            "Q:Ipad air 4 or S7+ which one has the best performance",
            "Q:Is this water resistant",
            "Q:Can I use Google meet ??",
            "Q:can this tab can handle pub g at high graphics without frame drops",
            "Q:Doesanyone experiencing the warm at the Left side where keyboard ports are situated ?",
            "Q:Is there a heating problem near the keyboard pin area. Almost many customers have said this issue online ?? Even one of my friend has this issue . Can u advise",
            "Q:Is this support wireless earbods",
            "Q:Why is there no wifi variant?",
            "Q:There is headphone jack in this?",
            "Q:Is anyone experiencing a local display heating issue near the keyboard pins??",
            "Q:Can I connect it with projector?or is it give HDMI output",
            "Q:I'm actually an interior designer can I use this tab to create 2d and 3d drawings for my work.?",
            "Q:Does it work on mobile hotspot",
            "Q:Did anyone in India get Android 12 update for wifi model of this tablet? also the security patch is still at October 2021.",
            "Q:How's it for graphic designing?",
            "Q:This tab support windows 11?",
            "Q:Till what year s7 tablet will get updates?",
            "Q:Does it Support hdr?",
            "Q:Can we use Microsoft apps as in laptop",
            "Q:Can I unlock it's bootloader to install windows?",
            "Q:What exactly does only tab mean in the description can anyone explain? I was under the assumption that the S-pen and charger comes in the box itself.",
            "Q:Is this tab refurbished .for 51k?",
            "Q:S-pen is chargeable?",
            "Q:Dose wifi variant support sim card",
            "Q:Battery life of this tab is very poor. About 6-7 hrs only",
            "Q:A lot of customers complaint about the green tint in low brightness and high refresh rate in this amoled display tab. Is it true?",
            "Q:Does it have a type c charger?",
            "Q:Does it come with screen protector applied",
            "Q:is box contains 45 w charging or 20 w charging ?",
            "Q:Fingerprint front or back",
            "Q:Does it have aluminium body?",
            "Q:Whats the screen refresh rate",
            "Q:Can I use jio sim with it??",
            "Q:can I use Photoshop and ms word in this",
            "Q:Tab s6 or tab s7",
            "Q:In LTE version is wifi available ? I mean can I use wifi in 4G variant",
            "Q:What exynos does it have?",
            "Q:Does this tab support 5G ?",
            "Q:Where does this tablet's keyboard get?",
            "Q:Can we use wifi in 4g varient, or we can use wifi only if we get wifi varient. Does 4g varient support wifi connectivity?",
            "Q:Will i get the laptop keyboard like thing?",
            "Q:can we play pubg",
            "Q:Is 55k rupees S7+only wifi version refubrised ??",
            "Q:Does it have separate sim card slot and memory card slot or is it hybrid like we can use either sim or memory card",
            "Q:Can we edit 4k videos",
            "Q:is S pen available with this or we have to buy it seperately?",
            "Q:Is fast charger included or not",
            "Q:Can I play hard games",
            "Q:is it have samsung desk in this tablet",
            "Q:does it comes with sPen",
            "Q:Can i do coading",
            "Q:Is headset included in the box",
            "Q:Does it support ms office??",
            "Q:Tab s7 plus vs ipad pro m1 2021 which is best",
            "Q:Is this tablet has both fingerprint sensor and face unlock?",
            "Q:How much battery life?",
            "Q:Can I call with this tab",
            "Q:This or Ipad pro for designing?",
            "Q:We can play bgmi on 90fps",
            "Q:Fingerprint is there in tab",
            "Q:Does S7 Plus have both cellular and wifi",
            "Q:AUTOCAD RUN OR NOT",
            "Q:Can i play games with its keyboard",
            "Q:Calling facility is there?",
            "Q:It come with keyboard case",
            "Q:is s pen included in the box.",
            "Q:Can I use the s-pen which comes with Samsung note 8 and note 9 on this tab? I mean, Can I use other s-pens (multiple s-pens) on this tab ?",
            "Q:Will I be able to stream NF and prime in UHD/4k ? Or just FHD is the highest .",
            "Q:It's 5th of April. Still didn't get android 12 update for wifi model. Can anyone please tell when it's going to recieve android 12 update?",
            "Q:Support wireless earphone",
            "Q:Can a medical student use as it has only 64gb of storage ?",
            "Q:Can we do computer work on it",
            "Q:Which android version is this? Will I will get android update of 11? Which should be preferred air 4 or s7plus?",
            "Q:Do it have YouTube Premium Subscription free for 3 months and Clip Studio Subscription for 6 months?",
            "Q:It will saport crypto chart editing or stock chart live editing yes or no",
            "Q:Is this tab good for coding purpose",
            "Q:What is the exact battery life for s7+?",
            "Q:Will it support multi tasking? Can i minimise windows and expand as like jn pc?",
            "Q:Does this tab support wireless charging",
            "Q:Why this product don't have Android 11 Operating System? or is there mistake while describing this product in product section? Beacuase S7 FE has Android 11 Operating System but it dont have?",
            "Q:What is the Latest operating system available in this tablet?",
            "Q:What is the model number written on it? SM-T...",
            "Q:Does it have a second screen feature?",
            "Q:Can we connect wireless mouse and keyboard both at same time?",
            "Q:What is the exact price of galaxy tab S7 plus wifi version ??",
            "Q:Does it supports whatsapp calls (On wifi version model)?",
            "Q:It is victus glass",
            "Q:is it 5g upgradable or not ?",
            "Q:Will we get key pad in box",
            "Q:Can I operate whatsapp in wifi version??",
            "Q:Can we use ms word and Excel without Microsoft 365 subscription on samsung dex? Pls chk on your tab and let me know. Thanks",
            "Q:Does it support galaxy active 2 LTE smart watch?",
            "Q:Can we use mouse with this tab?",
            "Q:Does it have a fingerprint scanner?",
            "Q:can we attached keyboard in it ?",
            "Q:How do we get keyboard of tab?"
        ],
        "answers": [
            "A:Beautiful S7Tab with super fine SPen.",
            "A:Yes",
            "A:Supported 4G network yes wireless keyboard you can use.",
            "A:yes you can purchase it separately",
            "A:yes wireless keyboard you need to purchase separately",
            "A:No",
            "A:no it's not a desktop or laptop. you can use light software like word Excel PowerPoint presentation etc.",
            "A:s7+",
            "A:No tablets are not water resistant.. it is not IP certified though it will take some light splashes without any issue",
            "A:Yes",
            "A:Yes just go for it without any other thought.",
            "A:yes , little bit warm at the left corner",
            "A:I don't think so there is not much heating problem It may have some if you connect with the Samsung Smart keyboard due to power transfer if you don't you the keyboard the is not heating problem",
            "A:Yes i supports all kind of wireless earbuds. As it comes with Bluetooth 5.0",
            "A:there are 3 variant available for S7 tab.",
            "A:no",
            "A:No not at all using 7 days. no issue.",
            "A:It gives HDMI output but not sure if can be connected to projector. Video output is 4K.",
            "A:Free hands drawing you can draw through S pen but unable to use CAD or other window software.",
            "A:yes it does perfectly",
            "A:No the update isn't available in India yet. We gotta wait!",
            "A:terrific",
            "A:it is andriod tab , If you can install windows ,then u r great",
            "A:2024",
            "A:yes",
            "A:yes you can...just like any android phone",
            "A:No",
            "A:It does come with an S-Pen, charging brick and USB A to C cable.",
            "A:No",
            "A:yes charges when attached to the back of the tab",
            "A:no",
            "A:Yes",
            "A:no",
            "A:Yes",
            "A:No , screen protector provided separately",
            "A:45w charging",
            "A:Front. In display optical finger print scanner.",
            "A:Yes, the body is very sturdy.",
            "A:120hrz",
            "A:Yes",
            "A:Yeah. Ms Office 365 has it all . And Adobe photoshop version is available too .",
            "A:s7plus",
            "A:Yes, you can use wifi also, just like your smartphone.",
            "A:Snapdragon 865+",
            "A:it supports where 5g tower is there",
            "A:Samsung website i brought.",
            "A:The difference is that the 4G variant has a SIM card tray and a sim card can be used along with WIFI. Both variants have a powerfull WIFI6 compatible card that can handle WIFI",
            "A:no, you will have to buy it separately. only tab will be present in the box along with charger and Spen.",
            "A:yes you can",
            "A:Believe me - I was also little doubt full , then I confirmed from Flipkart customer care they said it’s a New one",
            "A:Separate sim and memory slot. You can actually use both.",
            "A:Yes, you can.",
            "A:Available in package.",
            "A:18W charger included. but you have to buy the 45w separately",
            "A:yes",
            "A:You can use as a laptop but you need to buy separately keyboard.",
            "A:yes",
            "A:Yes",
            "A:No, only tht tab and charger",
            "A:Yes samsung office and excel platform available.",
            "A:Tab S7 Plus is an all-rounder.",
            "A:Yes it does",
            "A:6-7 hours of browsing and OTT LTE version over 4G",
            "A:Yes you can",
            "A:writing experience may be better on iPad. Although S-Pen is very nice. I have used iPad Air 4 (My friend's iPad). I own S7+",
            "A:nop..60 max",
            "A:Yes",
            "A:Yes",
            "A:Yes. But it's not as extensive as the desktop version.",
            "A:Yes",
            "A:Yes 4g network that means calling support available.",
            "A:no",
            "A:Yes it is.",
            "A:i don't think so. it comes with its own spen wich is automatically paired.",
            "A:You able be able to play video in which ever quality you want",
            "A:Android 12 is being rolling out on wifi models of samsung galaxy s7 plus , so be patient",
            "A:Yes.",
            "A:it has 128gb which is sufficient",
            "A:Depends on what type of computer work you want to do. It can do all things related to Microsoft office, work related to chrome browser etc. But it can't do stuff related to windows software",
            "A:Right now Android 11 and may be Android 12 in few moths.. Depend on you Both are good...screen and sound is so good...s7 plus best for study and gaming...",
            "A:No",
            "A:yes",
            "A:No. I wouldn't recommend it for coding. The keyboard functionality is very limited.",
            "A:It runs well a whole day , with heavy usage",
            "A:Yes",
            "A:No",
            "A:It comes with Android 11 OS",
            "A:android 11",
            "A:970",
            "A:Yes, it is literally called as \"Second Screen\"",
            "A:no",
            "A:72k",
            "A:yes.....video call is much better than mobile",
            "A:Yes it is.",
            "A:Today(6/9/21) no 5G connection available so not tested But 4G connection fine",
            "A:No. It has to be bought separately. Sometimes there is a discount offer associated with the S7 Plus purchase.",
            "A:Yes",
            "A:Yes you can. But it is basic version. you can't edit",
            "A:yes",
            "A:yes a wireless one. you can also attach samsung keyboard which already has TouchPad.",
            "A:yes",
            "A:Yes, you can attach the book cover keyboard to it. but you will have to buy it separately. Keyboard is not included with the tab.",
            "A:You will have to order it separately"
        ],
        "likes": [
            "93",
            "110",
            "87",
            "8",
            "4",
            "3",
            "6",
            "7",
            "5",
            "5",
            "4",
            "1",
            "2",
            "1",
            "1",
            "2",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "41",
            "133",
            "104",
            "8",
            "63",
            "13",
            "7",
            "4",
            "5",
            "5",
            "3",
            "4",
            "3",
            "6",
            "3",
            "2",
            "2",
            "11",
            "4",
            "4",
            "4",
            "1",
            "2",
            "2",
            "1",
            "1",
            "2",
            "2",
            "2",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "26",
            "44",
            "37",
            "1",
            "1",
            "1",
            "2",
            "3",
            "3",
            "2",
            "3",
            "0",
            "0",
            "0",
            "3",
            "2",
            "5",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "10",
            "0",
            "0",
            "2",
            "0",
            "2",
            "0",
            "0",
            "8",
            "205",
            "29",
            "0",
            "23",
            "3",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "0",
            "0",
            "1",
            "9",
            "1",
            "2",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0",
            "3",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    }
}