{
    "title": "SAMSUNG Galaxy Tab A 8.0 Wifi 2GB RAM 32 GB ROM 8 inch with Wi-Fi Only Tablet (Silver)",
    "product_specification": {
        "Model Number": "SM-T290NZSDINS, SM-T290NZSAINS",
        "Model Name": "Galaxy Tab A 8.0 Wifi",
        "Color": "Silver",
        "Connectivity": "Wi-Fi Only",
        "OS": "Android",
        "Operating System Version": "Android | 9.0",
        "RAM": "2GB",
        "Voice Call": "No",
        "Video Call": "Yes",
        "HD Video Call": "Yes",
        "Display Size": "20.32 cm (8 inch)",
        "Sales Package": "Tablet, Travel Adapter, USB Cable, Quick Start Guide, Warranty Card",
        "Display Resolution": "1280 x 800 pixels",
        "Primary Camera": "8 Megapixels megapixels",
        "Internal Storage": "32 GB",
        "Processor Speed": "2 GHz",
        "Sim Type": "No Sim",
        "Battery Capacity": "5100 mAh",
        "Battery Type": "lithium-ion",
        "Video Recording": "Yes",
        "USB": "No",
        "HDMI": "No",
        "Wi-fi Version": "802.11 a/b/g/n 2.4+5GHz",
        "Display PPI": "189 PPI",
        "Display Colors": "16M",
        "Video Formats Supported": "MP4,M4V,3GP,3G2,WMV,ASF,AVI,FLV,MKV,WEBM",
        "Expandable Storage Capacity": "512 GB",
        "Warranty": "1 Year",
        "Warranty Summary": "1 year manufacturer warranty for Tablet and 6 months warranty for in the box accessories",
        "Warranty Service Type": "At service center",
        "Covered in Warranty": "manufacturing defect",
        "Not Covered in Warranty": "Physical damaged",
        "Warranty Period": "1 Year"
    },
    "product_description": {
        "Functional Design": "This tablet features a lightweight and compact design which makes it easy for you to carry it and use it with just one hand. The lightweight design makes it easy for kids to also use this tablet conveniently.",
        "Stunning Display": "This tablet features a 20.32-cm (8) screen that has a 1280 x 800 pixels resolution. Also, this tablet’s aspect ratio of 16:10 ensures an immersive viewing experience, whether you’re watching a YouTube video or playing games. The dual speakers deliver stunning audio effects, which complements your videos and movies.",
        "Large Battery Backup": "The Samsung Galaxy Tab A 8.0 comes with a massive 5100 mAh battery which lets you play games, stream videos, and browse the Web for hours, without having to keep charging this device.",
        "Power-packed Performance": "With 32 GB of internal storage memory, you can store a large number of apps and games on this device. Also, this device’s 2 GB of RAM allows you to quickly switch between watching a movie to shopping on your favorite app without any lag. It also features the Android P OS for a smooth navigation experience.",
        "Samsung Kids Home and Parental Control Features": "The Samsung Kids Home feature lets your kids play and learn in a safer environment. The Quick Panel provides access to child-friendly apps so you can let your kids access safe content on this tablet. Thanks to the Parental Control feature, you can not only monitor the usage but also keep a track of the time your kids spend while using this device.",
        "Share and Create Memories": "Even if you stay miles away from your friends and family, you can still keep them updated and stay connected at all times. Through your Samsung account, you can share your photos, calendar entries, and Samsung Notes with them, ensuring distance doesn’t come in between you and your loved ones.",
        "One UI": "This Samsung tablet comes with One UI, which customizes and displays relevant content for you. When you tap on a particular content, it gets focussed, so you get to read the details and information without getting distracted by the other data on the screen."
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "2",
            "1",
            "4",
            "1",
            "1",
            "1",
            "1",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "4",
            "2",
            "5",
            "5",
            "5",
            "3",
            "1",
            "5",
            "4",
            "3",
            "5",
            "4",
            "2",
            "5",
            "5",
            "5",
            "5",
            "4",
            "2",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "3",
            "3",
            "5",
            "2",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "2",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "3",
            "1",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "3",
            "4",
            "5",
            "4",
            "1",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "3",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "3",
            "5",
            "5",
            "4",
            "2",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "1",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "1",
            "5",
            "4",
            "4",
            "1",
            "3",
            "5",
            "5",
            "4",
            "4",
            "3",
            "5",
            "3",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "4",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "4",
            "3",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "2",
            "5",
            "2",
            "4",
            "5",
            "4",
            "4",
            "5",
            "4",
            "3",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4"
        ],
        "review": [
            "Good Tab for normal usage. Value for money... Worth buying.... This type of yba need fast charger and fast charging support",
            "i m using this tab from last 2 weeks & find it useful for moderate usages such as reading , music quite good with Dolby , battery is tremendous , display for 720p videos only not full HD videos , overall it is Worthy in this price range.",
            "This is a must have in every student's essentials specially for how compact it is and how easily it can be carried anywhere.It is so lightweight and slim that it easily fits in my handbag.The screen-size and ratio is genuinely awesome.Reading e-books or watching course videos and movies have a different kind of feel now,solely because of the screen-size and dual speakers which gives an enriched viewing experience.No matter how much I watch videos or read articles, this device ain't gonna give up easily because of its massive 5100 mah battery.For students,it isn't possible for us to charge the device quite a few times in a day but I think I got the perfect solution for it.The Samsung Galaxy A8 which doesn't give up before one and a half days even with over usage.The performance is pretty smooth with its 2GB RAM and its expandable memory is just terrific,512GB.It makes sure we never run out of memories.The kids mode is another feature that won my heart.My 11 year old brother can use it too and me and my parents will have the assurance that he ain't being the victim of any cybertrap as we are the ones who decide what he's gonna see and for how much time.Lastly it's camera is too awesome.With an 8mp,it clicks crisp and clear images of every memorable moment of our lives.Overall the Samsung Galaxy A8 tablet is an absolute blockbuster product.I would recommend this to every school/college going student as it will help them not only with their studies but will help create a better image of themselves because of its style that carries a classic atmosphere with itself.",
            "Samsung Galaxy A8 Tab is one of the most affordable tabs in the market right now. It offers very good features at a reasonable price.\nFeatures including like:-\nScreen Size and Ratio 20.31cm (8\") Tablet of 1280x800 resolutions (WXGA) with TFT basic display having 16M color depth. Camera 8.0 Megapixels rear camera with auto focus. 2.0 MP front camera.Processor, RAM & Storage. CPU Speed of 2Ghz with Quad Core processor. Also has 2GB RAM size and 32GB ROM size with only 21.3 GB is available memory. But you can expand up to 512GB MicroSD card.\nBattery Life is excellent as it has massive 5100mAh capacity approx. It can work for 3-4 days easily. It’s a very light and agile Tablet weighing only 345 grams. You can carry it easily and comfortably to the work or in college.. After a long time, I’ve come across a Tablet having Dual Speakers which is really good for kids because there will be no use of earphones to listen to music and videos. It also has a kids mode and hence my younger sister can enjoy and have fun with creative and good learning applications in the mode.",
            "A marvellous product with huge display,its easy to carry it on meetings,journeys,etc.the large screen made me read my novels more efficiently.its storage capacity is great and i got astonished when i came to know that it has android nine pie in it,it is a compatible product in this price segment but 4GB RAM would be great and will add a sweet touch in its performance and working.Huge battery of 5100mAh gives a power packed performance and a long leading battery life which helps me to do long tasks and help me to attend my online classes without having to keep charging my device. its huge 18inch display help me to notice wack and every detail and help me to do my desk work more efficiently and effectively.i can now complete my assignments more easily and efficiently with this tab as earlier it was difficult for me to do the same on a short screen as i had to constantly zoom in and zoom out it,this tab has overcome my problem.overall it is a great device for me in this price range and with such great features compared to other devices in the same price range.",
            "Well I was not sure before buying this tab but now I am happy .\nReally good screen quality\nbuilt is also good\ngood for reading book watching movies studying\nWon't be playing pubg on it obviously.\nMy first Samsung but I have own quite a lot phones so you can just go and buy this don't be scared.",
            "Osm product for competitive students who give test through tab..🔥🔥.and it's work very smooth and nice product overall I am impressed with this tab..💓💓💖💖💕💕",
            "Amazing choice when priority is to studies and reading.. also it has fabulous Dolby atmos speakers which is I think best thing about it..camera is again good for technical purposes and not at all for photography, photoshoot and even casual clicking the pictures.... product looks premium indeed...battery life is outstanding in given price range... its compact and easy to carry anywhere with very good screen ratio ...overall performance is satisfying comparing its 10k price.... one of the best options for budget friendly student's tablet!",
            "Camera Is Good .... Screen Is Best ....Body Is Sleek And Comfortable .... Handy To Use .....\nBest For Working Class People .... Although I Use It For College Purpose .... Great Battery Performance .....",
            "This is a must have in every student's essentials specially for how compact it is and how easily it can be carried anywhere.\n\nIt is so lightweight and slim that it easily fits in small bag and kids can handle easily. During the Pandemic online classes purpose i bought the Tab and for me reading books with kindle excellent only while reading you may feel little weight.\n\nReading e-books or watching course videos and movies have a different kind of feel now, because of the screen-size and dual speakers which gives an enriched viewing experience\n\nThe screen-size and ratio is genuinely awesome.\n.No matter how much I watch videos or read articles, this device battery back up good once charged for classes normal browsing easily comes 2 days , if heavy browsing it would one day. I paid 7199 during the discount days with that price this tab is value for money.\n\nGames like subway surfer kids playing ok for that level. may not be for Heavy games like PUBG.",
            "Good Tab for normal usage. Value for money... Worth buying.... This type of yba need fast charger and fast charging support",
            "i m using this tab from last 2 weeks & find it useful for moderate usages such as reading , music quite good with Dolby , battery is tremendous , display for 720p videos only not full HD videos , overall it is Worthy in this price range.",
            "This is a must have in every student's essentials specially for how compact it is and how easily it can be carried anywhere.It is so lightweight and slim that it easily fits in my handbag.The screen-size and ratio is genuinely awesome.Reading e-books or watching course videos and movies have a different kind of feel now,solely because of the screen-size and dual speakers which gives an enriched viewing experience.No matter how much I watch videos or read articles, this device ain't gonna give up easily because of its massive 5100 mah battery.For students,it isn't possible for us to charge the device quite a few times in a day but I think I got the perfect solution for it.The Samsung Galaxy A8 which doesn't give up before one and a half days even with over usage.The performance is pretty smooth with its 2GB RAM and its expandable memory is just terrific,512GB.It makes sure we never run out of memories.The kids mode is another feature that won my heart.My 11 year old brother can use it too and me and my parents will have the assurance that he ain't being the victim of any cybertrap as we are the ones who decide what he's gonna see and for how much time.Lastly it's camera is too awesome.With an 8mp,it clicks crisp and clear images of every memorable moment of our lives.Overall the Samsung Galaxy A8 tablet is an absolute blockbuster product.I would recommend this to every school/college going student as it will help them not only with their studies but will help create a better image of themselves because of its style that carries a classic atmosphere with itself.",
            "Samsung Galaxy A8 Tab is one of the most affordable tabs in the market right now. It offers very good features at a reasonable price.\nFeatures including like:-\nScreen Size and Ratio 20.31cm (8\") Tablet of 1280x800 resolutions (WXGA) with TFT basic display having 16M color depth. Camera 8.0 Megapixels rear camera with auto focus. 2.0 MP front camera.Processor, RAM & Storage. CPU Speed of 2Ghz with Quad Core processor. Also has 2GB RAM size and 32GB ROM size with only 21.3 GB is available memory. But you can expand up to 512GB MicroSD card.\nBattery Life is excellent as it has massive 5100mAh capacity approx. It can work for 3-4 days easily. It’s a very light and agile Tablet weighing only 345 grams. You can carry it easily and comfortably to the work or in college.. After a long time, I’ve come across a Tablet having Dual Speakers which is really good for kids because there will be no use of earphones to listen to music and videos. It also has a kids mode and hence my younger sister can enjoy and have fun with creative and good learning applications in the mode.",
            "A marvellous product with huge display,its easy to carry it on meetings,journeys,etc.the large screen made me read my novels more efficiently.its storage capacity is great and i got astonished when i came to know that it has android nine pie in it,it is a compatible product in this price segment but 4GB RAM would be great and will add a sweet touch in its performance and working.Huge battery of 5100mAh gives a power packed performance and a long leading battery life which helps me to do long ...\nREAD MORE",
            "Well I was not sure before buying this tab but now I am happy .\nReally good screen quality\nbuilt is also good\ngood for reading book watching movies studying\nWon't be playing pubg on it obviously.\nMy first Samsung but I have own quite a lot phones so you can just go and buy this don't be scared.",
            "Osm product for competitive students who give test through tab..🔥🔥.and it's work very smooth and nice product overall I am impressed with this tab..💓💓💖💖💕💕",
            "Amazing choice when priority is to studies and reading.. also it has fabulous Dolby atmos speakers which is I think best thing about it..camera is again good for technical purposes and not at all for photography, photoshoot and even casual clicking the pictures.... product looks premium indeed...battery life is outstanding in given price range... its compact and easy to carry anywhere with very good screen ratio ...overall performance is satisfying comparing its 10k price.... one of the best options for budget friendly student's tablet!",
            "Camera Is Good .... Screen Is Best ....Body Is Sleek And Comfortable .... Handy To Use .....\nBest For Working Class People .... Although I Use It For College Purpose .... Great Battery Performance .....",
            "This is a must have in every student's essentials specially for how compact it is and how easily it can be carried anywhere.\n\nIt is so lightweight and slim that it easily fits in small bag and kids can handle easily. During the Pandemic online classes purpose i bought the Tab and for me reading books with kindle excellent only while reading you may feel little weight.\n\nReading e-books or watching course videos and movies have a different kind of feel now, because of the screen-size and dual speakers which gives an enriched viewing experience\n\nThe screen-size and ratio is genuinely awesome.\n.No matter how much I watch videos or read articles, this device battery back up good once charged for classes normal browsing easily comes 2 days , if heavy browsing it would one day. I paid 7199 during the discount days with that price this tab is value for money.\n\nGames like subway surfer kids playing ok for that level. may not be for Heavy games like PUBG.",
            "Best tab and quality is very gud ..... I like it very much ..... Its speed is also good",
            "I might sound pretty excited about viewing my new purchase which is the Samsung A 8.0 tab but I so impressed with this device. Me,being a college student,a tab was almost something which had become necessary and I was hunting down the internet to find the best fit until I came across this device. It is so compact and light weight that it can easily fit in my college bag; I can work all night on my project without any hassle, thanks to the huge screen and brillant clarity. The processor is pretty good and it doesn't lag whil I stream through YouTube videos. Another great feature of this tab is dual speaker which is pretty loud and clear. In all a perfect tab for all my requirement :D",
            "Nice and genuine product 👌 Only reading 📚 and normal usage this a bast choice. Good product for the price.❤🙏",
            "Very good tablet. 1080 pixel and 720 pixel Blu-ray cinema running smoothly. Battery backup is also good. Resolution display very fine.It is good for reading purpose also. Overall it is a nice tablet. Thanks to Flipkart.",
            "Very nice tab, I bought this for my son he is very much happy and using it for online classes..\n\nThank you flip cart for fastest delivery..",
            "Good for reading books. Ideal for students as learning tool. Sound quality is better than expected. Good battery life holds for a day. Recharges in 2 hours.",
            "This is a great tab for reading and viewing. Video calls work well, as do bluetooth and WiFi. The battery life is good and lasts the whole day. Gaming graphics and speed are good.",
            "Fantastic value for money. This tab is perhaps the best bet for under 10\". Unless you are into gaming, this is correct me good for most other use cases.",
            "Excellent Tab . It has really very good display which is main requirement for any tab. Coming to connecting features it has all facilities like wifi Bluetooth.",
            "It is an excellent product when compared to other brands in this budget. The tablet is very lightweight and easy to carry. the display is HD and in 16:10 aspect ratio. I can watch 3 movies straight with a full charge. And 2GB RAM for this tablet is really good for multitasking. The speakers are super loud and clear. Kids mode is amazing as my personal data is safe when I give this tablet to my little brother. The processor is very fast and responsive. It is amazing to play my favourite games. The camera quality is decent. Pictures are clear and the quality of front-facing camera during video calls is really good. Samsung's new One UI is very informative as it is very easy to use the device with one hand now. overall a really good product and I would highly recommend this tablet.",
            "Well it's an awesome product I ever purchased.\nIt's very light weighted, and the dimensions are just cool.\nsometimes I thought that I hold my smartphone in my hand as it's very light.\nscreen size is 8\" which is very good If you need a tablet. Big screen can have you a better experience.\nOne of the most valuable feature of this tablet is its Battery which is 5100mAh, You can use it for a long time, you can watch 3-5 movies at a time 😂😂.\nSnapdragon 435 chipset makes performance better than previous versions\nIt Supports 2 GB of RAM and 32GB of Storage, You can store documents as many as you can.\n8MP camera can help you in scanning or capturing clear photos of your documents and your long life memories,\nDual Speakers of it make your home like a theatre, I love it's sound.\n\nThe thing Which make it Wonderful is its KIDS mode.\nYou can Purchase it for your KID as a Learning Tablet with your full control on it.",
            "GALAXY TAB A 8.0 is light weighted and a handy tab. Easy to carry while travelling. Fast processor woth Quad core and 2GHz is superfast and multitasking is awesome. With battery backup of 5000mAh, it lasts all day and even some more. Awesome camera quality on both frint and rear side. Big screen size of 8 inch with best viewing angles makes it a great product to watch movies with friends and good sound quality speakers makes it even better. 2GB of ram and a Quad Core Processor running 2GHz speed makes multitasking amazing. I am really happy with this product especially at this price range is amazing value for money, highly recommended",
            "Writing this review after 10 months of thorough usage.\n*Design :\nAluminium back, plastic frame, thick bezels and rectangular shape. A typical samsung 2018 design.\nIt doesn't look extraordinary but still it looks premium, feels pricier.\nI would suggest you to go with the silver color as it looks premium.\n*Display:\nA tft display with a low resolution. Yes the resolution is low and pixelation is evident but at this price you just can't complain.\nViewing angles are good, and colors look natural.\nOnce you get used to it you will not feel it but yes the display resolution is poor by today's standards.\n*Performance :\nThis tab is just for basic tasks like online classes, reading pdfs and media consumption.\nIt has a dated Snapdragon 425 quad core processor with 2 gigs of ram. Yes a quad core in 2021 😂\nIt can handle day to day tasks fine but don't expect it to perform amazingly.\n*Software :\nIt is currently running Android 11 with one ui 3.1\nSamsung is the king of updates, my smartphone is stuck on android 10 but this meagerly powered tab is running Android 11 with latest security patch.\nGood job Samsung 👌\n*Battery :\nThis is where this tab truly shines.\nAmazing battery life, 14hr plus of screen time.\nI do 6hr online classes everyday and it lasts me 2 days easily.\nCharging is slow via the 7.5w charger that Samsung bundles in the box, although the tab supports 10W charging.\n*Camera :\nJust does the job.\nRear camera can take good photos in ample sunlight, but who takes photos with a tab ?\nFront cam is fine for video calls and online classes.\n*CONCLUSION :\nThis is the best budget tab for students and binge watchers.\nCheers!",
            "I'm so in love with this tablet. It basically comes up in two colors: silver and black. Both colors are supercool and the tablet looks extremely amazing! It is lightweight and easy to carry. Being in college you can't really carry that heavy laptop everyday but a tablet can be carried easily. I love how now I am able to do all my engineering software work on this tablet with ease. The 5100 mAh battery lasts for my entire day even after using this tablet all the time. It's got 2GB of RAM and 32GB of storage which I guess is more than enough for me. Moreover the sd card slot provides us with a 512GB storage. Then there's this cool feature of Samsung kids which is amazing for all of my younger siblings and their entertainment. It's safe for kids and offers educational stuff for quick learning. The camera's got a 8mp resolution while the screen size extends upto 20.31 cm(8\"). It's got dual speakers wherein the quad core cpu type offers a 2GHz speed and is quick enough to display the apps easily. The best tablet I've ever come across and basically is a must buy product! ❤️",
            "it is one of of the best tab with an incredible battery backup it is insane as it has 5100mah battery so it can work up to 2 days also means you can watch videos and play games like pubg for many hours . the speakers are excellent as it is very loud and clear the display of 8 inch is a big enough for all many multimedia needs it has a latest Android which is Android 9.0 pie and with One UI. It is very easy to use the tablet with one hand .\noverall it is a really good product for his price and I recommend everyone who is looking for a tab to get this one.",
            "I purchased this device few days back on Flipkart and I'm really happy to make a smart decision. Samsung A 8.0 tab is just the perfect fit for anybody who is looking to purchase a tab in a budget of under 10000. Few features like dual speakers, large screen, lightweight, attractive looks are all checked in my personal checklist while choosing a tablet.\n\nI usually work on college projects and hence I wanted a tablet with a huge screen and a lightweight machine which could be carried to college everyday. Additionally, the battery which is actually a beast (5100 mAh) helps me to use the tablet for hours and hours without getting drained. I am not a great photographer though but the camera in this tab is pretty cool as well and the photos clicked come out beautiful.\n\nTalking about streaming my favourite shows on Netflix was definitely fun since the colours are pretty vibrant. Getting all this for 10,000 Rs. is definitely a dream come true.",
            "Firstly I am buying a tablet for the first time and I would like to share my experience. Buying this Samsung A 8.0 is amazing. I have taken this tablet for my sister who is, all the time, watching series and I thought of buying this tablet for her and because of the Kids Mode feature, it is very handy. Secondly, this is so comfortable to carry everywhere as it is lightweight. The battery of 5100mAh is so extra amazing. My sister also carries this to the school for her project work. She also loves it and even the price of this tablet is so reasonable. The Dual Speakers have Dolby Atmos which makes the sound quality, very clear. It is an amazing product to buy from Flipkart",
            "Good tablet at this price range, screen quality also fine, sound quality awesome, big battery\ncons\nnot fast charger in box,\nno earphone.",
            "Samsung tab A8 is a good option in budget\npros-\ndisplay quality\nbuild quality\none UI software\nbattery backup\ncons-\nbattery charging time\nno led flash\nram should be 3gb\ncamera quality is quite average",
            "Great Product At Great Pricing.\nplease provide tampared and backcover for this tablet .\nits not available on flipkart.",
            "A fab one",
            "Excellent product",
            "Super samsung tab love u",
            "Good tablet., good performance.fast delivery Thanks flipkart for delivering this pandemic period",
            "Awesome.",
            "A good tablet for study",
            "Excellent tablet with a big display\n...camera and performance is excellent.....I like the tablet......Thanku flipkart😊😊😊😊😊😊",
            "just perfect for avid readers of online contents.",
            "Good for Office and personal works.",
            "Nice product... Worth it 🤩",
            "its awesome",
            "After one month of using this product I am reviewing.Worth of money, battery pack up is awesome 👌👌,it take 3.5 hours to complete full battery,Best for online class.",
            "I brought this in big billion days offer discount price. Everything is good for normal use except display. Display is not value for money. Little lagging issue. Otherwise overall good tablet in this price range. Go for it if you want a tablet for normal use.",
            "Good budget Tablet. My Children love it for online education.",
            "it's awesome.... must buy....",
            "Nice product",
            "I Purchased Samsung A50 Mobile Back In March And Now Purchased This Entry level Samsung Tab,Really Just Wanted A Tab To Watch Netflix,Prime,Zee5,Youtube And Some Browsing.The tab Does all of that smoothly.The Camera Is Worst,Actually I am Used to A50 Camera so yes that's the reason for 1star in Camera Department.Rest All Good About This Tab.Value For Money.",
            "Good mobile",
            "Very nice camera not good",
            "Really unbelievable..... very good in very very less price.....that too 8000 rupees only for this configuration. Worth the price. Tku flipkart and ekart and the seller company.",
            "Touch:-****\ncamera:-***\nbattery backup:-*****\nBody:-*****\ncharging time:-**\nsound mic:-****\nsound speaker:-*****\nweight:-****\nmultitasking:-****\napp loading:-****\ngames:- not played yet,my purpose is only for studying.\ndisplay:-****\nI have used it for 7days and these are my ratings.\nHope it will be helpful.I have given average rating on Flipkart.",
            "An excellent 'Value For Money' product. The only thing I miss sometimes is a larger RAM. But, it's more than adequate for watching movies & listening to songs. For Gamers, I would like to suggest to go for a high end tablet.",
            "Itz an osm product from Samsung\nWorth for money\nLoved it 😍😍😍😍😍",
            "Must buy product.\nGo blindly with this item..",
            "I was using iPad pro 2017 version Nd it had its own issues so bot tab for a replacement and I must for this price it's really good..!! I know it won't come near to iPad but if u r on a budget go for Samsung galaxy tab A 8",
            "Got it for 8000 best tablet for students in this price segment rather than iball or lenovo",
            "very good",
            "Overall good",
            "Nice good 👍😊",
            "Nice",
            "Profarmance very slow",
            "A good product at this price",
            "Good",
            "Good one",
            "This item is not good work",
            "Nice",
            "Awesome product. Thanks flipkart.",
            "Good for study purposes only...",
            "Best for reading or children.\nGo for it.\nI brought it 7499 with hdfc bank offer.",
            "It's very Nice product..........",
            "good",
            "Great tab",
            "Very nice tab at this price range. It's a must buy for students. Got it before schedule time. Thanks to flipkart",
            "Product performance is good and it will be updated automatically from Android 9 to Android 10 !!! But display is not good !!!",
            "Worth of money, looks great, function of this tablet is good over all recommendable",
            "Very nice product",
            "Nice product and the battery is also good.",
            "Smooth perfomance",
            "Niec product and I got the perfect Tab i needed...",
            "camera is not good quality but over all nice performance",
            "Best tablet in this price.",
            "It is really an entertainment package.You can't get anything better at this price.lucky to have got an offer just after booking,which was readily cancelled by Flipkart as per my request. Got it within 8k.\n1) Camera Good\n2) Video Very good\n3) Sound Good\n4) Touch response Good\n5) 3.5 Jack slot and Bluetooth headphone has excellent connectivity.\n6) Wifi connection was bit clumsy but latest update has fixed it.\n7) Full value for money.\nClose your eyes and go for it, won't regret.\nFlipkart you rock.",
            "i got it for 7200 worth for that price.full hd display could have been there",
            "The technician did all the ways possible to make this tablet connect to wifi, he was able to do it, after sometime again it is getting disconnected",
            "Display got damaged within 2month of use",
            "Nice product. Very good for students ....",
            "very bad product not meeting expectations it has no sim card slot waste product higher price value which is very bad for this product.",
            "I'm ok with tab..don't trust this seller. They say they will deliver next day once u order..but they will take minimum 5 days for delivery..",
            "Waste product.\nWith in 20 days its touch as not working properly.Waste of money.",
            "Not working",
            "Good product,value for money, must buy for students",
            "Good for routine use",
            "In this range i think it is the best. Customer support is really fabulous and polite. Yes i do experience few hangs after 7-8 months but Customer service helped me alot and after that tab is working smoothly I'm giving this review by this tablet. Now its been more than a year. I purchased it for online classes and my budget was too tight. So from my side go for this one.",
            "Best in this budget",
            "A good Companion in lonliness .....,thanks samsung and flipkart",
            "Good for the price innit",
            "Good one...",
            "Superb✌🏻\nCompare to lenovo m8\nThis is better one\nBest low range tab forever",
            "Bought this tab for my kid.. Some learning games and YouTube.. Serves good for that purpose",
            "For education purpose it's excellent tab. Audio from speakers r loud and clear, good quality screen with bright colour battery last easily 2 day with class, pdf, normal youtube and web. One ui 3 is available on board. Some tab specific optimization like native file explorer, notes app. Use tap in dark mode it's look and feel amazing. Don't expect anything form camera it's straight from. 2018but good enough for video call",
            "Vedio clarity not up to the Mark",
            "It's nice at this price",
            "My review is after 2 weeks of usage. Good for online classes with ok type battery backup and camera output. I got Android 11 update on arrival from flipkart.",
            "It's super slow. Not so useful now.",
            "Nice tablet in this range and good quality. It's work smoothly for light work and online classes. Must by if you looking in this range!!!",
            "Wow what a tab exlent product iam fully satisfied 👍 thank you flipkart",
            "I have use this tab from 2 days it work fine no lagging issue.\nBattery 5/5 it gone upto 10 hours screen time from 100%to 0% .\nBattery charging duration time 3 hours 10 minutes.\nCamera is very low and cheap quality images.\nPerformance is not too much decent it can work your daily task.\nApp opening and closing time is slow.\nVideo quality is awesome.\nYou can play video upto 720p and more than 720p video not play properly.",
            "Product was good",
            "Stopped working after 10 Months of use..",
            "The product is very good. Very reasonable price. Thanks to Flipkart for having this on their app because this model was not available any where else.",
            "it have no screen shot option it draw back",
            "Using last 4/5 months. Speed is little bit slower.",
            "great tab, appears smaller in pictures but is actually sufficient for reading and online courses, a must buy for students. ❤",
            "Nice",
            "After six month the microphone is not working while video conferencing even though Tab is used very rarely. Not a good option of buying samsung.",
            "Good product",
            "nice tablet",
            "This is best tab at this price. We bought it for online classes of kids. It servers the purpose best.",
            "Nice product",
            "Good tablet in basic range and value for money",
            "Bad products",
            "Nice💜💜💜💜",
            "Really amazing product... but expected better camera clarity",
            "Just right size in my hands for reading books.. decent display with easy 2-3 day battery makes purchase worth it..",
            "Cheap but does the work. Good for students.",
            "Good product",
            "Awesome 🥰🥰🥰😍😍😍",
            "Nice",
            "Delivery boy delivered on time and perfect",
            "bought it for my kid to do online classes n downloaded youtube kids . good product n value for money . battery lasts for 24 hrs n very handy.",
            "Nice",
            "A very useful and great product for an extremely affordable rate. As a college student it has become very much useful for me . Just loved it!",
            "Awesome",
            "Nice product, value of money",
            "Good",
            "Just awesome.\nMust suitable for online classes.",
            "wonderful tab for Online study preparation. Highly recomended.",
            "Good one",
            "Nice",
            "Excellent",
            "Awesome🤗😍",
            "Very nice 👍",
            "Good",
            "Display super",
            "Best tab in my opinion, Faster delivery by Ekart Logistics, Thank you Flipkart. Courier delivery boy are very good, Thank a'lot.",
            "Good product",
            "Delivery boy was good, delivered on time. Thanks to flipkart.\nGood for kids\nWorth it.",
            "Too bad",
            "Good value for money if you looking for study purposes only",
            "Super but. Wifi tablet",
            "Nice tab I like it but only 2gb ram",
            "Good product",
            "Good One",
            "Not bad",
            "To nice can buy ansome",
            "Excellent product",
            "After a month of usage - I think this is one of the value for money edu/browsing tablets available in the Indian market. For basic functionality such as browsing, google meet etc, this works like a charm. Touch and screen lag a bit sometimes - but the price justifies everything! Excellent for limited usage",
            "Nice product in this prise but full charging time is 3.30hr.\nCamera is average quality.\nBattery is good\nSound is very nice.\nDisplay is superb.",
            "Average product.",
            "Touch is not good",
            "Awesome tab in this range...\n\nI am using for Next target youtube channel...\nI will say .. this is awesome",
            "Hanging to much",
            "Ok",
            "great 👍",
            "Worth for budget doodling. Buy any stylus worth 400-500 and start your doodling journey.",
            "Very nice",
            "Loving it♥️",
            "I had make a full unboxing video on this tab my chaneel name is creed plays",
            "Good tab for reading books and watching movies.",
            "Amazing product just made for students. Compact slim and amazing design.",
            "Working fantastic",
            "Except for camera quality everything was worth my money.",
            "Good tab in this price range",
            "Good",
            "Very good product at 7499 rs,I like it.",
            "Good product....as this price",
            "Lagging issue and slow processor with no returns",
            "Go for it",
            "Good",
            "Good",
            "Very good",
            "Superb!!!!",
            "Thanks tooooo muuuuch flipkart",
            "Very good",
            "overall fully satisfied",
            "Once has issue with os after factory reset it's fine",
            "Value for money",
            "Such a great one.. love this one..",
            "Good tablet in this price range, but only for minimal usage as it has only 2GB of Ram.",
            "Nice",
            "Average tab...",
            "Demage products",
            "Good value for money",
            "For study purpose ,one can go for it\nBattery and performance is good at this price of range",
            "nice tab must buy it.......********",
            "Good product and delivered too.",
            "Good and affordable.",
            "Good Tab for 8K budget.. Worth for money.\n\nIt will be suitable for lite usages and multimedia purpose\n\nDisplay resolution is 720p only",
            "Good",
            "Good",
            "Everything is good about this tab. But as a customer, wish some more features could have been pumped in-like faster screen refresh rate, upto 3GB of RAM and a memory card slot.",
            "Ok",
            "Thanks Flipkart",
            "It's awesome",
            "Very good for kids",
            "For kids online classes I would say a perfect product, but for adult use, I mean gaming and robust use, would not solve purpose, as being only 2 GB Ram it lacks in performance and which is quite justifiable in this budget, but I f I talk about battery or speaker, you would love it, excellent display and rich finish.\n\nSurely go for it",
            "Good you can play games like free fire in ultra graphics",
            "Great product to be used for online learning for kids in today's scenario.",
            "Tab is good..but has some technical issues!!\n1)Hdfc securities app can't be installed!\n2) screen mirroring is not possible\nOtherwise it's a descent tab!!",
            "Purchased for my mother. Worth it.",
            "It is so useful 😁 and good I loved it 💕🥰❤️",
            "Its a good product and value for money. Can be bought",
            "Bought it as a gift to my Mom for basic whatsapp/youtube usage during offer period for below 8k. Reviewing from that perspective. Its a basic value for money tablet. Front camera is basic, not bad. Good display. But the sound output is much low compared to the lenovo tab used earlier. Tablet may need a rugged cover, especially for elders for easy handling.",
            "Perfect design and good valuable product",
            "How to express my feeling for this.very nice tab",
            "Nc. .. No sim tray",
            "Nice tablet, kid is happy.",
            "Just fine. Cant expect much from 2GB device, but ok for just attending online classes for kids and surfing. Too many apps slows down",
            "Delivery was on time.\nPackaging was good.\nPerformance is normal.\nSometimes Wifi may show issues.",
            "Perfect for kids have a great feature of Samsung kids home. Brightness automatically adjusts",
            "Best for kids online classes",
            "Terrific product at this price, got this tab for online class for baby and its working fine. Camera awality is average.It is very handy to carry.",
            "Wonderful",
            "Worth buying.....",
            "Really a worst product",
            "Good tab having multiple user functions but little dispointed can't move apps to memory card waiting for oneui upates",
            "Super nice product",
            "It was a slow rider but can be a good performance performer for day to day browsing and content consuming. All the appreciation goes to battety. Overall a non Chinese rookie. Not much to expect.",
            "Satisfied",
            "Value for money",
            "Love this must buy",
            "Nice product",
            "Wifi reception is very poor. Also it don't connect to WIFI easily. Otherwise it is a good buy considering price point. This is used by my son for online classes. Sound is good.",
            "Wow",
            "Not good condition product",
            "Best product",
            "That is a best product 😍",
            "I previously used Micromax tab which has better display than this, I expected good display, otherwise battery is ok, camera is ok, performance is slow, overall an average tablet",
            "Very good Tab. Working fine and smooth. No issue till now.",
            "Super",
            "Overall very good at this price range.",
            "Good...in this price range",
            "A real good product in this price change along with the brand name of Samsung, it was for my kid and serving all the purposes",
            "Very nice tab.. Value for money",
            "Satisfactory",
            "MY OPINION FOR THIS TABLET IS REALLY AWESOME ....YOU CAN REALLY AFFORD IT ....IT IS\nVALUE FOR MONEY\nGOOD PRO GAMING\nCLARITY IS AMAZING\nPERFOMANCE........REALLY NO WORDS\nTHANKYOU FLIPKART FOR THIS AMAZING PRODUCT",
            "Excellent TAB for kids/ online class in this price, too good.",
            "Very good product at 5his price. Ca.era is good, connectivity is good. Performance is good. Only display is below expectation as I am comparing it with my Samsung M21 mobile emoled display..",
            "Very nice",
            "this product is amazing must buy this ..l can't believe that this really mind blowing",
            "Good",
            "Good for online studies",
            "It ok average tab Remember its only working in wifi",
            "Super quality",
            "Useful product",
            "All ok. The keypad is small.",
            "Display resolution is very low. Things look blurry. And speed is also little slow.",
            "Cheap Beautiful Long-lasting",
            "Value for money... good battery life..",
            "Awesome for use",
            "One of the best for budget explorers",
            "Best Samsung Tablet....thank you flip kart....",
            "Very nice",
            "Good",
            "Nice",
            "THE TALBE IS AWESOME AND I REALLY ENJOY IS THE DISPLAY\n\nI LOVE IT SO SO MUCH 😍\n\nTHANKS FLIPKART 🙂",
            "Good",
            "Very good and very nice Tab in this range",
            "Nice display. Can't expect much from camera. Performance is quite good in this price range.",
            "Thanks",
            "Wortt buying",
            "Very poor,after 10 days receiving, battery not charged by charger..",
            "Good",
            "Product is good bt the delivery service by the flipkart is worst.",
            "A bought it for my 3.5 yr old boy. It is amazingly light weight n slim. My boy can use it easily. Just awesome. Recommend it without second thought. I got this at 8099 rs",
            "Best If you are seeking tablet for study purpose ,not for gaming and camera is not too good",
            "It's too good",
            "Nice tablet in budget range",
            "It is not nice",
            "I am happy Nice product",
            "According to budget it was great.... Battery is also very long lasting.... It is very good for students.",
            "Average performance",
            "This type of tablet is not expected from samsung. A message 'This app may not be optimised for your device' is shown in the play store below many apps when you install it. Internet is not working in some apps. Community posts are also not available on youtube.",
            "Good good tab this money range",
            "I bought the product for online classes, reading e-books and watching videos. For these activities I have found no issue with this Tab. If you are in for these purposes that I have mentioned above then just wait for nothing and go for it....",
            "Excellent samsung product @ this price.. considering the big billion + SBI Card discount.. Deserves a 5/5 if resolution could have been better than the current one..",
            "Average tablet",
            "Excellent for students and it is wifi only it's also safe",
            "Best",
            "Value for money",
            "Value for money good one",
            "Excellent product under 10k. Funpack entertainment for whole family.",
            "best at this price segment and sufficient for study and entertainment... cannot say how it works for gamers.",
            "Awesome...",
            "Super",
            "In my opinion its ..Awesome really very good product..loved it..I am using for it study,kindle and videos ..don't know about Games...",
            "Good product",
            "Overall excellent tablet !",
            "All good. One thing I did not like is that... Country of origin mentioned in flipkart as India, but in the mobile box it is mentioned as China: (",
            "Very bad mobile",
            "BEST FOR BUDGET",
            "Good for this budget compare to any tab.",
            "It's nice product. I am happy.",
            "Dont wait buy it first",
            "Average product, but for students it’s good.",
            "Samsung brand itself sufficient to know the quality. Sim is not there but overall product is good and fine.",
            "I wld say this is a good deal for this price range",
            "Loved it. Thank you flipkart",
            "Nice product good shipping good packed",
            "Good",
            "Good",
            "Touch sensitivity very low\nSlightly hang\nModerate display\nSuitable for who prepare competitive exams.",
            "Nice tab for students.",
            "Good Product",
            "Good tablet",
            "Value for money💰",
            "I bought this tab for my daughter. The delivery by flipkart was dit on time.\nSo far the tab has performed well for connectivity and battery life is concerned.\nReally happ with the purchase.",
            "Mi phone users may not feel happy with UI and fonts of samsung I am not satisfied with this tab due to one main reason ie touch response delays when we touch any icon it is not responding, two or three I need try touching on icon. Themes we can't change, feeling bore with tab UI and responsive. Resolution is not hd, icon colors like faded colors. Rest everything is good only issue if I compare with my mi phone.",
            "Good product books reader best",
            "Nice product, I like it, thanks flipkart",
            "Hmm... exllant.. m not paid more than 10k. For this quality product. Touch exllant, battery backup very good, performance exllant, picture quality and color saturation is ok but not bad. I know this is TFT.. it is made for normal uses only. Stay away heavy gamers.\nI'm not gammer. So I'm fully satisfied.",
            "Tab is good and reliable. Basic model, easy to handle, very useful. I was using the previous model for many years. Now bought the new A80. Happy with its performance.",
            "Super",
            "Top notch product...Seller is best..!!!",
            "Good tab in this price range under 10k",
            "Best",
            "Good product like the quality and volume is also good",
            "Very good",
            "Nice",
            "Average product.",
            "Excellent battery backup and slim design. Love the display",
            "Not bad best for causal use",
            "Not satisfied",
            "It's very very good awsome",
            "I wanted it for office purpose.. Serves it perfectly.. However when it operates on Wifi.. the internet is pretty slow..",
            "Very bad",
            "Excellent product. Using for online classes of my kid.",
            "Best for child education.",
            "Very nice tab😘😘😘😘😘😘😘",
            "Its very good for students for online class",
            "Good. It is a good tab.",
            "Issue for wifi connection",
            "Good",
            "Nice Tab",
            "yah it is good but is ram is poor it is not good for gaming and the camera is not good",
            "Value for money product",
            "Okka product. Working slowly.",
            "Best tablet in the price range",
            "Stunning performance . Display is good. Sound quality is also good.",
            "Superb at this price range pubg lite runs very well",
            "Ok working",
            "Good",
            "Well",
            "Performance reduces as usage increase, at the best a decent low end product",
            "Good product under 8k, go for it if that is the budget",
            "I'm very much satisfied with this... perfect for study purpose..",
            "Awesome but some wifi issue",
            "A decent tablet at this price",
            "Its awesome!!!!",
            "Does not need any researching others\n\nSimply go for it ull get happy",
            "very very nice",
            "Value of money",
            "Amazing and must have product for all students",
            "there is no storage problem, but screen touch not working smoothly. battery performance is good.",
            "Was fantastic Tablet",
            "I don't want to lot of functions and facilities on tab but this is give me more than my expectations\nCamera - ok\nBrowsing - hmmm good\nDisplay - very nice\nYou tube and other app\nPerformance very well\nThank you Flipcart",
            "Very Good Product.Like it's",
            "Nice product",
            "Nice",
            "Like",
            "Awesome product...",
            "Good",
            "Performance, battery, display wonderful..best for reading.. buy it at offer season then u can get it at 8500.",
            "Well packed.. Give it a try....",
            "Average performance but price good",
            "This is a very branded product and no chance for getting any problems on this device..but this is not a gaming device but this is for students and for students who want to learn from internet may buy this product 😀😁😁😁",
            "mind blowing tab 😍 in such an affordable price .. really thanks flipkart",
            "good product",
            "Good Product\nGood for students",
            "Great tab",
            "one of my best purchased product ever",
            "awsome deal in awsome money",
            "Great product from Samsung.",
            "good for reading and browsing",
            "Excellent tab in this price range!!!",
            "nice products",
            "Original product and good service by flipkart.",
            "Excellent product from Flipkart.",
            "Best in budget",
            "I love samsung products",
            "Nice budget range tablet needs little more improvement in display.",
            "Nice product with best battery backup, and given on time delivery.",
            "its ok...at this price.... u can buy it for study purpose,suffering and gaming...",
            "very good tab . thank you.....",
            "Good tab for watching movies, and reading books, go for it",
            "Nice",
            "Nice",
            "Best for student",
            "Tab is very good.Display battery capacity was very good.camera option good.mainly this prices Samsung tab was gave us difference features I like it.but processor speep medium and camera quality is medium.",
            "It was nice specially its androids version its 9.0 it works really nice",
            "An overall Good product and user friendly. I mainly buy it for study purpose and it will replace your books efficiently. But As a Reader I find 2 drawbacks which is very minimum at least in this price. 1. A stylus for writting, 2. Split Screen. Hope At least they will give second one in next update.",
            "gud for kids",
            "Value for money!!!",
            "Best in this price range",
            "display hd quality very good and sound quality dolby very loud and clear . battery backup very good.hang some time reason low 2gb ram.",
            "It's really value for money I like it for ebooks reading",
            "Great",
            "nice.fully setisfied",
            "Good battery and display. But 2gb RAM and low end CPU is turning out to be spolier with the kind of bloatware Samsung adds. Overall not a great product.",
            "great product. but sometimes its slow while playing games.",
            "amazing tablet\nUnexpected Display suberb\nBig battery\nCamera not bad in this price range\nOver all awesome product",
            "nice tab",
            "looks pretty, size is good for watching TV shows but streaming is not a bit clear. I recommend to take.",
            "Still now it's working fine. Let's see.",
            "good",
            "Sach a great product ..",
            "V good",
            "nice product",
            "one week almost and going good. camera is fine. no lag. good performance. good battery as well",
            "good battery backup. bright screen colours. stereo speakers. easy to handle, light weight and maintenance.",
            "Good product....but with mobile telephone calls feature would have better.",
            "It's good",
            "This basic tablet is good for readers.",
            "I think camera is not so impartent but rest all is good as this price bracket."
        ],
        "likes": [
            "22",
            "78",
            "1310",
            "846",
            "143",
            "21",
            "8",
            "6",
            "4",
            "5",
            "22",
            "78",
            "1310",
            "846",
            "143",
            "21",
            "8",
            "6",
            "4",
            "5",
            "1",
            "2",
            "3",
            "2",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "3",
            "2",
            "1",
            "1",
            "0",
            "0",
            "367",
            "147",
            "96",
            "9",
            "7",
            "18",
            "6",
            "6",
            "9",
            "5",
            "16",
            "5",
            "11",
            "19",
            "7",
            "11",
            "3",
            "3",
            "7",
            "7",
            "2",
            "2",
            "3",
            "3",
            "4",
            "3",
            "2",
            "2",
            "2",
            "4",
            "3",
            "2",
            "1",
            "2",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "0",
            "3",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "9",
            "17",
            "225",
            "163",
            "31",
            "4",
            "0",
            "0",
            "0",
            "1",
            "9",
            "17",
            "225",
            "163",
            "31",
            "4",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0",
            "1",
            "2",
            "0",
            "0",
            "70",
            "31",
            "20",
            "0",
            "0",
            "3",
            "0",
            "0",
            "1",
            "0",
            "4",
            "0",
            "3",
            "7",
            "1",
            "3",
            "0",
            "0",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "2",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "12",
            "1",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1"
        ]
    },
    "qna": {
        "questions": [
            "Q:does it have a mic for WhatsApp & Skype video calls??",
            "Q:aluminum or plastic body?",
            "Q:does it have selfie camera",
            "Q:can I connect earphone",
            "Q:Does it support ms excel???",
            "Q:can we use stylus (pen) in this tab ? for study purpose?",
            "Q:A youtuber can use this tablet for YouTube uploading videos or not.",
            "Q:can we use whatapp",
            "Q:Is there any lag on playing games like pubg or call of duty",
            "Q:processor full detail ?",
            "Q:can we use otg cable",
            "Q:Is it good for students ?",
            "Q:can we use WhatsApp , Facebook every same with phone or not???",
            "Q:Does it have hanging problem? i have noticed after a year or so samsung tabs starts hanginh and get slow. please share your reviews.",
            "Q:Can you play freefire",
            "Q:does it contain wats app",
            "Q:does it have sim card tray",
            "Q:does it come with tempered glass",
            "Q:how many hour play game",
            "Q:Can we see documents and emails in this tab??",
            "Q:this tablet weight",
            "Q:Can we call in this tab",
            "Q:can i fill bank form on tablet",
            "Q:Can we connect to mobile hot spot?",
            "Q:How can I transfer my data to laptop ?",
            "Q:we can show power point presentation",
            "Q:this has camera or not",
            "Q:Can I transfer apps from internal stroge to SD card ??",
            "Q:how many minutes it will charge",
            "Q:Does it support pdf ?",
            "Q:can we play free fire without hanging",
            "Q:pugy is playing on HD",
            "Q:can i play pung",
            "Q:will it be updated further by Android 10 ?",
            "Q:Does it support whatsapp voice calls?",
            "Q:Blue light filter available in this tab ?",
            "Q:Can we play 2020games",
            "Q:Is it supports WiFi calling",
            "Q:Can we use jio 4g voice call app from jio fi",
            "Q:Can we play clash of clans?",
            "Q:do we get earphone with this?",
            "Q:can i take screenshots.",
            "Q:how to take selfies with this tab",
            "Q:net banking apps and google pay is available or not",
            "Q:can we use 5g",
            "Q:Does it support Google Pay & net banking",
            "Q:Is there any provisions for bluetooth connectivity...???",
            "Q:does it has speaker",
            "Q:can we conect key board",
            "Q:Can I project onto a TV using a micro USB to micro HDMI cable with this tablet?",
            "Q:wifi not connected..how it can be resolved?",
            "Q:split screen option available",
            "Q:2gb ram is that fine for a brand new tab?",
            "Q:We can connect with keyboard and mouse and make it like a computer",
            "Q:Jio sim suport",
            "Q:does it have face unlock function ????",
            "Q:plz tell me can we play pubg lite on this samsung A 8.0 tap",
            "Q:Can I Use Wi Fi Calling In this Tablet Connect To Jiofi ?",
            "Q:where will i find fit cover and screen guard?",
            "Q:Can we play free fire and pubg lite both on this tab without laging",
            "Q:Does it have earphone??",
            "Q:Is S pen available with this tablet?",
            "Q:what is Jack Size? dose it support Boat headphone 3.5mm?",
            "Q:Screen lock available",
            "Q:Can I move on net with sim",
            "Q:Can we do multitasking?",
            "Q:Can i connect pen drive with it??",
            "Q:does this tab has gallary",
            "Q:Can i on hots pot",
            "Q:Will we get pen with this tab?",
            "Q:Network or WiFi",
            "Q:can we use pen in this tablet",
            "Q:Can I play brawl star",
            "Q:Does it's WiFi connect perfect? Or it's like samsung smartphone like network errors?",
            "Q:we can use data without wifi",
            "Q:Can I put idea sim",
            "Q:Can I use somna typing software",
            "Q:Can i use for graphic designing?",
            "Q:Do this tab is available to take calls on zoom app",
            "Q:Can we install free fire from Google play",
            "Q:is this have headset",
            "Q:Can we download Google meet and Google classroom for online classes",
            "Q:Can we install Microsoft team",
            "Q:Does front camera is good enough for online class",
            "Q:Can I download pubg mobile kr version",
            "Q:voda 4G and jio 4G sim usable",
            "Q:it had kids zone",
            "Q:Can we see you tube videos without wifi",
            "Q:Did this tab support the airtel 4g sim",
            "Q:Can we use 64gb memory card in this tablet?",
            "Q:Sim slot availble or not",
            "Q:does it support ms word and ms Excel",
            "Q:can we get airports or headphones with it",
            "Q:does it has finger print sencer",
            "Q:did it have face unlock",
            "Q:does it support c-type charging cable",
            "Q:What are the accessories provided along with tablet?",
            "Q:Ppt presentation possible, size of HDI",
            "Q:is this 4G enable",
            "Q:it doesnt have sim slot??",
            "Q:is its ram is expandable",
            "Q:Pen come with this ?",
            "Q:Is it useful for online classes",
            "Q:can we play free fair on this",
            "Q:which battery capacity",
            "Q:can i use carrerwill application in this tab???",
            "Q:hello how is the battery backup of the tablet",
            "Q:is it 4G Set ?",
            "Q:Does this have sim card",
            "Q:Can i use auto cad on this?",
            "Q:Can you play PUB G smoothly on it?",
            "Q:Does this tab have Fingerprint Scanner?",
            "Q:Can it run in it pubg mobile",
            "Q:Is it good for online classes and how is the network connection",
            "Q:Can we download zoom app.",
            "Q:can we play free fire without laying",
            "Q:only wifi use???",
            "Q:what about the processor, quad core or octacore?",
            "Q:can we use instagram??",
            "Q:CAN I PLAY PUBG PERFECTLY",
            "Q:Does this product have call facility/SIM support?",
            "Q:can I use jio sim",
            "Q:does it support pubg Mobile",
            "Q:is it 4g tablet",
            "Q:i can play pubg moblie playing",
            "Q:can you play pubg mobo",
            "Q:OTG facility is there? can i connect my pendrive",
            "Q:We can use whatsapp on it",
            "Q:Can I am playing Minecraft on this tablet",
            "Q:Does it has a stylus pen in it ????",
            "Q:Tab will come with pouch or without pouch",
            "Q:Can use sim card this tap",
            "Q:How to on the tab ?",
            "Q:4g or 3g b sb snnajskakksbzjj",
            "Q:it is 2GB ram",
            "Q:does this tablet hss stereo speakers",
            "Q:is support jio news app?",
            "Q:Is this have a IMEI number and serial number??",
            "Q:will it support calls and watsapp",
            "Q:can we make tiktok videos",
            "Q:Even though connecting 4G wifi to this tablet, I am not able to imstall apps from google play store....can any one help me on this matter?",
            "Q:Which processer using??",
            "Q:Does it have bluetooth and headphone jack",
            "Q:can we use fingerprintlock on this tablet",
            "Q:720 HD video support in this table",
            "Q:can we play hello neighbour",
            "Q:can play internet without wifi",
            "Q:What is prosesor",
            "Q:Can we use ibis paint app on this to draw?",
            "Q:can i use imo app",
            "Q:We can use earphone or bluetooth to this tablet yes or no",
            "Q:How many apps or games keep in the tablet",
            "Q:Can kids use this tablet?",
            "Q:Can we download watapp?",
            "Q:how many hours i use to YouTube in one time after full charge",
            "Q:Can we insert SIM in this tablet",
            "Q:Can we change wallpaper and texts",
            "Q:Is this phone have hang",
            "Q:Can I use unacademy and telegram on this device?",
            "Q:It have flash light",
            "Q:Is it amoled display?",
            "Q:Does this tab is useful for daily office work? Sometimes Mobile ask for desktop version where mobile doesn't support desktop work.",
            "Q:How long it take to charge",
            "Q:Can i use stylus pen",
            "Q:Does it support mobile hotspot",
            "Q:This have the screen mirror?",
            "Q:Can we use memory card sim card",
            "Q:Jio 4g support",
            "Q:Can we run it through airtel 4g sim",
            "Q:Is it having two speakers in bottom or a single ?",
            "Q:Does this tab have earphone",
            "Q:What's the weight of the tablet in grams",
            "Q:the tab will connect to wifi connection???",
            "Q:can we do digital art on this tablet",
            "Q:does it come with temper gourd",
            "Q:call of duty",
            "Q:does candy crush get connect with Facebook on this tablet",
            "Q:can I connect harddisk",
            "Q:What is the processor used in this device..Is it qualcomm or exynos processor",
            "Q:Does hd video play smoothly without lagging?"
        ],
        "answers": [
            "A:Yes, it can handle video calls easily.",
            "A:aluminium sleek body",
            "A:Yes 2MP",
            "A:yes",
            "A:Yes",
            "A:Ofcourse! you can use stylus pen.",
            "A:of course you can",
            "A:Yes, you can use the same...",
            "A:It's not a gaming type. Please opt other models.",
            "A:Snapdragon 429 - 2ghz quad core",
            "A:Yes",
            "A:Very useful. One can use it as an ebook reader also.",
            "A:Yes.We can use.if you synchronise contacts with google in your tab, All numbers wil be available.if you install and activate whatsapp with your registered number, then your same account will display.",
            "A:It's slow.",
            "A:Yes",
            "A:No. install from Google play store for free.",
            "A:Nope. It's a wifi only model. U can find a memory card slot on the tray",
            "A:no",
            "A:full charge battery to can easily play 2 hours game nonstop",
            "A:Yes you can see both",
            "A:It’s light weight I recommend to go for it",
            "A:WhatsApp, zoom and teams calls yrs you can",
            "A:yea",
            "A:yes we can connect. As it supports wifi.",
            "A:Usb or Bluetooth",
            "A:Yes",
            "A:yes , why not ♥️",
            "A:Yeah",
            "A:3,4hr to full charge but battery also lasts long",
            "A:Yes",
            "A:No.",
            "A:you can but you will face some lag",
            "A:Not for gaming",
            "A:Yes",
            "A:yes 👍",
            "A:Yes",
            "A:yes",
            "A:Yes",
            "A:yes",
            "A:yes u can",
            "A:No. You have to buy separately",
            "A:yes",
            "A:same like we do in mobile phones",
            "A:Not available it requires SIM card",
            "A:No",
            "A:yes",
            "A:yes it has....",
            "A:Obviously. It has a very nice speaker. Enjoy even without headphones.",
            "A:yes",
            "A:No you can't",
            "A:check WiFi connection.",
            "A:No",
            "A:Yes, it's fine for day to day tasks, normal browsing, casual gaming and movies",
            "A:yes bt u wont be able to use windows apps on it...it can handle other stuff like excel and word",
            "A:No",
            "A:no",
            "A:Sure i am playing PUBG mobile on my device,there is no logs,one thing you install one game on device,and lot of Biggs are there ,don't install PUBG lite ..quite not interested",
            "A:Yes, you can",
            "A:obviously on Flipkart.",
            "A:No",
            "A:no",
            "A:Nope",
            "A:yes",
            "A:Yes normal as well as code lock also",
            "A:they have given slot but not yet tested",
            "A:no you may not....",
            "A:No",
            "A:All gadgets that have camera is also having gallery",
            "A:no",
            "A:No.",
            "A:WiFi",
            "A:no",
            "A:yes you can",
            "A:perfectly n easily connected. No errors",
            "A:No",
            "A:This is Wifi only tablet, there isn’t any sim slot in this tablet. So you can’t put any sim for this tab. Please check the model before buying, if it is wifi only or wifi + 4g lte.",
            "A:If its on playstore, you can",
            "A:no",
            "A:yes",
            "A:Yes.",
            "A:nooooo",
            "A:Yes",
            "A:yes you can install",
            "A:Yes",
            "A:yes you can download",
            "A:no",
            "A:No",
            "A:No this only Wifi Tablet not Sim",
            "A:This is wifi version only",
            "A:yes",
            "A:not",
            "A:yes",
            "A:no only travel adapter",
            "A:No",
            "A:no",
            "A:NO only B type",
            "A:nothing..charger only and a pin to open",
            "A:Yes",
            "A:Only wifi",
            "A:It is wifi only. Only memory card slot is available on the tray.",
            "A:nope . but ROM is explanable upto 512 GB",
            "A:No",
            "A:Yes,",
            "A:yes you can play free fire on this .",
            "A:5100 mah which goes to 10 - 12 hours in normal usages",
            "A:yes",
            "A:So far so good. Only charged once and I am using it for 3-4 days. Even though I didn't use it continuously, battery backup is really good.",
            "A:4g",
            "A:No sim card",
            "A:No its a Android tab not a windows",
            "A:pubg the large version which is 2gb you can't play on it because ram is 2gb only though it has a 64 bit processor but still it will lag , but PUBG lite you can play easily and it smooth as butter .",
            "A:unfortunately it has no finger sprint scanner , but it has a sensor you can double tap on the screen and screen unlocks .",
            "A:it's not a very powerful tablet and I bought it for reading ebooks and for that purpose it works great but you can play normal games under 200mb but try not to play heavy games like pubg",
            "A:wifi sometimes doesn't connect , but u can use hotspot . Rest everything is fine . But I won't suggest this for online classes . Go for a 10 inch tab .",
            "A:yes ofcourse",
            "A:No",
            "A:Yes",
            "A:Nice working",
            "A:yes , why not? it works",
            "A:Sorry not recommended for gaming",
            "A:No, it supports�Wifi�only",
            "A:Nope, only wifi",
            "A:Yes it can but you will not get good experiencing bcoz it is having only 2 GB of ram also it is not having powerful chipset",
            "A:its 4g LTE , but doesn't support Sims",
            "A:No",
            "A:yes u can but this tab is not for high end games as only 2gb Ram",
            "A:can I connect pendrive with this",
            "A:Yes whatsapp can be used on it, both app based as well as through desktop site in chrome",
            "A:yes of course.. I have played on it.",
            "A:No",
            "A:without pouch",
            "A:no",
            "A:there is a power on off button",
            "A:4g",
            "A:Yes",
            "A:Not stereo but we can assume as same as such. Overall good one.",
            "A:Yes",
            "A:Yes.",
            "A:yes",
            "A:Yes you may make Tiktok videos. However the front cam is just 2 mega pixel and the clarity isn't what you would expect in your tiktok videos.",
            "A:basically if you have a Google account and have accepted to allow play services it will be installed in your tab , I have done it and it works . try to sign out and sign in then give it a try .",
            "A:Exynos. Smooth so far😊",
            "A:yes.",
            "A:no",
            "A:yes",
            "A:Yes",
            "A:Yes, you can play but in dream !! It's not calling tab, only WiFi option available",
            "A:2GHZ OCTACORE ..",
            "A:surely u can",
            "A:yes ,but not directly. not recommended",
            "A:Yes U Can",
            "A:no games are there but basic apps are there samsung notes are there",
            "A:yes.",
            "A:yes but we can't put sim",
            "A:7-8 hours",
            "A:No it only works with wifi and it have only one memory card inserted slot option",
            "A:Yes",
            "A:no",
            "A:Yes",
            "A:No",
            "A:no",
            "A:not useful",
            "A:Around 2 hrs",
            "A:no",
            "A:Yes",
            "A:yes it has selfie camera",
            "A:yes , memory is expandable upto 128 GB.",
            "A:This tablet doesn't support any kind of SIM so a Jio 4G sim card cannot be used. One can only use Wifi for accessing Internet on this tablet.",
            "A:yes",
            "A:it has two speakers",
            "A:no",
            "A:350 gm",
            "A:yes",
            "A:no",
            "A:no",
            "A:Not meant for gaming",
            "A:yes",
            "A:No",
            "A:qualcom",
            "A:HD video runs smoothly on youtube.."
        ],
        "likes": [
            "104",
            "165",
            "49",
            "91",
            "91",
            "17",
            "10",
            "8",
            "28",
            "12",
            "31",
            "6",
            "10",
            "19",
            "9",
            "8",
            "8",
            "6",
            "7",
            "3",
            "3",
            "6",
            "6",
            "5",
            "8",
            "8",
            "3",
            "4",
            "5",
            "2",
            "2",
            "3",
            "7",
            "4",
            "4",
            "5",
            "3",
            "2",
            "1",
            "2",
            "1",
            "2",
            "1",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "0",
            "1",
            "2",
            "2",
            "4",
            "3",
            "1",
            "3",
            "1",
            "1",
            "1",
            "2",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "0",
            "1",
            "0",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "14",
            "775",
            "1",
            "8",
            "81",
            "11",
            "6",
            "4",
            "78",
            "7",
            "12",
            "3",
            "2",
            "2",
            "3",
            "3",
            "2",
            "10",
            "7",
            "5",
            "12",
            "6",
            "4",
            "4",
            "2",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "2",
            "2",
            "1",
            "2",
            "6",
            "5",
            "3",
            "2",
            "2",
            "2",
            "3",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1"
        ],
        "dislikes": [
            "18",
            "36",
            "10",
            "18",
            "20",
            "1",
            "0",
            "0",
            "6",
            "1",
            "8",
            "0",
            "1",
            "6",
            "2",
            "2",
            "2",
            "1",
            "1",
            "0",
            "0",
            "1",
            "1",
            "2",
            "3",
            "3",
            "2",
            "1",
            "1",
            "0",
            "1",
            "0",
            "4",
            "1",
            "0",
            "3",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "3",
            "2",
            "3",
            "4",
            "1",
            "1",
            "3",
            "2",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "1",
            "2",
            "1",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0",
            "209",
            "1",
            "0",
            "39",
            "3",
            "9",
            "1",
            "96",
            "3",
            "11",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "9",
            "3",
            "2",
            "18",
            "6",
            "3",
            "4",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "8",
            "7",
            "2",
            "1",
            "1",
            "1",
            "1",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0"
        ]
    }
}