{
    "title": "APPLE iPad Pro 64 GB ROM 10.5 inch with Wi-Fi Only (Space Grey)",
    "product_specification": {
        "Model Number": "MQDT2HN/A",
        "Model Name": "iPad Pro",
        "Ideal Usage": "Entertainment, High Processing Tasks",
        "Color": "Space Grey",
        "Connectivity": "Wi-Fi Only",
        "OS": "iOS",
        "Operating System Version": "10",
        "Voice Call": "No",
        "Display Resolution Type": "Quad HD",
        "Battery Features": "Non Removable Battery",
        "Processor Type": "A10X Fusion Chip with 64‑bit Architecture with Embedded M10 Coprocessor",
        "Additional Features": "4 Speaker Audio, ProMotion Technology, Video Calling: FaceTime Video - iPad to Any FaceTime Enabled Device, Audio Calling: FaceTime Audio - iPad to Any FaceTime Enabled Device, Digital Compass, Siri: Use Voice to Send Messages, Set Reminders, and More, Accessibility: AssistiveTouch, Switch Control, Magnifier, Built-in Apps: iTunes Store, iCloud Drive, App Store, iBooks, Photo Booth, Podcasts, Find My iPhone, Find My Friends, iTunes Remote, iMovie",
        "Display Size": "26.67 cm (10.5 inch)",
        "Sales Package": "iPad Pro, Lightning to USB Cable, USB Power Adapter",
        "Display Resolution": "2224 x 1668 Pixels",
        "Primary Camera": "12 Megapixels",
        "Internal Storage": "64 GB",
        "OS Upgradable Version": "iOS 11",
        "Multi-touch": "Yes",
        "Sensors": "Touch ID, Three‐axis Gyro, Accelerometer, Barometer, Ambient Light Sensor",
        "Sim Type": "No Sim",
        "ROM": "64 GB",
        "Battery Type": "Li-ion Polymer",
        "Internet Browsing Time": "10 hrs",
        "Document Viewer": "Yes",
        "E-mail": "Yes",
        "Secondary Camera": "7 Megapixels",
        "Frame Rate": "30 fps",
        "Video Recording": "Yes",
        "Full HD Recording": "Yes",
        "HD Recording": "Yes",
        "Flash": "Quad LED True Tone Flash",
        "Optical Zoom": "2x",
        "Other Camera Features": "Rear Camera: Optical Image Stabilization, Six‑element Lens, Panorama, Sapphire Crystal Lens Cover, Backside Illumination Sensor, Hybrid IR Filter, Autofocus with Focus Pixels, Live Photos with Stabilization, Body and Face Detection, Exposure Control, Noise Reduction, Auto HDR for Photos, Burst Mode, Timer Mode, Photo Geotagging, Front Camera: 1080p HD Video Recording, Retina Flash, Auto HDR, Body and Face Detection, Auto Image Stabilization, Burst Mode, Exposure Control, Timer Mode, Video Recording: Cinematic Video Stabilization, Video Geotagging, Noise Reduction, Continuous Autofocus Video",
        "Digital Zoom": "5x",
        "2G": "No",
        "3G": "No",
        "Bluetooth Version": "v4.2",
        "USB": "Yes, Lightning to USB",
        "Browser": "Safari",
        "Headphone Jack": "3.5 mm",
        "Wi-fi Version": "802.11 a/b/g/n/ac",
        "Other Connectivity Features": "Bluetooth Support",
        "Other Display Features": "QHD LED Backlit Multi-touch Display, Wide Color Display, True Tone Display, Fully Laminated Display, Antireflective Coating, Fingerprint-resistant Oleophobic Coating",
        "Display PPI": "264 ppi",
        "Display Type": "Retina Display",
        "Video Formats Supported": "H.264, MPEG‑4, MP4, AVI, MOV",
        "Full HD Playback": "Yes",
        "HD Playback": "Yes",
        "Video Playback": "Yes",
        "Audio Formats Supported": "AAC, MP3, WAV, AIFF, AAX",
        "Map Support": "Maps",
        "Memory Card Support": "No",
        "Warranty": "1 Year",
        "Warranty Summary": "1 Year on Tablet, 6 Months on Accessories",
        "Warranty Service Type": "Carry In",
        "Covered in Warranty": "Manufacturing Defects",
        "Not Covered in Warranty": "Physical Damage",
        "Warranty Period": "1 Year"
    },
    "product_description": {
        "Redesigned Retina Display": "The iPad Pro's 26.67 cm (10.5) touchscreen offers you enough canvas to work on, to read texts or to watch movies without straining your eyes. All iPads offer users a great multi-touch experience, but the iPad Pro's redesigned Retina display sets a whole new standard. This iPad's display is brighter and more responsive than ever. It is also less reflective than regular tablets. Everything feels smooth, fast, and immersive on the iPad Pro. The iPad's fingerprint-resistant oleophobic coating protects it from smudges.",
        "Endless Fun": "This iPad supports various software that make both work and play fun. Apps like Adobe Photoshop Lightroom lets you make professional-level adjustments to your photos on the go with a simple tap and swipe gesture. The iPad Pro also includes features like Great Big Story which lets you watch a curated playlist of the best videos from around the world, the Star Walk 2 which brings you lifelike images of stars, planets, and comets, and Houzz which lets you use the Apple Pencil to write and draw on high-resolution home renovation images.",
        "Incredible Refresh Rate": "The iPad Pro's Retina display supports a refresh rate of 120 Hz so the videos you watch on it look spectacular, while video games run smoothly without any distracting artifacts. The iPad Pro intuitively responds to commands regardless of whether you use the display with your finger or the Apple Pencil.",
        "See More, Feel More": "Immerse yourself in the videos you watch on your iPad Pro because the iPad's 600 nits of brightness enhances its lighting so you can clearly view content on your iPad. This iPad's wide P3 color gamut brings you more vibrant greens and reds so images and videos are truer to life. Apple's custom-designed anti-reflective coating makes this iPad Pro's display clear and readable.",
        "Seamless Multitasking": "When updated with the iOS 11, the iPad Pro's all-new Dock makes it easy to open your favourite and recently used files and apps. Use the Slide Over or Split View apps if you want to stay active or work on two apps simultaneously.",
        "Powerful Performance": "Powered by the A10X Fusion chip which has a 64-bit architecture and six cores, the iPad Pro is packed with incredible power. You can edit 4K videos, or use uMake to create elaborate 3D drawings or models and export them as industry-style formats. The iPad Pro also has the AudioDesk Format which lets you capture building design concepts digitally, anywhere you are. The Bloomberg Professional app lets you view real-time data, charts, graphs, and more such documents when you multitask. Apple's ISP (Image Signal Processing) uses machine learning to breathe life into your photos and videos so they look lifelike.",
        "Long-lasting Battery": "The iPad Pro's long-lasting battery ensures up to 10 hours of performance. Take your iPad Pro with you and work on the go.",
        "Responsive Apple Pencil": "This iPad's pencil boasts an increased refresh rate which makes it feel responsive and natural. Use this pen to write notes, sign documents, annotate on PDFs, or to draw on screenshots with ease. The Apple pen also lets you sketch and draw with pixel-perfect precision. It also includes the searchable handwriting feature which lets you search for handwritten texts and characters.",
        "Files App": "The Files app brings all the files on your iPad, your apps, in your iCloud, and also the files across other services like Dropbox and Box together. This iPad has an expansive 64 GB ROM for you to save your media files in.",
        "Drag and Drop": "Drag and Drop lets you move texts, photos, and files from one app to another with just a finger swipe. The iPad Pro also includes the App Switcher which lets you smoothly switch from one app to another. This function even remembers the combinations of apps you've multi-tasked with previously.",
        "Sleek and Compact Design": "The Apple iPad Pro packs a credible performance, an advanced display, two cameras, ultrafast wireless connectivity, and a powerful battery. All this goodness is packed into a neat and compact device that is the iPad Pro. Its sleek and compact design means you can carry your iPad around with you and work on the go.",
        "Wireless Connectivity": "Stream videos or browse the Internet at your leisure, the iPad Pro's Wi-Fi connectivity offers you the world in your hands.",
        "Cameras": "The iPad Pro features the same cameras as the iPhone 7. The 12 MP rear and 7 MP front cameras in the Apple iPad Pro have an advanced optical image stabilization function and a ratio of f/1.8 which allow you to click picture-perfect photos and videos even in low-light conditions. The iPad's wide color capture feature helps you click the perfect Instagram-worthy selfies.",
        "Touch ID": "The Touch ID feature uses an advanced fingerprint sensor that lets you unlock your iPad almost instantly. This ID also lets you secure private data in apps, or make purchases with Apple Play within apps and on the Web.",
        "Convenience at Your Fingertips": "Keep your photo library and your edited images up to date on all your devices with the iCloud photo library. The iPad Pro also includes features like Handoff which lets you start a movie and pick up right where you left it. The Universal Clipboard lets you copy texts or videos from an app to your iPhone and paste them to your iPad. It's that simple and convenient. Want to share files between devices? The AirDrop lets you transfer files wirelessly. The iPad Pro works with your iPhone, your Mac laptop, and your Apple Watch."
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "1",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "3",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "1",
            "1",
            "1",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "3",
            "5",
            "4",
            "5",
            "4",
            "1",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review": [
            "First of All Thanks Flipkart for such a Wonderful price for a Beast Like This. This is my first Apple product. I must tell you the price I paid is complete justice. Every vertical has been completely justified by this. Speed, Display, Touch, Battery and specially sound is awesome. Viewing things on Laptop is always makes you feel good but on this it's awesome.\n\nOverall it's worth every penny I paid. It's on 2017 but still fails every model of 2018. Just Go For It !!",
            "I have used iPad before but this one is classy and crisp. Thank you Flipkart for the earlier than expected delivery. The iPad Pro 10.5 is now in a super new level and the Apple pencil experience was out of this world.",
            "product is Good but don't buy it if you really don't need it. after a week you really start realising that you don't need to but such a expensive tablet. any apple ipad costing around 25k can satisfy your tablet need..also windows users will never find its file saving method and opening method better than windows itself. Anyway Apple needs to simplify it's UI. they must take reference from windows for doing it like android. Apple pencil works fine on the pad.\nThanks.",
            "Wow.. colour display (P3) is amazing. 120 Hz refresh rate is just amazing. You can never notice any lagging in this device. With apple pencil it is a beast which can defeat most of the laptops! I have bought the 64 gb Version along with the Sandisk Wifi Stick of 64 gb and the apple pencil in the Bigbillion days. I got it in 40K and the Sandisk Stick is 2.5K . It is a reasonable price. Why should I buy the 256 GB version spending about 20K money more.. I should suggest every student to go for the 64 GB storage.",
            "Awesome!\nIt is my first apple device.\nIt's very much faster and stylish than a laptop. Camera is best in class. Love it.\nThanks Flipkart for fast delivery!",
            "This thing is a BEAST!!! Display is awesome, never ever seen such a great display on a mobile device. As Powerful as it gets with the A10x fusion chip, 4gb ddr4 ram.\n\nThe best thing though, is the backing up of the hardware, through the software. IOS11 is a real big upgrade for the Ipad, and is a huge selling point from my point of view. It takes the Ipad way ahead of its competition with the split screen use, drag and drop feature, and much more.\n\nThe speakers will make you forget, all other audio devices, it's loud, clear, has a good bass. I would at least hear one song for the sake of listening to those speakers.\n\nThe cameras too. This ipad has got the iphone 7 camera, and I can't believe, apple gave those cameras on an Ipad. It's just awesome.\n\nGaming experience in this Ipad with the pro motion display, or the 120hz display, is just future stuff, at present. No other tablets are even nearby. Games look super smooth with yhe high frame rates, and you will never want to play games on other mobile devices.\n\nLastly, this Ipad has no competition, and is in the league of it's own. Kudos to apple ✌️\n\n\n\nLastly,",
            "Very satisfied with the product. I have combined the Apple pencil and Apple keyboard to enhance my experience. It is almost a touchscreen laptop and I am still exploring as to how I can increase my productivity. It's sound is of great quality with four speakers.",
            "#Pros#\n1. Nice delivery\n2. Awsome look of ipad pro.\n3. There r 4 speakers do Music is very loud.\n4. Camera is really good.\n5. Aprrox. 10 hours battery backup.\n6. Picture quality is awsome due to 120htz refresh rate.\n7. Cheapest product than iphone. I purchased 45k only 64gb wifi model but iphones are very high priced than ipad.\n\n#Cons#\n1. No whatsapp massenger for wifi model on app store.\n2. Apple pencil & keyboard would be include in ipad box. Bcause thay r expensive.\n3. There r so many apps that are not available for ipad on app store.",
            "The Invoice serial no. Didn't match with the product serial number. Very disappointed. The product is genuine and working fine. I contacted customer support n ask to change the invoice serial number but rather they agree to refund and arrange the pick up after 3 days. The pick up boy come to very next day to pick up the product. I haven't taten the back up of Ipad, so i asked to come when pick up date is registered. On that day he didn't come n pick up is cancelled. Again I call to flipkart to arrange the pick up, till date i am waiting to pick up from flipkart.",
            "Its a wonderful device. Crisp,fast and beautiful. Cant imagine why anyone would want to buy outrageously priced smartphones over this. Generous real estate and yet so portable. Its the perfect media device, an awesome e-reader, a terrific laptop substitute. Cant think of one reason why I wouldnt purchase this again. Its my first Apple product and I love the natural colours on screen and the fact that it never hangs. Ive been meaning to get the Apple Pencil now that the iOS 11 has been updated...\nREAD MORE",
            "First of All Thanks Flipkart for such a Wonderful price for a Beast Like This. This is my first Apple product. I must tell you the price I paid is complete justice. Every vertical has been completely justified by this. Speed, Display, Touch, Battery and specially sound is awesome. Viewing things on Laptop is always makes you feel good but on this it's awesome.\n\nOverall it's worth every penny I paid. It's on 2017 but still fails every model of 2018. Just Go For It !!",
            "I have used iPad before but this one is classy and crisp. Thank you Flipkart for the earlier than expected delivery. The iPad Pro 10.5 is now in a super new level and the Apple pencil experience was out of this world.",
            "product is Good but don't buy it if you really don't need it. after a week you really start realising that you don't need to but such a expensive tablet. any apple ipad costing around 25k can satisfy your tablet need..also windows users will never find its file saving method and opening method better than windows itself. Anyway Apple needs to simplify it's UI. they must take reference from windows for doing it like android. Apple pencil works fine on the pad.\nThanks.",
            "Wow.. colour display (P3) is amazing. 120 Hz refresh rate is just amazing. You can never notice any lagging in this device. With apple pencil it is a beast which can defeat most of the laptops! I have bought the 64 gb Version along with the Sandisk Wifi Stick of 64 gb and the apple pencil in the Bigbillion days. I got it in 40K and the Sandisk Stick is 2.5K . It is a reasonable price. Why should I buy the 256 GB version spending about 20K money more.. I should suggest every student to go for the 64 GB storage.",
            "Awesome!\nIt is my first apple device.\nIt's very much faster and stylish than a laptop. Camera is best in class. Love it.\nThanks Flipkart for fast delivery!",
            "This thing is a BEAST!!! Display is awesome, never ever seen such a great display on a mobile device. As Powerful as it gets with the A10x fusion chip, 4gb ddr4 ram.\n\nThe best thing though, is the backing up of the hardware, through the software. IOS11 is a real big upgrade for the Ipad, and is a huge selling point from my point of view. It takes the Ipad way ahead of its competition with the split screen use, drag and drop feature, and much more.\n\nThe speakers will make you forget, all other audio devices, it's loud, clear, has a good bass. I would at least hear one song for the sake of listening to those speakers.\n\nThe cameras too. This ipad has got the iphone 7 camera, and I can't believe, apple gave those cameras on an Ipad. It's just awesome.\n\nGaming experience in this Ipad with the pro motion display, or the 120hz display, is just future stuff, at present. No other tablets are even nearby. Games look super smooth with yhe high frame rates, and you will never want to play games on other mobile devices.\n\nLastly, this Ipad has no competition, and is in the league of it's own. Kudos to apple ✌️\n\n\n\nLastly,",
            "Very satisfied with the product. I have combined the Apple pencil and Apple keyboard to enhance my experience. It is almost a touchscreen laptop and I am still exploring as to how I can increase my productivity. It's sound is of great quality with four speakers.",
            "#Pros#\n1. Nice delivery\n2. Awsome look of ipad pro.\n3. There r 4 speakers do Music is very loud.\n4. Camera is really good.\n5. Aprrox. 10 hours battery backup.\n6. Picture quality is awsome due to 120htz refresh rate.\n7. Cheapest product than iphone. I purchased 45k only 64gb wifi model but iphones are very high priced than ipad.\n\n#Cons#\n1. No whatsapp massenger for wifi model on app store.\n2. Apple pencil & keyboard would be include in ipad box. Bcause thay r expensive.\n3. There r so many apps that are not available for ipad on app store.",
            "The Invoice serial no. Didn't match with the product serial number. Very disappointed. The product is genuine and working fine. I contacted customer support n ask to change the invoice serial number but rather they agree to refund and arrange the pick up after 3 days. The pick up boy come to very next day to pick up the product. I haven't taten the back up of Ipad, so i asked to come when pick up date is registered. On that day he didn't come n pick up is cancelled. Again I call to flipkart t...\nREAD MORE",
            "Its a wonderful device. Crisp,fast and beautiful. Cant imagine why anyone would want to buy outrageously priced smartphones over this. Generous real estate and yet so portable. Its the perfect media device, an awesome e-reader, a terrific laptop substitute. Cant think of one reason why I wouldnt purchase this again. Its my first Apple product and I love the natural colours on screen and the fact that it never hangs. Ive been meaning to get the Apple Pencil now that the iOS 11 has been updated on this fabulous device.Shall update the review once I purchase that.",
            "the fact that we can't increase the memory or can't connect to PC or can't download and work with any 3rd party software restricts the device to do so many wonderful things , my only question is why the Apple is not working on it to be more productive and utilized....",
            "A very nice product.. Delivered in good condition, and i am loving it. The only thing is you cannot make calls from this Ipad even after inserting Sim. Since Sim is needed only to access internet. Overall IOS 11 is awesome.. Just go for it",
            "it is one of the best tablet I have ever seen. bro don't take any samsung tab because this is best. pros:1) pro motion display 2) best camera ever in any tablet. 3) it is powerful ipad with A10X fusion chip. 4) 8000 mah battery. cones:1) not earphone in box. 2) and not fast charger in box.",
            "Hmm It ws d first ipad in ma life , i ws waiting fo release of dis beauty fro 3-4 mnths actually i planned 9.7 before but after rumours started cmng on phonearena i thought waiting for 10.5 is must, soo finally apple released ipad pro , dat night i watched full apple keynote. Ok den i saw dis ipad avail on flipkart in a fraction of sec i ordered, & got it delivered in 2 days.. its COD,, Ok finally d moment cm to Unbox the Beast , its been rose gold colour 64gb wifi and apple pencil ,,, as i opened d box ipad ws on top of d box ,, as soon as removed it out of box n removed rapper i just closed ma eyes n gave a kiss .no earphones in d box,after switching on Display s jst mind blowing, sound is jus ossum ,camera s good , sooooper fast processor , battery is loooong live wt would u expect more , i use lap for business purpose nly hence it replaced my lap also,, don't dream apple pencil wil make u an artist ha ha , so dont waste money on dat\nClimax ,, go for it all d best",
            "very good product.100% satisfied.\nAfter a rough and tough use of 3 years is very well working. Really like this product.",
            "Good display, great battery, fine performance, not that great camera but manageable.",
            "Its super smooth for multitask and excelent for gaming , ut can handle all the big games like pubg and all in 120 fps with incredible experience",
            "Device is a beast, perfect in every way.Got it at at a very attractive price. But the packaging by flipkart was not upto the mark, considering the product is delicate, packaging standards should be improved for the electronic devices.",
            "One of the best ipad i have ever purchased. The 10.5 size is the perfect fit for most of the purposes. This is quite an improvement from the previous generation ipad's. The bezels are pretty thin, the form factor is very slim, palm rejection works great.\nThe only thing which i feel missing is the face recognition. IOS 12 works great, but it would have been better with face recognition. Battery is little weaker,what i feel, but still not a deal breaker. I purchased this on flipkart offer 37.5k...\nREAD MORE",
            "This ipad pro is the best one by far up until now even after the newer iPad pro 2018 has been launched. This one has the A10X which is lightning fast. You can render huge 4k files and raw files on it on the go. The camera is the best in any tablet so far and yes that is including the iPad pro 2018 coz the latter doesn't have OIS. And since this is a tablet which makes it a media consumption device let's talk about the things that matter if you are a media junkie just like me. The battery life is just insane. iOS is so good that the standby battery drain overnight (around 8-10 hours) is just 1% for me. The speakers are the best on any tablet by far (the 2018 ipad pro I'm hoping will be a bit better although I don't know how Apple could improve upon the already kickass speakers). The speakers are so good that it is better than most laptops out there. Finally, the screen is just so mesmerizing. The day I got it and even now I find myself lost in that beautiful retina 120 Hz screen. The colors pop out and the iPad can get extremely bright. And now probably the best thing about it is that it will continue to have support for another 4 years thanks to Apple. Overall, it has been a great purchase and a wonderful experience.",
            "Its been around a month, using iPad 10.5 pro bought at 37.5k and working absolutely fantastic.\n\nPros\nPerformance is good as we expect from an apple product with better graphics and smooth touch\nCamera quality is also an average however better than any tablet/laptop you can compare with..\nAccessibility is not so difficult than I have been heard from roumers\nBest gadget for gaming perspective as no performance lag, no hanging problem and no screen sharpness\nIt is having good connectivity with other gadgets such as Bluetooth keyboard, mouse, headsets, speakers and mobile devices\n\nCons\nBattery backup is good however taking too much time to fully charge at once i.e. Overnight\nOriginal gadgets such as pencil n keypad is too costly n over priced still you can manage to get Bluetooth once which suits well\n\n\nOverall it is good n decent product which can handle your personal n professional work together. Best in range n blindly go for it if you are looking for tablet as durability, accessibility and better performance than any other gadget",
            "It's Apple !!! nothing more to say. Best in class, best in performance, best in style, best in everything and the most important thing is that you won't regret for making this choice. Those who are reading this, you are at the right place, just go ahead and get it. I got it at a very good deal for 35K during the Big Billion Day. Loved it 🤩",
            "PRODUCTIVITY ON THE GO\n.. A very powerful device. very snappy experience ..\nThe 120 Hz pro motion display is something to be appreciated live.. colours are vibrant. thanks to wide P3 colour gamut .\n\nAugmented reality works flawless and is an amazing experience and Apps like jigspace is the coolest way to learn how stuffs work.\nIOS 12 brings the best out of this device ,multitasking using split window ,slide over and moreover picture in picture video playback makes the device a productive beast. one can use maximum of 4 apps at once , all enabled : 2 on split screen 1 on slide over and 1 on pip video playback.\n\nBattery usage:\non light usage 11-12 hrs\non moderate usage 10 hrs\non heavy usage like gaming around 4-6 hrs depending on the game.\n\nReading books on a bigger 10.5 inch display is somewhat better experience than reading on smartphones moreover u can underline , highlight text and draw on the PDF using pre-installed NOTES app.\n\nLots of things can be done with this iPad pro, pro means productivity on the go..\nbest for professionals..\n\nGot it for 35,100 only on big billion day using HDFC card",
            "Working like charm. iOS 11.3 one of the best. Everything is fine. I got it 39990 Rs from flipkart. Thank you flipkart on timely delivery. Must buy!!!",
            "Amazing product from apple and timely delivery from Flipkart, actually ahead of scheduled date. Also an amazing deal from the seller. Great discount. Can't be more grateful!!",
            "This iPad has been my first apple product. While I was certain that I needed an iPad for my browsing requirements at home and also whilst at travel, I was not sure which model to go for. After a lot of research, I zeroed in on 10.5 iPad Pro. My reasons for selecting this model are as follows:\n\n> better display than the 9 inch version\n> smooth operation and really fast\n> the specs are latest so will not get slow with iterations in iOS\n> Ideal size for a non professional use compared to a 12 inch model\n\nI have been using the tablet for about a month and the only minus that I notice is that it is a very good fingerprint magnet. Excellent device to browse, read and play games. Feels premium. iOS 11 update has bumped up the experience significantly. The best tablet around if you are interested in one.\n\nFinally, kudos to Flipkart for the excellent delivery. The entire purchasing experience was quick and extremely satisfying.\n\nThank you.\n\n\nPS: A note from my eight year old son.........It has a very large screen and that is the best quality in an iPad.",
            "Superb product just love it. Earlier I was using iPad air and now to this it is a huge upgrade for me. Just go for it is is best iPad till this date.",
            "Product delivered in good condition. Thanks Flipkart and seller for the great deal. Really happy :)\nit has been a year and i am still happy with it. Still as Good as new.",
            "overall good but so good as people talking about it. after using this product what I found:\n- Display is good for reading and browsing but sharpness is really bad. even in normal mobile you will find better sharpness and colour balance. it is really disappointing. Don't know why people talking about its display quality that it has best in class. aspect ratio of display is also very bad. 4:3 ratio is very old fashion. if you watch even YouTube you will find small part of screen playing video....\nREAD MORE",
            "you can actually go paperless, excellent refresh rate so apple pencil works superb, key board is really helpful. apple gives nothing free so need to pay for all accessories. MS office is not free you need to subscribe for rs.360/- per month to make use of iPad fully or to go paperless.",
            "Very good and genuine seller. Received my Ipad in a good condition and 2 days before delivery date. Hats off",
            "It’s an amazing product .... very useful ... easy to carry when you go out... and I strongly recommend people to buy the product coz it’s very useful...",
            "awesome product from Apple. and also speedy delivery by flipkart. great performance but camera picture clarity has to fix in update I hope",
            "it is my first apple product and my first review . it will fulfill all your needs. it is must for online reader. it is alot has to give you as learner.kinder reading is also good and pdf annotation is also good but you have to select correct app. dont think go for purchase . it cost me 48250 Rs purchased at the time no offer is there .best of luck",
            "Thanks for the offer and good delivery.\nEverything was fine except for the main box inside the package looks little old with dirtmarka and scratches, and i dont know how the scratches come on the ipad box if it was sealed from outside by the company itself😇😬..\nHowever the ipad was perfect .. checked everything, it was the genuine one.",
            "A great product to boost your productivity, I am writing this review after 1 Month. Pros : Clear display, Good Quality Sound, Highly productive for work with apple pencil, Performance is quite excellent, and look wise its amazing. Cons : Camera is good but it could have been better, A slightly small screen space because of touch id. Suggestion: if you really want to make is worth of money don't forget to buy apple pencil.",
            "I bought this with a Pencil. Amazing screen, both Cameras, refresh rate is 120 Hz which you cannot identify normally but watching videos and movies is a treat. Writing with Pencil is buttery smooth like on paper. You can go for it if budget is allowing as it will serve you for min 3 to 4 years as my previous ipad Air 2 did good job for almost 4 years. if someone is tight on budget, iPad 6th Generation is also a terrific. For sure there is no competition of iPad in Tablets atleast.",
            "Worth buying .. got it for 44900 on june 2018. Loved using it.. flawless page transition while using 5000pgs pdf and apple pencil works very well. Recommended for those hu love gaming (PUBG) ,photoshop works etc",
            "Best product from Apple so far. Loved it, apple pencil works flawlessly. Pure value for money product. The performance is top notch. I'm completely satisfied. I already own a iPhone 8 and now this iPad. I'm using iPhone since 2 years now, but till now I have never noticed any lagging what so ever. Same applies for this Ipad and the build quality is again top notch as expected.",
            "Great product, received in good condition and I have been using it since 2 days it’s really a great beast! With its Retina display it appears as u r looking at a printed paper while reading on this tablet. Thanks flipkart for super fast delivery!",
            "Amazing product by Apple. super fast, reliable. Got for good discount in big billion sale. Apple pencil makes the use more convenient",
            "Fast , great size and best at illustration , great product",
            "First apple product. It's a beautiful beast .Mind blowing great deal for 35k . Just go for it no compromise worth it. Don't forget the pencil lol .",
            "Ipad Pro is the beast !!! Throw anything on it and it accepts everything with a charm !!! I am very happy with the purchase !!! A must have for people who would want to have excellent display,powerful processing and multitasking !! Battery back up is also very good !!! Touch is amazing as Apple always make best products !!! Hats off to the sound with 4 brilliant speakers !!! A premium product with delivers maximum satisfaction !!!",
            "Such a promising product for all your basic work ...good to read ... pleasure to watch a movie in night or dark time(due to glare in daytime )... Got it in an offer 36117 thankyou Flipkart... even though the delivery was on time as they mentioned but taking a week is little frustrating as you deliver the 160 rupees book that too from a remote seller in a very next day... packing was worst as I opened and found the box was not pasted or glued properly and my ipad box was dancing inside the bag due to the free space they left... Anyway I got the right product in a right way.. thankyou Flipkart for the heart whelming offers..",
            "Best in category of ipads this is the best decision of my life thank god i didnt went for the budget ipad\nIf you dont own an ipad and are planning to buy one please go for pro series not the 9.7 one\nGet 10.5 or 12.9 64gb is sufficient for hardcore users.",
            "This is a best Tablet you can buy around..With great display, camera , sound and processing power..work like charm with a Apple pencil or Wacom Bamboo tip..",
            "Excellent for professional and personal use. Ecart service also excellent than the competitor for the timely delivery and we can contact the delivery boy through flipkart directly. I ordered another item with the competitor and assured delivery on 14th August 2018 but not delivered or contacted that day and next day.",
            "awesome ipad, little pricy but utility exceeds the price.\ndisplay is awesome\nbattery lasts for day and half to 2 days depending upon the use.\nI feel it's worth the price after all it's APPLE",
            "ipad pro is the best POWER machine i have ever used. Have a very nice camera both front and rear. It has hell of a speed thing in general and in web browsing. Its FAST very very FAST. Crystal clear display. Speakers are best of all ipads till now. And last not least ios11 just rocks this product. Very Happy with Apple , such a great job done for students and proffesionals with ipad pro 10.5 !!!",
            "Awesome delivery by Flipkart and thats too before time. Product is fantastic with super processing speed. It worth single penny spent on this flawless IPAD from Apple.",
            "iPad Pro has been the best investment I made as an artist equipment. I am learning to draw and iPad has been a great help to me. I make vectors and I am loving it.",
            "Bought this at the Big Shopping Days, got a good deal. The product is very good and will definitely recommend buying. The packing was flimsy though and the product was just put inside a flip kart branded bag with absolutely no cushioning. I believe its time the seller go back to their basics and learn to do better packaging.",
            "ordered a rose gold 64gb wifi ipad pro.. awesome product.. awesome deal with flipkart.. delivery was so fast.. only 5days taken to reach in kahalgaon. Ekart handled the product beautifully.. no damage..",
            "FIrst of all while buying apple online I was bit suspicious whether I will get original Apple product or not. because there are many online stores which are selling China made replicas which are difficult to identify. Thanks to Flipkart and seller got 100% original product. I have checked it online as well confirmed it's serial number through apple India customer care. I pad pro is the best I pad till date. I will give 100% for it's performance. Good battery backup. Only problem it takes 3 hours to fully charge. and fast charger is worth RS.9k which is again a big deal. But guys go for it without thinking. Value for money.",
            "Great apple is showing wonder on all time after two weeks of using my iPad Pro I have not seen this much power in a tab 120 HD screen is simply superb\nGreat no words to explain\nA essential product for a gadget lover",
            "Very good product.\nAwesome display.\nValue for money.\n\nI am mainly using for taking notes. It completely made my notes easy.\nReduced to carry all my notebook work load.\n\nMade my reading very easy.\n\nYou should buy Apple Pencil if you like to talk notes\n\nThank you Apple.\nThank you Flipkart",
            "12 hours received my iPad Pro. As of now it is working excellent, super fast and great product.\nThanks to flipkart, delivery of package on promise date and package packing also in well packed.",
            "This is my first tablet. I am very much satisfied from this. Ipadpro 10.5 inch. Looks wise is best i guess.",
            "Thanks Flipkart my dream come true and you people are part of it",
            "Please don't buy apple products from flipkart bcoz I bought an iPad pro on JAN 04 and got an iPad without the IMEI number and they replaced the product with IMEI number and after that when I checked with icare and they told that this ipad was already billed on oct 2017 and it's warranty is till Oct 2018..so pls don't buy high cost products through flipkart and their sellers..they are really cheating their customers..I don't expect from this flipkart..any one need proof about my complaint just ... to me I will provide the necessary details eight eight three eight four six three six five six",
            "Not yet refunded my eligible offer.I registered my complaint 6 days ago but till now no response was taken.I'm really disappointed with your service",
            "most fantastic machine I've ever used.",
            "Cool pad",
            "Got defected display,there was a thick black line of drad pixels after 14 days.disappointed.",
            "Its an amazing product. If you're looking for the very best iPad,then this is what you need! On time delivery, packaging could have been better, overall fantastic experience!",
            "Apple ipad pro 10.5 is flawless and awesome product. It is very smooth and very fast. But I am very upset the product packaging was not very good.",
            "great product value for money... got it for 36000 in a promotional offer Thanks for the God the almighty Jesus for the wonderful gift.",
            "Product is flawless no doubt. Top class tablet in the market. Apple have added serious firepower in it.\n\nBut I had a bad delivery experience. The delivery boy tried to dupe me by giving a package of another person. I don't know what his intentions were, but it was clear that he was trying to rob me. Buyers please beware of such incidents. I urge Flipkart to take action against such practices, otherwise it will forbid me and others to buy expensive electronic items from Flipkart in the future....\nREAD MORE",
            "Gread ipad for medical students...",
            "Got third time mismatch in imei/serial number in invoice from this seller. I want complete refund and not going to buy again.",
            "Had a display pixel issue. Got it replaced with a new one from Apple Care Centre. Ppl do check after buying online, you will get it replaced immediately. Good purchase @35K during Big Billion Sale,,,",
            "the slim beast does the job perfect",
            "no words ... its awesome ....",
            "The BEST companion for all work.. from Studies to Editing to Casual Gaming.. This tab handles everything like a beast..\n\nI'm writing this review after iPad 2019 has launched.. but if ur short on cash and want to get something to get a job done.. go for it. you won't regret this..",
            "Worth every penny..great product!!!!",
            "amazing product !! got it for 43k ...thanks flpkart :)",
            "apple is known for performance,quality, security so this ipad also looks good, performance is amazing &quality is superb.actually i got this at 35k so am i very much happy",
            "It's osm in this ipad gaming is super battery is very good 5hrs30min for pubg gameplay 😁❤️❤️❤️❤️👌",
            "No problem with product or delivery....read lot of negetive review but i no problem in ipad.its supersmooth.",
            "It's a steal deal at 35k including the debit card offer.\nChecked serial no. on the box & in iOS are matching,confirmed warranty through apples coverage which has warranty of complete 1year (some on Flipkart complained that they got 9 months warranty only). The model no. also started from M (other letters have other meaning) and concluded that it is genuine.\n\nThis is my first iPad and I am impressed with the retina display,camera, battery,audio quality & ios (now upgraded to 12.0.1)\n\nonly letdown is the serial no. on the invoice & the iPad aren't matching. But Apple service never asks for a invoice but rely on their data for warranty.",
            "The ipad pro is really cool .packed well and exact delivery .",
            "Received defective product. It has dead pixel on screen.",
            "Love this product",
            "Thank god I just bought this ipad 10.5 for Rs. 38000 on a deal in Flipkart. Its a great device and no compromise in perfomance.",
            "Product was delivered in a whopping 14 hours (probably because the product is housed in Bangalore and I stay in Bangalore). iPad is what it is. Unbelievably fast and has a beautiful display. It's true potential will be unleashed once iOS 11 is released.",
            "Apple iPad Pro 10.5 is very good for daily use & I'm using for designing purpose.\nGaming Handling is Great.\nCamera is good.\nBattery performance is Great.\noverall my Rating is 4.7/5.\n#chaanikya",
            "this is what u call tablet\nno other brands come near to ipad\nbest writing experience very less latency",
            "Got it for 36999,great device for entertainment,speakers are great,best buy!",
            "super product for valuable price\n\nI got this iPad 36000 in offer.",
            "simply It's great...",
            "No doubt this one is the best tablet. After using it more than a year I am writing this review. I am very happy to have this. But if you need for basic use then go for the basic ipad.",
            "best product. i got it for 39800 Super Value for money excellent performance",
            "Excellent. Looking gorgeous. Money worthy",
            "I got the genuine one\n\nIt is very good...no damage nothing.....Flipkart nice job.\n\nIm satisfied with it",
            "Great buy. Got a great deal. Very happy with the performance.",
            "Pros:\n1. Excellent 10.5 inch Screen\n2. Smooth Processing\n3. Good Camera\n4. Awesome Speakers\n\nCons:\nNone",
            "its perfect. no comparsion",
            "The best you can get at 43400.",
            "becoming the the apple user itself a premium feeling...as of now its doing well...however having some difficulties to handle the product as i have never used apple product before. if i want to describe in one word that will be fantabulous. thanx flipkart",
            "Hello to all i dun know why most of the guy reviewing the indiflashmart sellar as a defaulter. I purchased the ipad pro 10.5 and its a brand new no defects no sctrach nothing i saw. Fully packed and everything is good.\nNow about ipad pro. Its nice and light weighted speed touch reaponse everthing is cool even camera is of iphone7 so no doubt about camera. As many of the guys talking about its processor but i feel that its runs as other iphone do... atlast want to conclude that these all are good for movies surfing gaming. Dont expect that it will replace any laptop.",
            "Many people will say many thing..!! But I have only one thing to say..Bro it's an iPad..!!😎",
            "For 36k it's a decent product. But it gets quite warm at the back.",
            "It's a beast.. excellent display with true tone and it's crazily fast.. plays 4k video butterly smooth and high end graphics game plays without any lags. Multitasking with ios11 is such a pleasure. Overall it will replace your laptop for daily purpose.",
            "This iPad is really awesome. It's a complete iPad. It's not going to replace your laptop or pc but in terms of tablet it's the best ever made.",
            "Best one",
            "don't think too much just go for it",
            "i used this apple ipad pro 64gb 10.5 inch. display, sound quality is awesome. I have also used it's ipencil and they pretty awesome as compared to Samsung and other brand. if you want to invest for business purpose or for personal purpose the i suggest you to buy this product.",
            "Fantastic",
            "awesome..... thank you Apple",
            "Nice I like it.",
            "great product. just go for it with closed eyes, if you are looking for a tablet. got it for 35k under Diwali sale.",
            "The Best Ever in Productivity Work.",
            "Camera, display, speakers, performance all are superb i got it 41500. in big shopping days.",
            "Awesome deal ....thank you flipkart.....got it on around 36K during sale..",
            "Awesome genuine apple product at killer price during big billion sale. Thanks Flipkart",
            "The best in the house. The retina display is so spectacular. Watching videos, reading is smooth. Got this for 35k which is worth of 50k and you can't ask for more. Buy it guys. It a beast.",
            "Nice and handy.... perfect partner for medical students..",
            "awesome product🤗",
            "Product is good.Delivered in right time. I have got some problem and misunderstanding with Flipkart,regarding the no costEMI option for my order.Earlier some one in customer service said to me that he would do all the things to sort out the issue.But later on they refused to do so.If I wrongly put the order,they would have been informed me earlier..,because at that time I had the option to cancel the order and put it back again.But they told me sorted that out,and hadnt done that.So I felt that I had been cheated by Flipkart that time.",
            "An excellent product.",
            "awesome experience.\n\npros:\nfluidic screen 120hz & laminated display\nbuild\nApple pencil experience\nspeakers\ntouch id speed\n\ncons:\nOS is walled so experience is not exactly like PC/Mac\nslow charging speed with bundled charger\naccessories are costly in India & poor availability\nDoesn't handle RAW files through third party connectors",
            "For artists - Great for Skteching, but not ok for pro illustration",
            "Worth of money delivered in good condition",
            "Every one knows the reasons to like Apple devices",
            "superb!!",
            "The product is good and safely deliver. But the packaging was not properly done.",
            "->amazing blazing fast\n->120 hz display just osm smooth\n->power full then most of the macs and laptops.\n->battery backup upto 10 hours.\n->sound amazing with 4 speaker .",
            "worth every single penny 👍",
            "Just got what I needed..",
            "item is definitely incredible and safe..BUT too slow to delivery...bad job flipkart",
            "As i expected Apple is the best..",
            "Bought iPad and next day price was 2000 less Flipkart never gave the price lower benefit whereas amazooon always does . Look and buy as Flipkart does not honour its customers . Ipad was brand new and delivery was fast but customer care is like always helpless on price fall benefit",
            "Awesome product...But battery life could be more....",
            "Great",
            "Sad to say but the screen developed a hairline crack for no reason just about a month of use and had to apply for replacement.",
            "Fantastic product.",
            "Thanks a great buy",
            "Great service, fast delivery. Love the product its so ahead in all things i wanted it to do!",
            "Very good packing. Fast shipping. Superb product.",
            "Nice product",
            "In love with My iPad,Gorgeous display, amazing speaker sound, battery life. Got it at reasonable discounted price.\nThank you Flipkart",
            "I did not know that the Apple platform would sell all the apps including Microsoft Word also. I want this for my office usage. After paying the price of 40000 rupees the Apple still expects me to pay for the apps also. That's completely ridiculous. Sue you apple.",
            "A excellent device, built to spoil! IOS 11 makes it usage seamless and the experience amazing.\nI have spent weeks contemplating between surface pro and ipad pro, and finally got the ipad, which suited my needs of an inbetween device. Needless to say, no regrets.\nBut those looking to use it as a laptop, it falls short by a mile and then some more.",
            "Everything is ok, but the picture quality is below my expectations.",
            "I got for 37499 on big billion sale thank you Flipkart",
            "the indoor camera as well as low light camera quality is not good..",
            "The offer price by Flipkart was awesome, the lowest anywhere. As for I Pad Pro 10.5, what to say, the ULTIMATE. Very pleasing shopping experience",
            "iPad pro 10.5 with iOS 11 is jus what a student needs...with split screen feature and picture in picture video playback iPad is as close to replacing a laptop...Only thing it lacks is Microsoft apps which needs a subscription for 10.5 inches but there are few apps which could make for it...",
            "Display is bad. Using it for 10min got eyestrain and headache. I didn't expect this type of display from apple",
            "worst product.after 2 days of purchase they reduced 10000 price.",
            "I had bought this with intention of leaving my laptop but its worthless as far as productivity is concerned. I should have bought Surface Pro instead",
            "I bought this ipad primarily for taking notes. I must say that I don't find it useful at all. In fact I hate using it. So its been a waste of money. I'll tell you why.\nI hate writing on the screen with that lousy apple pen. There is hardly any friction between the pen and the surface for which my handwriting become very bad. I tried putting a matte screen protector but all it does it makes the ipad look old.\nAnother issue I found is the time it takes to charge. In this day and age where fast charging is possible it takes ages to charge. I had to wait more than an hour to charge from 0% to fully charge. The same goes with charging the pen. This tablet not only waste my money but even my time. Hopeless!\nIt's a decent tablet for other purpose, but. The sound is good.",
            "I own iPad pro 10.5 (wifi only) model, Using it since 2 years... And still performs like a beast !!!\n⭐⭐⭐⭐⭐",
            "awesome.......",
            "Great product and it got delivered on time safely.",
            "best in prise 49000",
            "great product from apple\ngreat delivery by flipkart",
            "Good product, Great deal from Flipkart. Delivery service was on time.",
            "I like Flipkart bcoz Flipkart sales by only original products",
            "Great performance....original new product as promised",
            "I am satisfied with my product.And I don’t need for refund",
            "thanks Flipkart for this",
            "This is awesome and delivery is too fast",
            "outstanding display\noutstanding performance\noutstanding sound\nexcellent camera",
            "Write this review after more than 6 months of use. The iPad works great, what I like from this device is the processors speed, the Application that it supports, mostly I connect it as a midi device to play music via geoshred, grade band. There is no lag what so ever, go for it..",
            "Everything is grt... Only drawback is accessories are costly..",
            "wonderful product . a students must have kit",
            "nice product",
            "Very good",
            "Good to use for long time",
            "using past 3 months. as usual apple product. usefull gaget for professional working personal.\n\nworth for money also...\nthank you APPLE for nice product",
            "very good performance",
            "Best Investment ever made by me. Also bought Apple Pencil along with it. Now I make all the notes and other stuff on ipad only. Since I have to read many pdfs and mark it, ipad gives best experience on it.",
            "feeling good",
            "Have been Living together with This Beasty Girlfriend of mine for 4.5 months. Detailed review Coming Soon 😎",
            "close your eyes & Grab this deal!!",
            "Cuz of security i already lost 1100rs...don't forgot your passcode ....",
            "Great Product and delivered on time",
            "a good product .... with amazing value for money",
            "Very satisfied with my purchase.",
            "Nice Product",
            "Best device, but 64 gb memory is not sufficient. Also doesn’t come with fast charger.",
            "I got a great deal... so.... worth the mobey",
            "amazing product. got it at 36700 which is quite a steal for a product this good.",
            "awsome product",
            "satisfied with the product",
            "Worth for money. Got it for 36000rs during Diwali offer.",
            "great deal",
            "excellent product and great deal by flipkart",
            "Okay",
            "all good but front camera not upto mark nd touch sensor little bit unresponsive after 2 month don't know what happened except this ❣️ everything fine.",
            "Apple is Apple rest all are simple Product.",
            "Product is worth of it's price. All features of products are tremendous. Delivery was within given time.",
            "Yes Apple is Apple. go for it",
            "This is a very good product. I got it at a good price during a sale here in Fkart. No regrets buying. The performance is outclass and it's damn loud which is something I like! Overall my first and best Apple product till date.",
            "Great price and order was delievered as promised !! Thanks Flipkart",
            "Excillent",
            "Charging losses very down",
            "gud offer.. just loved it",
            "I have using this for a month now and can say this is the best hands down tablet in the market (everyone knows already). However what people might be confused about that can it replace laptop? i has the same question in my mind before buying this, now I can say combining it with the keyboard accessory is other apple keyboard or logitech along with the pencil(as a mouse) makes it whole package for laptop replacement.\n\nBut it in next sale and you won’t regret.",
            "The iPad Pro 10.5 has a serious issue in its display. A faint illuminated spot appears on the display after using tablet more than 6 months. My device has the same spot above the home button which appears when the display is white. My device is still under warranty. But let me try if they replace it.",
            "no need of computer when u have this",
            "Device is getting slow.",
            "nice product",
            "Superb and just loved it packing was also very nice",
            "amazing device to use , works perfectly",
            "IPAD Pro - ALways buy apple products from Flipkart. 100% genuine",
            "awesome it's value for money",
            "Wow..... amazing.....awesome....",
            "Ingot the iPad for 36k in big billion days & I cant get any tab better than this there is no lag and the display is great as ever........",
            "there was a bump near the apple logo but the flipkart didn't provide any replacement.",
            "*Nice Product\n*Product packaging is good\n*On-time delivery\n*Awesome offer",
            "Best prize of deal",
            "Really worty the price .The speed..the look and feel is best.would recommend to buy apple pencil for more efficiency.",
            "little bit costly if compare to other models . but still a perfect deal according to your needs.",
            "Fantastic product, got on Diwali big sale for low price",
            "loved the device, got in a cheaper price on flipkart, and early delivery, thanks alot!",
            "just fantastic",
            "It's been more than a week now since I bought this, and still the product amaze me...\nMy Apple product and very much satisfied...",
            "Love it!",
            "nice product cost me 37000 at that price it is a worth for your money.",
            "Thought I missed the opportunity in the first instance. But the second sale with the additional discount on Axis card was a life saver. Thanks Flipkart 👍🏻\nThe device is extremely fast. Coupled with the Apple Pencil, it’s a great platform for people from a graphics background.\nThere’s very little negative one can say about an Apple product (other than their stringent compatibility to use third party accessories).",
            "Excellent product. Great service and support by Flipkart.",
            "It’s a great product!",
            "excellent product thought it is 2017 release but it is value for money ..got with huge discounts and again cash back along with apple pencil and airpods as bundled package",
            "Box was not in a good condition. Corners were chipped, spot marks on top of the box.",
            "Good product ! quick delivery",
            "Top class. Everything about this ipad gleams of perfection. World's biggest company for a reason... They deliver the best in the business.",
            "Much better product compared to the usual iPad. Fantastic price during the sale. Steal at the price being sold.",
            "Okay, this product is a beast when comes to performance and endurance.\nNow those who want to dig a bit deep can read rest your purpose is solved with the verdict.\nSo, iPad 10.5 inch housing A10X fusion chip is a powerhouse and for everytask it is ready. Just add a keyboard and equip it with apple pencil it will touch even the laptop (as apple said what’s a computer?)\n\nNot going into pros and cons as there are various other reviews in short go for it if you want a complete powerhouse and a replacement to your daily laptop or PC...!! B",
            "just the best the money can buy. Always buy Flipkart assured products and check the seller ratings before buying",
            "iPad Pro 10.5 simply super, key objective was to utilise the iPad for professional and my research oriented notes, go completely paper less was thoughts, it completely satisfied with my expectations, no doubt it will replace both notebook and laptop, amazing experience for past one week.",
            "The best",
            "Awesome",
            "best ipad available in the Market ............. specially for graphic and designing.",
            "Genuine product",
            "Good geal.. for great product.",
            "Simply. Suuuper.",
            "OK after 15 days of extensive gaming and editing use I can say that this is one heck of a beastly device apple created and I loved flipkart because I Got this in Rs36k with axis bank credit card instant discount. Delivery was done before expect date so thumbs up to flipkart for that. This is 100% genuine device from flipkart with warranty from apple.",
            "Flawless product.",
            "I never thought I can get online",
            "Nice product i like it",
            "Just awesome",
            "Perfect ipad for students, an android phone and an ipad makes a best pair",
            "Very good must buy",
            "best value for money. it's speed, big awesome..",
            "the ipad pro is amazing.works flawlessly.thanku Flipkart",
            "Very Nice Product. Got for good price. Delivery Delayed by one day.....",
            "love it",
            "nice product",
            "Got it for 39000 with additional discount on credit card. Very happy with the purchase.",
            "NO ISSUE IN GETTING A PRODUCT FROM FLIPKART EVEN IN SALE TIME . ITS AUTHENTIC NOT A USED PIECE OR SOMETHING AND M HIGHLY SATISFIED WITH THE PRICE IN WHICH I GOT MY IPAD AND DELIVERY AS WELL.",
            "Excellent product and very quick delivery.",
            "Simply awesome........!!! No one can touch 🍎🍎🍎🍎🍎",
            "Bought it in an awesome deal",
            "Tablet is good. Battery backup is also awesome. Only Camera didn't meet to my expectation.",
            "must have device..",
            "The iPad was good and working but the on and off button is a bit wobbly and the delivery was so late it took 15 days for it to come flipcart can improve its delivery",
            "Amazing experience",
            "Simply the best!",
            "Very good product",
            "best in class",
            "After 4 months of usage, the device freezes at a ratio of 8/24 in 24hrs ratio. Didn’t expect this from apple. Not happy at all.",
            "fast processor, only limited access to external storages",
            "good product and super performance",
            "Excellent product",
            "Excellent",
            "Fabulous!\nGot it for Rs.33734 during the BBD Sale. The Tablet is just awesome. Fluid and Fast.\nHowever Flipkart delivery is very late. Got it after 14 days!!",
            "excellent",
            "don't have WhatsApp for ipad",
            "7 stars for the product....5 stars for the price 40k......0 stars for the delivery.....unusual from flipkart ,,,packing was minimal(edges of ipad box were impacted),product could have been damaged....",
            "Quick delivery by Flipkart . Amazing Product",
            "this ipad pro is a beast..everything is fine except for the packaging...there was a thin layer of bubble wrap only..please upgrade the packing standard for such delicate and expensive tech thing..it could broke during transit with this kind of packaging",
            "content creator must have this productively enhancer. After through research I finally opted it.",
            "nice product",
            "The ipad received is having a charging issue. Contacted apple support and they are asking me to meet a technician today.",
            "Product is good but packing is tempered. Very disappointed with Flipkart.",
            "A must have for every student and with iOS 12 / 11 there is nothing which can stop this beast",
            "Got it for 40k from Flipkart .... Loving it",
            "Thank you for the amazing offer!",
            "A magic Box",
            "Nothing to say about apple\n\nI bought this for 37499 in Flipkart big billion days offers\n\nIt’s far batter than iPad 2018 model at this price\n\nIf you are looking for iPad definitely go for this\n\nIt’s amazing zing zing",
            "ipad tablet is good but not a pencil this Box. and not a Ear phone in the Box performance is good",
            "No complaints. The best tablet out there",
            "perfect purchase and total value for money.device running very smoothly without any hitches.",
            "Best product . Don't know about laptop replacement but surely one for the mobile",
            "BEST IN CLASS..",
            "Excellent product and Best Tablet Ever",
            "No doubt the best tablet in the world...the screen is just mesmerising...camera and sound quality are also awesome....no one can beat apple in tablet platform atleast...blindly go for it if you can spare that amount of money ...you will be proud of your choice..it will show the difference of brand Apple and rest of the world...",
            "good product",
            "Very good",
            "amazing!!!",
            "One of the best ipad in terms performance and display. pen is sold separate should have been a bundled package.\n\nvery costly to buy the protectors for this ipad.",
            "Audio is not apple class",
            "What a display!!! It feels like you are looking at a canvas painting..\nTouch ID is seemless.\nThe design is sleek.\nios 11 interface is just superb.\nYet to explore...",
            "Flipkart delivery was within time. Only they could have packed it better. Such a costly item was poorly and inadequately packed. Regarding ipad I am yet to check it in detail and will update later",
            "it's going to be almost 2 months I bought iPad pro on sale on Flipkart... totally worth it.. m happy...",
            "video bit shaky\notherwise overall good",
            "just one word ... AMAZING!!",
            "First of all i hat damage product again flipkart replacement with another one happy to shopping with flipkart",
            "Speedy delivery . And awesome iPad pro",
            "It's fast, Superfast!!",
            "best one",
            "After 15 days using this iPad and found the screen heating problem when using apple pencil. This is the only one problem i am facing. i don't know whether it is general or really it is a problem. Rest everything is fine. I am really falling in love with the device but pinch my heart when i use pencil and feel the heat under my palm after 5 mins of using. please let me know if anyone having the same issue.",
            "Smart packaging and before time delivery by flipcart. Awesome product.",
            "One of the best thing I could have!",
            "It is awesome.",
            "Mind blowing purchase... in Flipkart billion day thanku",
            "wow, the offer price was totally worth.",
            "It's nice.",
            "The overall performance is good battery backup is also good....packaging is original and best but currier survice is worst",
            "Good one!!",
            "Amazing product.....guys those who going to buy this tab on Flipkart don't forgot to check the serial validity on Apple official site ....\nTalking abt the tab it's really very smooth fast....I got this around 40k on Flipkart sale...thnx to seller for amazing product....but onething I really disappointed that the Flipkart packaging is really bad man...it's a tablet or anything which is very delegated can be broke....hppy with the product but not the Flipkart packaging\nThank you",
            "This should be the best tablet out there..\nworth the money.",
            "Got my ipad pro yesterday\nBest delivery by flipkart a day before commitment\nGenuine product with genuine packing lamination by apple\nGood behavior of courier person\nSuperb packing",
            "Really awesome. Only one drawback - Microsoft office is not free on any apple ipad or rather any pad with screen size greater than 10.1 inches as per Microsoft policy, as far as I could understand from different blogs. So if MS office is a priority, please go for a lesser screen size ipads, like 9.7 inches.",
            "Thank you Flipkart for the amazing sale and I wish Flipkart team to achieve more success in future!",
            "Awesome Product, Loving it",
            "Only once you start using the Machine .. you will understand what a Money worthy purchase it has been even though it's costly.\n\nThank you Flipkart for delivering the item within timeline & on an absolute proper condition moreover in the Jaw dropping Flipkart deal.\n\nMy first Apple product it is & it blows my mind ..",
            "You have to purchase/use one to know the beauty of iPad Pro. Best tablet I have ever used.",
            "Its a wonderful experience to use a pro",
            "I got best product#i like thise seller product#product was very good in condition#",
            "Gud product .....cam super..... ....",
            "the best piece of technology apple has ever made",
            "Product received with good condition. Package delivered as expected",
            "Jaw dropping price at Big Billion days.. Wish I could avail it..",
            "just amazing",
            "Good Buy...",
            "Excellent product .All pros very few cons . I wish it had more ppi. A powerhouse needless to say .",
            "Great tablet",
            "A true leader in its class..an intelligent investment..",
            "nice product",
            "Awesome",
            "Good",
            "Received d item before expected delivery date. Item was in perfect condition. Opened n checked in d delivery hub itself, in front of delivery guys, so that it could b returned on d spot if found any defect.",
            "Delivery is before time and the Delivery executive is superb .Packaging is ok.",
            "Nice product\nFast delivery",
            "Best ipad",
            "Still good\nUpdate: just broke the screen\nmight have got better screen for such a pricey device",
            "The machine is great, but the apple Sim is not available inside as commited",
            "Its apple no need for review about performance.\nFlipkart delivery was fast as its high price order.\nGot it in offer for 46400.\nOverall awesome buy.",
            "The delivery was prompt and efficient. I shall not give the product review as you can find it on YouTube",
            "THE BEST THAT MONEY CAN BUY( tablet wise)",
            "Its apple. Works fine. Buy it.",
            "Very fast and superb sound quality. Listening song is never before experience.",
            "Product is superb genuine and good discount I got of 4k, but delivery was somewhat delayed ,",
            "iPad a word which make me alot 50k made me worth in it's small run\nLove design.\nAppreciate features.\nThrill with 120 hz.\nAnd many more......",
            "Delivery was really fast and the Product was awesome.\nPacking was fully secure even there was no dent on the box. Shoud go for and iPad pro the enhance your tablet experience!",
            "Have been using since a month now and its awesome. Lighting fast and no glitches at all. Flipkart is the best",
            "Excellent delivery service from flipkart!!!",
            "Awesome device. Flipkart delivered it in less than 24 hours in a very less price.Worth buying product.",
            "Seeing the ipad pro, i could just say : 'Oh... What a beauty..'. If u wish to buy, just go for it without givibg it any second thought.\nI was lucky to get it at around 45,500.. All the best.",
            "Excellent product.",
            "Superb.....",
            "Superb product wuld def recomend.",
            "Nice ipad",
            "Nice, Must to have for workholic.",
            "Surface pro is better option if you don't mind lower battery backup.",
            "Amazing",
            "On time delivery...!! Best products ever from Apple",
            "Excellent",
            "Good product & nice delivery.",
            "Wonderful product...has everything in it...thanks to flipkart, delivered earlier than expected date",
            "I'm very happy with the product. Quick delivery by Flipkart.",
            "Awesome product worth buying",
            "good product in every segment",
            "Nice product",
            "excellent",
            "Product delivered before time. Perfect condition. Cheers.",
            "Awesome product. With iOS 11, iPad pro will be on next level.",
            "Awesome product..it is so fast and looks beautiful..great buy..go for it..!!!",
            "Amazing product..",
            "Thanks",
            "Hi, iPad Pro 10.5\" is the world's fastest and best tablet . Thanks Flipkart for discount . It's rare to find discounts on latest Apple iPads .",
            "1.awesome\n2.fabulous\n3.superb\nProduct👍",
            "Buttery smooth and waiting for ios11... Buy Apple pencil for best experience... good tab",
            "Beast",
            "Very good and classy",
            "I got an inferior manufactured device, after nagging for 3 weeks, they finally replaced my ipad, sent me a brand new one.\nRest, ipad is nice",
            "Product received intact and in good condition. I am impressed with the prompt delivery by Flipkart as this product delivered to me within 14 hours.",
            "Nice product. But ultra slow delivery by Flipkart. I hate Flipkart for that"
        ],
        "likes": [
            "381",
            "639",
            "34",
            "41",
            "327",
            "7",
            "6",
            "12",
            "9",
            "12",
            "381",
            "639",
            "34",
            "41",
            "327",
            "7",
            "6",
            "12",
            "9",
            "12",
            "7",
            "5",
            "3",
            "18",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "4",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "78",
            "82",
            "35",
            "28",
            "12",
            "250",
            "88",
            "55",
            "132",
            "65",
            "13",
            "11",
            "4",
            "9",
            "10",
            "4",
            "4",
            "6",
            "11",
            "11",
            "3",
            "3",
            "5",
            "5",
            "4",
            "5",
            "58",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "8",
            "5",
            "3",
            "3",
            "4",
            "15",
            "4",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "3",
            "5",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "12",
            "4",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "2",
            "1",
            "0"
        ],
        "dislikes": [
            "71",
            "181",
            "8",
            "8",
            "74",
            "0",
            "0",
            "2",
            "2",
            "4",
            "71",
            "181",
            "8",
            "8",
            "74",
            "0",
            "0",
            "2",
            "2",
            "4",
            "5",
            "3",
            "1",
            "24",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "11",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "6",
            "18",
            "5",
            "5",
            "1",
            "95",
            "28",
            "17",
            "51",
            "23",
            "2",
            "2",
            "1",
            "2",
            "2",
            "0",
            "0",
            "1",
            "4",
            "5",
            "0",
            "0",
            "1",
            "1",
            "1",
            "2",
            "71",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "6",
            "3",
            "1",
            "2",
            "2",
            "28",
            "4",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "8",
            "3",
            "4",
            "1",
            "2",
            "1",
            "1",
            "63",
            "17",
            "11",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:What is the date of manufacture of this iPad",
            "Q:is finger print lock accesseble on this",
            "Q:Can I play pubg with extreme frame rate in it?",
            "Q:what is the available storage on 64gb ipad pro ?",
            "Q:Is Apple pencil comes with the product? if its a seperate purchase, whats the cost of the pencil. is there any combo offers available?",
            "Q:does the apple pencil work if i use glass protector",
            "Q:Is it a 2017 model or 2018 because it says a a10x chip processor while 2017 model has a9 chip processor?",
            "Q:How is it works for pubg game",
            "Q:Is ipad pro 10.5inch2017 model?",
            "Q:Is it worth to repalce my Ipad pro 9.7 with this one??",
            "Q:what is the battery specification in mah of this product?",
            "Q:Does it come with the apple pencil",
            "Q:Is there any IMEI number in iPad pro wifi?",
            "Q:what is the specification of battery ???",
            "Q:will i get potrait mode for photography in this ipad ?",
            "Q:I usually take lot of notes. I attend seminars, lectures etc. instead of carrying a paper notebook everywhere I would like to go digital with cloud support. Is this device suitable for it?",
            "Q:is cover free with ipad",
            "Q:how to measurements of 10.5 screen ?",
            "Q:can bluej run on this Device????",
            "Q:Does it supports programming like c++,aurdino, etc?",
            "Q:does any class note taking app free of cost in app store?which one ?",
            "Q:does the device heat up after continuous usage, say for a couple of hours?",
            "Q:Can I connect external HDD to ipad pro ?",
            "Q:which colour is best?",
            "Q:does it have headphone jack?",
            "Q:I WANT TO PLAY HIGHE END GAMES WHILE LIVE STREAMING THEM SO WILL THIS BE THE BEST CHOICE?",
            "Q:Has a 5g sim support?",
            "Q:Is there any space for keeping apple pencil in this tab?",
            "Q:Date of production if this unit",
            "Q:WHY DOES IT BEND SO EASILY!! I WATCHED A VIDEO ON YOUTUBE !!!",
            "Q:does it have flash in back camera?",
            "Q:I want to exchange my Samsung Galaxy Tab 3 for apple I Pad Pro. Is it possible?",
            "Q:is there any software download charges?",
            "Q:can i use it for shrare trading and technical analysis purposes?",
            "Q:can i use it for share trading purposes?",
            "Q:Dose it have fast charging....????",
            "Q:It is not support YouTube 1080p ?",
            "Q:What is the manufacture date and factory os version on ipads being shipped as of now?",
            "Q:how much weight do it have.",
            "Q:Is it is the 2017 model? or 2018? if it's 2017 model then when we get the 2018 model on Flipkart?",
            "Q:Is it's the 2018 model?",
            "Q:does it support jio wifi router network?",
            "Q:Jio Fi saller said that I can make call using Jio Fi in iPad pro but you said that I can't so I'm totally confused what to do now?",
            "Q:What u meant by Microsoft Office 365 personal subscription ?",
            "Q:How long will it get security updates and will it be upgraded to OS12?",
            "Q:Is it good IT professionals to do coding like run Ipython Jupyter Notebooks or Anaconda distribution or for running machine learning algorithms? Does it let install third-party packages for python?",
            "Q:Is this 2018 version or 2017 version",
            "Q:Is this contains stylus pen with this product",
            "Q:does it support autocadd software?",
            "Q:Does it have wireless earphon",
            "Q:what is the meaning of autocad?",
            "Q:what is the meaning of face time?",
            "Q:Do we use OTG cable in this device ?",
            "Q:can we connect external memory? like pen drive",
            "Q:can we connect pen drive?",
            "Q:what is the diffrent between laptop and ipad",
            "Q:it support jio?",
            "Q:can i install a 3rd party app to support video calling?",
            "Q:Does it has apple sim?",
            "Q:does it support keyboards? if yes then apart from Apple keyboard any other keyboard is compatible or not?",
            "Q:What is the best pubg mobile graphic setting it can support without lagging?",
            "Q:Is ipad pro browser perform like windows 10 browser of desktop means full view? Is their any kite user except app version to suggest define?",
            "Q:would 64gb be enough space for reading and drawing purpose ?",
            "Q:would 64 gb be enough for drawing and reading purpose ?",
            "Q:can i make calls using my jiofi by downloading the jio voice call app??",
            "Q:can we use sim ?",
            "Q:can we use any other third party pencil or pens ?",
            "Q:can I download adobe acrobat pdf reader ?",
            "Q:My iPad pro charger is getting very hot after charging.. Is this normal or should I change it?",
            "Q:does it support volte fuction?",
            "Q:can it run autocad",
            "Q:Can we expand the storage via otg cables or hard disk??",
            "Q:does it supports voice call?",
            "Q:can i connect this to smart tv for teaching purpose?",
            "Q:Can I use this for programming instead of MacBook air?",
            "Q:Does it come with the pencil?",
            "Q:can we send direct messege using instagram on ipad pro",
            "Q:it has sim tray?",
            "Q:Can we connect jiofi to ipad for making use of internet??",
            "Q:can we do some programs of laptop on ipad pro",
            "Q:does it have FaceID",
            "Q:we get headphone",
            "Q:shall we connect the ipad to printer and projector directly..?",
            "Q:Is apple pen is given free with the ipad?",
            "Q:is it possible to use what's app in this ipad?",
            "Q:does it support coral draw ?",
            "Q:Is it expandable?",
            "Q:How can we use Mobile banking or Net banking without Registerd Sim???",
            "Q:Dose it has a 120Hz display or standard 60Hz display?",
            "Q:can i use Videoscribe on this ipad",
            "Q:does it have face id (face lock) ?",
            "Q:can i use it software like i use it to laptop?",
            "Q:will it get the latest ios update???",
            "Q:Is it a fresh unit or a refurbished one?",
            "Q:can it be connected to hp deskjet printer 2130 series ?",
            "Q:does it is having siri ?",
            "Q:Will we get the pencil too",
            "Q:is it 2017 model",
            "Q:Is this the latest 2017 model as the reviews are for older ones??",
            "Q:how much ram does this i pad have",
            "Q:does it support apple pencil for writing stuff ?",
            "Q:is it supports 4k vdo shooting",
            "Q:how much ram do we get in this ?",
            "Q:Does this tab have playstore",
            "Q:It has support pubg game",
            "Q:how much ram does it have?",
            "Q:does it come with screen recording",
            "Q:this gloing Apple logo ?",
            "Q:Does the Smart Keyboard and Apple Pencil support",
            "Q:can i play pubg",
            "Q:is this upgradable to ios 11..?",
            "Q:Can I play game in ir",
            "Q:Is 64 gb of rom enough for normal usage like photo,movie,videos &games?or 256 gb version would be better?",
            "Q:DOES IT HAVE 4G SIM SLOT OR NOT",
            "Q:what all are included in the box?",
            "Q:Is it support to play songs and downloading??",
            "Q:Does this product comes with a Headset?",
            "Q:can it be used with keyboard or not",
            "Q:can it make calls?",
            "Q:what is the battery rating?",
            "Q:Does the keyboard come along with it?",
            "Q:Is it having magnetic connector?",
            "Q:Can we play cricket games in this tab",
            "Q:Doesn't it come with ios 11?",
            "Q:Can this support micro SD card",
            "Q:Inside the box",
            "Q:Does it supports apple pencil 2nd gen",
            "Q:Does IT support other stylus rubber pens from local companies or only Apple pencil support?",
            "Q:Does it run what's app and telegram on WiFi model",
            "Q:is the product displaced above really 10.5 inches ipad pro with 120 hz refresh rate and 4gb ram one or else is it 9.7 inches with 2gb ram one that you are selling?",
            "Q:what is its battery mah",
            "Q:How to transfer big files without internet from android to iOS?",
            "Q:can we use sim in this handset",
            "Q:in which year it was released??",
            "Q:Is ipad pro 10.5 supporting 3.5mm audio jack/earphone?",
            "Q:Can we use google and will we have google app in it",
            "Q:It rear camera is blur the photo",
            "Q:its support tally accounting software",
            "Q:Does it come with NOTABILITY already installed for writing?",
            "Q:is this usb supported ? like pen drive or anyother ???",
            "Q:can apps like whatsapp instagram, tiktok etc be downloaded in it? and does it has play store for downloading or any other source",
            "Q:is the camera good enough to take clear and beautiful pictures",
            "Q:Is it upgradable to ios12 now?",
            "Q:how much does the apple pencil costs nd can i buy apple pencil and ipad smart keyboard in Flipkart????",
            "Q:can we use watsapp in iPad pro Wi-Fi only model",
            "Q:can we do sort of programming on it? like in c, c++, Java or python?",
            "Q:Can I sketch film storyboard on it",
            "Q:Will i get pencil and keyboard if i purchase this IPad pro?",
            "Q:does it has pre-loaded ms excell in this ipad for free",
            "Q:can we make voice call without internet data like phone????",
            "Q:does it have fingerprint sensor",
            "Q:Is this iPad Waterproof??",
            "Q:is 64 gb rom is sufficient for normal usage?or i should go for 2556 gb model?",
            "Q:Is apple pencil included in the package?",
            "Q:can i play pubg in this ipad",
            "Q:Can we do C++ programming on this device??",
            "Q:How much battery backup",
            "Q:Will it be updated to ios 11?",
            "Q:does it support video calls??",
            "Q:can anyone tell about the box contents ?",
            "Q:does ipad pro 2017 connect to otg pendrives n hard disk other storages",
            "Q:is it have 4k video shooting",
            "Q:in iPad pro 10.5 working ios 13",
            "Q:This or ipad air 2019?",
            "Q:does it support wireless charging",
            "Q:can we get GST invoice with it?",
            "Q:can I call through this ipad",
            "Q:can I connect External ssd...?",
            "Q:did it has 4g internet connectivity",
            "Q:i pad is best or laptop is best",
            "Q:Is it scratchless?",
            "Q:I want to hear online lectures in this device.Is it useful?",
            "Q:it has facelock also",
            "Q:can this adapter be connected to indian electrical sockets directly or do we need any converter extra?",
            "Q:Docs or videos created in an ipad supports in windows laptop or android devices?",
            "Q:is slow mo in ipad",
            "Q:does it has 3d touch available ?",
            "Q:how can i get ipad pro for 35k?",
            "Q:Does it support ios 11 ?? and can we play fortnite on it",
            "Q:Does it allow WhatsApp"
        ],
        "answers": [
            "A:Aug 2018",
            "A:Yes, it works fine. It is 2nd Gen finger print lock.... Very Fast.",
            "A:Yes with HDR",
            "A:6.1 GB is used by system on my iPad out of 64.",
            "A:Apple pencil? You wont even get an earphone along with it. The pencil costs around 7k-7.5k Other than the iPad u get a charging adapter only. But the iPad u will love. It works butter smooth.",
            "A:yes",
            "A:a10x, it's the iPad pro 10.5 2017 model.",
            "A:It's mind-blowing...!!!!!!",
            "A:Yes.",
            "A:It depends. Some points to be considered. Display features. 120 ghz refreshing rate. Blazing fast speed. Most important point is camera. Well this is my 1st ipad& i am loving it.",
            "A:7300mah",
            "A:No. Apple Pencil is a separate purchase.",
            "A:No. Only cellular capable devices will have IMEI",
            "A:The battery is good. In normal use it would not drain as fast as a cellphone do. I use procreate which drains the battery faster. So if you are using some high end apps or camera it will drain faster.",
            "A:Nope, it has a single back camera you will only get traditional potrait mode no bookeh effect or any blur effect",
            "A:U can go completely digital with this device.i prepared 1000 pages of handwriting with this device using Notability app. But Apple Pencil is compulsory.",
            "A:They don't even bundle a fast charger which is by the way a necessity in their box, even with their 1 lakh+ costing phones and you expect them to give a cover hahaha",
            "A:Diagonally from one side to other.",
            "A:No",
            "A:no",
            "A:One note",
            "A:No the device does not heat up on continues usage for more than 4 hrs but make sure the air ports not blocked.",
            "A:no",
            "A:It is a personal choice, the most sold color is space grey.",
            "A:yup",
            "A:yes",
            "A:No",
            "A:no",
            "A:March 2018",
            "A:The 2017 model does not bend. a very good product.",
            "A:yes off course it has flash in rear camera while there is no flash with front camera.",
            "A:Yes. You can go for exchange.",
            "A:Google apps are free , office 365 have subscription plan, Adobe apps also need subscription for full features. Auto Cad subscription is awesome. 2700/year to 3300/year.",
            "A:Yes.",
            "A:Yes you can use it for share trading purposes.",
            "A:No",
            "A:it supports",
            "A:aug 2018 and ios 11",
            "A:Around 500gms. It's comfortable to hold though",
            "A:There is no 2018 model. This ipad 10.5 is a 2017 model. Only the 9.7 has different year model.",
            "A:Nope, 2017",
            "A:yes it support every WiFi network",
            "A:Dear this one is only wifi, for making calls you need to have the wifi+cellular model that costs hefty amount and moreover it's very uncomfortable to call with a 10.5 tab!",
            "A:You have to buy Office annual subscription from Microsoft.",
            "A:Security update and software upgrade are totally depend upon apple service authority. But it is conform that apple provides update to all apple products.",
            "A:Nope, you can’t install anything outside the App Store on the iPad, get a laptop instead.",
            "A:2018 version is not available in size of 10.5. It's 2017 pro model",
            "A:No. It does not have a stylus. You have to purchase it separately.",
            "A:Nope. Only softwares from Apple’s AppStore.",
            "A:No wireless earphone. Normal audio jack is there to connect wired earphone.",
            "A:AutoCAD is a commercial computer-aided design and drafting software application.",
            "A:an app for video calling",
            "A:no",
            "A:No",
            "A:NO, not easily",
            "A:ipad is best for media consumption and browsing the web. It is not even close to what a laptop can do. laptops have more power and run full version programs while ipad run only light weight apps",
            "A:It supports all 4g sim",
            "A:Nope...",
            "A:*does it have Answer is No. It doesn't.. Although there is a similar version available at much higher cost",
            "A:yes it does support some 3rd party keyboards like Logitech keyboard, which in my opinion is a lot better than apple keyboard",
            "A:Not for pubg users",
            "A:you can use chrome browser...pretty much all functions that a desktop version supports. Then there is Safari too. Its all good.",
            "A:No, better go for high amount of space",
            "A:I have chosen for drawing, with respect to reading books and notes taking, yes it will suffice the need, having MacBook Pro in home which will be used for backup yearly address concern of space.",
            "A:No",
            "A:no.",
            "A:no we can't use",
            "A:You can download any app that is available on the App store which includes Adobe Acrobat Reader as well.",
            "A:there is no issue after charging my iPad Pro 10.5 inch. i'm using 2 months ago.",
            "A:if you are using a Reliance JIO sim, you can do VoLTE using JIO 4G app.",
            "A:yes it can",
            "A:No! You have to buy Apple Lighting to USB3 Camera Adapter, to plug your USB devices and all devices are not compatible as well. Go for a Wifi Pendrive.",
            "A:Yes, Face time",
            "A:Yes you have two options - 1) directly via lightning to hdmi adapter(preferred) 2) via airplay screen mirroring if you have apple TV and fast Wi-Fi router",
            "A:yes",
            "A:Nope ! u have 2 buy pencil separately & it works fine wid all ipad PRO 😎",
            "A:yes",
            "A:No.",
            "A:Yes!",
            "A:No",
            "A:No",
            "A:No, you have to purchase it separately.",
            "A:You'll need lighting to hdmi connector.",
            "A:no.. has to be separately purchased for approx 7000 Rs.",
            "A:No. Only cellular version supports WhatsApp. However, you can get WhatsApp from 3rd party apps such as tutu app on WiFi only model.",
            "A:No",
            "A:no",
            "A:You Can't",
            "A:Yes it has 120Hz display",
            "A:You can download VideScribe Anywhere from Apple Store which is around Rs. 75, but it is not as good as VideoScribe PC/Mac version and has very limited functions.",
            "A:No",
            "A:It depends upon what type of work u do. For programming and other things answer is no but for mail browsing little editing typing taking notes making ppt one can use iPad.",
            "A:yes it does. every os update will be available OTA",
            "A:I got brand new piece",
            "A:through bluetooth yes",
            "A:Yes it does.",
            "A:No pencil we have to buy saprately",
            "A:yes. but it is upgraded to ios 12",
            "A:yes this is best and latest apple ipad PRO till date 11/10/2018",
            "A:4gb",
            "A:Yep, pencil works flawlessly !!",
            "A:Yes",
            "A:4gb",
            "A:This is iOS based system...u get iTunes..and APPLE appstore...(and not Google playstore)...to further clarify, u need Apple ID and not Google ID...",
            "A:Yes sir. I okay every 3 hours.",
            "A:4GB.",
            "A:Yes it does.",
            "A:No... it's not",
            "A:yes ofcourse both are made for iPad pro only",
            "A:yeah u can play pubg but it's taken 2.3gb ram",
            "A:yes",
            "A:Yes, but if you want to play mainly games than any older and cheaper version will be enough. This one is for professional work and for entertainment.",
            "A:For pictures, videos, online movies & games, 64 GB is enough. But if you want to store movies and some other high space consuming data then you can go for 256 GB",
            "A:Not this one but Wifi+4G Model does.",
            "A:IPad + cable + charging plug + manual",
            "A:You can downloads songs to Apple Music app only via iTunes but you can use third party apps like Wynk, Gaana, Hungama, etc and download songs into those apps.",
            "A:No",
            "A:apple keyboard is the best. other btooth keyboards are available. the logitech one doesnt come for the 10.5 yet",
            "A:No",
            "A:5/5",
            "A:No",
            "A:yup",
            "A:Yes, if its available on app store.",
            "A:No, but you can update to it immediately, without any trouble at all.",
            "A:No",
            "A:ipad",
            "A:No. 2nd gen apple pencil is compatible only with the new 2018 ipad pros. It supports 1st gen apple pencil which works flawlessly.",
            "A:yes other stylus works but only as a finger touch you don't have access of pressure sensitivity and sometimes it's confuses with gestures, for example double touch undos in procreate",
            "A:It runs telegram but whatsapp not available fo ipads whether it is cellular or wifi but you can use it by whatsapp web on Google Chrome.",
            "A:I purchased 10.5 64 GB I pad pro at good price. packing was nice and deliverd at right time. there is no demerit in this product and it's delivery.",
            "A:The battery backup is very good n goods are genuine thanks flipkart.",
            "A:we can transfer by Shareit. otherwise there is no other way to transfer from android to iOS",
            "A:No, it's a Wi-Fi model",
            "A:2017",
            "A:Yes it does",
            "A:Yes.",
            "A:no",
            "A:No.",
            "A:No. Notability is a paid third party app. You have to download it from App Store.",
            "A:look for SanDisk Pendrive for ios, wifi option and insert option available in market",
            "A:it can be downloaded from apply store with out any issues",
            "A:yes awesome camera",
            "A:Yes it did update to iOS 12 .",
            "A:simply search on flipkart",
            "A:Yes, you can but it’s of no use. Better use the what’s app on mobile",
            "A:Use a online complier.",
            "A:yes you can",
            "A:no you will have to buy both seprertly.",
            "A:No it don't have an inbuilt Excel.",
            "A:no we can't make call",
            "A:Yes",
            "A:No Not at all , but you can use some nice cover to , make some water resistance, but still you cant say it water proof.",
            "A:Better if you go for higher storage, but there is not end to it. If you buy 256 GB, you will be able to load numerous movies and music files, 3/4th of them will be \"I will watch later/listen\" category",
            "A:No its not included in the Package.",
            "A:yes",
            "A:NOpe",
            "A:Good battery backup",
            "A:yes it will; i am already using ios11 with it",
            "A:no",
            "A:Ipad Pro 10.5 (Ofcourse) wrapped in plastic covering, 12W Adapter, USB to Lightning Cable, Welcome Guide, Warranty Information, and some show off material ( Apple Stickers )",
            "A:no. you will have to connect the charging cable provided with the ipad to another adapter to be able to connect pen drives and hard discs.",
            "A:No... full hd video recording is available..",
            "A:Yes its working on ios 13.2 which is great,and the product is awesome..",
            "A:Its ipad pro10.5",
            "A:No",
            "A:Yes we get GST invoice with it.",
            "A:No... it’s wifi only .. SIM card not supported",
            "A:Yes!",
            "A:Only through wifi. No SIM connectivity.",
            "A:they both are needed , for separate applications,,",
            "A:Yes, its Scratch-resistant glass with oleophobic coating.",
            "A:Yes",
            "A:no",
            "A:It is indian electrical sockets adapter. No converter needed.",
            "A:Yes.",
            "A:yes it is there slo-mo, time lapse",
            "A:NO",
            "A:you have to wait for the big sale and the offer on debit card... thats the only way",
            "A:yes",
            "A:no"
        ],
        "likes": [
            "10",
            "181",
            "19",
            "10",
            "19",
            "6",
            "6",
            "11",
            "6",
            "127",
            "7",
            "20",
            "0",
            "23",
            "36",
            "11",
            "12",
            "2",
            "2",
            "2",
            "4",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "5",
            "3",
            "0",
            "4",
            "2",
            "6",
            "3",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "197",
            "13",
            "334",
            "36",
            "5",
            "10",
            "8",
            "7",
            "7",
            "11",
            "0",
            "205",
            "21",
            "3",
            "1",
            "31",
            "4",
            "16",
            "0",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "5",
            "4",
            "9",
            "50",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "4",
            "6",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0"
        ],
        "dislikes": [
            "0",
            "53",
            "3",
            "1",
            "3",
            "0",
            "0",
            "2",
            "1",
            "108",
            "2",
            "13",
            "0",
            "16",
            "33",
            "7",
            "9",
            "0",
            "0",
            "0",
            "2",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "7",
            "3",
            "1",
            "8",
            "3",
            "17",
            "8",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "3",
            "4",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "36",
            "1",
            "119",
            "9",
            "2",
            "1",
            "1",
            "1",
            "1",
            "3",
            "0",
            "153",
            "10",
            "0",
            "1",
            "27",
            "1",
            "14",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "3",
            "12",
            "113",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "5",
            "10",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "7",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1"
        ]
    }
}