{
    "title": "Lenovo Tab3 7 Essential 1 GB RAM 8 GB ROM 7 inch with Wi-Fi Only Tablet (Black)",
    "product_specification": {
        "Model Number": "TB3-710F",
        "Model Name": "Tab3 7 Essential",
        "Color": "Black",
        "Connectivity": "Wi-Fi Only",
        "OS": "Android",
        "Operating System Version": "5.0 (Lollipop), Upgradable to v6 (Marshmallow)",
        "RAM": "1 GB",
        "Voice Call": "No",
        "Video Call": "Yes",
        "Processor Type": "MediaTek Quad Core",
        "Additional Features": "Usage Time: Upto 10 hrs, Receive 1-OTA Update for Android 6x Marshmallow, Software: McAfee Security, Applications: SHAREit, SYNCit, Dolby Audio, Built-in GPS",
        "Display Size": "17.78 cm (7 inch)",
        "Sales Package": "Tablet, Adapter, USB Cable, Warranty Card",
        "Display Resolution": "1024 x 600 pixels",
        "Primary Camera": "2 Megapixels",
        "Internal Storage": "8 GB",
        "Processor Speed": "1.3 GHz",
        "USP": "Android v5 OS, 2 MP Primary Camera, 7 inch Touchscreen, 1.3 GHz Quad Core Processor, Wi-Fi Enabled",
        "Sensors": "G-Sensor",
        "Sim Type": "No Sim",
        "ROM": "8 GB",
        "Battery Capacity": "3450 mAh",
        "Battery Type": "Lithium - Ion",
        "Internet Browsing Time": "6 hrs",
        "Play Time": "7.5 hrs (Video Playback)",
        "E-mail": "Yes",
        "Secondary Camera": "0.3 Megapixels",
        "Other Camera Features": "Secondary Camera: Selfies, Video Chatting",
        "Bluetooth Version": "4",
        "USB": "USB",
        "Browser": "Android",
        "Other Display Features": "WXGA IPS Display",
        "Video Playback": "Yes",
        "Audio Formats Supported": "MP3",
        "GPS Support": "Yes",
        "Map Support": "Google Maps",
        "Expandable Storage Capacity": "64 GB",
        "Memory Card Slot Type": "microSD",
        "Memory Card Support": "Yes",
        "Warranty": "12 months",
        "Warranty Summary": "1 Year on Product & 6 Months on Accessories",
        "Warranty Period": "12 months"
    },
    "product_description": {
        "Engaging Audiovisual Experience": "Enjoy videos and images to the fullest on the 17.78 cm (7) IPS display. Every sound will be crystal clear and free of distortion, thanks to the Dolby Audio enhancement technology.",
        "Performance That's Packed with Power": "A 1.3 GHz MediaTek quad-core processor and 1 GB of RAM make every task smooth and fast. The Android 5.1 operating system offers a seamless and safe user experience.",
        "Two Cameras": "Use the 0.3 MP Visio front camera while video calling on Skype or Whatsapp. Capture beautiful photos and videos with the 2 MP rear camera.",
        "A Tab You Can Bank Upon": "When fully charged, the 3450 mAh battery offers up to 10 hours of binge-watching, gaming or browsing on the Internet. Find nearby hospitals, restaurants or other landmarks with the built-in satellite GPS."
    },
    "reviews": {
        "ratings": [
            "4",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "3",
            "2",
            "4",
            "4",
            "5",
            "4",
            "4",
            "3",
            "5",
            "4",
            "4",
            "3",
            "4",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "3",
            "4",
            "5",
            "4",
            "2",
            "5",
            "5",
            "4",
            "1",
            "1",
            "1",
            "5",
            "4",
            "5",
            "4",
            "5",
            "1",
            "4",
            "5",
            "4",
            "1",
            "5",
            "5",
            "3",
            "2",
            "4",
            "3",
            "4",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "2",
            "3",
            "3",
            "4",
            "4",
            "5",
            "4",
            "3",
            "3",
            "5",
            "4",
            "5",
            "5",
            "1",
            "2",
            "5",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "3",
            "5",
            "5",
            "1",
            "4",
            "5",
            "1",
            "2",
            "4",
            "1",
            "3",
            "5",
            "5",
            "1",
            "4",
            "5",
            "4",
            "2",
            "4",
            "5",
            "5",
            "1",
            "3",
            "5",
            "1",
            "3",
            "5",
            "1",
            "1",
            "5",
            "5",
            "1",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "1",
            "4",
            "1",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "1",
            "3",
            "5",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "1",
            "1",
            "4",
            "5",
            "3",
            "4",
            "1",
            "2",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "4",
            "4",
            "1",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "1",
            "5",
            "2",
            "4",
            "5",
            "5",
            "1",
            "4",
            "1",
            "4",
            "4",
            "5",
            "4",
            "3",
            "3",
            "4",
            "5",
            "4",
            "5",
            "2",
            "5",
            "4",
            "4",
            "4",
            "5",
            "3",
            "5",
            "3",
            "3",
            "3",
            "4",
            "1",
            "5",
            "5",
            "5",
            "1",
            "1",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "1",
            "5",
            "4",
            "1",
            "4",
            "5",
            "4",
            "5",
            "5",
            "2",
            "1",
            "1",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "3",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "4",
            "4",
            "3",
            "2",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "2",
            "3",
            "5",
            "1",
            "4",
            "5",
            "4",
            "4",
            "2",
            "1",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "1",
            "5",
            "3",
            "5",
            "4",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "3",
            "4",
            "4",
            "3",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "2",
            "3",
            "3",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "1",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "3",
            "5",
            "5",
            "3",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "4",
            "4",
            "3",
            "4",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "3",
            "3",
            "5",
            "5",
            "3",
            "5",
            "4",
            "3",
            "4",
            "4",
            "2",
            "4",
            "4",
            "4",
            "1",
            "5",
            "5",
            "5",
            "3",
            "5",
            "3",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "4",
            "5",
            "3",
            "2",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "3",
            "4",
            "1",
            "5",
            "5",
            "1",
            "1",
            "4",
            "4",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "4",
            "2",
            "3",
            "1",
            "1",
            "5",
            "4",
            "1",
            "4",
            "5",
            "5",
            "1",
            "4",
            "3",
            "1",
            "5",
            "5",
            "4",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "2",
            "4",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "3",
            "4",
            "4",
            "4",
            "4",
            "5",
            "3",
            "5",
            "3",
            "4",
            "3",
            "4",
            "5",
            "5",
            "3",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "3",
            "5",
            "4",
            "4",
            "1",
            "4",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "2",
            "1",
            "1",
            "1",
            "5",
            "1",
            "1",
            "1",
            "5",
            "1",
            "3",
            "1",
            "1",
            "5",
            "5",
            "1",
            "5",
            "1",
            "5",
            "1",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "3",
            "5",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "5",
            "1",
            "3",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "2",
            "1",
            "1",
            "3",
            "4",
            "3",
            "2",
            "5",
            "1",
            "1",
            "5",
            "4",
            "1"
        ],
        "review": [
            "Shared my initial review below.\n\nPros:\n\n1. With the provided RAM and processor, it is fast. The applications, games, songs and videos are loading smooth\n2. Pure android, so new bloat wares! This is really good for the given configuration.\n3. As this tablet is meant for kid, it has an option as to when to start and when to shut down in the Settings. So you can habituate your kid to use only for stipulated time only\n4. Screen is decent. You should not expect high resolution as it is only 1024 X 600. So the screen is good when viewed from half a feet distance\n5. Battery stays for a long also charging takes a max of 3 hours to fully charge the 3450mAh battery. I have ASUS turbo charger for my phone. I tried that as well and the charging takes 2 hours to fully charge\n6. No heating when playing games, watching video, playing music in full volume which is big plus!\n\nCons:\n\n1. Screen is not sharp. It’s smudgy because of the resolution and ppi. Its only 1024 X 600 with 179ppi\n2. Expected the \"Restart\" button to restart the tablet, rather it shuts down. With repeated attempts, I confirmed this\n3. Touch sensitivity is a bit lagging. Tried to close the Chrome browser tab and it was unresponsive\n4. Swiping (from right to left) and closing the Google Now cards takes a bit of time. Not that fluidic\n5. Reading photos from SD card takes more time. I mounted one of my 2GB cards and was trying to open a picture, it was slow a bit\n6. Booting the tablet takes nearly a minute.\n7. Marshmallow update is not there for this tablet as opposed to the spec given in the Spec sheet.\n8. Accessories like cases / covers are very expensive in the web stores. There is no appropriate cases available yet. And the same goes with Tempered Glass. So it’s up to you to handle it carefully\n\nConclusion\n\n1. I initially though thru Micromax P680, iBall, Swipe, Lenovo Tab2 series and all and finally purchased this.\n2. If you are gifting this to your kid, I would strongly recommend this as for 5000/- the tablet serves its purpose diligently. Can't expect more from this device.\n\nI am happy with the Prompt FlipKart delivery. Ordered on Friday and got it delivered yesterday!",
            "Why can't I have a peace of mind while buying product from Flipkart? Why it's becoming a fact that whenever any electronic Item (specially mobile devices) is bought online from Flipkart is turned to be somehow faulty? Do you source from some special vendor who always supply faulty product?\n\nLast time I bought a Micromax product and within 3 months it started having issue, ultimately after 1 year 2 months time, I had to throw out that phone. This time I bought a Lenovo Tab3 7 inch.\n#1. The charger, is not working since, I have opened it, the charger did not work once at least. Thanks god, I had a old charger fro which I can charge the device to use it.\n#2. While Talking in phone mode using that Tab, voice reach very low on the other end. So on this end. Even with highest volume.\n\nSince, it was a gift to my nephew on his excellent result in his exam, I am in no state to take that out from him and return that to Flipkart. Why do I always need to take the product to a service center even if it's a new one? WHY?\n\nBe very cautious before buying it on Flipkart. Don't know about others.",
            "I'm write review after using 5 month experience. This tab performance is really good nd their is no issue of lagging when ever you play high graphics games or using whole day like watching movies, listening songs etc. I'm buy this tab for e-learning and I realize lenovo doing a good on it. All the things are much much better than others so I'll give 5 star. Thanx flipkart",
            "Thanks flipkart. I received my tablet within the day mentioned. I'm extremely satisfied with it. No issues. No lags. It's android 5.0, not bulky. Feels light. No bloatwares pre-installed except 2 lenovo apps. Camera isn't that great, you can't expect anything more at this price point. Only 8GB internal storage, out of that you get only roughly around 3GB for apps. Android is not upgradeable, eventhough i won't update it because upgrading new version causes tablet to lag after that. Newer versions android 5.1 onwards need minimum 1.5GB RAM for smooth performance. Display isn't bad. Bright and vivid. But only problem when you change it to landscape mode, it shows pixelation due to low dpi. Battery is great, gives me 6 hours of screen on time till 50%. For complete discharge gives 9 hours of screen on time, which is exceptional with wifi on. Speakers aren't that loud. Internal DAC is not that good. Got it's MAC vendor is motorola, expecting it is made by motorola parts. LOL.. !! Overall i love it and recommend this lenovo tablet.",
            "Great tab, for this value its worth. Battery back up is good, good sound quality, picture quality is good, camera is good compare to another one. I really like the product",
            "After 1day use= flipkrt is soo good, this tab is best for reading books, in other section like browsing watching movie camera games u will b disappointed eventually..it serves my reading purpose well so i'm enjoying the tab",
            "dis tab is just awesome for its performance according to its price.its 3g wifi is great.it has fast & good net browsing with good display resolution.Good speed ...good software......",
            "The smart blue margin around the ebony black body looks very nice, light and thin as well. Touch screen working pretty good without a guard. The picture quality with the main back camera is quite decent in natural light, I don't bother with the front camera that much. The tab has the good feel of a good make (Lenovo) so don't bother to go for the cheaper ones which promise you this config at 2K-3K. Your money will go down the drain. This is a very fair price to pay for this config. This is not meant for heavy use, as the 3450 mAH battery needs charging after continuous use of about 3 hours. The 1 GB RAM and processor takes care of all normal needs from the internet like banking, e-shopping, mailing, site surfing, social networking etc. My 8 year daughter is very happy with the looks and also her purpose of downloading and playing games from the internet and sometimes listening to You Tube is more than fulfilled. You can go for the 16GB, 4G model with a larger battery if you need it. Very satisfied with the Lenovo tab.",
            "Fake descriptions no update available no Dolby Atmos sound effects touch little hard\nbattery backup was good display clarity good but light leaks noticed in black screen good sound clarity . value for money\n. Just ok",
            "Tablet I loved it\nBut it need some more improvement for this price ok\n\nOnly for browsing and watching movies simply awesome .\n\nSupporting OTG good\n\nAudio clarity superb as expected\n\nIts ok ok tab",
            "Shared my initial review below.\n\nPros:\n\n1. With the provided RAM and processor, it is fast. The applications, games, songs and videos are loading smooth\n2. Pure android, so new bloat wares! This is really good for the given configuration.\n3. As this tablet is meant for kid, it has an option as to when to start and when to shut down in the Settings. So you can habituate your kid to use only for stipulated time only\n4. Screen is decent. You should not expect high resolution as it is only 1024 X 600. So the screen is good when viewed from half a feet distance\n5. Battery stays for a long also charging takes a max of 3 hours to fully charge the 3450mAh battery. I have ASUS turbo charger for my phone. I tried that as well and the charging takes 2 hours to fully charge\n6. No heating when playing games, watching video, playing music in full volume which is big plus!\n\nCons:\n\n1. Screen is not sharp. It’s smudgy because of the resolution and ppi. Its only 1024 X 600 with 179ppi\n2. Expected the \"Restart\" button to restart the tablet, rather it shuts down. With repeated attempts, I confirmed this\n3. Touch sensitivity is a bit lagging. Tried to close the Chrome browser tab and it was unresponsive\n4. Swiping (from right to left) and closing the Google Now cards takes a bit of time. Not that fluidic\n5. Reading photos from SD card takes more time. I mounted one of my 2GB cards and was trying to open a picture, it was slow a bit\n6. Booting the tablet takes nearly a minute.\n7. Marshmallow update is not there for this tablet as opposed to the spec given in the Spec sheet.\n8. Accessories like cases / covers are very expensive in the web stores. There is no appropriate cases available yet. And the same goes with Tempered Glass. So it’s up to you to handle it carefully\n\nConclusion\n\n1. I initially though thru Micromax P680, iBall, Swipe, Lenovo Tab2 series and all and finally purchased this.\n2. If you are gifting this to your kid, I would strongly recommend this as for 5000/- the tablet serves its purpose diligently. Can't expect more from this device.\n\nI am happy with the Prompt FlipKart delivery. Ordered on Friday and got it delivered yesterday!",
            "Why can't I have a peace of mind while buying product from Flipkart? Why it's becoming a fact that whenever any electronic Item (specially mobile devices) is bought online from Flipkart is turned to be somehow faulty? Do you source from some special vendor who always supply faulty product?\n\nLast time I bought a Micromax product and within 3 months it started having issue, ultimately after 1 year 2 months time, I had to throw out that phone. This time I bought a Lenovo Tab3 7 inch.\n#1. The charger, is not working since, I have opened it, the charger did not work once at least. Thanks god, I had a old charger fro which I can charge the device to use it.\n#2. While Talking in phone mode using that Tab, voice reach very low on the other end. So on this end. Even with highest volume.\n\nSince, it was a gift to my nephew on his excellent result in his exam, I am in no state to take that out from him and return that to Flipkart. Why do I always need to take the product to a service center even if it's a new one? WHY?\n\nBe very cautious before buying it on Flipkart. Don't know about others.",
            "I'm write review after using 5 month experience. This tab performance is really good nd their is no issue of lagging when ever you play high graphics games or using whole day like watching movies, listening songs etc. I'm buy this tab for e-learning and I realize lenovo doing a good on it. All the things are much much better than others so I'll give 5 star. Thanx flipkart",
            "Thanks flipkart. I received my tablet within the day mentioned. I'm extremely satisfied with it. No issues. No lags. It's android 5.0, not bulky. Feels light. No bloatwares pre-installed except 2 lenovo apps. Camera isn't that great, you can't expect anything more at this price point. Only 8GB internal storage, out of that you get only roughly around 3GB for apps. Android is not upgradeable, eventhough i won't update it because upgrading new version causes tablet to lag after that. Newer versions android 5.1 onwards need minimum 1.5GB RAM for smooth performance. Display isn't bad. Bright and vivid. But only problem when you change it to landscape mode, it shows pixelation due to low dpi. Battery is great, gives me 6 hours of screen on time till 50%. For complete discharge gives 9 hours of screen on time, which is exceptional with wifi on. Speakers aren't that loud. Internal DAC is not that good. Got it's MAC vendor is motorola, expecting it is made by motorola parts. LOL.. !! Overall i love it and recommend this lenovo tablet.",
            "Great tab, for this value its worth. Battery back up is good, good sound quality, picture quality is good, camera is good compare to another one. I really like the product",
            "After 1day use= flipkrt is soo good, this tab is best for reading books, in other section like browsing watching movie camera games u will b disappointed eventually..it serves my reading purpose well so i'm enjoying the tab",
            "dis tab is just awesome for its performance according to its price.its 3g wifi is great.it has fast & good net browsing with good display resolution.Good speed ...good software......",
            "The smart blue margin around the ebony black body looks very nice, light and thin as well. Touch screen working pretty good without a guard. The picture quality with the main back camera is quite decent in natural light, I don't bother with the front camera that much. The tab has the good feel of a good make (Lenovo) so don't bother to go for the cheaper ones which promise you this config at 2K-3K. Your money will go down the drain. This is a very fair price to pay for this config. This is not meant for heavy use, as the 3450 mAH battery needs charging after continuous use of about 3 hours. The 1 GB RAM and processor takes care of all normal needs from the internet like banking, e-shopping, mailing, site surfing, social networking etc. My 8 year daughter is very happy with the looks and also her purpose of downloading and playing games from the internet and sometimes listening to You Tube is more than fulfilled. You can go for the 16GB, 4G model with a larger battery if you need it. Very satisfied with the Lenovo tab.",
            "Fake descriptions no update available no Dolby Atmos sound effects touch little hard\nbattery backup was good display clarity good but light leaks noticed in black screen good sound clarity . value for money\n. Just ok",
            "Tablet I loved it\nBut it need some more improvement for this price ok\n\nOnly for browsing and watching movies simply awesome .\n\nSupporting OTG good\n\nAudio clarity superb as expected\n\nIts ok ok tab",
            "OK Fine Now Guys Writing this review after 11months of tab use so I will\ndivide my review in pros and con's:-\nPROS:-\n1.Even though the ram provided is less the tab doesn't hang up.\n2. Battery life is a bit good as compared to other tablets in this range.\n3. Display quality is good but would have been better.\n4. As there is no sim slot the in built Wi-Fi is of top notch quality even catches low range Wi-Fi without any problem.\n5. Speaker quality is just awesome, and the volume can go really high.\nCon's:-\n1. Difficulty in getting the accessories for tab as the one available in the Indian market is very very costly, so I ordered the back cover and tempered glass from aliexpress.\n2. Flipkart claims that the tab will receive marshmallow update but it is not.\n3. The android version on the tab is very unstable, doesn't have file manager out of the box, the lenovo UI just sucks on the tab.\n4. Camera quality is very cheap, even considering the price range there are other Chinese tab manufactures that give better camera quality at the same price range.\n5. Lots of time the chrome browser becomes non response, the open tabs in the browser doesn't close.\n6. Problem with external memory card, always you have to grant the permission for external memory card, and while downloading on utorrent or any other client when you choose directory as external SD card the torrent file downloading shows error.\n7. Many apps on Google play store are not supported on tab such as WhatsApp,etc.\n8. When we change our wallpaper using any photo or the apps the wallpaper switches to the custom wallpaper within few seconds.\n9. Sometimes due to heavy usage the tab shut down on its own and enters boot mode and switches on after 5mins.\n10. When we connect the tab to the computer via USB cable it just shows the SD card and do not show the internal memory on PC.\n11. Out of 8GB we get only 4.9GB and this is not sufficient as after updating apps from play store almost 1.5GB is used up and also installing the few important apps such as file manager which doors not come preloaded and few other you are usually left with 2.5GB and that is not sufficient for downloading a movie of 1080p or installing a game.\n12. Guys never try to run a 1080p movie because no use the screen quality is just 1280×600.\n13. The touch pad is not scratch resistance and will get scratches very fast even using it lightly so screen guard and tempered glass is necessary.\n\n\nThere are many more cons but the review will become too big. So guys buying this device today will be just wasting our money, this device is just good for reading books.\nAs flipkart is giving huge discounts in the tab I feel that no one should purchase this tab in late 2017 where there are many other brands which give better quality than this lenovo tab. I GOT THIS DEVICE FOR 4,799.\n\n\nTHANK YOU.",
            "yes I know this is not a very good tablet for everyday use in a manner of ease but its a fantastic tablet for teenagers or youngsters for playing game and surfing internet and doing multitasking also in a good budget that pocket friendly. Matte finished back panel that helps you to drop the device very often, sleek design with dolby digital sound(in headphone or speaker). But one thing the screen resolution and ppi is not impressive. After all this device is fine to use and yes the Ekart delivery is 5star... its delivered my tablet within two days!",
            "I was expecting a good product from Lenovo but they somewhat disappointed me when i received the product. The tablet is build with a cheap quality plastic and they didn't even provide me a screen protector with it. Anyway, These things weren't a big for me but the battery life was. It wasn't not giving me a stand by time more than 5 hours. The processor starts giving hiccups when you try to install Google Launcher on it. Speak quality wasn't good aswell.\n\nI had a word with Flipkart about it and they refunded me back the money, I might wait for a good tablet now.\n\nPS: It's a okay tablet if you don't want to play games, Facebook, Twitter.",
            "Mind blowing tab in this price. HD videos look excellent. Display is great in 170 ppi. I have not found even a single defect. Everything is working perfectly. I m using the hotspot of jio SIM.\nPreviously, many apps were not working.Then, I realised I have put the jio SIM in the second slot of my mobile. After putting the jio SIM in first SIM slot of my mobile, all the apps and sites started opening. Flipkart has sent the perfect tab with speed Post.",
            "4/5\n\n\nCons:\nTouch is not that great.. lagging & sometimes don't even responding.. 3/5\nDisplay quality poor.. very low ppi 179.. 3.5/5 ( you can only play 720p videos in YouTube 1080p option not available )\nPoor camera quality.. 1/5\nNo marshmallow update\nOnly 2G/3G no 4G support\nLow stroage 8GB out of only less then 5GB available\n\n\nPros:\nBattery is good... 4/5\nPerformance.. 4/5\nRam management.. 4/5\nGraphic.. 4/5\n\n\nIt's worth of 4999 only.. Not worth of 6999+\n\nI got this in 4999 so I am ok with it :)",
            "Its good value for money.. I wanted some handy device through which i can watch some casual movies Jio tv hotstar youtube etc .. It really perform s well in media consumption. You can also read ebooks with ease of 7 inch screen. Clash of clan works like a charm on this screen size. Speed is good with 1 gb ram for aforesaid daily uses. Dont expect to run asphalt 8 as internel is only around 4 gb u will get. Camera is of worst quality, but who take pics with tab. Really good for media streeming over wifi.. Best budget rab with real brand quality. Just awesome in comparison with those Chinese tabs like penta swipe even micromax also. Im really satisfied.",
            "Great deal for 5k..! However it do have same pros and cons\nPros:\nNice display nice touch\nWhen the tablet is idle it hardly loses 2 percent even in an entire day\nCons:\nCamera average however not a great deal\nBattery takes a huge time 5hrs to get fully charged\nBuilt quality is cheap\nMarshmallow would have been nice to include in.!!!",
            "More than a months Search ends here..This tab has a good screen resolution, good sound, good responsive touch but the problem is that Flipkart sell this product on MRP.",
            "It's a decent tablet which works flawlessly battery backup is avarage display is fine\nOver all best value for money",
            "It's an excellent product .loved it to the core .But the only thing is that the camera quality could have been more enhanced so that photo could be clicked and directly sent to the people (not worried about the front cam but the back). It works excellent in hot sun too that it provided more brightness and provide a clear image of the screen.\nSo ,finally..it is an excellent product from flipcart with very good packing.",
            "Good product at this price... Touch is not too good though... Bt battery back up is excellent... It's a calling tab which makes it more useful... I'm happy with the product...",
            "I like the product . It is a good product . I like the design . The functions are very good . It is the best deal .",
            "Nice, I bought it as a gift for my father and he is pretty much satisfied and happy with it.\nTouch is not that responsive but it serves the purpose very well.\nOverall, a nice product for surfing, watching youtube, movies and play low end games on a big screen.",
            "Good one for is price. Can be used for some daily task like web browsing but not intended for heavy task like gaming",
            "Good Tablet I am satisfied for tablet looking good and performance is very good",
            "Too good while handling nd I thanks lenevo for so worth productive unit under such price so it is wow some|",
            "Woow great tab in this price . Great quality body. And better brand than iball micromax celkon etc. I m happy and satisfied tq flipkart. Dnt think just but it",
            "Most of the apps are not supported and moreover the device doesn't have a upgrade to marshmallow so it will run on lollipop version. My advice for Lenovo tab which is 8 inch is the best thank you.",
            "One of the excellent product from Lenovo. I love it. Battery back up is fantastic. Price is also perfect for this configuration. Simply go for it. Thanks to Lenovo for wonderful product and flipkart.",
            "It's a Great Tab . I like Lenovo so the processor and work is always good .",
            "Good product. Purchased with the trust of Lenovo. Works fine. Tried other products in the past like iball and micromax, but their stability isn't good. Had to repair it very often.",
            "Nice bill quality display clarity is good some application installing very slow battery life very good value for money tab normal user very good",
            "Best value product, decent stuff for kids to play, wonderful display,good battery and nice touch",
            "Nice one. Best in the price segment. It's smooth and fast",
            "Superb Product.Only Wifi No Sim slot So Suitable For If U Don't Want Sim. Ram is Good Storage is Also Good 8 GB. Sound is Louder.",
            "Its a good product suggest to buy insted this one of the better tab for some\nother\nValue returne\nMake happy do good\nThank you",
            "Awesome long lasting performance tab. Feel the mediatek quadcore speed like a jet engine. Battery backup is too good &; thanks flipkart for faster delivery.",
            "Good product.I got it for only for 4499.Good battery backup.No heating issue\n.It has 3G+Calling.Quadcore processor provides enough app handling.\nCamera quality& Audio in earphone is bad. What else can you expect for 4499?\nSo nice deal.Thanks to flipkart service.",
            "nice product\nlenovo use very easy and his delivery is good thank for flipkart",
            "Display is good n for 1 GB RAM the tab is smooth enough for this price range ... Battery backup is average .,.. n no Marshmallow upgrade , just Android 5.0.1... Only 5gb is usable memory. For this price range this is the better tab among others",
            "Very good service from Flipkart got the product in hand the next day.\n\nComing to the product after using two Lenovo tablets this is my third one, but this is a average product in terms of build quality and screen\nThe current tab which I am using now (Tab2 A710F) is far better in terms of build quality and screen wise which costed me the same a year back.\n\nIt's a decent product under 5000 budget and for day to day usage and for kids it might serve better and with a quad core processor its a bit faster\n\nIf u want a tab for day to day use or have to gift your kid their first tab this can be a ideal choice .. its not for heavy users",
            "Good product for basic tab needs at an affordable price. Looks wise great, long lasting battery, good resolution",
            "Lightweight, easy to use, good screen, portable, great at its price. Worth it.",
            "One of the best products in the price range.\nGood Packing and On time delivery.\ncan be upgraded to the latest version of android.\nAn excellent product from Lenovo",
            "Its a decent tab with good features and all useful slots like sim card and sd card. My kids are loving it.",
            "Good tablet for small amount and battery life is very good.",
            "Product was good and flipkart service is fantastic",
            "It is nice for study purpose and it supports OTG ,USB dongle, screen resolution is OK,more space to store.",
            "Worthy...",
            "It's fine to my daughter",
            "I am using ths tab 6 or 7 months think\nI am very happy with ths\nIts worth for money",
            "POSTIVE:\nIam using Lenovo tab3 7 essential with 3g for 15 days..\nI bought this tablet for 4999rs.\nThis tablet with fully high clarity display as compared to many other tablets under 15k.\nIt's appearance and slots position is good.\nAs it contains internal battery there is no heating problem and battery life is too good.\nThe software was updated and apps working good.\nNEGATIVES:\nthe touch was some what hard.\nThe downloaded hd videos was not playing continuously in mx player also.\nIt takes more time to charging.\nIt doesn't had ability to manage sd card files the only thing it do is reading files only.",
            "There are performance issues, can't be compared with the current market.\nLooks are \"okay\"\nBut, lacks most of the current features\nSort of an out of date product.\nI won't prefer buying this.",
            "Good battery life, nice product",
            "5 stars for 5000 INR, no Dolby ,no marshmallow",
            "Everything is good as per its price.but it doesn't giving such upgrade like Marshmallow in its software update. So if someone in interested in marshmallow update then he or she shouldn't buy it.",
            "No Marshmallow update. Wrong description. It won't be updated to Android 6.0.1 or 6.",
            "Worst Product battery life is ridiculous I bought this for my niece but after use of some time it indicates battery need to charge after fully charged again & again it gives the same indication.",
            "Plz don't use this tab & flipkart aaps blady bastrd sarvece flipkart",
            "good",
            "I purchased this for study purpose and online exam. For that this is enough",
            "Value for money purchase . Thanks to Flipkart. Delivery was good. Coming to performance of the tab it's quite a good at this price range. Battery performance is also good. Will recommend this to all specially for surfing and movies etc .",
            "flipkart delivered it on 2nd day of order....superb tab for internet,gaming, ebook reading and other works,...updated android 6 version...battery is very good..good tab for this price nice looking..go for it...",
            "I got the tab in a day and quality is very good. faster and price worthy.\nDo not look at camera as spec itself low.\nEven screen casting is provided really worth to buy.",
            "Worst ever product guys dont go for it.. Spend little extra buck and get good quality product..with in a month touch sensitivity gone..no more lenovo product and flipkart",
            "The only problems with this tab of WiFi model is charging time that can go upto 4 hrs from 0%-100% ..... And no fast charger helps this to charge quickly so can be frustrating...... Overall I m really satisfied with what I paid for this tab ₹4499",
            "looking so good and good battery backup",
            "Good features along with the latest version. Value of money",
            "Worst worst worst...! No more comments.",
            "Tab is good.. But delivery is very bad.. Wait 7 Seven days....",
            "It's so cheap (less than 5K), yet it is a tablet made by Lenovo, and it is so fast! I am primarily using it for reading stored e-Books. Large PDF and DJVU textbooks are getting opened (I downloaded EBookDroid for that) in it as if in a computer! The video and image quality of stored videos and images seem pretty good also. Even the camera, for still photography, is quite satisfactory for laymen like me! Hat's off to Lenovo and to FlipKart for this miracle! The only hitch is the absence of a pre-installed file manager (I downloaded and installed both ES File Explorer and 'File Manager' later), the files copied to this tablet appears (yes, connection cable for PC is provided as a part of the charger cable) lost totally within the wilderness! However, a few days later, with downloaded WPS Office (all these four apps are free), I can now read and edit MS Office files also.",
            "Good product but very low voice and poor camera",
            "This product is very slow, out of 8gb 3fb is system space and graphics quality is very low.",
            "Nice one, I lik it.",
            "Not Upgrading to 6.0 Marshmallow.",
            "Writing after 4 years of use.. 😂\nStill running very cool😍",
            "Very cute and value for money",
            "Nice tab under 5k",
            "Good tab for kids",
            "Don't buy. Do not waste money. I bought two tabs for official purpose but the quality is really bad and the speed is too slow.\n\nI would request if the same can be returned.",
            "Value for money @₹4899. Best product from lenovo. Flipkart delivery is excellent",
            "I used this tablet one and half year it have no lag. I enjoy this tablet experience.",
            "the screen is not responding",
            "Product battery is not good. Performance is fine .",
            "Amazing sound quality just love it",
            "everything is good. 1 start less only because it doesnt support 4G",
            "best product for children at this cost.",
            "Display very good when compared to Micromax P 290, battery life lasts long,excelent in this price level,thanks to Flipkart,for 4500rs.",
            "Screen size is small except other product.no lenovo sign in front of the screen.touch quality is not good.otherwise ok.",
            "Good device for kids",
            "Ok",
            "Nice",
            "Good",
            "Very good product the visuals are clear battary is good",
            "Superb product... Specifications as per info provided.\nGood for basic usage!! Overall very satisfied with service and quality of Flipkart and Lenovo respectively.",
            "This tab is not calling",
            "The product display is average. It is not voice calling tab agree..... But it doesn't allow you to whatsapp and many such chatting apps.\n\nOverall average product...",
            "It's totally worth it if purchased at less than 5000 Rs. Front camera quality is not great. That is the only flaw I found so far. Otherwise it's good android product. Screen quality is also good.",
            "Not gud heat.",
            "This tablet I am havig. this is 4g tablet their telling lie friends",
            "v6 marshmallow and storage 8gb are advantages but camera 2 , 0.3 are bad",
            "wast product of lenovo",
            "Ok",
            "Very good tab for this rate",
            "What a amazing product at low cost.thanks lenovo.....ALWAYS LENOVO",
            "tab is good .. using for past 3 / 4 days.. battery back up is ok... only cons is 1gb RAM which is not sufficient to run high end games or apps, otherwise for essential apps and games it is ok",
            "Nice to use",
            "well built entry level tab by Lenovo. Good battery life and display.\nShort comings\n1. Low internal memory. Should have provided at least 16 GB\n2. 3G connectivity not upto the mark.\nWi-Fi fails to connect to known hotspots at times",
            "This is my first time online shopping and the experience is just awesome because of filpkart.the tab is also great.work smoothly.like filpkart?like lenovo tab3 7 essential(3G)?",
            "This price teb is unbelievable and very good quality thank u flipkart",
            "this table having sim system like calling",
            "Gud",
            "Very Good Product and fast delivery",
            "one of the worst product from Lenovo ( Don't waste your money by getting this tab). I had purchased this tab on Dec-4 ' 2016 . From day- 1 it has problems with software and very frequently it gets hanged.\n\nand now its not getting ON at all, tried all my best possibilities",
            "battery keeps dragging in airplane mode even when not using the tab.\npurchased the product from flipkart, acknowledged my issue and they helped me out refund request without much difficulties.\nvery good service by flipkart.",
            "Nice build quality. It ticks all the boxes. There is nothing very great , but nothing mediocre either in its features. Sturdily built, for use as a add-on device for mobility. Lenovo should aim for a 1280x800 screen resolution next time.",
            "It's worse than any tab could be",
            "Performs good,but images not as per spec",
            "Value for money, good for childrens online study propose.",
            "very Good Perfomance after two years.",
            "I gifted to my son but ironically the battery life was very poor. It did not last for even one year. Ultimately we have to throw it. All money got wasted.",
            "Ok",
            "Wonderful tab",
            "Average",
            "touch is very poor also no SIM card facility also not good service center facility",
            "Hi guys, bought this almost 3yrs ago. 4got to updt feedbk so updating nw. Got this 1 4 my kid is really happy using this especially 4 gaming its awesome. THANKS LENOVO",
            "goob prourd",
            "it's been a year since I'm using it and had just only one problem and I solved it by calling the customer care. really worth the price",
            "Has suddenly stopped working",
            "This thing is only for viewing experience and reading ebooks nothing much",
            "Nice",
            "better to go 4 g",
            "Good",
            "good",
            "Battery problem\n\nPlease change my headset.",
            "Dont buy from flip kart because totally faulty product..I am writing this review after use this tablet 4-5 months.. dont waste your money",
            "excellent",
            "best product",
            "Insufficient memory. Even though just use Facebook, hotstar, ozee, Sony and news app. whatsapp not supporting (Whatsapp now not compatible in any tabs).",
            "very nice",
            "nice",
            "very nice product",
            "Nice product .working is Good",
            "Good",
            "nice 👍👍👍",
            "poor battery backup.....",
            "good 😊😊",
            "Never trust this company be careful.",
            "good tab, no problems till now. good for light usage.",
            "use less without sim",
            "Very good product specially for kids to learn... i purchased it for my students... display , battery, performance is good.... awesome tablet under 5000...",
            "superb product I loved it.😍😍gud product",
            "Value for money",
            "nice tab...helpful to study and play games tooo",
            "Good Tablet mobile... Good battery life& other performance...",
            "very good",
            "super",
            "Good",
            "awesome product",
            "It's ok for the price range. Storage space could have been increased. Battery backup not as expected, u need an alternative backup in case u are travelling.\nCamera quality very low.\nOverall out of 5, I would rate it 3.5 , battery and camera should have been improved by a lot more margin.",
            "good one",
            "Good Product..",
            "Not purchase please",
            "Bad features.......",
            "Worst tablet. its supposed to be kids tablet, but no kids mode.\nnever buy this lenovo products anymore. not worth the money. there are better options.",
            "Lenovo tab 3",
            "Good tab amazing",
            "Best use",
            "The good product...",
            "Nice product and packaging also.",
            "The worst product",
            "Good product.",
            "Excellent tab.really a value for money",
            "It is awesome",
            "Super good",
            "Pretty good at this price point.",
            "Nice",
            "On the 5 th day of purchase it stopped working.thanks to flipkart for returning the product and refunding money.5 star for flipkart..",
            "Good if you use it at home for reading / watching videos. Not for gaming surely. Does not lag unless you install heavy to very heavy applications.",
            "Best tab in this price range for normal use.",
            "It is delivered correctly on the date they said",
            "Bad.no sim",
            "Not even used for 6 months and its very slow.. Touch not working properly waste of money..\nElectronic device i recommend all to buy from a shop..",
            "it's nice tablet. but there are no File Manager option in this tablet that is the only problem so you need to download File Manager or File Explorer from Google Play Store.\n\n\nSardar wife that tablet is very good in this price I am happy with this product",
            "Good product",
            "It's is good but 6day ago it's starting hanged",
            "Ok",
            "Such a worse product I don't like to give that one start also Flipkart is cheating site. It's a cheap product",
            "Tab is good but in lenovo product charger pin provided in the body is getting failure frequently. This is to be rectified",
            "Super",
            "Great product go for it but Android is marshmallow....",
            "Superb",
            "Affordable price best tab and flipkart service Awesome",
            "Nice product..",
            "Ok",
            "Good tab",
            "Its worth the price",
            "Bad product",
            "Good tab for the price range",
            "Its been a week since i bought this tab.Dont mind anyone who says go for another tab in this price range, this lenovo tab 3 essentials is the best one, one will get in this price range.",
            "Very nice Tablet",
            "Good product battery ok",
            "Superbb product",
            "Best tab for reading purpose...",
            "Good deal. Good quality for this price!!!!!",
            "Tab is nice battery life is also good but sometimes it is getting hang",
            "Super budjet product....",
            "Good",
            "Performance is not great",
            "Its nice for study purpose .Iam happy with this product. Thanks to flipcart.",
            "Not happy",
            "Awesome product.....good sound quality..... Nice tab...good camera clarity......looks beautiful......",
            "Without sim card so it's use only wy fy",
            "Tab is good but packing was not good",
            "Gud",
            "Good product",
            "Nice tab....",
            "Worst Tab .Very poor battery backup. Even my 2 yr old Lenovo A7-30 work better than this model. Lenovo Quality has gone down.",
            "Very nice piece",
            "Not good",
            "Good",
            "Best tab ever great value for money is too less the features is best",
            "Nice product.My son like it very much....",
            "After using 1 month screen-touch stop working.",
            "Almost ok . But has no FILE MANAGER and 1 big issue while charging in switched off mood it shows wrong time as a screen saver !\nCan't find any solve",
            "It's very poor.. to be expect products from Flipkart... I booked sim model but they delivered wifi model and no response to exchange. ..",
            "This is a very good device. If you are looking for a tab for your kid. Then blindly go for it. It's charge quality is great.",
            "This tab I have purchased for my children , they are enjoying its",
            "Nice tab",
            "Worth for money , good quality",
            "Product is average",
            "Good",
            "good product in good price..... a little problem in speaker....",
            "Good product...Go for it without any second thoughts ✌️✌️",
            "Good product, value for money",
            "I have been using this tab for months. No issues till now. Good condition. Sound was perfect. I liked the overall performance. Only thing I wish to have is more battery backup. But it is satisfactory. Anyway I loved it.",
            "Display complaint with in 4 month",
            "Nice one to get it... Happy for it",
            "Ok",
            "Good quality and awesome product",
            "Great taplet",
            "Gud one..",
            "Its A very good product.At this price range this product is mind blowing.",
            "Superb product..value for money..",
            "Value for money",
            "Tab is good with decent looks. It's only an Will fi tab and there is no SIM card slot",
            "Good 👍",
            "Tavis ok we can play some of games and excellent condition but lagging of speed in inside of box only charger and cable and booklets you can produce on screen guard and protector and pouch",
            "Low battery pickup",
            "WiFi not connected",
            "I like it",
            "The product is good... But need some memory space otherwise good.. But the courier service named ekart logistics I loved.. Not delhivery so send them to me again...",
            "Filpkart selling dameged items so don't by costly items from Flipkart",
            "Horrible product",
            "Very bad product and Purchase\nNot good service",
            "Good",
            "Everything is good, but charging is very slow......",
            "Great product , bought 5 more , totally reliable, and perfect for data entry and sharing",
            "Nice",
            "Good",
            "Touch complaint after two months from purchase.Totally disappointed.",
            "I My tab display was broken not available in Hyderabad I need display of tab with compertable price..",
            "Reasonable tab at this cost ... I am satisfied for what I bought ....",
            "Battery backup is really really good.",
            "I have purchased the above product before three and half month and now its display is not working properly and its touch system is not working. I enquire abt the service centre but in middle of kerala there is no facility to repsir it.",
            "Value for money",
            "Nice....for my daughter a surprise gift",
            "Amazing",
            "superb",
            "Nice product.",
            "Good",
            "I got the product yesterday while I'm charging the tablet sometimes it will be charging and sometimes it will be not charging charging port problem I got a defective piece",
            "Very bad",
            "Nice",
            "Some of the apps are not supported by this device. I could not install Duo, Mi store and similar apps. Overall Gr8 for basic usage.",
            "Good product fr d price",
            "Good product",
            "Nice product",
            "Wow woww",
            "Best in this price",
            "Super.....",
            "Good",
            "Just good",
            "Nice tab use full but I lost it",
            "Nice product",
            "Not good. Always issues with connection to computer.",
            "Good one perfect time to delivery",
            "best",
            "Table is good, but OS not upgradable as said in discription.",
            "Bought this one for my nephew. Display, touch, battery's very good. Enough speed and power.",
            "Good",
            "It is awesome in this prize. It's working well.",
            "It's a very good in this price.",
            "The tab is very useful for my son he was not used to do anything but when the tab came he utilized his time in this tab",
            "Good for price range",
            "Value for money",
            "Product is good . Should see how it performs over the time",
            "Pretty good",
            "Memory space is very low\nit's a big handicap",
            "Worth the price Supr Product Loved It!!",
            "Good",
            "Good",
            "Excellent product.I never get even a single problem since nearly 2 years",
            "Its very good i really thanks to Flipkart",
            "Good",
            "Excellent product with this great price.",
            "Awesome",
            "Nice product in this price... Week b4 purchased no issues till now",
            "Just Awesome! Battery backup is mind blowing...",
            "Good",
            "Best in budget",
            "good",
            "You wont get a better deal at this price!!!\nDurable product...\nIts great for those who want to give this to children in the age group of 5-12 Years old..",
            "Ok",
            "Not bad",
            "Nice product & fast delivery in committed days",
            "Not good product",
            "Good",
            "nice tab at the range 4.8",
            "The tab is good for watching videos. It's touch quality is not that great.",
            "Nice",
            "Nothing",
            "Bad prodect",
            "Since it is a wifi only tab\nPrefer only if u have a wifi connection at home.\n\nIf you do, nothing is smoother.",
            "nice product",
            "Very nice...",
            "Good product in this price range...",
            "Return not interest",
            "Nice tab.my 10 yr old son can see youtube videos easily.",
            "Very good",
            "Loving it",
            "Nice product ...Quick delivery from flipkart .",
            "Good cheap tab for buying",
            "Good product in this price range, camera result not good.",
            "Good product by Lenovo ....... purchased for my son.",
            "Nice tab",
            "ITS a perfect deal in this price specially those who want a brand and quality tab this tab not like a poor quality brand tab micromax, swipe etc etc",
            "It is a excellent tab from lenovo good battery backup but it takes more time to charge no hanging and heating nice display",
            "Excellent product",
            "Super tab I love it",
            "Everything was perfect for this tab... .",
            "Very bad product",
            "Chief and best for normally uses.",
            "Good product. Suitable for kids. Performance in a little bit lower side some times.",
            "Good item",
            "Good battery and good gaming tablet",
            "Super product..& thanks.. sarvice",
            "Delivery and Product Quality was ok,but some laging the product ,display quality was not good,Over all product was just Okeya",
            "Good tablet with in its price range.\nHappy with it",
            "Best buy",
            "Good",
            "Good",
            "superb",
            "Product good but did not upgrade to marshmallow",
            "lenovo tab3 is most usefull product in given propeties.i think all product from lenovo should maintain thier own diffrent specification.this is like such one.low cost in prize and high performance",
            "Great offer",
            "Nice",
            "always best",
            "Nice look",
            "Gd one",
            "Bought this for our todfler6. He is loving it. Best budget tab for all the children.",
            "Gud product but features must be increased",
            "Good",
            "Great deal with Flipkart. And very good product.",
            "Useful product",
            "Very good",
            "Good prosuct with full multi media option and full value for money\nThank you flipkart for offer these awsome product for meee",
            "Nice",
            "Awesome product",
            "Good one..",
            "Worthy",
            "It is best table I love it",
            "Nice",
            "Valuable",
            "Good. Product one of the best performer in it's range",
            "This tab 3 is so good and awsome features",
            "It is a good and presious products and good delivery",
            "Fast dilevri ohk",
            "Nice",
            "Don't buy ....Touch screen not working.....Phalse product.....",
            "best tablet",
            "Nice tablet at this price range",
            "This product is awesome",
            "Nice Product",
            "For such a gud product its a reasonable price.",
            "Screen in an let down.try asus tabs instead they are way better",
            "Very poor product",
            "Flipkart delivery is just fantastic.",
            "Best in price range",
            "Good at low price",
            "Very very good product and fast delivery",
            "This Tab3 is good 👍",
            "Good tablets at incredible price,good graphics.",
            "Very amazing gadget it is, No lagging, fast touch response, battery life is superb, but if you want to capture anything so this is not for you because both camera sucks, but anyway i got in 5100rs on big billion day so for me it's paisa wasool .",
            "Most comfortt for price n action",
            "It was fabulous battery life was superb",
            "Its not my first expirience but as usuall its wonderful and easy to purchase the product on flipkart and excellent quality",
            "Nice buy it very nice",
            "Nice",
            "Thanks for the valuable product",
            "Ok",
            "Perfect in this price no lagging no heat up problems battery life is awesome dint hesitate buy it",
            "Nice tablet",
            "It's awesome in 5000",
            "Good",
            "Good",
            "Good product put its metrial is bad",
            "Worth for money... Useful for my 2yrs princess to play and learn... Very sturdy",
            "Excellent",
            "Best tab under 5000 ru",
            "No tab better than this if you have home wifi",
            "Good product",
            "Please send this awesome product on my adress",
            "Marvelous",
            "Cheap and best",
            "Its good",
            "The tab is best in this price range I am using this tab from two months and it works good the only bad think about it is that it takes so much time to fully charge",
            "Nice tab",
            "Wroth for this rate but some time working slowlly.",
            "Very good quality and good product I m very happy.",
            "Battery backup poor.",
            "Excellent product for this price range. go for it!",
            "Good tab",
            "Thid product is good. Can go for it. My daughters like it very much.",
            "Valuable for money",
            "Good tablet",
            "Average",
            "Ok",
            "Very good",
            "Good performed",
            "Good but not best",
            "Awesome",
            "Good tab",
            "much better.",
            "It a good product. Camera is not good one",
            "Touch very smooth",
            "Product",
            "Tab is working fine as expected after 2 months",
            "Good device",
            "I am using Lenovo tab 2 for two year .It is just great in thos price.If you manage the internal space then it is the low cost beast.",
            "Dear friends pls don't buy this tab very very worst one",
            "Worth for money",
            "Good product\nPerformance is good\nBattery Charging is fine",
            "Its bad tablet it,s going automaticly switch off flipkart is so bad online shopping is all bad",
            "Good",
            "After using for a week now I will just say WöW......its Awesome.",
            "Not bad..",
            "all ok except camera......ok in this price",
            "HI,\nThis is Ashish. After lots of research I zeroed on in this tablet primarily for gaming. The piece delivered to me by Flipkart is excellent.\nBoth my daughter and wife are enjoying it thoroughly.\nIt is very good for gaming. Picture quality is also awesome.\nGo for it . Value for money.",
            "Opossum tab",
            "1. this is not upgradeable to marshmallow.",
            "Good",
            "It's too good in a affordable price...i really become fan ..",
            "Best",
            "Excellent product in this prize.",
            "good",
            "Very good product",
            "Simply Awesome.",
            "Good for normal use",
            "Tab works good & slim size",
            "Heating problem otherwise it is a good product",
            "Very slow internet, memory also low, unable to download one movie too.battery backup very low",
            "nice.but there is only 4 GB of storage",
            "I am very happy with lenovo tab3 7 essential",
            "Ok",
            "Good. Battery backup is also good",
            "Very good battery backup",
            "Nice product",
            "Awesome tablet for basic things like reading, watching movie, net surfing n casual gaming.. No negative issue found still now",
            "Pros -\n1.low budget\n(good for kids)\nCons -\n1.mediocre touch and display\n2.pathetic battery..takes night to charge and discharges very fast\n3.volume and power button are badly placed ..",
            "Good one",
            "My tablet WiFi doesn't work..",
            "It's a worthfull product..... I bought this product specially for my mom and this is amazing for her. Thanks to flipcart becoz of their nice delivery of the product",
            "Good piece",
            "This tab is very poor\n\nPoor touch audio and poor backup",
            "There is no slot for insert sim",
            "Good product in effective cost",
            "very good tablet and otg support..m happy",
            "Awesome product at unbelievable price just ₹5000..",
            "Nice product",
            "I have used Tab2 before and battery backup was much better in that... I did not find any other changes...good for kids.",
            "Good product",
            "Good",
            "Nice product",
            "Good Product",
            "Good",
            "Good",
            "yes i like the product and delivery both",
            "Awesome experience.",
            "It has all the features which I need.\nLenovo is much better than micromax...",
            "Worth every penny",
            "Superb",
            "Good",
            "A good tablet in 5k range. Screen is a bit disappointing, storage is less but the RAM Management is good and speaker output is also good. A nice tablet for mediocre gaming and normal day to day usage",
            "Quality was very poor... Display not good",
            "PRODUCT SO GOOD AND PROMPT DELIVERY BY FLIP KART. THANKS AND ATTRACTIVE DISCOUNT.",
            "Battery backup problem slow",
            "Heating issues vl b dare wen d video get play tab vl get over heating",
            "Good",
            "Good one for kids",
            "Not worth.",
            "Everything is perfect......except camera quality",
            "This was good to lowest price",
            "Good product for a best price and Also love you flipkart it is an express delivery with in 3days",
            "Not nice tab charging not charging only",
            "It is best...",
            "Decent product",
            "Ok",
            "Nice product I am happy.......",
            "Its good",
            "Camera quality is very bad.\nWhile ordering I thought it was with single sim, but there is no sim slot. Then I realised that, I have changed the color which has changed the model itself. So the review for with sim is not really for this phone. Please remove the color option in site for this model, and separate the reviews as well.",
            "Value for money nice",
            "This one is the best tab for small amount and i was really happy with flipkart service",
            "Proved a white Elephant..have to return it same day.",
            "nice tab ....afodable price...",
            "Gud product i am used this product",
            "Very good tab battery life is awesome not hitting issue you play games and watching videos thanks Lenovo",
            "Worth buying...I bought the Lenovo calling version tablet at just 5K..It is the best tab under 5K ... Battery backup is ok ok",
            "At Rs. 4999 it is the best deal I get .",
            "Good for 5k. Touch is average. But good if u buy for 5k.",
            "Good",
            "I have not got marshmellow update as written in its details in flipkart it shows latwst upgrade in lollipop only",
            "Super disply",
            "Good for the price",
            "good one working fine but for the issue of an update which was downloaded and not upgrading have to check the issue but very good got the single sim 3g variant for the price of the wifi variant.",
            "Excellent product at the price of below 5k.",
            "Good",
            "Best tablet in less cost...and its battery power is very good...",
            "It's a very good tablet it's very fast and battery life is good",
            "There is no file manager icon in this tablet.",
            "Not bad and not good..display is not good.but I am adjusted. ....",
            "Nice product",
            "Its good for kids but camera is not good its okkkk",
            "Nice tab with a decent price tag. Got for 4499/",
            "Nice tab great offer flipkart.",
            "Nice product",
            "Good",
            "Total value for money. Enough said",
            "Didn't received with earphones. Only Tab and Charger was sent in the sealed box.",
            "Nice product",
            "Lenevo ten very very... Good..23.03.2017 today working... Good",
            "Audio quality need to be improved on 3g.",
            "Flipkart could have given a better deal on this during their big sale",
            "This tab is superb.\nFront camera is not ok",
            "It's not Dolby system tab, sound is very bad over the earphones, don't have separate speaker I.e earpiece and speaker is same , voice is low sound, touch sensitive is not up to the mark, battery backup is average, according to it price it's OK. Not great work, screen sharpness is average.",
            "i mean really.. this cheap tab taken over samsung galaxy tablet..! good good!",
            "Tab is okkk but ram is not soo good",
            "Worth for the money...Best Buy..If ur looking for a tab within 6k go for it...Good screen revolution..Touch is okay.... Overall good product....",
            "good product but battery going hot within half hour of use camera is weak.",
            "Ok",
            "Nice sound quality no lags runs games smoothly my kid is loving it nice product go for it",
            "Good product",
            "The product is good. But this product is not for heavy users. The battery backup is not good. For 100% charging we have to charge for 5-6 hrs.",
            "It is a good product. Yet, Swipe Strike 4G VoLTE would have been a better choice on the price band.",
            "Little bit slow",
            "It's an entry level tablet so do not expect extraordinary, lag-free performance. Available user memory is 4.8 GB only.",
            "I'm very happy to this purchases.",
            "Vry good",
            "Very good. Thanks Flipkart !!",
            "Low price.",
            "Good product from lenovo. Got it delivered yesterday , before scheduled delivery date.",
            "Gud but touch in edges not working gud",
            "Good product",
            "Worth for rs.5000",
            "Good",
            "Nice tab. It has a finishing touch.",
            "Bad display and camera apart from that others are good.",
            "Very good tab for the price......... If any 1 want a tab with less budget then go for it",
            "not bad.... its nice to use....",
            "Such a good product at a low cost",
            "Not satisfied",
            "Tab is really good but heats so quickly and battery drains faster",
            "Defected product",
            "Good tab on this price range.",
            "Best product",
            "Its very good tab I requested to buy that one please that's good",
            "Good one..",
            "In every aspect it's fantastic",
            "Nice tab wonderful tad ....... Thanks to Flipkart product thanks again ....... JANGAM Siri varshrini some ,some products only waste sound is slow",
            "Good",
            "You cannot expect any more at such price. Although, it is not upgradable to android 6 as mentioned in the description.",
            "Good",
            "Goood for budjet",
            "Nice TAB with less price",
            "Good",
            "Good",
            "Love it",
            "An excellent product for the price. Absolute Value for Money.",
            "Its was nice to use",
            "Great tablet to buy under this range. Nyc call clarity. Good display.",
            "Using day and night....performance is too good..never gets hang..batterywise too good...best deal ever at flipcart",
            "Beautiful product.. Battery Backup Are Excellent..??",
            "Best tablet very good tablet",
            "It worked great without any issue so far. Battery backup is nice.",
            "Nice",
            "Awesome tab at a awesome price",
            "It works super",
            "Super tab ,fast browsing. Its really good tab.",
            "Reasonable for that price cam not so good",
            "Good",
            "Till now its good",
            "awsmm tab....",
            "It's a nice tablet with low cost...",
            "super dumper",
            "Good Tab ....but its battery idle percent is goes on increasing... and it also have storage issue....",
            "Very good product",
            "I bought this 2 weeks ago from outside retailer. For this price the tablet has HD display and smooth going Upto now. YouTube videos work in 720p which is HD and I haven't seen any lag Upto now.",
            "Have any one brought this model?\n\nOrdered Today. Hope it will be Good Tablet",
            "It's a good tablet but problem is it's expandable memory is just 32 GB and other didn't have support of other cables it's just my guess I don't know whether it's support or not....hope you will find",
            "Nice value for money. Want a tablet but on a tight budget? Look no further!",
            "memory is too low to install big games,May be android 6.0 update solve this issue by which the sD card is formatted as internel storage. game like GTA sanandreas runs smoothly. good tab for gaming,entertainment, calling,internet 3G surfing. battery life is good.",
            "Awesome tab at its build quality but lacks in specifications comparing to other models at this range",
            "First... Kudos to Flipkart for fabulous offer.. Got it @4998/- ... Great Battery backup & awesome making...",
            "Super fast shipping and decent product in this price range compared to other. Thank you Lenovo and Flipkart",
            "Awesome experience",
            "when i ordered the Tab on the website it was written name as \"Lenovo Tab3 7 Essential 8 GB 7 inch with WiFi Only (Black)\" and in feature it was given \"Connectivity as Wifi + 3G\". when i receive the product it doesn't have 3G feature in it it is just WiFi only. when i initiated return with Flipkart they have rejected my return request in very rude way saying you have check correctly on website and order. also now the seller has made the changes on the feature of product stating :Connectivity as WiFi only\".",
            "Nice",
            "Good",
            "can anyone tell me how is its camera quality",
            "1dum nakli product. A fake one. Guys please don't buy it",
            "Front camera is very poor, back camera is ok,\n\nwould have been better if it was 2 front and 5 back camera",
            "1-2 Din tab use kiya Par Achaa nai laga.\n-\n1) 1024x600 Ki display Quality he hi nai.\n2) 30 min Game khelo battery garm ho jati h.\n3) Is tab k layak koi cover nai h market me.\n4) Dosto file Manager tak nai h...kamal h na. Or\n5) Flipkart ki Dabav...manna padega bhai.\n-\nMujhe yeh product pasand nai aayi mene Refund maga nai diya. Other product maga nai dete. Aaj majboori me yeh tab mujhe rakhna pada. Pese ki baat nai h par customer k sath dhokhaa huaa na. Jo cheez pasand nai aa rahi pheer bhi leni padi.p product check karne to milti nai h photo dekh k lete h. Ab photo dekh k kese ptaa chalega achaa h ya nai.\n-\nMe tow aglibaar Flipkart se koi bhi cheez nai lene wala. Infect online shopping se hi nafraat hogai 500 rs. Jyada dunga but store se check kar k lunga.\n-( Looto Flipkart Looto)-",
            "thanks for the fast delivery",
            "I believe this device reviews not genuine, it is very poor product. Battery back is pathetic\neven it is not 2 hours",
            "Kaun se bank se 243 me emi suru hota hain filpkart ji ..... dhokha dene ka kaam kyu karte ho",
            "I dont want replacemant i want my money refund",
            "cheater, 64 GB memory card not supported.\nso why cheats me.....",
            "In less than 2 months, the Lenovo Tab 3 7 Essential has issues - Display Garbled, Just lines on the display, nothing visible. It was in regular usage e.g. audio songs being heard etc",
            "Wrong Description about Android Version.",
            "Good",
            "Vai log waste of money",
            "The Tab is extremely good and the screen is also big enough . But the camera is not that good.",
            "Very fast&good service",
            "Only using the wifi",
            "Good for reading books and has a good battery backup. Not built for regressive use.",
            "Don't buy this, can't upgrade to newr Android version although mentioned in the description so you can't use WHATSAPP!!",
            "its vert good product and fast delivery",
            "Delivery late",
            "One of Tha pathetic service provided by Flipkart and will never buy and recommend to buy from Flipkart ever......Never buy from Flipkart",
            "In time delivery. best service by flipkart",
            "Very good lenovo tab & filpkart fastest services",
            "I purchased lenovo a730 tablet from flipkart. It provide genuine products and quality products. Iam using since November 2014. Time to time delivery is Good thing.",
            "Not able to upgrade this to Marshmallow.... Please advice",
            "nice delivery anyway...",
            "Good service of flipkart",
            "its embarassing, they dont take this peace as return",
            "Paisa wassooll",
            "Got this at 5K, average camera, responsive touch, speakers ok, no lagging issues, great screen, great battery backup. You can't expect more at this price.",
            "I want this tab to be in 2gb ram",
            "Nice product. Thanks Flipkart",
            "I revised broken tablet",
            "Other couriers deliver the shipment within one or two days. But Flipkart took six days for the transit of Bangalore to Cochin.\nAlso they are not allowing to pick it from their warehouse.\nVery bad customer service.",
            "Plz flipkart can u tell me to how to upgrade android version lollipop to marshmellow?????",
            "The Tab is having problem with sound. Sound is worse. Further, there was problem for switching on the tab. The product was delivered on 7th nov and complaint was lodged on 18th nov (delay for problem arose due to demonetization of 500 and 1000).The flipkart denied to exchange the product. Pathetic.",
            "Disappoint with delivery",
            "No problem with Flipkart, this is review for product, not seller.\nProduct developed a bend in the body and became dead in a month. It never suffered a single fall and there's not a single spot on the body.\nService center is rejecting warranty service for manufacturing defect. They says it got bend due to falling! (Imagine a glass getting bend by falling and not breaking!)\nMoving to consumer court. I've not ever seen a more cheating company than Lenovo.",
            "On time...",
            "I book calling tab ,got WiFi only I want return it no response positive response from flikart",
            "average tablet.\n\nnot expect much.\n\nit is ok for students.\n\nintial price is 4999 but now 7000 is higher compared to other.\n\nheating issue.\n\ncamera , clarity is normal for 2mp.",
            "Tab3 wont suport whatsapp...?",
            "woo!",
            "VERY very third class serivce filpkart\nmaine order dea tab ka muje mom dad ko gift dena tha and filpkart ke customer care pr bolte hai aapko ham jaldi se jaldi delever denge jhoot pr jhoot bole ja rahe hai and na order track kea ja raha hai na he koi ans mil raha hai\nfilpkart ko ham bahut salo se use kr rahe the lekn iss product ko lene ke baad ham filpkart app unistall kr rahe hai or jo be purchasing hoge wo amazon ya snapdeal se hoge\nvery very third classs service very bad experince\n\nproductt is average no sim card screen is avrage only brand name lenovo not a qualitiy",
            "Good product on time delivery .",
            "Voice calling is enabled or not",
            "Fast delivery by razzak",
            "చార్జింగ్ సరిగ్గా ఎక్కుట లేదు",
            "It's bad i want to return it can i",
            "I have a one year old htc desire 326g dual sim mobile.how much value will i get to exchange with this tab.?",
            "I referred a friend and got a 200 rs off coupon, so I used the coupon when buying this tablet but when I got the product it shows the discount has been applied on the invoice but the product price was same even after applying the discount.",
            "This Tab is v5.0 Not v6. ..I feel so sad..\nHow to upgradeable 6v tell me",
            "This 60$ tab sold for 7k in india, compare to other tab the price not worth for me.\n\nThe display suck,\nContact stop working when you connect Skype other apps.\nWi-Fi stop working when sleep, I go thorough every function possible but unable to fix it.\n\nOther then it this good tab IMO.",
            "Exchange offer is there for this tab ihave motog2",
            "I have not received my tab",
            "Very bad display",
            "Want to return this tab\nBut customer-care not replacing this request waste tablet",
            "Any tell me what is the model number of this product???",
            "How much discount will i get",
            "dear sir my display is broken u replace the display"
        ],
        "likes": [
            "305",
            "44",
            "20",
            "2",
            "4",
            "11",
            "3",
            "4",
            "1",
            "1",
            "305",
            "44",
            "20",
            "2",
            "4",
            "11",
            "3",
            "4",
            "1",
            "1",
            "1",
            "3",
            "8",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "249",
            "259",
            "34",
            "5",
            "5",
            "4",
            "19",
            "7",
            "3",
            "4",
            "3",
            "6",
            "16",
            "5",
            "2",
            "2",
            "2",
            "2",
            "10",
            "6",
            "5",
            "3",
            "2",
            "9",
            "5",
            "13",
            "2",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "3",
            "4",
            "2",
            "2",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "2",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "3",
            "1",
            "1",
            "1",
            "1",
            "7",
            "4",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "22",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "65",
            "63",
            "11",
            "0",
            "2",
            "16",
            "2",
            "4",
            "0",
            "0",
            "65",
            "63",
            "11",
            "0",
            "2",
            "16",
            "2",
            "4",
            "0",
            "0",
            "0",
            "3",
            "19",
            "1",
            "1",
            "2",
            "2",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "51",
            "63",
            "11",
            "0",
            "0",
            "0",
            "9",
            "2",
            "0",
            "0",
            "0",
            "2",
            "11",
            "2",
            "0",
            "0",
            "0",
            "0",
            "9",
            "3",
            "3",
            "1",
            "1",
            "9",
            "4",
            "22",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "6",
            "1",
            "2",
            "3",
            "3",
            "3",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "5",
            "7",
            "2",
            "5",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "2",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "11",
            "5",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "3",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "25",
            "0",
            "0",
            "1",
            "2",
            "3",
            "0",
            "0",
            "2",
            "1",
            "1"
        ]
    },
    "qna": {
        "questions": [
            "Q:is this android",
            "Q:Does this support otg?",
            "Q:can we download YouTube in this Tablet...",
            "Q:Is this upgradable to Android 6? please send the link...",
            "Q:can we play games in it",
            "Q:can a usb modem be used in it ?",
            "Q:can we open back cover",
            "Q:Is the front camera okay for video calls?",
            "Q:What is tablets",
            "Q:Can i use jio 4g voice in this tab for calling...",
            "Q:DO WE GET THE CORRECT COLOUR",
            "Q:does is it sim spported",
            "Q:Are the apps transferrable to external sd card?",
            "Q:mentioned in Product details that upgradable to Android 6... is this possible?",
            "Q:it is a calling tab",
            "Q:whatsapp and fb videochat can be ?",
            "Q:can we put sim on it",
            "Q:Mentioned in product details that upgradable to Version 6... is this true?",
            "Q:Does it support hdmi?",
            "Q:does it have inbuilt Dolby digital",
            "Q:does it support Hotspot ?",
            "Q:Is there a sim card use in this lablets",
            "Q:will it support sim slot. i am answer Yes.!!",
            "Q:is this 4g?",
            "Q:can i connect dongle with help of OTG",
            "Q:Can I connect mouse/keyboard through otg ?",
            "Q:This phone is HD video supported??",
            "Q:whatsapp would be working in it or not",
            "Q:is it touch screen or not",
            "Q:What is the Camera quality ?",
            "Q:can we put a password in it",
            "Q:Does it support tablet keyboard?",
            "Q:does it hangs?does clash royale work on it?",
            "Q:Does it support OTG?",
            "Q:does it support sd card",
            "Q:does it support pencil/stylus usage? if not can someone tell me which tablet of lenovo brand supports that?",
            "Q:can we use internet through jio wifi",
            "Q:more storage space is there",
            "Q:does it has vr support?",
            "Q:whatsapp and you tube use me",
            "Q:does it support jio SIM...??",
            "Q:does it have google services",
            "Q:is it 32gb or 64 gb internal",
            "Q:Can I make calls through what's app",
            "Q:is it is it support hotspot Wi-Fi from from another mobile phone",
            "Q:does it support tally erp 9",
            "Q:does it have front camara",
            "Q:any heating problem??",
            "Q:Is it have Bluetooth in the tab",
            "Q:how is the display , is it having a good viewing angle?",
            "Q:is this calling tab",
            "Q:Can i edit word and excel documents and save on this tablet?",
            "Q:this have blutooth",
            "Q:Does it have Play store",
            "Q:will it support wifi"
        ],
        "answers": [
            "A:yes , Android 5.0 (Lollipop)",
            "A:yes",
            "A:it is android os...and this tab has YouTube inside...all android os will have youtube...not doubt ..this tab have youtube...",
            "A:no not up grade",
            "A:Yes my son who was in 7th standad use to play games on it",
            "A:If you are talking about inserting usb modem into the Tab, there is no port. The Tab has a port for charging the battery and earphone pin. You can connect with your home wifi",
            "A:no",
            "A:No front camera is not up to the mark and video call looks dull",
            "A:tablets like a big screen mobile and it's has or not sim slot",
            "A:No... This is not calling device.",
            "A:yes i get the correct colour sir i want display and touch",
            "A:no , it is wifi only",
            "A:No",
            "A:No",
            "A:yes...u can use it for caller purposes",
            "A:yes",
            "A:NO . there is no option for sim. but runs well on wifi .",
            "A:Right now as you buy the product it comes with Android Version 5.0.1 & Till date no update to version 6 is available; may be in next few weeks.",
            "A:No",
            "A:no",
            "A:No..!!",
            "A:This is not calling tablet, there is no slot for sim card.",
            "A:No it does not support sim card",
            "A:Wi-Fi only But service may from 3G or 4G, No SIM Service only by Wi-FI",
            "A:Yes You Can Connect.",
            "A:Yes",
            "A:Yes, It is",
            "A:yes. whatsapp will work.",
            "A:yes",
            "A:camera quality is not up-to the required level.. but tablet is very good with other stuff",
            "A:yes",
            "A:Yes.",
            "A:no. it doesn't....Yes it works",
            "A:yes",
            "A:yes it supports sd card good tab under 5k and im sending this message with this tab",
            "A:no",
            "A:yes",
            "A:It has inbuilt memory of 8GB and can be extended upto 64 GB.",
            "A:yes",
            "A:yes",
            "A:No",
            "A:Yes, It supports all Google services.",
            "A:8 gb internal external 32 gb",
            "A:Yes via wifi , no sim slot",
            "A:Yes. It's Support",
            "A:No",
            "A:yes",
            "A:No heating problem at all.",
            "A:yes , Bluetooth v 4.0",
            "A:display is Good",
            "A:No it is not calling tab",
            "A:yes you can edit word and excel documents ...",
            "A:Yes it does have.",
            "A:yes it has a play store and this tab is functioning very well..",
            "A:yes"
        ],
        "likes": [
            "110",
            "117",
            "12",
            "6",
            "3",
            "12",
            "2",
            "1",
            "1",
            "3",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "132",
            "7",
            "1",
            "3",
            "4",
            "2",
            "2",
            "0",
            "1",
            "1",
            "1",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "20",
            "30",
            "6",
            "3",
            "0",
            "11",
            "1",
            "0",
            "0",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "7",
            "0",
            "0",
            "0",
            "1",
            "1",
            "49",
            "2",
            "0",
            "1",
            "4",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "4",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1"
        ]
    }
}