{
    "title": "Swipe Slate Pro 2 GB RAM 16 GB ROM 10 inch with Wi-Fi+4G Tablet (Champagne Gold)",
    "product_specification": {
        "Model Number": "Slate Pro",
        "Model Name": "Slate Pro",
        "Color": "Champagne Gold",
        "Connectivity": "Wi-Fi+4G",
        "OS": "Android",
        "Operating System Version": "6.0 (Marshmallow)",
        "RAM": "2 GB",
        "Voice Call": "Yes",
        "Display Resolution Type": "HD",
        "Supported Network": "GSM, WCDMA, 4G VoLTE",
        "Display Supported Network": "LTE, GSM",
        "Processor Type": "Quad Core Processor",
        "Display Size": "25.4 cm (10 inch)",
        "Sales Package": "Tablet, AC Power Adapter, USB Cable, Earphone, OTG Cable, User Manual, Warranty Card",
        "Display Resolution": "1280 x 800 Pixels",
        "Primary Camera": "5 Megapixels",
        "Internal Storage": "16 GB",
        "Processor Speed": "1.1 GHz",
        "Sim Size": "Mini SIM",
        "Multi-touch": "Yes",
        "Sim Access": "Dual Standby",
        "Sensors": "Accelerometer, Proximity Sensor",
        "Sim Type": "Dual Sim",
        "ROM": "16 GB",
        "Battery Capacity": "5000 mAh",
        "Battery Type": "Li-ion Polymer",
        "Document Viewer": "Yes",
        "E-mail": "Yes",
        "Secondary Camera": "2 Megapixels",
        "Video Recording": "Yes",
        "Flash": "LED",
        "2G": "Yes",
        "3G": "Yes",
        "Bluetooth Version": "v4.0",
        "USB": "Yes, Micro USB",
        "Browser": "Android",
        "HDMI": "No",
        "Headphone Jack": "3.5 mm",
        "Wi-fi Version": "802.11a/b/g/n",
        "Other Connectivity Features": "Bluetooth Support",
        "Video Formats Supported": "MP4",
        "Video Playback": "Yes",
        "Audio Formats Supported": "MP3",
        "Map Support": "Google Maps",
        "Expandable Storage Capacity": "32 GB",
        "Memory Card Slot Type": "microSD",
        "Memory Card Support": "Yes",
        "Warranty": "12 Months",
        "Warranty Summary": "1 Year on Tablet, 6 Months on Accessories",
        "Warranty Service Type": "Carry In",
        "Covered in Warranty": "Manufacturing Defects",
        "Not Covered in Warranty": "Physical Damage",
        "Warranty Period": "12 Months"
    },
    "product_description": {
        "Great Display": "With its 25.6 cm (10.1) HD IPS screen, view videos and photos in great clarity.",
        "Camera": "Take clear photos/videos with its 5 MP rear camera. Use its 2 MP front camera to click amazing selfies.",
        "Powerful Performance": "Seamlessly multitask without any lag as it is powered by a 1.1 GHz quad-core processor. In addition to this, the 2 GB RAM and 16 GB ROM help load webpages quickly and install apps instantly.",
        "Battery Life": "This tab is powered by a 5000 mAh battery.",
        "Dual SIM 4G VoLTE": "Use two 4G SIMs on this phone and make online calls on either SIM using the VoLTE network.",
        "Other Features": "This tab runs on Android Marshmallow."
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "1",
            "5",
            "2",
            "5",
            "4",
            "5",
            "5",
            "1",
            "1",
            "1",
            "2",
            "5",
            "1",
            "1",
            "1",
            "5",
            "1",
            "1",
            "2",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "1",
            "4",
            "5",
            "5",
            "3",
            "3",
            "1",
            "1",
            "5",
            "5",
            "4",
            "5",
            "2",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "3",
            "5",
            "4",
            "3",
            "3",
            "3",
            "5",
            "1",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "2",
            "2",
            "3",
            "5",
            "4",
            "1",
            "3",
            "4",
            "5",
            "2",
            "3",
            "5",
            "5",
            "1",
            "1",
            "5",
            "1",
            "3",
            "3",
            "5",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "2",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "1",
            "3",
            "1",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "2",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5"
        ],
        "review": [
            "What a product....... what a speed, boom boom speed...... Fantastic camera ......i love it .....best product at reasonable price. i am feeling great\nGaming performance is also very good.\nBattery backup is also pretty good.",
            "Excellent Phone, Amazing , Its working perfectly and its a great device with excellent performance, i am very happy with it because its great as described, very good advanced instrument in very low price, so dont think more, just go for it, really value for money.\nIts a nice tab, Good Looking, 1 day delivery Looks like the best phone in this price range , Nice display, feature rich camera.",
            "Ur product is very nice i am very happy as u show the way it is thank you so much",
            "Excellent Product !\nValue for Money !",
            "best over all .if this slate with 3 gb ram will me more fabulous.Excel an micro soft viewer not in this tablet ,you can download from play store . 4 g speed is also good .\nRajesh kumar sinha .\nsolan .",
            "Very good product very smooth touch is responsive till now running fine go for it guys u'll not regret it after buying. In this price range this product is good. Mainly its battery backup is very very good. Im very happy to have this tablet go for it guys go for it. Thanks swipe",
            "i am writing this review after 22 days using. The product is very Excellent performance and very reasonable price i appreciate flipkart for timely couriered",
            "i got this Tablet already, fully satisfied with it, now buying other one for my dad. best price with best features in its class. thank u flipkart",
            "Great Product it is...the packing was nicely done and I am impressed with the service!!!!!!!!!!\nDisplay..(it's crisp and wonderfully)...........\nSpeakers..(sound quality is good)............\nLooks (damn good looks in its class)...........\nExcellent TAB,Amazing..............",
            "Display Is great Touch is smooth. The TAB is very good with good speed n clear voice. Its an amazing TAB.\nGreat Design and performance wise Excellent.",
            "What a product....... what a speed, boom boom speed...... Fantastic camera ......i love it .....best product at reasonable price. i am feeling great\nGaming performance is also very good.\nBattery backup is also pretty good.",
            "Excellent Phone, Amazing , Its working perfectly and its a great device with excellent performance, i am very happy with it because its great as described, very good advanced instrument in very low price, so dont think more, just go for it, really value for money.\nIts a nice tab, Good Looking, 1 day delivery Looks like the best phone in this price range , Nice display, feature rich camera.",
            "Ur product is very nice i am very happy as u show the way it is thank you so much",
            "Excellent Product !\nValue for Money !",
            "best over all .if this slate with 3 gb ram will me more fabulous.Excel an micro soft viewer not in this tablet ,you can download from play store . 4 g speed is also good .\nRajesh kumar sinha .\nsolan .",
            "Very good product very smooth touch is responsive till now running fine go for it guys u'll not regret it after buying. In this price range this product is good. Mainly its battery backup is very very good. Im very happy to have this tablet go for it guys go for it. Thanks swipe",
            "i am writing this review after 22 days using. The product is very Excellent performance and very reasonable price i appreciate flipkart for timely couriered",
            "i got this Tablet already, fully satisfied with it, now buying other one for my dad. best price with best features in its class. thank u flipkart",
            "Great Product it is...the packing was nicely done and I am impressed with the service!!!!!!!!!!\nDisplay..(it's crisp and wonderfully)...........\nSpeakers..(sound quality is good)............\nLooks (damn good looks in its class)...........\nExcellent TAB,Amazing..............",
            "Display Is great Touch is smooth. The TAB is very good with good speed n clear voice. Its an amazing TAB.\nGreat Design and performance wise Excellent.",
            "It's very sorry to say that Flipkart sells such brands & even do not offer proper customer service.\nDespite of mixed reviews on the product I still decided to go for it as the specs mentioned were really good and the price was also a highlight. But the product was delivered I personally faced below problems...\n1. Battery automatically discharges in 2-3 hrs without any usage.\n2. When battery reaches 25% mark tablet switches off automatically.\n3. Even though its a 4G tablet it hardly catches 4G network (tried with Idea and Vodafone 4G) hence speed is very slow.\n4. Camera and flash quality is pathetic, though its given as 5MP but results are like VGA camera.\n5. Flipkart seriously cheats here, I have marked the product return twice, Flipkart rejected. Then finally they agreed to send some technical person to inspect who never turned up. Thus 10 days replacement period is over and I am left with the same piece.\n5. Surely recommend NOT TO BUY this product or similar one which gives rosy pictures but in actual we end in frustration.",
            "Excellent tab worth money. Touch quality super...\nBattery backup super.... Good packing.... Super fast delivery... Go for it",
            "Tab is very good it's working fine….Amazing Tab with super performance for great price............!\nVery good Camera and also well Battery packup.............!",
            "Love this smart Tab its a wonderfully desinged fastest working and beauty full better than any other Tab within this price range.",
            "Good product! After 3 years of use, it is still in good condition. I use it for reading books. Battery could be a bit better though. All in all, a good purchase",
            "Tablet is very nice .diaplay quality is too much good also give a good batery back up.....nice tablet in this price range.",
            "Good one if you want to use it for browsing and watching movies. Not suitable for heavy work or gaming or taking pictures/videos.",
            "Was delivered well before the expectancy date. Product is good. So far cannot upgrade OS to Nougat.",
            "Poor quality prodect\nPoor batter\nPoor camera\nPoor display\nAlready used tab was delivered",
            "Very good product at this awesome",
            "Sometimes automatically stops and restart device and there is also problem in sd memory card slot",
            "So ...in budget... big screen...perfect sound..not so good camera..but overall I'm happy...thanks",
            "Like the product with in this budget. Giving feed back after using 7 days\n+Ves:\nBig Handy Screen, 2GB RAM.\nDisplay Quality is good.\nWifi + 4G SIM. connecting without any issue.\nVery useful for e-books reading and browsing.\ncomfortably playing games, No hang ups so far.\n\n-Ves:\nPoor camera quality.(not expecting a best camera quality with in this budget. that's ok)\nEar Phones are cheap quality.\nSound.(If sound quality is improved, this is the best option instead of buying 15000 tablet)\n\nif you...\nREAD MORE",
            "wow this is a good quality 4g tablet and good running internet",
            "Thanks Flipkart very faster shipping and excellent product",
            "Worst from Flipkart\n\nI am strongly recommends don't buy this product. Most worst product available in Flipkart.\nDisplay: Very Poor\nCall Quality : Very Poor\nTechnical Issues:\nLot of issues with this..\n1. Restarting suddenly..\n2.Ram mentioned as 2GB. But Ram occupied with default apps more than 70%.\n3. Touch not working well.\n4. After 2 days of usage When contact Flipkart customer care they suggested to go to SWIPE care near by you. Hardly i was used 4 hrs. in total 12 days after received this product.\n5. Tab was very poor quality\n6. Tab was very slippery.\n7. Screen protection is not available any where.\n\nFinally i sincerely suggesting Flipkart don't encourage this kind of Faulty products. They are mention on product cleverly.. \"Made in PRC\". This was \"China\" product.",
            "First impression 5 stars.\nFor one day delivery.\nGood budget tablet......",
            "Not satisfied,every time gets permission for apps like \"screen overlay detected\" and screen lock mode is not working even pin was set.Power button and volume buttons are so delecated.\nDisplay of app images are larger appearance.\nThere is no response from techinal support of this product.",
            "Product is not satisfied",
            "Good",
            "Not rootable. Pops up opera ads as notifications and you cannot uninstall opera since it is inbuilt, nor can you root the tab to remove it. Heavily bloated and must be earning heavily due to these ads, so value for money is definitely not what you can say for this tab.",
            "Defect product received .\nThe customer care number not working and always busy ring tone.\nLost the amount after purchasing.\nDon't buy.",
            "Sir, Neither in your manual nor in any pictures or video you mentioned how to insert sim in the Swipe Slate Pro Tab and the sim slot is also very complex, once the sim inserted wrongly it will stuck in it. i bought new tab with great expectation but disappointed in the first impression. there are no guidance anywhere how to put sim in the complex slots and it got stuck, now i have to go to service centre to remove it. it is pathetic without even starting the phone i have to go service centre. please at least upload guidance or mention in your phone manual to how to put sim in the complex slot or make videos on it. there are no input anywhere for help.",
            "I purchased this Tab last week. And I am using it. It is really Awesome. I am happy to purchase it. And its battery is too good. There is no heating problem...",
            "Worst product. How flipkart allow this type of product to sell. ? And there is no option for return.",
            "BAD CAMERA QUALITY like vga\nAND BUILD QUALITY IS NOT camera GOOD (Poor plastic)\nNO SCREEN PROTECTION\nPoor screen resulation\nBattery backup avarage",
            "Very nice product , go for it",
            "delivery was on time that was mentioned product is orginal and is working perftly with out any problem flipkart has made a good trust in mind set of people with its product and delivery hope to shop with you in future",
            "Very good",
            "Product is ok within the price range.",
            "It's very good. I m happy with this product. ☺️",
            "nice And very good Product",
            "Good product",
            "Product is good but m not happy with Flipkart or whosoever the seller was ,as the product seems to be old and used. even there is no protected cover on it and some minor scratches were there too.",
            "Vary nice product",
            "Worst product please don't buy worst build quality ram management is poor better go for Alcatel tab which comes for 9,999 return requests are also denied (rejected) worst costumer service",
            "Nice tab. Good working but screen guard not available.",
            "nice phone i liked the display and camera",
            "Best Tablet for any user. Easy handling good performance",
            "Such nice product but expandible memory is 32 is not good",
            "No profitable. Value for what you pay.",
            "Bad quality",
            "This is an established truth that cheap in price is also cheap some how in quality. The reviews already written are mostly seems sponsored, a new trick to sale their cheap quality product. The Swipe Slate Pro is one of them.",
            "Display Quality Is Awesome with great touch Response.\nPicture quality is good.\nThank you Flipkart and Swipe.",
            "Tab is very good it's working fine….Amazing Tab with super performance for great price.",
            "Has no inbuilt head piece or mouth piece. Alcatel 10\" slate is having it. Otherwise a nice piece of machine. Worth buying.",
            "Good tablet under 8500 Rs..",
            "Not worth the money. A bit slow in performance. Camera is damn bad. Speaker sound and touch is average. Don't think it will last a long.",
            "Ok",
            "Good to see this better for budget price",
            "Fully satisfied with the TAB . I made a right choice,,,",
            "The charger was faulty",
            "Good",
            "Best tab in this price range. Worthy buying",
            "VALUE FOR MONEY\nNice Tab. Performance also very good. Camera also having more features. Totally very good one to suggest to my friends.\nExcellent Product.",
            "Simply superb... ( actually, i am using apple products but 1st liking this one",
            "Finishing is not so good",
            "SUPER DUPER TAB@@@@@@@@@@@@@@@@@@@@@@@@@@@\nGOOD PRODUCT…BAHUT ACHA DEVICE HAI…BATTERY BACK UP BAHUT ACHA HAI......",
            "Very good product at a great price. You can't expect more than this at this price.",
            "Product is good but its not open instantly as it take tomuch time to on.\nsometimes will take more than 5min.\nRest of the features are fine.",
            "Very nice",
            "NICE",
            "Just after one year of use. Screen touch bus unresponsive.",
            "Product is very good but no customer service are any where all service center are fake no call received and if received deny for service provided",
            "good",
            "best tablet under 9000rs",
            "The Product is not good, bad OS configuration, every time it is giving an error in-app access permissions.",
            "Good tablet home and office uses\nworking uses\nand other uses",
            "Stupid product 3 months is getting ptoblem",
            "Product is assme",
            "budget tab I am so happy. than Q flipkart",
            "Nice product",
            "good",
            "Very Useful! Value for money!!!",
            "amazing better backup",
            "Very bad",
            "VERY VERY GOOD TABLET",
            "don't buy....",
            "very worst product, sim doesnt works",
            "very nice product",
            "ok",
            "Great product, was expecting more out of it 6 months of regular usage i got no complaints in any functionality but yes its lags many time in performing small tasks",
            "The screen quality is poor and gives an LCD feel. Build quality of the product not good. Advisable to look for other tabs or phones with larger screen size. Doesn't solve the purpose.",
            "awesome but little laggy",
            "Speaker volume very low.Needs to use headphone.",
            "Very Good Product ,nothing matches price and features.",
            "Product is okay as per the price, but it's very slow because of small ram(2gb) & battery drains very fast",
            "Good product at thi range....no complain except battery backup is very poor...",
            "Betar",
            "Osem",
            "This is tooooo waste product don't buy it",
            "Very bad",
            "Nice product",
            "Horrible product don't buy guys please save your Money.... I bought this tablet a month ago and display got cracked...When I took to the service center they said they can't fix it...They don't have display available....Why sale if u can't provide parts of tablet....I waisted all my money... Please don't buy this crap.",
            "Sim Card Not Deducting. Why these people are sending the product by not working condition",
            "good morning sir this product is not good .Charger is not working .Display is not working i am report costumer service how to replace the product pls help",
            "Nice product",
            "its come with me broken screen and touch not working. it harassed me",
            "Fine",
            "Good one",
            "This is so so product , using from last 1 year",
            "It is best very good. Satisfied",
            "Best product",
            "Dont buy",
            "Good",
            "Good superb #niceone",
            "Simply excellent.crystal clear pics and hd sound together with high speed connectivity .",
            "Dirty product",
            "very nice tab",
            "perfomance guaranteed...fully satisfied..",
            "Good working tab battery backup ok",
            "Value for money. Amazing speed.",
            "good",
            "good product",
            "Nyc product but camera is not nyc",
            "Good value for money. Display good for this price range.",
            "Good",
            "nice and good product",
            "very good product",
            "Value for Money Product; The Best of its kind.",
            "I bought this product last month. Within a week charger stopped working. Even when charging with Samsung charger, the tab is not getting charged over 80%.",
            "Good product and good for volte calling",
            "Exceellent product",
            "Very nice product",
            "Good Product very nice",
            "good and nice product",
            "Good",
            "Value for money, good product.",
            "very good product\n\nit will surpport 5G network also. only week point sim slat and memory card slat",
            "very excellent product",
            "this tablet rock",
            "best tablet",
            "superb tablet",
            "value for money",
            "awesome tablet",
            "nice",
            "This is awesome Tablet in this range, watching movie in this mobile is good experience because of its fhd display, great gaming",
            "Excellent product by SWIPE.......... :)",
            "Best product in the price range",
            "It's superb and battery backup is very good",
            "Best product with best price",
            "Simply superb",
            "Please don't buy. Poor build quality.",
            "Charger is damesed",
            "very bad damaged peace received but no replacement from seller and camera quality very poor display very poor",
            "best tablet",
            "perfact tablet",
            "nice tablet",
            "It's awesome.",
            "Product performance is not good as mentioned in specs. For this rate we can use as a play product even graphic and display is not great.",
            "Superb",
            "No soo good as expected",
            "Thank Flipkart...your services is highly appreciated",
            "Worthy product. Working well. RAM speed also high. Nice product",
            "Good product",
            "Looking but it's like normal tab not so much rich look",
            "Good product for this price,loud speaker",
            "Nice product",
            "value for money",
            "Good product ...I like it..."
        ],
        "likes": [
            "149",
            "46",
            "91",
            "88",
            "5",
            "1",
            "1",
            "1",
            "8",
            "4",
            "149",
            "46",
            "91",
            "88",
            "5",
            "1",
            "1",
            "1",
            "8",
            "4",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "2",
            "2",
            "49",
            "4",
            "1",
            "7",
            "7",
            "25",
            "6",
            "1",
            "5",
            "2",
            "2",
            "2",
            "5",
            "5",
            "4",
            "4",
            "3",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "7",
            "3",
            "3",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "123",
            "91",
            "41",
            "39",
            "6",
            "0",
            "0",
            "0",
            "16",
            "6",
            "123",
            "91",
            "41",
            "39",
            "6",
            "0",
            "0",
            "0",
            "16",
            "6",
            "1",
            "1",
            "2",
            "4",
            "0",
            "0",
            "0",
            "0",
            "4",
            "1",
            "23",
            "0",
            "1",
            "1",
            "1",
            "14",
            "3",
            "2",
            "2",
            "0",
            "0",
            "0",
            "3",
            "3",
            "2",
            "3",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "11",
            "4",
            "4",
            "2",
            "3",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "7",
            "2",
            "2",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1"
        ]
    },
    "qna": {
        "questions": [
            "Q:hdmi point is their",
            "Q:How to insert the sim in this tablet?...Is mini sim same as regular sim?",
            "Q:Can I use video calling with wifi. how is quality of video picture during call as I have bad experience with another device where I was able to see black color instead of picture images.",
            "Q:is it full HD tablet?",
            "Q:have usb cable slot",
            "Q:have dual sim and sd car slot are separate",
            "Q:it is vertical or horizantal",
            "Q:Battery is removeable or not?",
            "Q:Can i call voice and video calling?",
            "Q:speaker sound its good?",
            "Q:Any improvement in swipe products. willing to buy swipe tablet. Past experience wrost. swipe elite plus jun 16 become u/s in Sep 16 company replaced it in Dec. but still u/s. Complete waste",
            "Q:why this product otg suport",
            "Q:supports 4G sim ?",
            "Q:we play heavy game like gta sanandreas on this",
            "Q:this tab which processor used Mediatek or Snapdragon",
            "Q:DOES THIS MODAL AS GORILA GALSS 3",
            "Q:I s this jio 4g supportable",
            "Q:does it connect with precision-pb510 biometric device?",
            "Q:Is both sims are VOLTE support and JIo sim can be activate directly without install Jio apps",
            "Q:can we play games like asphalt 8,coc,modern combat 5,shadow fight 2.....etc",
            "Q:What is about quality of touch",
            "Q:Does it support pen drive?",
            "Q:will it hang",
            "Q:Does it have dedicated memory slot?",
            "Q:some time it is suddenaly stop and not working anything so what we should do for it",
            "Q:any update available?",
            "Q:how is browsing speed?",
            "Q:is it nice tab?",
            "Q:how its battery will be?",
            "Q:how will be video calling quality?",
            "Q:Is it required to install Jio app to work with jio sim"
        ],
        "answers": [
            "A:no",
            "A:Regular Sim.",
            "A:it's not working",
            "A:It is HD. Good display.",
            "A:u can use it via otg. please confirm whether this tab support otg or not",
            "A:yes",
            "A:Its Horizontal",
            "A:not removable...",
            "A:Yes you can both of simultaneously.",
            "A:good but not as loud as you expect.. headphones sounds is great",
            "A:Working Good. Till now i don't face any issue.",
            "A:Yes it's",
            "A:Yess.. I am using Jio sim in it. It supports volte",
            "A:No",
            "A:For this and other clarifications he can write to \"contact us\" at www,justswipe.com",
            "A:No..It doesn't have Gorilla Glass protection.",
            "A:swipe slate pro support jio 4g . but they have provided SIM slots very congested. very very difficult to place dual SIM . voice is very very poor. we are unable to hear voice from other person calls.",
            "A:absolutely .. it will..I got it done .. I fallen in love with tab ..",
            "A:I used only one SIM and have VOLTE support. We can activate Jio SIM without Jio apps.",
            "A:Yes you can play this because it has 2 gb ram and 16 gb internal.",
            "A:Normal function, good touch sensitivity",
            "A:Yes it support",
            "A:Yes.. It is hanging.",
            "A:Yes. now I am using 32 GB memory card with my Swipe tab. it is working smoothly.",
            "A:simply switch of and on it.",
            "A:no updates",
            "A:as 4g volte mobile have. satisfied with it",
            "A:yes",
            "A:of your question regarding the life.. reasonable. Good at this price range though.",
            "A:it completely depends on your internet connection. i had made calls where both were on broadband wifi which was seamless video stream. but on phone data it varied between 3g,4g. with 4gto4g the best.",
            "A:no"
        ],
        "likes": [
            "47",
            "3",
            "3",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "59",
            "82",
            "0",
            "5",
            "0",
            "9",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0"
        ],
        "dislikes": [
            "25",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "11",
            "19",
            "4",
            "2",
            "0",
            "9",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1"
        ]
    }
}