{
    "title": "SAMSUNG Galaxy Tab A 3 GB RAM 32 GB ROM 10.5 inch with Wi-Fi+4G Tablet (Blue)",
    "product_specification": {
        "Model Number": "SM-T595NZBAINS",
        "Model Name": "Galaxy Tab A",
        "Ideal Usage": "Entertainment, High Processing Tasks",
        "Color": "Blue",
        "Connectivity": "Wi-Fi+4G",
        "OS": "Android",
        "Operating System Version": "8.1 (Oreo)",
        "RAM": "3 GB",
        "Voice Call": "Yes",
        "Display Resolution Type": "Full HD",
        "Video Call": "Yes",
        "Supported Network": "GSM, 4G LTE, WCDMA",
        "Display Supported Network": "LTE",
        "Processor Type": "Qualcomm Snapdragon 450 Octa Core",
        "Additional Features": "Quad Speaker with Dolby Atmos Effect, FM Radio",
        "Display Size": "26.67 cm (10.5 inch)",
        "Sales Package": "Tablet, Adapter, USB Type C Cable, User Guide",
        "Display Resolution": "1920 x 1200 Pixels",
        "Primary Camera": "8 Megapixels",
        "Internal Storage": "32 GB",
        "Processor Speed": "1.8 GHz",
        "Sim Size": "Micro SIM",
        "Multi-touch": "Yes",
        "Sensors": "Accelerometer, Gyro, Compass, RGB Light, Hall Sensor",
        "Sim Type": "Single Sim",
        "ROM": "32 GB",
        "RAM Type": "DDR3",
        "Battery Capacity": "7300 mAh",
        "Battery Type": "Lithium Ion",
        "Play Time": "Upto 14 hrs",
        "Document Viewer": "Yes",
        "E-mail": "Yes",
        "Secondary Camera": "5 Megapixels",
        "Video Recording": "Yes",
        "Full HD Recording": "Yes",
        "HD Recording": "Yes",
        "Flash": "Yes",
        "Other Camera Features": "Auto Focus Camera",
        "2G": "Yes",
        "3G": "Yes",
        "Edge": "Yes",
        "GPRS": "Yes",
        "Bluetooth Version": "v4.2",
        "USB": "Yes, USB 2.0 Type C",
        "Browser": "Android",
        "Headphone Jack": "3.5 mm",
        "Wi-fi Version": "802.11 a/b/g/n/ac",
        "Other Connectivity Features": "Bluetooth Support, Wi-Fi Direct",
        "Touch Screen Type": "Capacitive",
        "Other Display Features": "Full HD Backlit LCD Display",
        "Display Type": "PLS",
        "Video Formats Supported": "MP4",
        "Full HD Playback": "Yes",
        "HD Playback": "Yes",
        "Video Playback": "Yes",
        "Audio Formats Supported": "MP3",
        "GPS Support": "Yes",
        "GPS Type": "A-GPS",
        "Map Support": "Google Maps",
        "Expandable Storage Capacity": "400 GB",
        "Memory Card Slot Type": "microSD",
        "Memory Card Support": "Yes",
        "Warranty": "1 Year",
        "Warranty Summary": "1 Year Warranty Provided by the Manufacturer from Date of Purchase",
        "Warranty Service Type": "Carry In",
        "Covered in Warranty": "Manufacturing Defects",
        "Not Covered in Warranty": "Physical Damage",
        "Warranty Period": "1 Year"
    },
    "product_description": {
        "Design": "Featuring a 26.67-cm (10.5) Full HD Backlit LCD Display, the Galaxy Tab A is a visual treat for your eyes. Also, enjoy more out of your smartphone with a clean, plain bezel which offers no distraction.",
        "Cinematic Display": "Enjoy a cinematic-viewing experience right at home with the 26.67-cm (10.5) display and a 16:10 ratio to make your Friday-night movie experience a memorable one.",
        "Quad Speakers": "Any movie is complete only the visuals are complemented by high-quality audio. Featuring Dolby Atmos Technology, this tab automatically adjusts stereo settings according to the screen orientation, providing you with an enriched 3D surround sound experience.",
        "Battery": "With a massive 7300 mAh battery, you can unplug and enjoy up to 14.5 hours of video playback on one charge. Also, thanks to Fast Charging you don't have to wait for a long time to use it.",
        "Smart Home Display": "You can make this tab display your favourite photos, weather forecast, current time or your calendar while it charges, turning it into a smart home display.",
        "Bixby Vision": "So you're on your vacation and are trying to find your way in a new city. In those situations, Bixby Vision is your ideal companion which helps to identify landmarks, and even translates foreign language signs and menus.",
        "Enhanced Performance": "Powered by an AP chipset and 3 GB of RAM, you can run your apps and games seamlessly. Also, with 32 GB of storage space that can be expanded up to 400 GB, you can easily store all your pictures, music, and videos.",
        "Samsung Kids Mode": "With this mode, you can let your kids learn and enjoy using this tablet, while making sure to control their usage time and access to content.",
        "Kids Mode, Reinvented": "With built-in apps and content, this tab indulges your kids' curiosity and serves as an educational tool while keeping them engaged."
    },
    "reviews": {
        "ratings": [
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "1",
            "5",
            "3",
            "4",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "1",
            "4",
            "5",
            "5",
            "3",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "2",
            "5",
            "4",
            "4",
            "1",
            "5",
            "4",
            "1",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "3",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "3",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "3",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5"
        ],
        "review": [
            "I have been using it since 3 weeks now. My feedback is based on my experience with the device in last 3 weeks.\n\n1. Performance & Features - This Tab A has very good ram optimisation and ROM management. It runs fast and easy-to-use. Face recognition is good with secondary lock protection.\nCamera R - Ok with 8MP not great\nCamera F - Not ok with 5MP dose offer good selfie pixels are disgusting.\nAddone - Tap to wake up Screen is good. Lenovo phone are slow in responding.\nSound & Volume - Good mo...\nREAD MORE",
            "Nice tab and looking so good .....camera and battery quality is good I like this tab but price is high but I take my decision to buy this tab in big billion day ... my delivery date its mention 10oct 2019 but I will get fast delivery on date 7oct 2019..... thanks Flipkart for fast delivery",
            "very nice product.Delivered on time.But the accessories like flipcases/covers not available online.Flipkart should ensure that the cover is available online at the earliest",
            "it is very good to use every day . works well and touch is much impressive.",
            "Only tab that offers latest Android version. Having reviewed several tabs, I can confidently say, this is the only large sized tab with close to 95% screen brightness uniformity . But I have to agree that despite non uniform screen brightness, Ipads have a crisp display due to high ppi. The Dolby atmos with quad speakers is certainly a best feature offered by Samsung and one will really appreciate it.iPads miserably fail on audio front. Major pro is good network connectivity, battery life, sound, touch responsiveness and guaranteed pie update. Major cons are slow multitasking capability, with only ~200 ppi, texts on pdfs are little blurred, pathetic auto brightness and quite heavy. Overall recommendation is to buy whenever the price drops like during big billion day or other festive offer days.",
            "Bought in sale effective 17250\nWorks fine though processor is slow\nCannot be compared with my iPad\nBut good media device with sim support\nPossibly worth the money i paid",
            "Hi Guys/Girls...this review is based on my 1 week usage of this Tab. This is an excellent purchase. Tab has a great battery life. With one Charge you can see at least 4 movies. Great display with good viewing angle. It has all the features just like a high end Smart phone.",
            "Hi, I got this tablet for a good price in the big billion offer 2019, it’s worth the price I got it for, nice product it’s better then the 10.1 model of 2019, you can compare and check for your self.\nVery good battery life ! Performance is also great!\nGo for it!",
            "pros\n1- nice big screen\n2- good performance\n3- range wise best tab\n\ncons\n1- poor face unlock\n2- ram should be 4 GB",
            "I m totally satisfied with it's performance . amazingly fast , good touch screen, sturdy, with a big screen. one can enjoy movie, games etc with it.",
            "I have been using it since 3 weeks now. My feedback is based on my experience with the device in last 3 weeks.\n\n1. Performance & Features - This Tab A has very good ram optimisation and ROM management. It runs fast and easy-to-use. Face recognition is good with secondary lock protection.\nCamera R - Ok with 8MP not great\nCamera F - Not ok with 5MP dose offer good selfie pixels are disgusting.\nAddone - Tap to wake up Screen is good. Lenovo phone are slow in responding.\nSound & Volume - Good mo...\nREAD MORE",
            "Nice tab and looking so good .....camera and battery quality is good I like this tab but price is high but I take my decision to buy this tab in big billion day ... my delivery date its mention 10oct 2019 but I will get fast delivery on date 7oct 2019..... thanks Flipkart for fast delivery",
            "very nice product.Delivered on time.But the accessories like flipcases/covers not available online.Flipkart should ensure that the cover is available online at the earliest",
            "it is very good to use every day . works well and touch is much impressive.",
            "Only tab that offers latest Android version. Having reviewed several tabs, I can confidently say, this is the only large sized tab with close to 95% screen brightness uniformity . But I have to agree that despite non uniform screen brightness, Ipads have a crisp display due to high ppi. The Dolby atmos with quad speakers is certainly a best feature offered by Samsung and one will really appreciate it.iPads miserably fail on audio front. Major pro is good network connectivity, battery life, sound, touch responsiveness and guaranteed pie update. Major cons are slow multitasking capability, with only ~200 ppi, texts on pdfs are little blurred, pathetic auto brightness and quite heavy. Overall recommendation is to buy whenever the price drops like during big billion day or other festive offer days.",
            "Bought in sale effective 17250\nWorks fine though processor is slow\nCannot be compared with my iPad\nBut good media device with sim support\nPossibly worth the money i paid",
            "Hi Guys/Girls...this review is based on my 1 week usage of this Tab. This is an excellent purchase. Tab has a great battery life. With one Charge you can see at least 4 movies. Great display with good viewing angle. It has all the features just like a high end Smart phone.",
            "Hi, I got this tablet for a good price in the big billion offer 2019, it’s worth the price I got it for, nice product it’s better then the 10.1 model of 2019, you can compare and check for your self.\nVery good battery life ! Performance is also great!\nGo for it!",
            "pros\n1- nice big screen\n2- good performance\n3- range wise best tab\n\ncons\n1- poor face unlock\n2- ram should be 4 GB",
            "I m totally satisfied with it's performance . amazingly fast , good touch screen, sturdy, with a big screen. one can enjoy movie, games etc with it.",
            "Samsung galaxy Tab A is a good Product for Official Work & For Entertainment Also but Little but Costly..",
            "price should be reduce little more",
            "excellent product....value for money....every function is very nice.....this is the best product of Samsung.....",
            "Amazing for videos and official work...",
            "Face lock is very slow and most of time I will have to use pin or pattern to unlock and could have reduced the price a little bit",
            "very nice",
            "superb..tab\nfast delivery",
            "How can anyone handle a 10.5 tab without flipcover.... which is non existent on Earth... please do arrange from Mars.... Flipkart needs to be more sensitive in customer response",
            "Very Good product .I am requesting flipkart to add a flipcase and other supporting accessories for this Sm-t595NZBAINS Tab so I can easily purchase from flipkart",
            "best fastest tab",
            "awesome product. value for money",
            "I am not going to rate the product, but I will rate Flipkart. While purchasing the product i had clearly selected the EMI option for this product and somehow the EMI option failed to get activated. I called Flipkart to help, as usual their customer service gave me an answer that they cannot help. Their system was the problem and I have to bear the brunt. Absolutely pathetic if they cannot help.\nAll in all, the product is great just avoid purchasing it from Flipkart.",
            "very nice tab a",
            "super",
            "Pathetic. I bought it on Aug 23 and in less than 2 months, the device wont turn on. I took it to the service centre and they informed that the device has a motherboard issue. And then they want to replace the charger and the data cable also. Horrible experience. They didn't even consider replacement. Very dissapointed. I choose Samsung Tab A over Apple iPad, Big mistake. Didn't expect something like this from Samsung. There is really no comparison between Samsung and Apple.",
            "A great tablet for the price range. Have been using it for 2 weeks now and I'm impressed with battery life and overall performance",
            "please also advise where to get a folder and glass top to protect this valuable gadget.",
            "good",
            "Thanks for Samsung & Flipkart. Cheap rate but big performance. I Buy this tab Rs17991.",
            "Thx big billion got it & 17000/-",
            "So far........ so good",
            "by seeing some negative reviews I got scared to order , but due to return policy some how I prepared my mind and ordered, but hats off Flipkart for on-time delivery and first class packing ..\nnext tab nice to use ...",
            "Good tab by Samsung, display and dolby sound is fantastic, battery life is really good, the only negative thing is bit higher price.",
            "ok ok",
            "Wonderful tab. Kindly add accessories like cases, keyboard and Screen protectors for Samsung Tab A 10.5",
            "Amazing tablet. A little costly but, with the various offers, managed to get a steal of a deal. Picked this up for my child and the best feature is the child mode activation thru the Family Link app. You have complete control on what your child does with the device. Don't think twice. Pick it up!",
            "vgood",
            "face unlock is very slow, sometimes not recognizing. Battery life and display is good. processor is not very fast",
            "Good choice",
            "nice 😎👍👍👍👍👍👍👍",
            "Good if compared to other tab.",
            "Product is good...",
            "Excellent sound quality, Extraordinary picture quality and latest features.",
            "I bought it recently.Overall tab was very good.Battery backup was excellent(2days for sure).Only disadvantage is pubg was experiance some lag not mostly but some times we can see delay in frame rate.",
            "Excellent tab must buy",
            "So far, I have used, happy with the performance",
            "total money raised",
            "Terrific purchase. Everything is fine. But otg cable is missing",
            "Amazing Tab... using from 5 months\n\nGood & High Sound quality\n\nGood battery capacity\n\nThanks to flipkart I got this Tab for Rs. 19,999",
            "the ancient processor is the only weak point of the otherwise steal deal at 18000rs. fabulous screen speakers and battery life are its strength. It is quiet hefty but with such a huge batter and lower price range you would have to make that bargin.",
            "I'm happy to get 10,000 discount during big billion days. This 2018 model has better reviews that 2019 samsung model.My cellphone and this tab, both samsung, android 8 have similar settings. So I'm easily navigating through the tab without any hesitation.Only thing, in the specifications, it is wrongly mentioned as MICRO SIM. Infact this tab carries NANO SIM. Overall I'm very satisfied .",
            "Had a software crash within 3 months. Had to send it way for repairs. Performance still unsatisfactory post repairs by Samsung. Flipcart, do you care enough to replace the product? I guess not...",
            "Slim & Simple tablet..",
            "nice one",
            "Excellent",
            "All are good but I want now invoice in this regards",
            "Not good",
            "Good product.",
            "There is only one drawback.. no s pen works on it .. other than that it has amazing display.. dolby atmos speakers makes mobie watching epic.. and every thing is great...",
            "I like it very much,it is a nice product",
            "Flipkart is always excellent. Good service and high quality of items👌👌👌",
            "Good and handy product,\nfor both purpose phone\nand infotainment",
            "Good Product. and fast delivery",
            "Good tab value for money runs on Android 9 updates are good ...",
            "Poor and very slow performance after few months.",
            "Lovely.I like it.",
            "Wonderful",
            "Nice thing",
            "Defaulted product",
            "Ok",
            "Nice product I am happy with this product tq filpkart",
            "Phone not refund.",
            "Good product",
            "Good device",
            "Good product from samsung . But samsung tm. Didn't sent headset in the box",
            "It's a good product and since it bought in sale time the price was also good",
            "See basically it depends on your requirement. If u want a large screen experience, this one is for u. If its painful for u to live with small font size of your phone, this one is for u. But if u want a tablet for gaming then its performance will disappoint u. It also hangs when we rotate the screen from porttrait to landscape mode. Its internal memory is just 32 gb. But it can be compensated with 400 mb memory card. So its a mixture of pros and cons. Usb type c port can be found anywhere and pen drive/usb/data cable can be attached easily. Jio sim 4g compatible. Thanks",
            "ultimate",
            "Product is very good and I would definitely recommend to go for it..",
            "screen is big for watching movies\nbattery backup is also\nif pencil support is added it would be more better",
            "worth the money",
            "camera quality is bad . it's accessories not available on Flipkart",
            "Valuable tablet, for money. Happy with this.",
            "Excellent product",
            "Good Device with high price",
            "fabulous. more RAM required....",
            "nice Product",
            "Superb product. Tab is little heavy to carry .",
            "it's Good..\nmobile calling is not working\nppt also not working...\n\nfor watching movies gaming is good..\n\nmy kids love it...",
            "awesome product...I luved it..",
            "Smart and Sexy look. I claimed exchange offer, but Delivery boy refused because of some dents on the back cover. Later came to know from many people that Flipcart generally do so!!!",
            "good product",
            "best battery backup",
            "excellent",
            "Really Nice Product From SAMSUNG I Purchased On BB Day Offer @ Rs.18000/- Value For Money",
            "very good product",
            "Fabulous device. Good for wifi & 4G voice tablet. Best device in Tablet.",
            "processor is slow but overall nice tab.",
            "Battery last for long and performance is decent enough. 10.5 inches screen feels really big enough. Volume and sound quality is good. Product quality is decent. There is an option to connect external keyboard but it's seems to be not available in the market.",
            "worth buying",
            "awesome product and useful too...",
            "Value for money....Good",
            "got an update Immediateley after unboxing 😍",
            "thanku so much flipkart",
            "All is good but some banking exam form filling site are not open . plz fix this problem.",
            "amazing product",
            "I bought it for my son on the big sale event... Samsung display as usual is fab... but there is nothing unique about this device",
            "games like pubg is not made for this device worst performance for pubg game.",
            "AMOLED display is missing. Except display and camera, remaining are excellent. Android pie update is given. It is equivalent to latest 2019 tabs.",
            "Nice product as expected. Felt a small lag sometimes while browsing web sites. Little heavy. Need to be lighter.",
            "Woow best tab.... sure go for it",
            "its overall good tab. battery backup is 10/10\ncamera 7/10\ndisplay. 8/10\nperformance 7/10\nover all 8/10",
            "very good",
            "awesome product",
            "I am very happy.",
            "great product, must buy, value of money, Samsung should give accessories like earphones, screen protector, and cover",
            "Price is little bit too much",
            "very good product",
            "none of the apps can be downloaded from Google Play Store.\neven if you download any app from a proxy site ,it won't open bcz the device wants a updated app\nhopeless device",
            "good for students",
            "This tab is bad compared apple iPad 2018 that one can buy for a slightly lower price than this. Although the configuration of apple iPad seems less than this, the iPad doesn't hang as much as this galaxy tab a . However if you want a tab with cellular option, galaxy tab a may be a good option in this budget range",
            "Nice product",
            "Super excellent purchase thank you flipkart",
            "superb tab...",
            "Face unlock very slow and defective. Poor display. Although dolby digital output , speakers should have more powerful.Only good thing is battery backup.Perfomance us not at per price.",
            "excellent tab",
            "amazing tab !!! best features qnd effective price",
            "otg doesn't support, main drawback, rest all fine",
            "nyc product as compared to money .....VERY NICE",
            "super",
            "everything is good"
        ],
        "likes": [
            "173",
            "25",
            "8",
            "2",
            "4",
            "1",
            "1",
            "0",
            "0",
            "0",
            "173",
            "25",
            "8",
            "2",
            "4",
            "1",
            "1",
            "0",
            "0",
            "0",
            "113",
            "90",
            "34",
            "20",
            "121",
            "7",
            "22",
            "143",
            "28",
            "28",
            "7",
            "14",
            "5",
            "10",
            "15",
            "3",
            "3",
            "3",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "7",
            "5",
            "4",
            "3",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "5",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "26",
            "1",
            "1",
            "0",
            "2",
            "0",
            "2",
            "0",
            "0",
            "0",
            "26",
            "1",
            "1",
            "0",
            "2",
            "0",
            "2",
            "0",
            "0",
            "0",
            "13",
            "19",
            "5",
            "2",
            "31",
            "0",
            "3",
            "63",
            "8",
            "9",
            "0",
            "2",
            "0",
            "4",
            "8",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "5",
            "4",
            "3",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "7",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1"
        ]
    },
    "qna": {
        "questions": [
            "Q:Does it support fast charging",
            "Q:Does it support face lock",
            "Q:is there any 4 gm RAM tab available in market or online shop fot gaming purpose?",
            "Q:Will PUBG run smoothly on this tab",
            "Q:can I type using inbuilt keyboard easily or its too big for that?",
            "Q:can we use WhatsApp in ot or install from play store?",
            "Q:can I work in this tab with Ms Office,photoshop,Coreldrow,etc",
            "Q:it can play pubg??",
            "Q:does it have super amoled display or TFT display?",
            "Q:does it support stulus pen and one note application",
            "Q:Does this tab 10.5 inch Galaxy tab A will work with S pen if I purchase S pen saperately",
            "Q:does it have auto display wakeup or Everytime have to press power button ?",
            "Q:can we play pubg in UHD in this",
            "Q:Can i take notes",
            "Q:does it work in other countries?",
            "Q:can use stylus pen",
            "Q:1. it can play pubg? as i am purchasing only for pubg. 2. is it comes with any type of stand,if we want to use it as laptop.",
            "Q:will it support bluetooth printer ?",
            "Q:Can we use it as a laptop",
            "Q:is it play videos smoothly on youtube?",
            "Q:what is the battery backup of this tab",
            "Q:can we use thus tab for voice call ?",
            "Q:Does it support single sim ? Please Answer me",
            "Q:Is it running high end games smoothly?",
            "Q:When will be available screengaurd and cover of this???",
            "Q:does it support 4g volte ?",
            "Q:does it support full hd videos..?",
            "Q:does it have head phone",
            "Q:Does this tab have always on display feature?",
            "Q:can we use dual sim?",
            "Q:does it support any sim expect jio",
            "Q:can we use 1tb hard drive/disk for data transfer?",
            "Q:it is a sim tab",
            "Q:how to activate initilay this tablet without sim?",
            "Q:does it support Jio sim (4G Volte LTE)?",
            "Q:Does it have eye protection mode?",
            "Q:can it run footnote in it",
            "Q:what about software update options? does it show software update options?",
            "Q:can i connect it with samsung tab s4 keboard cover",
            "Q:can printer attach ?",
            "Q:does it have game lancher",
            "Q:does it have finger print security scan",
            "Q:Can do vedio chat ??? Can I do calls ?? Can I use Gio sim ??",
            "Q:does it have finger prints",
            "Q:Can we do video calling like Skype and all? Please anyone help.",
            "Q:Microsoft Word and PowerPoint asking for 365 Subscription to use it. Is there any way to use Basic version for free like other android devices or 365 subscription is necessary??",
            "Q:Does it has fingerprint sensor to unlock?",
            "Q:can we work on Microsoft word excel PowerPoint wasaapp face book copy paste options otg cable etc",
            "Q:does it support volte calling",
            "Q:Is it perfect device for watching movies and video or games",
            "Q:Can it handle heavy games like PUBG and Asphalt 9 legends??",
            "Q:Can we coonect key pad",
            "Q:does it come with S-pen in the box?",
            "Q:Can It run DLS Smoothly?",
            "Q:water proof yes or no?",
            "Q:Does Galaxy TAB A support both wifi & 4G LTE?",
            "Q:Can we upgrade its android version from Oreo to Android 10?",
            "Q:is it have calling specification????",
            "Q:ISN'T IT LED SCREEN?????",
            "Q:Does it support pen drive and OTG compatibility",
            "Q:does it support wireless charging??",
            "Q:does it support MS IFFICE APPS AND ADIBE READER ?",
            "Q:Can i play fortnite?",
            "Q:Which colur should we go for. Black or Blue",
            "Q:reply about pen compatibility ..",
            "Q:does it come with a earphone",
            "Q:No flip case is available....from which site to buy?",
            "Q:it has fingerprints lock",
            "Q:is there any ootion for android update to latest version of 2020? because i m buying in 2020",
            "Q:is it warm if i play pubg in high graphics for long time",
            "Q:Body is made up of plastic or metal",
            "Q:does this model support 4G connection?",
            "Q:does this have pen drive compatibility?",
            "Q:suggest me best book cover and tempered glass for this tablet?",
            "Q:how many ram it has",
            "Q:Does it support Spen or any Pen ?",
            "Q:does s pen works with this",
            "Q:it comes with pencil",
            "Q:does it support to hotspot",
            "Q:how many games can we install",
            "Q:does it support desktop mode?",
            "Q:Does this tab supports stylus pens ? If yes then please do suggest me regarding buying ...Thank you",
            "Q:does it's support pubg",
            "Q:Can we hear music and watch movies?",
            "Q:does it support bluetooth ?",
            "Q:can it play 4k movies",
            "Q:is it have photoshop app?",
            "Q:how is the battery life in terms of screen on time?",
            "Q:how can i get the real information about RAM on this device. because i cudnt find anywhere this devices RAM",
            "Q:can we down load english to other languages apps and work",
            "Q:can the word and excel or sap can be install in it....",
            "Q:I want to use for laptop purpose and for work with pen.does it work",
            "Q:does it have microphone",
            "Q:What all are contained in the box?",
            "Q:DOES WHATUPPS WORKS",
            "Q:can be use for office work",
            "Q:Does it support HDMI connection???",
            "Q:can hdmi cable be attached to it and projected to tv?",
            "Q:Can we use or connect S-Pen with this Tab? Simple question why you delete my qualification?"
        ],
        "answers": [
            "A:Yes",
            "A:yes, it does",
            "A:check ipad",
            "A:Yes i play pubg in HD Mode",
            "A:yes it's quite big and comfortable screen so you can easily type using inbuilt keyboard.",
            "A:yes",
            "A:yes",
            "A:yes",
            "A:it's an LCD TFT Display",
            "A:yes",
            "A:no , it don't support s pen",
            "A:It does have display wake up. Whenever it's flip cover is opened, it wakes up. Also, double tap on screen wakes it up.",
            "A:No. the processor and RAM is not sufficient. gaming in uhd is not possible.",
            "A:Yes absolutely.",
            "A:Yes",
            "A:Yes",
            "A:It can play pubg. There is no stand",
            "A:yes it supports",
            "A:In my opinion this tab can use as laptop, but with Limited function, I am using now",
            "A:Yes, this tab streams Youtube videos smoothly",
            "A:5 to 6 hr of continuous use",
            "A:yes can use this Tab for voice call",
            "A:yes one single sim for calling and network",
            "A:Yes, so far I haven't seen issues",
            "A:available online",
            "A:yes",
            "A:yes",
            "A:No",
            "A:yes it has",
            "A:yes you can.",
            "A:yes",
            "A:yes offcourse.",
            "A:It's not very slim. But it's very good and easy to handle.",
            "A:you can use wifi net.",
            "A:Yes",
            "A:You can switch off the white light mode which is harmful for the eyes and make it night mode.",
            "A:no",
            "A:yeah it did.",
            "A:No USB only Bluetooth connection to the tablet",
            "A:no",
            "A:No Buddy it does not.",
            "A:no",
            "A:yes.. it's same as a smartphone",
            "A:no",
            "A:yes you can. you can also use it like a phone to make calls with a sim card for the LTE variant",
            "A:no need of 365 subscription",
            "A:No",
            "A:All above applications except Whatsapp are working. i have not tested whatsapp and don't even plan to.",
            "A:yes...I'm using jio in it",
            "A:It's good for movies.For games it depends on the kind of games you play.For high end games it's okish.",
            "A:yes you can but performance up to mark",
            "A:Yes, you can connect Samsung Compatible Keyboard.",
            "A:no",
            "A:It should play as Tablet specs are better than game requirements. Haven't tried myself as I have purchased the Tablet for my mom.",
            "A:No sir but tab is good",
            "A:Yes, certainly.",
            "A:Yes",
            "A:yes",
            "A:No, it has ips lcd screen, with full HD resolution",
            "A:yes",
            "A:no",
            "A:Yes please I think so it's suport",
            "A:Yes.",
            "A:Black. The classic.Blue would look rather gaudy. Even cheap. An eyesore, may be.",
            "A:👌 ok",
            "A:No",
            "A:at present not available on any site, you need to wait",
            "A:No. it only has face recognition. It doesn't have fingerprint",
            "A:No option of patch up for android update to latest version of 2020",
            "A:yet I have not played pubg in high graphics but yes it get heated after playing games for long hours.",
            "A:Plastic",
            "A:Yes it is",
            "A:No.",
            "A:i don't think you will find a tampered glass this big in size. you can go for a flip cover with a stand. That's the best option for safe and hassle free usage of the tablet.",
            "A:3gb ram",
            "A:No",
            "A:it doesn't come with a S pen. But probably it will work",
            "A:No",
            "A:Yes",
            "A:it's a 3 gb ram so calculate accordingly.",
            "A:Yes",
            "A:Does not support stylus pen",
            "A:yes it does. but can hang in btw. better opt for good processor and good ram cellphone.",
            "A:yes",
            "A:yes",
            "A:No",
            "A:No",
            "A:all features include battery life are good.",
            "A:3gb ram",
            "A:you can change language",
            "A:no",
            "A:No, it doesn't support Pen. not recommended for your usage as a Laptop",
            "A:yes",
            "A:Charger and user manual only",
            "A:Yes, definitely.",
            "A:yes",
            "A:No",
            "A:No",
            "A:No."
        ],
        "likes": [
            "110",
            "15",
            "12",
            "15",
            "5",
            "5",
            "7",
            "14",
            "0",
            "3",
            "7",
            "11",
            "2",
            "2",
            "2",
            "7",
            "7",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "3",
            "1",
            "1",
            "2",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "134",
            "131",
            "5",
            "5",
            "11",
            "8",
            "11",
            "3",
            "2",
            "2",
            "0",
            "3",
            "1",
            "4",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0"
        ],
        "dislikes": [
            "29",
            "3",
            "2",
            "5",
            "0",
            "0",
            "1",
            "5",
            "0",
            "0",
            "3",
            "7",
            "0",
            "0",
            "0",
            "5",
            "5",
            "1",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "5",
            "1",
            "1",
            "1",
            "2",
            "8",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "2",
            "0",
            "2",
            "0",
            "1",
            "1",
            "3",
            "3",
            "0",
            "0",
            "41",
            "62",
            "1",
            "0",
            "2",
            "1",
            "3",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "6",
            "2",
            "3",
            "4",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "4",
            "18",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    }
}