{
    "title": "Lenovo Tab 4 8 Plus 3 GB RAM 16 GB ROM 8 inch with Wi-Fi+4G Tablet (Aurora Black)",
    "product_specification": {
        "Model Number": "TB-8704X",
        "Model Name": "Tab 4 8 Plus",
        "Ideal Usage": "Entertainment, Gaming",
        "Color": "Aurora Black",
        "Connectivity": "Wi-Fi+4G",
        "OS": "Android",
        "Operating System Version": "7.0 (Nougat)",
        "RAM": "3 GB",
        "Voice Call": "No",
        "Display Resolution Type": "Full HD",
        "Supported Network": "GSM, WCDMA, 4G LTE",
        "Display Supported Network": "LTE, GSM",
        "Processor Type": "Qualcomm Snapdragon 625 (MSM8953) Octa Core 64-bit Processor",
        "Operating Frequency": "GSM: B2/B3/B5/B8, UMTS: B1/B2/B5/B8, 4G FDD LTE: B1/B2/B3/B4/B5/B7/B8/B20, 4G TDD LTE: B38/B40",
        "Additional Features": "Microsoft Powerpoint, Microsoft Word, dual glass casings for the front and back, Lenovo Account, OneDrive Microsoft, Skype, OneNote Microsoft, Lenovo Framework, Lenovo SYNCit, Microsoft Outlook, Dolby Atmos Sound, Lenovo Applications: Lenovo SHAREit, Lenovo User Experience (UE), Microsoft Excel, 2 x Front Facing Speakers, Netflix, Third Party Applications: Google Calendar",
        "Display Size": "20.32 cm (8 inch)",
        "Sales Package": "Tablet, Charger, USB Cable, Quick Start Guide, Warranty Card",
        "Display Resolution": "1920 x 1200 Pixels",
        "Primary Camera": "8 Megapixels",
        "Internal Storage": "16 GB",
        "Processor Speed": "2 GHz",
        "Sim Size": "Nano SIM",
        "Multi-touch": "Yes",
        "Graphics Processors": "Qualcomm Adreno 506",
        "Sensors": "G-Sensor, P-Sensor, L-Sensor, Vibrator, Hall Sensor, Fingerprint",
        "Sim Type": "Dual Sim",
        "ROM": "16 GB",
        "Battery Capacity": "4850 mAh",
        "Battery Type": "Li-ion Polymer",
        "Internet Browsing Time": "WiFi: Over 8 Hours, 3G: Over 8 Hours, LTE: Over 8 Hours",
        "Play Time": "Over 8 Hours",
        "Document Viewer": "Yes",
        "E-mail": "Yes",
        "Secondary Camera": "5 Megapixels",
        "Video Recording": "Yes",
        "Flash": "LED",
        "Other Camera Features": "Auto Focus Rear Camera, Fixed Focus Front Camera",
        "2G": "Yes",
        "3G": "Yes",
        "Bluetooth Version": "v4.2",
        "USB": "Yes, USB Type C",
        "Browser": "Android",
        "Headphone Jack": "3.5 mm",
        "Wi-fi Version": "802.11 a/b/g/n/ac",
        "Other Connectivity Features": "Bluetooth Support",
        "Other Display Features": "60% Color Gamut, 390 nits Brightness, 10 Point Multi-touch Display",
        "Display Colors": "16.7 M",
        "Display Type": "IPS",
        "Video Formats Supported": "MP4",
        "Video Playback": "Yes",
        "Radio Support": "Yes",
        "Audio Formats Supported": "MP3",
        "GPS Support": "Yes",
        "GPS Type": "A-GPS, GLONASS, Beidou",
        "Map Support": "Google Maps",
        "Expandable Storage Capacity": "128 GB",
        "Memory Card Slot Type": "microSD",
        "Memory Card Support": "Yes",
        "Warranty": "12 Months",
        "Warranty Summary": "1 Year on Tablet, 6 Months on Accessories",
        "Warranty Service Type": "Carry In",
        "Covered in Warranty": "Manufacturing Defects",
        "Not Covered in Warranty": "Physical Damage",
        "Warranty Period": "12 Months"
    },
    "product_description": {
        "Full HD Display for Captivating Visuals": "From Netflix to video games, enjoy a wide-angle viewing experience on the 20.32 cm (8) FHD display.",
        "High-quality Audio": "Enjoy your favourite tracks to the fullest, with or without headphones, thanks to the Dolby Atmos technology.",
        "Sleek and Lightweight": "With 7 mm thickness and weighing only 310 grams, it is easy to carry around by anyone.",
        "Performance That Commands Respect": "A Qualcomm Snapdragon 64-bit quad-core processor, 3 GB of RAM and 16 GB of internal memory make for a seamless and fast user experience.",
        "One Tablet, Multiple Accounts": "Each member of the family can have their own account with individual passwords, settings and social media accounts, all on one tablet."
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "4",
            "5",
            "4",
            "5",
            "2",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "1",
            "4",
            "1",
            "2",
            "4",
            "5",
            "2",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "3",
            "4",
            "5",
            "3",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "1",
            "1",
            "1",
            "1",
            "4",
            "5",
            "1",
            "1",
            "1",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "1",
            "3",
            "5",
            "1",
            "1",
            "4",
            "4",
            "4",
            "5",
            "1",
            "5",
            "4",
            "4",
            "5",
            "3",
            "4",
            "2",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "2",
            "5",
            "5",
            "2",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "1",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "3",
            "2",
            "5",
            "4",
            "5",
            "1",
            "4",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "4",
            "3",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "4",
            "3",
            "5",
            "4",
            "1",
            "5",
            "5",
            "4",
            "4",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "1",
            "3",
            "4",
            "5",
            "1",
            "3",
            "4",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "4",
            "5",
            "5",
            "1",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "5",
            "2",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "5",
            "2",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "2",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        "review": [
            "After using for 2 months\nFirst of all the main difference between tab 4 8 plus and tab 4 8 is hd display and ram variant and 8 plus is 20 gm lighter than tab 4 8\nExcellent product no lag found till now\n1(a).crisp clear hd display,its a treat to watch or operate anything whether watching movies or playing games\n1(b).easy to hold ,easy to operate the tablet as it's weighs only 300 gms ,it doesn't feel a heavy tablet,its like a big phone\n1(c).Where is quick charge\nit takes a long time to charge compare to normal usb,but battery still longs till 2 days\n\n2.Decent camera\nU can't expect a good camera from a tablet still does decent job\n3.no volte support ,it will do work from jio voice app\n4.excellent performance whether it's a gaming or any office work ,this is the usp of this product\n5. Hybrid sim slot\n5.(a) awesome sound ,u can customize the sound as desire.,there is a separate app for sound.\nOverall deserves 4.5 star\nU can't find the better product in this range in comparison to tablet\n6.It's a long time when great android tablet comes since 2015\n7.Interesting ,no indian review found of the product on YouTube neither by geekyranjit or technical sharma\n8.scrolling(up to down ,down to up ,it's like circle button of mouse)problem solved:::under developer option ,search for drawing option then turn off window, animation,transition scales , scrolling will work smooth as butter or either you just root your device and change the value on build .prop (scrolling section) ,just reboot and see the magic",
            "First impression of lenovo tab 4 8 plus. I was little bit of disappointed after seeing the specification where it is written no voice call and only 16 gb ROM. As I was waiting for this tab since the announcement made in feb'17. During BBD all another version launched but this one is not. Now my wait is over and I received the tab within 2 days of order.\n\nDesign- Galssy and classy just similar to Sony Xperia z5. Top notch design looks like premium one.\nDisplay- Very Good but not great when compared with Sony Xperia display which I have. Full HD with somewhat less vibrant in color reproduction. Perfect size 8\" for better viewing.\nCamera-Average, no complain as not very much necessary.\nProcessor/RAM/ROM- Faster processing, 1.3gb RAM & 8gb ROM available for user.\nSpeaker- Loud and clear.\nCalling & Internet - yes it supports voice call in factory installed version. Don't know about future updates. Internet surfing is fast and it depends on carrier.\n\nI compare this tab with Sony Xperia mobile as I am big fan of Sony and currently using Xperia mobile. This is my second lenovo tab and it worth to have one at this price.",
            "Looks beautiful! Sound is beautiful, with the Dolby Atmos.. Feels a li'l slipperry due to the glass back(and no cases available yet!!). Performance is neat i thought. Fast. 3gb seems to be enough although I've not tried playing games.. But there's barely any Memory left for our use as about 7gb is used up in the OS.. The reason i waited and bought this one was the display - 283ppi. Especially since I'm planning to use it as a reading tool as well. Overall happy after 2 days of use!",
            "a good tab right now in the market ... in this price. range\nbut there is one major issue is internal storage the storage is just 16 gb its very low for gamers like me . and battery is not so good ...\notherwise its great choice 👌",
            "Ok, so I ordered Alcatel A3 tab after reading good reviews, however, I was not sure of Mediatek processor performance. Hence ordered Tab 4 8 plus\n\nComing to Tab 4 8plus if you in Maharashtra it will be delivered to you in 1 day. Here is my experience after using it for 2 days\n\nPros:\n\nGood Built Quality and looks good, glass back, pretty light weight\n\nAmazing speakers, dual front firing with Dolby Atmos, excellent via headphone jack as well.\n\nGood battery life and performance, Snapdragon 625 never disappoints. Could play high end games without device heating up.\n\nFingerprint sensor works fine\n\nGood touch, viewing angles as it is IPS full HD display\n\nNougat 7.1, got 1 gb update already\n\nGood split screen window\n\nLed notification light\n\nExpandable MMC upto 128gb, Hybrid slot\n\nJio internet will support but not sure of VOLTE as haven't inserted the sim yet.\n\nCONS:\n\nFingerprint magnet, its black glass attracts a lot of finger print at back\n\nCharger is 5.2v 2amp, not fast not slow, it's decent. I would say it is nit picking and will not bother you as battery last long\n\nBiggest con is 16gb Inbuilt spave out of which 7.5 or 8 gb is used by system. However you can add a micro sd card.\n\nScrolling issue, I am not sure if this is a bug or something to go with integration of Apps, scrolling is not that smooth inside some apps, don't get me wrong here, there is no lag but the scrolling needs to be pushed a little which is not that fluid, I am sure it can be fixed via a update. However you will not notice any lag in the laucher or while opening apps. It is just some apps.\n\nTo end the review here, If you have budget of 15k plus go for this tab it will not dissapoint you. No device is perfect\n\nTry Nova laucher and Computer Laucher",
            "First of all thanks to FLIPKART for your quick delivery in 24 hours without extra cost. Wel done and keep it up.\n\nProduct: Lenovo TAB 4 8 Plus\nType: LTE Call 3GB+16GB\nModel: Lenovo TB-8704X\n\nOrder date: 10.10.2017, 09:30 Hrs.\nDelivery date: 11.10.2017, 09:35 Hrs.\n\nVery Good Product.\n\nDon't compare this product with any other tablet in this price range. Nice looking. I liked it's richness.\n\nThis is a calling tablet. Can't understand why Flipkart's specification say NO VOICE CALL. Questions / clarifications before placing the order not supported by Flipkart site. Just I taken a chance at my risk.\n\nIt is a DUAL NANO SIM (hybrid) tablet. Lenovo would have made it as dedicated SIM Slot.\n\n16 GB builtin may be insufficient. System consumes lots of space (about 9 GB) when I got in my hand. I couldn't get 64 GB version because of the verdict, Lenovo is not releasing 64 GB version. Anyhow 128 GB external storage may compensate the lacking.\n\nLatest Android 7.1.1 is very much appreciated with full of feature.\n\nI Feel, Protective sleve or case is must to handle this tablet because of the glass finish at back. It may slip from the hand while using. But good finishing.\n\nFlipkart / Lenovo would have provided Exchange Option ???\n\nRecommending for safe and good packing from the seller, i.e., M/s. Health and Happiness Pvt. Ltd.,. I appreciate your commitment in delivering the product in time as assured above.\n\nDelivery person is very obedient. Good guy.\n\nAs a LENOVO fan since from a decade, once again I am satisfied with this product (this is my 14th Lenovo product) in my kitty.\n\nAll the best and Diwali Wishes to:\nM/s. Lenovo (India) Pvt. Ltd., and Team.\nM/s. Flipkart and Team.\nM/s. Health and Happiness Pvt. Ltd., and Team",
            "Got it with 10% cashback with Axis bank card and also rs. 200 instant cashback.\nWriting this review after almost 20 days of usage:\nAt the price of 16K its a really good tablet. I wanted a tab with qualcomm snapdragon processor and with more than 2gig RAM. Found this tab to fulfil my required specs. This is a 3GB RAM + 16GB internal memory version comes with Android 7.1.1 out of the box plus few updated that were downloaded later. Works very smooth. One feature i like most is for few apps you can share screen and run two simultaneously. Even in that mode no lag is observed.\nMain purpose of my usage goes into lot of browsing along with whatsapp and youtube plus online video lecture streaming. I observed that it streams HD 1080 videos without any lags and no hangs or lags eveb after app streaming videos is closed. I have used Samsung Tab2 GT P3100 for around 4 and half years and brought this tab when my previous tab entered the restart loop with no effect of factory reset also.\nI can say its a definitely go for tab for this budget. Sound is good and sufficient. Display is superb. Volume and power button appears to be sturdy when pressed. Power button has a fingerprint sensor and it works great and fast. Weight is less, slim design and feel is premium although the glass back and screen surface attract fingerprint a lot. But design is simple and superb. Notification light is helpful. I found screen brightness to be sufficient and i can say its more tgan sufficient. Display clarity and color is great. Both camera are good and suffice the purpose. I havent tried low light photography yet and not used the flash too. Camera software does not have much settings available.\nOf 16GB internal memory more than half is resreved by system which is quite high. But expandable memory via microSD card is present so no issue.\nOne thing i felt is that it slips off easily if kept on uneven surface.so you need to be carefull if it is kept on lap while sitting or so. Also no cover is available. But thats not an issue for me.\nEvery time i use it i found it value for money and feel to have made correct decision in selecting this tab.\nI definitely recommend this tab for budget of 16k.\nAnd as always flipkart service was up to mark with timely delivery and great price.",
            "Good tab for price . Not a big fan of camera on tabs and mobile's . Can take decent photo . Space is an issue as it gets clogged fast in spite of putting extra SD card which the tab takes up and cannot be used elsewhere . Performance issues not much as I am only a light user of it . Me and kids using it with seperate user interface which is very nice . Inspite of multiple users it responds well . The finger sensor on the main On Off button is also cool as it changes the user also automatically .",
            "This tab is just amazing in very good price screen quality is good camera also good and smooth in use",
            "Writing this review after using two months. I don't like the display at all, compared to my mobile (letv le 1s) it's so dull, And it also crash every now and then. Most of the play store's apps are not compatible with this tab (may be bcz of larger display but I installed them Anyways), the few things I liked about this tab is sound , USB type c and built quality. Battery is average 4-5 screen on time",
            "After using for 2 months\nFirst of all the main difference between tab 4 8 plus and tab 4 8 is hd display and ram variant and 8 plus is 20 gm lighter than tab 4 8\nExcellent product no lag found till now\n1(a).crisp clear hd display,its a treat to watch or operate anything whether watching movies or playing games\n1(b).easy to hold ,easy to operate the tablet as it's weighs only 300 gms ,it doesn't feel a heavy tablet,its like a big phone\n1(c).Where is quick charge\nit takes a long time to charge compare to normal usb,but battery still longs till 2 days\n\n2.Decent camera\nU can't expect a good camera from a tablet still does decent job\n3.no volte support ,it will do work from jio voice app\n4.excellent performance whether it's a gaming or any office work ,this is the usp of this product\n5. Hybrid sim slot\n5.(a) awesome sound ,u can customize the sound as desire.,there is a separate app for sound.\nOverall deserves 4.5 star\nU can't find the better product in this range in comparison to tablet\n6.It's a long time when great android tablet comes since 2015\n7.Interesting ,no indian review found of the product on YouTube neither by geekyranjit or technical sharma\n8.scrolling(up to down ,down to up ,it's like circle button of mouse)problem solved:::under developer option ,search for drawing option then turn off window, animation,transition scales , scrolling will work smooth as butter or either you just root your device and change the value on build .prop (scrolling section) ,just reboot and see the magic",
            "First impression of lenovo tab 4 8 plus. I was little bit of disappointed after seeing the specification where it is written no voice call and only 16 gb ROM. As I was waiting for this tab since the announcement made in feb'17. During BBD all another version launched but this one is not. Now my wait is over and I received the tab within 2 days of order.\n\nDesign- Galssy and classy just similar to Sony Xperia z5. Top notch design looks like premium one.\nDisplay- Very Good but not great when compared with Sony Xperia display which I have. Full HD with somewhat less vibrant in color reproduction. Perfect size 8\" for better viewing.\nCamera-Average, no complain as not very much necessary.\nProcessor/RAM/ROM- Faster processing, 1.3gb RAM & 8gb ROM available for user.\nSpeaker- Loud and clear.\nCalling & Internet - yes it supports voice call in factory installed version. Don't know about future updates. Internet surfing is fast and it depends on carrier.\n\nI compare this tab with Sony Xperia mobile as I am big fan of Sony and currently using Xperia mobile. This is my second lenovo tab and it worth to have one at this price.",
            "Looks beautiful! Sound is beautiful, with the Dolby Atmos.. Feels a li'l slipperry due to the glass back(and no cases available yet!!). Performance is neat i thought. Fast. 3gb seems to be enough although I've not tried playing games.. But there's barely any Memory left for our use as about 7gb is used up in the OS.. The reason i waited and bought this one was the display - 283ppi. Especially since I'm planning to use it as a reading tool as well. Overall happy after 2 days of use!",
            "a good tab right now in the market ... in this price. range\nbut there is one major issue is internal storage the storage is just 16 gb its very low for gamers like me . and battery is not so good ...\notherwise its great choice 👌",
            "Ok, so I ordered Alcatel A3 tab after reading good reviews, however, I was not sure of Mediatek processor performance. Hence ordered Tab 4 8 plus\n\nComing to Tab 4 8plus if you in Maharashtra it will be delivered to you in 1 day. Here is my experience after using it for 2 days\n\nPros:\n\nGood Built Quality and looks good, glass back, pretty light weight\n\nAmazing speakers, dual front firing with Dolby Atmos, excellent via headphone jack as well.\n\nGood battery life and performance, Snapdragon 625 never disappoints. Could play high end games without device heating up.\n\nFingerprint sensor works fine\n\nGood touch, viewing angles as it is IPS full HD display\n\nNougat 7.1, got 1 gb update already\n\nGood split screen window\n\nLed notification light\n\nExpandable MMC upto 128gb, Hybrid slot\n\nJio internet will support but not sure of VOLTE as haven't inserted the sim yet.\n\nCONS:\n\nFingerprint magnet, its black glass attracts a lot of finger print at back\n\nCharger is 5.2v 2amp, not fast not slow, it's decent. I would say it is nit picking and will not bother you as battery last long\n\nBiggest con is 16gb Inbuilt spave out of which 7.5 or 8 gb is used by system. However you can add a micro sd card.\n\nScrolling issue, I am not sure if this is a bug or something to go with integration of Apps, scrolling is not that smooth inside some apps, don't get me wrong here, there is no lag but the scrolling needs to be pushed a little which is not that fluid, I am sure it can be fixed via a update. However you will not notice any lag in the laucher or while opening apps. It is just some apps.\n\nTo end the review here, If you have budget of 15k plus go for this tab it will not dissapoint you. No device is perfect\n\nTry Nova laucher and Computer Laucher",
            "First of all thanks to FLIPKART for your quick delivery in 24 hours without extra cost. Wel done and keep it up.\n\nProduct: Lenovo TAB 4 8 Plus\nType: LTE Call 3GB+16GB\nModel: Lenovo TB-8704X\n\nOrder date: 10.10.2017, 09:30 Hrs.\nDelivery date: 11.10.2017, 09:35 Hrs.\n\nVery Good Product.\n\nDon't compare this product with any other tablet in this price range. Nice looking. I liked it's richness.\n\nThis is a calling tablet. Can't understand why Flipkart's specification say NO VOICE CALL. Questions / clarifications before placing the order not supported by Flipkart site. Just I taken a chance at my risk.\n\nIt is a DUAL NANO SIM (hybrid) tablet. Lenovo would have made it as dedicated SIM Slot.\n\n16 GB builtin may be insufficient. System consumes lots of space (about 9 GB) when I got in my hand. I couldn't get 64 GB version because of the verdict, Lenovo is not releasing 64 GB version. Anyhow 128 GB external storage may compensate the lacking.\n\nLatest Android 7.1.1 is very much appreciated with full of feature.\n\nI Feel, Protective sleve or case is must to handle this tablet because of the glass finish at back. It may slip from the hand while using. But good finishing.\n\nFlipkart / Lenovo would have provided Exchange Option ???\n\nRecommending for safe and good packing from the seller, i.e., M/s. Health and Happiness Pvt. Ltd.,. I appreciate your commitment in delivering the product in time as assured above.\n\nDelivery person is very obedient. Good guy.\n\nAs a LENOVO fan since from a decade, once again I am satisfied with this product (this is my 14th Lenovo product) in my kitty.\n\nAll the best and Diwali Wishes to:\nM/s. Lenovo (India) Pvt. Ltd., and Team.\nM/s. Flipkart and Team.\nM/s. Health and Happiness Pvt. Ltd., and Team",
            "Got it with 10% cashback with Axis bank card and also rs. 200 instant cashback.\nWriting this review after almost 20 days of usage:\nAt the price of 16K its a really good tablet. I wanted a tab with qualcomm snapdragon processor and with more than 2gig RAM. Found this tab to fulfil my required specs. This is a 3GB RAM + 16GB internal memory version comes with Android 7.1.1 out of the box plus few updated that were downloaded later. Works very smooth. One feature i like most is for few apps you can share screen and run two simultaneously. Even in that mode no lag is observed.\nMain purpose of my usage goes into lot of browsing along with whatsapp and youtube plus online video lecture streaming. I observed that it streams HD 1080 videos without any lags and no hangs or lags eveb after app streaming videos is closed. I have used Samsung Tab2 GT P3100 for around 4 and half years and brought this tab when my previous tab entered the restart loop with no effect of factory reset also.\nI can say its a definitely go for tab for this budget. Sound is good and sufficient. Display is superb. Volume and power button appears to be sturdy when pressed. Power button has a fingerprint sensor and it works great and fast. Weight is less, slim design and feel is premium although the glass back and screen surface attract fingerprint a lot. But design is simple and superb. Notification light is helpful. I found screen brightness to be sufficient and i can say its more tgan sufficient. Display clarity and color is great. Both camera are good and suffice the purpose. I havent tried low light photography yet and not used the flash too. Camera software does not have much settings available.\nOf 16GB internal memory more than half is resreved by system which is quite high. But expandable memory via microSD card is present so no issue.\nOne thing i felt is that it slips off easily if kept on uneven surface.so you need to be carefull if it is kept on lap while sitting or so. Also no cover is available. But thats not an issue for me.\nEvery time i use it i found it value for money and feel to have made correct decision in selecting this tab.\nI definitely recommend this tab for budget of 16k.\nAnd as always flipkart service was up to mark with timely delivery and great price.",
            "Good tab for price . Not a big fan of camera on tabs and mobile's . Can take decent photo . Space is an issue as it gets clogged fast in spite of putting extra SD card which the tab takes up and cannot be used elsewhere . Performance issues not much as I am only a light user of it . Me and kids using it with seperate user interface which is very nice . Inspite of multiple users it responds well . The finger sensor on the main On Off button is also cool as it changes the user also automatically .",
            "This tab is just amazing in very good price screen quality is good camera also good and smooth in use",
            "Writing this review after using two months. I don't like the display at all, compared to my mobile (letv le 1s) it's so dull, And it also crash every now and then. Most of the play store's apps are not compatible with this tab (may be bcz of larger display but I installed them Anyways), the few things I liked about this tab is sound , USB type c and built quality. Battery is average 4-5 screen on time",
            "Great tab at great price\nDisplay - good contrast , good viewing angle, viberent and sharp\nProcessor - SNP 625, proved performer\nRam - 1.3GB available after installing 30+ apps\nAudio - One of the best\nBuilt - Premium\nUpdates - believe it will get timely updates as it's mostly stock . And believe lineage OS will be out very soon to root it and get best out of it.\nOverall very good tab\nOnly concern is only 7GB of inbuilt free storage, could have been better.",
            "Voice call :\nYes, provided as an default calling app for other sim.\nHowever, tab is 4G LTE; no Volte, so if you want to use Jio sim you can use Jio voice call app and make calls very easily. I am using it.\nBattery:\nQuite good charging time is ok and long lasting.\nUSB :\nUSB C type is provided which is not common with other android mobiles so you will face the problem in connecting it with other chargers.\nThe touch is good enough.\nA 8\" classy rich look tab stand on edge through its competitor.\nBoth the Cameras are very good..\nVery fast in processing as installing and uninstalling an app will hardly a matter of eye blink.\nNo heating problem as far I have used.\nFor readers:\nColour inversion is provided. However I am using blue light filter app which will make your screen warm in colour (f.lux for desktop).\nFinger sensor detects quite well.\nSpeakers are more than awesome.\nFor earphone user, an earphone w/o mic works also quite well even when puttting your tab at a distance.\n\nEarphone jack faces some problem while detecting the earphone.\n\nStorage is good for apps only and general reding stuff along with photos and songs storage is not a matter of concern.\nBoth sims are of nano type,\n\nThough slippery little bit, but not a fingerprint magnet.\nI have purchased a fast way book cover black in colur, it gives this tab a note diary look and preserves its rich appearance with safety.",
            "you will not get better than this in need this range , the quality of camera, display and speaker are satisfying.... but you need to increase the RAM ... overall best tab from one of the best companies",
            "Very good product...excellent battery backup,no lag at all,premium and stylish looks,approx 8 gb space left after os,the only thing i found not upto the mark was its display which wasn't as vibrant and rich as a superamoled screen-lenovo should definitely have to work upon it for meeting the premium screen qualities.....anyways quite happy with it other than its screen!",
            "nice tablet from lenovo.\ncompared with lenovo yoga, this looks more like a phone because, the length is more and width is small which is not the case of lenovo yoga 8 inch tablet.\n\nPros:\n1. good battery backup. with minimum usage, 100% lasts upto three complete days with network on and data, gps on. with moderate usage, it lasts for upto 1.5 to 2 complete days. for heavy usage, it can hardly last upto or less than a day. everything depends on the amount of usage.\n2. charges quickly within three hours or so.\n3. very nice design build quality.\n4. this doesn't require jio4g voice app to be installed. it has 4g volte capability. make sure to distinguish the usage of jio4g voice app. this is installed in those phone which doesn't have volte support\n5. sound quality is good enough\n6. fingerprint sensor works fine.\n\nCons:\n1. lesser internal memory. you will have only around 10 to 11gb internal memory available.\n2. camera not that good. of course we cannot demand a high quality camera from an 8inch tablet that too in this price range.\n3. some times faced problem with headset as it doesn't get recognized. not a serious problem, though.\n4. hybrid sim slot which restricts you in expanding the memory or adding a sim.\n\noverall, a nice product from lenovo.",
            "Very good product from Lenovo. Good screen quality with enough battery charge. Excellent device to watch movies and TV series.",
            "After using 2 years, I am giving this review\nIt is really good product, and I am well satisfied with this product especially battery was good enough, it will long lost 2 days with out playing any games.",
            "Honest Review After Using The Tablet for 2 months.\nThe look is premium. The tab is solid enough. you can play pubg without any lag. 3gb of ram is gud. Major prblm is STORAGE.. it's only 16 gb(out of which 7 gb is used by os).\nBut we have an option to merge external storage with internal. so the prblm is solved. I got 3 updates within 2 months and also an upgrade to Android pie 9.0. Also, i got update to volte feature. The tab handles the load well. Adapter provided for charging heats a lot while charging the device even in AC room. so i have to remove it for some time and charge again.\noverall a gud buy.",
            "First of all I would like to thank Flipkart for its speedy delivery in just 24 hours. Now about the Tab: its just awesome👍, great tab to have. After a lot research i opted to buy this tab, which is just fabulous. Not too high end nor too low, i think its perfect for medium user like me, with great battery backup, and also with a finger print scanner. Display is great too. With not too bad camera.",
            "This product is awesome product developed by lenovo.\nI am getting this product on time.\nI am fully satisfied by this product.\nIt has a fingerprint sensor at the right side and work as very fast.",
            "Cons : 1. Very slippery due to the glass back.2. Fingerprint magnet. 3. The UI has utilized 8gb already so only 7-8 gb for internal memory.\nPro: 1. Good sound quality due to dual speaker with Dolby Atmos 2. Very crisp and clear screen 3. Good battery backup.",
            "Tab is good but need to improve storage,price is so high if it is 32 GB price is worthy otherwise not worthy in case of price range",
            "Delivered on time. But regret to say that no proper packaging by supplier, so chances of damages.\nProduct is very good 1) very loud n clear sound 2) perfect HD display 3) size 8inch is good for all usage.\nCould reduce the price with non-calling options & may remove finger print sensor as well.",
            "Please note, there are two different models of Lenovo Tab 4 8 plus. This model has 3GB RAM and 16GB Internal storage. There is another model with 4GB RAM and 64GB internal storage which is Rs.21,999.00. That model is not available in flipkart and it is available in Amazon.\nPros:\n1) Very good display\n2) Superb Audion Experience especially in Landscape mode while watching full screen videos.\n3) Extremely good build quality. Feels premium\n4) Running Android 7.1.1 and received multiple updates in last few weeks.\n5) Very good gaming performance. Very responsive.\n6) USB Type C and Finger print sensor at this price range is awesome.\n7) Support for 2 SIMs or SIM+SD Card.\n\nCons:\n1) No accessories available from Lenovo in India (Folio case, Bumper Case, Pen etc)\n2) 4GB model is the best option but priced much higher compared to the 3GB model ( Costs a lot more just for the additional RAM and Storage, No other changes compared to the 3GB model)\n\nI'm using it for the last few weeks and happy about its performance. I strongly recommend it. (If your budget allows, buy the 4GB model)",
            "Beautiful product, stunning display. Adequate performance and light. Fits well into the palm of ones hand . Haven't tried using it for the heavier gaming apps but it's a neat buy if you are looking for a tab that's less than 10 inches .",
            "Product is good\ncons:\nram 1.5 used with no apps running\ninternal nearly 8gb available of 16gb\npros:\neven though , good speed for normal use,\naudio dolby atmos loved it\nscreen resolution,video clarity good.\n\ncamera- you can't ask for clarity of a phone camera on a tablet-average quality good for video calling\nNo tests on gaming\n\n\n\nIs it worth for 17k moneys? no\nsoftware sucks..getting stuck using factory installed apps",
            "Fast and responsive tab. Perfect for watching movies & YouTube, and for reading books.\n\nI'm loving PDF reading on this tab. Screen quality is nice. High resolution screen is vibrant looking.\n\nListening to music is a joy, both with headphones and without - the speakers are front firing, reasonably loud and accurate sounding.\n\nI don't play games so can't comment on that part. But for my use, snapdragon 625 with 3GB is snappy enough.\n\nI'll highly recommend it.",
            "Using this tab from 2 months, awesome experience. Display is very good, light weight. Dolby Atmos sound is great and it makes watching videos an amazing experience. Just go for it blindly. Fingerprint sensor is not so fast, rest everything is good.",
            "one issue with earphone pluging.\nWhen i plug earphone for the first time it works well and notify earphone plugged in,and then when i remove and pluged in again, then it does not work well..\nWe here sounds from tab as well as in headphone..and there is no notification about earphone pluged in. :(\nTab is updated to latest version\n\nPls help",
            "This is the best tablet in this price range.\nDisplay is gr8, colours are good and it is extremely sharp with adequate brightness.\nPerformance is fantastic thanks to SD625 and 3GB RAM is also sufficient.\nSpeakers are fantastic!! They are dual front firing speakers with gr8 sound quality and loudness.\nThe build quality is gr8. The glass back feels gr8 and its not very much of a fingerprint magnet, it does a good job of preventing fingerprints.\nThe cameras are average, as expected from any tablet. The fingerprint sensor works well. The multi user functionality is quick and gets the job done.\nBattery life is also good enough. Not as good as the iPads but still better than most of the tablets in this price bracket thanks to the SD625.\nAlready received 3 updates within a couple of days. Maybe Lenovo can keep it up.\nThere is no voice calling but u can make calls through the jio app. There is a hybrid Sim slot.\nCons-\nBattery backup could have been better.\nThe storage provided is very low and u have to use an sdcard with it as only about 9GB storage is free.\nNot sure if Lenovo will provide any further updates.\nOverall a real bank for the buck. If you have a budget of below 20k then this one is a no brainier. Go for it!!",
            "After using 15 days i cud say this product is worth of every penny....when I was purchasing that product I hv som doubt in ma mind like does it support otg ,abt voice call n 4 g status so yes it works well on 4 g,supports pandrive through otg, average battery backup,loud sound.so overall it's worth to purchase.",
            "Just awesome. Excellent performance. Very fast microprocessor. Internet at lightning speed. Cameras are not excellent but pretty good. Dolby sound is better than expectations.\nI waited for three months in expectations of release of this tab and now I think my long waiting did not go in vain. Just go for it.",
            "When I ordered it, i bought in 18 hours\nVery fast delivery\nAnd tab also very good for this price range ( better than samsung tab A 2017 model )\nEvery thinking was perfect special display quality, no hanging and heating problem",
            "Very good product given the price involved. Speed is good, screen response is best in class. Battery and display is also good. I would recommend this as near as Ipad mini.",
            "the purpose of tablet is served, a good study companion and entertainer. special mention about the immersive Dolby Atmos stereo speakers, which completely rule out the necessity of headphones. A very satisfying product overall. Of you are looking for a camera of quality detail and dynamic range,oops! it is not for you",
            "3days of use, bought for my kid, first impression, it's looks very premium and executive TAB, observed for all school work it's very useful and for official work also. I liked it very much",
            "For limited usage the Tab is working fine (only for academic purpose). Though not as snappy as smartphones but large screen is handy to watch prime videos and read books. Camera is not used at all. Overall happy with Tab",
            "flipkart didnt mentuon true detail about voice call which is available in both sim as well as call disabling option is available in phone with working internet service.\nbattery backup about to 7 hrs in continuous browsing.\nabout 10 hrs in standby sim network mode.",
            "it's come with 3 GB ram. & fingerprint sensor.. which is the best. full HD screen is good brightness. SD 625 is one of the best professor for tablets with Adriano GPU... over all the best buy. but in India missing 4 GB ram version.\nalso it's cost bit more we are paying..\nmissing is it's official cover which should provide by Lenovo...",
            "on time delivery by Flipkart , excellent product loved it the moment I opened it.. It's working fine just updated the security and apps. Camera is ok no good not bad.. have kept for first full charging while writing this review. will update more after using it",
            "Lenovo tab4 8 plus very nice tab this price value for money display quality very powerfully all is good i like it",
            "Pros - Awesome display, great sound, light weight. Clean user interface, stock android experience. Really good for videos and reading.\n\nCons - Less internal storage (64GB Card added, problem solved), tablet is slippery (good case solves that problem)\n\nOverall great buy. Im loving it.",
            "Really appreciate the service of Flipkart, delivered my order within 2 Days.\nCash on delivery was swift as I contacted the delivery person in advance.\nI am satisfied with the service and look forward to deal again.",
            "The Tablet looks very premium due to the glass back. Screen looks amazing and it is adequately bright. It's also smooth thanks to the SD 625. I would like to mention that Flipkart says Android 7.0 in the specs but the tab ships in with Android 7.1.1 out of the box. Also there is no headphone issue whatsoever that some people have written about.\n\nPros:\n+Large display\n+Thin and light\n+Smooth and fast\n+No bloatware( I found all the preinstalled apps useful)\n+ Good looking interface and notification panel.\n+ Fingerprint security\n\nCons:\n-Accidental touches on the fingerprint sensor is quite frequent due to its positioning. (Power button is fingerprint sensor)\n-Although tab has Dolby Atmos dual speakers I did not find the sound noteworthy. It is just okaykish.\n-Battery life could be better but this is understandable because they made the tablet very thin and light.\n-No fast charge support, also the charger that comes in the box is kind of cheap.\n-This particular model has only 16 gigs of internal storage. Much of it is already consumed by the system.\n\n\n\nThe above mentioned shortcomings do not really bother me much. This is a great tablet that provides a wonderful android experience. Recommended.",
            "Lenovo Tab 4 8 Plus --\nPros : prime series tab with good sound amalgamated with Dolby quality ( equilizers with app). USB- C type connectors --> 10 to 90% charging takes ~ 2 hrs. Picture quality is crystal with FHD display. It houses multi user accounts , each with separate fingerprint smart unlocking. Independent account with separate app lists & preferences. Camera is decent, good enough for VC. Hybrid slots for SIMs ( 2 nano) or mSD card. Dial band WiFi.\n\nCons : Doesnt support 4G LTE voice calling ( for Jio use 4GVC app). Youtube doesnt go to full screen on landscape mode, needs manual touch for full screen. Backside of the tab is also glass, so needs special care with tab cover. FM works only with headset cable & in nnon airplane mode.\n\nOverall : Extremely smooth UI with Android 7.1. No clutter apps. Screenshot button is a good aaddition. Battery too runs for good amount of ttime. Light weight & responsive tab for personal & family use. !!",
            "Product is very good nice design. Great hardware Snapdragon 625.tablet is very fast and smooth. First time I have ordered the tablet , headphone jack of tablet is not working. I got replacement second time the wifi is always restart.thats why I am giving one star. Bètter to buy ipad.",
            "I am using this tab from last from 4-5 month performance wise it's working good.\nLight weight easy to handle, compact & also handy.\nBattery aslo performing well.\nBut I am facing one issue with whenever I try to open Excel sheet it's automatically restart the program, it's took 2-3 time to open & use the Excel sheet other than all are good I am happy & recommend to go for it",
            "Good battery life, Decent performance, Bright and colorful display, Great value.",
            "You cannot get a better tab than this.... It handles anything very easily...... No lag.....\nWay better than Samsung's tab A.... !! Happy with the delivery....!!",
            "No need of calling facility its just a price extension! Tab is good but the glass back panel is really a bad option, since there is not a single accessory available by lenovo in the market or at flipkart. No back cover, cases or gaurd etc. Battery takes a decade to get fully charged but the backup is good if you use it offline. Internal storage is 16gb that's seriously an issue. If lenovo had launched wifi only version of the tab with a low price like 11k .. it wud be better. Accessories are really required .",
            "First of all I'll confess i switched to android tablet from my previous ipad mini. This is the best tablet, an all rounder.. with respect to battery life its awesome, power effecient 2GHz SOC, crystal clear Full hd display with protective glasses both on front and back, gives an extremely premium look to tab. Its thin design makes u feel happy and comfortable whenever you hold the tab in your hand. Finger print sensor on side makes u feel protected. With an option to use 4g sim n expandable storage it will gain priority over ipad. Camera is good, not bad as they would say. Its for the people who are looking for premium tab in midrange budget, who loves to watch movies n bit of gaming.. Its best for reading too.. if u are planning to buy any tab within 20k. This should be your first choice.",
            "A great product for anyone looking for a tablet under 20 k solid features great processor with ample 3gb ram, a decent primary camera with flash secondary camera is just okay but does the job not your selfie camera though, beautiful full Hd display and great features like dolby sound out put front firing speakers, fingerprint sensor and option for expandable memory with an option for using sim. calls can be placed through jio app.A better alternative to Ipad 2017 in my opinion.",
            "Excellent tablet with great look and fast processor. Everything is perfect in it.",
            "Better that what we were expecting. Though pricebaba has rated display downwards, display is good enough. Overall a nice product. There's pre-installed blot-ware that occupies almost whole internal memory. You will have to have memory card. There's no separate port for memory card. Either of the sim-card port is to be used as a memory card slot. So it is either network or sim-card sort of funny situation.",
            "Surprised by the good build and finish. Remarkably light and comfortable to handle. Best display I have seen in an android tablet; visually seems no worse than my retina iPad Mini at about one third price. All systems smooth. Speaker sound good. Headphone sound superb with hi quality in ear phones and using Dolby Atmos / Equaliser Apps. Super job Lenovo.",
            "I am using it for the past 2 month and everything is fine except the battery life and the fingerprint reader. The fingerprint reader allows even the unsaved prints to open it, that is with the 5th attempt of any finger it allows the device to open. Battery drains little fast. If you are a heavy Internet or a media user don't go for it. This tab does the premium look, good audio output better screen result and not the battery. Lot of software bloats.",
            "Excellent product. Found it even more beautiful and solid in real life. Delivery was swift, earlier than expected. Thank you.",
            "Awesome Display.. Excellent Speed.. Superb look.. If it's 4gb ram with 64gb internal memory it'll be a best tab..",
            "Used this device for almost 2 weeks now and must say it is an awesome device to have.\nPerformance is awesome and has a very elegant hd display.\nOnly Con I could find out is otg support as the charging cable is of different type thus u can't plugin otg pendrives.",
            "A very good product from LENOVO. I had been searching for a fast and good tablet for past 3-4 months and finally settled for Lenovo tab 4 8\" plus....am soooooo happy.",
            "Using it from last one week. Till now didn't found any issue with product.\nSome drawbacks observed and can be improved by lenovo\n1.No headset with box you have to purchase separately.\n2.Out of 16gb 7 gb is occupied by Android system. usable space is 8gb only .\n3.It has hybrid sim slot (flipkart kindly mention this in specifications) ,You can use dual sim or one + memory card.\n4.Camera is not up-to mark photo quality is OK,camera button on screen not properly placed. Difficult to click photos.(do not expect good camera from tablets)\n\nGood things about tablet is\nLightweight\nFigure print security. Works very well without problem\nFine Sound quality.\nBattery back up.\nOver all nice product .It serves my purpose so I am happy with it.",
            "Awesome tablet Lenovo tab 4 8inch Snapdragan 625 chipset and 3GB Ram and FHD Display 1920 x 1080 and you can insert SD card up to 128GB. Great tablet I love this.",
            "ULTRASUPER.WORTH EACH PENNY.\n\nThis is the one of the finest android tablet you ll get at this price range. I bet this is the best android tablet in the market at this price with outstanding features.\n\nI ordered this tablet on 7th october and got it\non 9th October. Thank you flipkart for fast delivery.\n\nThe main highlight is it's Display.you will fall in love with this FULL HD IPS display. The experience of reading n watching movie is oustanding with this display.\n\nWith Dolby Atmos the sound is more louder n sharp and you will feel the 360 ° sound around you.\n\nThe next best thing about the tablet is it's light weight.it just weighs only 300gms. You literally feel like you are just holding a phone.\n\nWith 3gb ram n SD 625 processor with 2GZ speed you can download n run almost all imp apps n games and the phone will be working quite faster.\n\nDecent primary camera but the secondary camera looks promising.\n\nIt comes with latest android version 7(Nougat)\n\nThe user interface is fast n I didn't experience any lag between moving pages. It has a finger print sensor to unlock the screen.\n\nThe only problem is 16 gb storage. The system set up consumes 7gb n you ll be left with 9gb storage only but that can be rectified by inserting SD card. It is expandable up to 128gb\n\nOverall The best android tablet right now in the market at this price. Super display, stylish design, super performance with 2GZ processor speed, outstanding sound.I waited for this tablet for more than 4 months n I m completely satisfied with the tablet.Go for it. It is worth buying.",
            "Amazing Tablet ! Really beyond expectations !\n\nAudio quality is also amazing which is ofcourse due to the Dolby Audio !\n\nEven the display is awesome ! No lags due to the SD625 and 3 gigs of RAM !!! Good for gaming as well ! Modern Combat 5 Runs without any lag....!\n\nFor a even Awesome battery experience !!! Install Greenify and the battery lasts for 3 days !!! Just Amazing Experience all together !\n\nThanks to Flipkart for delivering before time !!!",
            "Nice tab\nSlim\nNice feel,feels premium.\nAmazing display crisp & sharp.\nOverall good tablet",
            "NICE ONE IN THAT RANGE OF PRICE\nAWESOME PERFORMANCE",
            "good looking. decent performance. great display and battery life. only gripe is camera quality. and the tab is quite slippery.",
            "nice tablet so fast.and great screen.",
            "Awesome performance and quality and best price ever🤩😍😍",
            "I buy this phone @17000 and after Oreo update JIO VOLTE FEATURE removed buy Lenovo now this is a just garbage piece\nif any one purchase please don't update",
            "Best buy if u r looking for tab b/w 15-20k.\nIt has voice calling option.it is wrongly mentioned in details...\nDecent 8mp camera u can't expect much in a tab.\nDolby speakers are awesome,u don't need any extra Bluetooth speaker..\nSpeed is good..\nOverall good..\nVery good in hand and feather light in weight\n\nCons:\nHybrid sim slot\nTransfer files to external memory card is slow n has few minor issues\nVideo resolution a bit on lower than my expectations\n\nGood tablet.doesnt disappoint u..",
            "Dear lenovo\nYour tablet headphone jack is not working. It is always plugged in after removing the headphone.\nPlease provide on the firware update.",
            "Hey guys so after a few days of use the headphone jack on this stops detecting, I don't know the reason but after restarting the tab it starts detecting but again after few days or hours it stops detecting headphone completely,i cross checked the headphone with my smartphone and it works just fune so i was sure there is no problem with my headphones but the problem was with tablet. I just thought u guys should know before purchasing this.",
            "Device is good. Price is little high. And after using 1week there is heating issue while charging. Scrolling is not that fast. Does not support JIO 4G LTE calling.",
            "very good phone...",
            "Nice budget tablet.just using it for 2 days & found no issue .Let's see how it perform later. After 4 months of use I have noticed headphone connection issue in this tab.when headphones plugged in it sometimes not recognised it & after restarting same is recognised. May be this is a technical fault & lenovo team need to be focused over this.",
            "Quality Product\nSpec are higher than Samsung Galaxy tab A 2017",
            "I have been using it for 8months performance is good , issue with head phone jack still persists, since I don't use inbuilt speakers much it's not an issue for me. but overall in the price range it's the best\n\n16GB is to less have to use a sd card",
            "Only one WORD\"\"\" AWESOME \"\"\"",
            "after 1 year use review this teb outstanding performance",
            "Best calling tab ever",
            "I bought on 08/12/2018 @₹15449, value for money. performance good.",
            "Nice tablet",
            "i got defective product .battary problrm.battary drain fast and charging time 0% to 100% take almost 8 hour and dischage in 2 hour .now new problem is arises my tablet get dead and charging icon bling reapatedly and do not start set after severl attept..lenovo comapny fix my issue",
            "good one",
            "Very good solo tab for study and other works",
            "overall or is awesome 👌👌👌",
            "nice one",
            "But less internal storage",
            "I have been using this tab. Last 2 months, there is a problem with touch pad, some time touch is automatically working, other things are good fast working.except ghost touch problem. This problem began after the 2nd update.\nAnd there is a volte feature available.",
            "i think storage is one of little disappointing thing for me..",
            "Before time delivery .. flipkart is doing great in north East arunachal pradesh.",
            "After 2 months of use I can say that tab is really fast in processing but it's headphones jack sometimes stop detecting earphones,headphones....I also observed that these \"\"\"\"headphone jack not detecting problem\"\"\"\" is complaint by many user .....so please take care of this important point before purchasing this tab....",
            "Good",
            "Product is good upto my expectations... Flipkart delivery experience is too bad... Irresponsible customer care",
            "Really the premium tablet one can rely upon. Amazing display and surround sound. After a long research i got it finally",
            "Nice look,light wait,fast performance, Android",
            "Great tab at this range.",
            "Superb... n thanks lenovo.. for super speed n display n battery backup. n sound evrything well. .. ... everybody shop this tab without hesitation..",
            "Good",
            "Amazing tablet. Fast and beautifully crafted.",
            "All good as expected. Only concern which I have is, tab is too slippery.",
            "Good",
            "Great product",
            "Excellent",
            "Worth buying..",
            "I got the product on 26th March,2018. For around 12 days the product was working good... but now, there are too many problems.\n1) The battery does not charge and automatically heats up.\n2) display automatically blackouts and vibrates..we can't even switch off the tab.\n3) The battery discharges quickly.\n\nNow the return policy has lapsed on 05th April, 2018. Is there any other way to return the product and launch a complaint against it.???",
            "Serious flaw. Every time u restart SD card is shown as corrupted and there is no way to use it, means all data u had on the card is lost. To save data u will have to take card out and repair using PC. Basically using SD card on this card is a real pain. I have referred to other forums and this is a widespread problem with this tab. I wouldn't recommend buying it. Real pain to use with SD card, go for 64 gb storage if u can afford it, but then u can purchase ipad.",
            "Good product.. but screen guard, tab cover not available..!",
            "Not worth the money,nothing new features in this tab. Doesn't run smoothly, can't play games properly,as it glitches some times.\nIt just has looks,not the property of good tab,nd cost is too high",
            "After just 2 days the tab displayed temperature issue and the service centre is unable to repair it. Pathetic service and product from Lenovo.",
            "I though it will be bigger. I was using a 10 inch tablet before this. People who used bigger tablet do not prefer this one. It looks very tiny in hands",
            "Booked on 04.10.17\nDelivered on 06.10.17\n\n\n...Good Display...\n...Very Smooth Touch Response ...\n...Good Speed...\n...Good battery backup...",
            "waste tab , display damaged after 15 days of use don't take this tab",
            "People who used ipad don't purchase this disappointing display",
            "It is a dual sim.. But how do i fit in both d sims and d memory card in dat same sim plate.???",
            "Good",
            "Good",
            "Best for a budget tab especially this pandemic.. very useful for my friends son who needs to attend online clases",
            "This is the best tablet in this price range..\nBeen using it for like 6 months, battery lasts for more than 12 screen hours, superb for reading and entertainment.\nFor 14k this is best one can get.",
            "ABSOLUTELY HORRIBLE DISPLAY. I CAN NEVER HOLD AND EVEN UNINSTALL ANY APP. THE TOUCH IS SUPER BAD AND DOES NOT WORK A BIT CORRECTLY AS WELL.",
            "Great tab for regular use.\nI am using the tab since I purchased it from Flipkart.\nThe design, functionality, features are great.\nThe price is also reasonable.\nWill recommend for those who want a tab for regular use.",
            "Using since 2018. Was satisfactory till I inserted sd card to get more space..sd card not working, no app transferable. although same sd card is using fine with other devices. Very much disappointed.",
            "Good",
            "Awesome",
            "Battery discharges continuously... Even with no use it discharges within 2hrs...",
            "Very bad quality Tab . stopped working after 27 days",
            "all things is ok but if u use continuously it is heating little bit.",
            "This tab provides better performance in this price range .It gives battery backup of two days.",
            "good",
            "Nice",
            "Do not buy this product. It does not start due to battery problem. Complete waste of money..!!",
            "Nice device and also appreciate flipkart whole team and sales executive of guwahati who delivered in time during the difficult situation of Covid-19. Thanks flipkart weldone",
            "very good",
            "good product",
            "very nice tab👌👌👌",
            "lenovo tab 4 8 battery is very heat..battery backup bad..",
            "it is not volte supported\nbut you can go to the settings and search enhanced 4g LTE and then enable enhanced 4g LTE MODE and then you can call normally using any 4g sim even jio",
            "after 4 months of usage display issue occurred..",
            "Best tab in the budget, but I'm unable to use my jio sim in this tab.\nOverall performance is Good.",
            "Nice looking tab and performance also very good.",
            "Excellent product and delivery on time. Got the same product as in the picture .Highly recommended. Very good ,compact product in this price range.",
            "Suitable for study✌️",
            "very bad product within 3 months me screen touch is not working",
            "Good product in low cost",
            "I brought for my son who is 3 years old and it is working absolutely fine with out hanging after installing apps too",
            "osm product",
            "good",
            "Excellent performance.",
            "NICE TABLET",
            "Good one..\nPerformance good..",
            "headphone jack is faulty ..sound from the speakers comes even when the headphones are plugged in.",
            "Good performance",
            "good device.somewhat slippery.value for money.",
            "It's osm",
            "Out look is amazing",
            "great tech..great sound and display..average camera..performance great..loved it..",
            "Worth for the money...Nice experience for kids specially...",
            "nice product",
            "nice product",
            "pls dont buy",
            "the sound system is not working",
            "awesome product",
            "awesome tab",
            "not bad",
            "price is high for specifications",
            "Good Tab @ this price range\n\nIt can be updated to Android 8.1.0\n\nGood sound & video Quality",
            "Best tablet. Superfast delivery within 12 hours of ordering.. Product was properly sealed unopened and no damage when delivered",
            "Nice tablet my son is very happy",
            "Another wonderful product from Lenovo, the performance is very good at this budget.",
            "useful 👌👍",
            "Exlent",
            "worth for this cost but slightly fingerprint problem n Jio sim not working properly in this tab",
            "Good tablet as android tablet but it has glass back and the 1080p screen is great and 4g data. It does not match ipad but same as price.",
            "good product",
            "Good Product, in this price range.",
            "Great Procuct. Suprised.",
            "Fine tab but shortage so could not got for all 40 friends",
            "one mor lenovo 4 8 Plus 16 GB 8inch with wi-Fi",
            "Wonderful Tab.",
            "Display problems and Viruses after 3 days usage",
            "Worst product",
            "sound quality is so good like a theatre sound",
            "overall performance wise it's a good daily use tablet ...battery backup is not up to mark ...rest device is good value for money.",
            "Nice tab working smoothly nice battery back",
            "A good tablet. I have inserted Idea sim card. It does support voice calls",
            "Happy and Satisfied",
            "SUPER\n\nVERY GOOD PRODUCT FROM LENOVO, I AM HAPPY WITH IT",
            "suoetb product",
            "excellent",
            "overall good.\nbut the proximity sensor is too much sensitive. most of the time while doing something the device gets locked if my hand hover around it or my finger just touches the unlock button softly...\n\ni have not yet tried playing large games/apllications, so cant review on processor's performance.",
            "screen quality is nice..and all is good..but seller not applied screenguard.",
            "review after using 1 day\nwonderful performance\nvery good display\nnice touch\nlag free performance\n1.2 day battery backup with average usage\nfeels premium on hands\n\nvery poor camera\na bit high priced.\n\noverall worth buying product",
            "value for money",
            "Great for watching movies and browsing.. loved the sound quality.",
            "more than what i expected.first hand feeling was excellent",
            "does the job",
            "looks good, but lot of software and hardware issue in my set.\nheadphone jack is bad, 4 network calling problem, keyboard problem, etc.",
            "Good specs, beautiful device and great value for money.",
            "software problem. the drop down quick settings donot work. I have to go settings on menu to on or off WiFi or Bluetooth. camera is great. touch is not smooth. scrolling of web page is little difficult.",
            "latest and grate",
            "After few days of use, i found that there's defect in audio jack. Sometimes it detects headphones and sometimes i won't. The package proudly shows the tag MADE IN INDIA. This happened me before with Xiaomi phones rocking Made In India tag.\nIn such cases, when i called customer care, they simply tell you that It's an electronic item and it's made in bulk so sometimes the defect (human error) is bound to happen ! ????\nMake in India doesn't oblige companies to JUST provide jobs(and not to train their employees) and make substandard products without adequate quality check. not cool !",
            "till date no issues. audio jack sound quality is not per expectations even with high quality earphones.",
            "Performance is very good. But jio calling is not functioning.",
            "the offered to purchased this product by flipcart & bajajfinsrrve is too good. product is exelent",
            "good",
            "i'm using this tab for 4 months, and it's an awesome device.",
            "Awesome",
            "good product but not available in stores",
            "Device looks nice.\nIt has 4G dual SIM options with phone dialing features. It has finger print sensor in power button and that makes it easier to use.\nIt can also take Sdcard.\n\nCons:\n========\nThe display is too boring and dull. It is dull and muted compared to even old Nexus 7 2013 edition with same resolution screen and same price point. They have used lower grade LCD panels to save money.\n\nOther problem is the weak processor. Cortex A53 is too weak to handle anything demanding. These are used in better processor as low power CPU cores to conserve energy. Here they just bumped up the GHz to make up for it, but sadly it doesn't work. The execution unit is too weak to handle workload as they are more of low power optimised core by design.\n\nSame goes for the GPU, it's too weak to handle Games at full HD.",
            "Satisfying... working properly till now...",
            "it showing 4G but it not support volte.",
            "First impression is nice one. Very happy to have it will write review after one week.",
            "One thing i'm not satisfied with, headphone jack problem, sometimes it shows when you plugged off and because of that you won't hear any sound in speaker, only solution is to that, restart. All in all, nice tab display wise.",
            "Amazing tablet within 20k. Full HD display 4G snapdragon processor and almost 5000 mAh battery",
            "nice",
            "best product very good build.",
            "performance is best of the tab .but the screen size is only 7 inch .",
            "Stylish & slim. Good battery backup. Lightweight.\nAlthough Operatingg system is not polished as it should. Touch response is not good. Screen color production is average.",
            "Those who are looking for an android tab that has decent specs and not very expensive, go for this one.",
            "Good",
            "Good",
            "Excellent. Value for money.",
            "good",
            "waste tab no proper touch and we can't send or receive sms",
            "good product",
            "excellent, value for money",
            "This product is good",
            "Excellent tab in this price range",
            "good product..but can't find its good flip cover..",
            "nice product",
            "After using 7 days i found that....\n1. screen is smooth as expected .\n2. don't expect much from Camera it is avg\n3. battery life is 7 - 10 hour and slow charging\n4. browsing is quite fast.\nso overall it is a good product by lenovo. if your budget is around 16k then go for it. it won't disappoint you.",
            "Love the product. display is the best in this price range.",
            "Wow awesome...love..this..product...",
            "A great tablet but there are many software bugs. Hope lenova will fix in the future updates.",
            "Awesome tab. Absolutely worth the price",
            "Nice working ..voice quality best ..and screen size big an HD .....but camera quality is not good",
            "love this product",
            "At first this Tab started producing sound from internal speakers & headphones at the same time but I ignored this fault. But just after two months tab suddenly stopped working & hanged on boot screen. I showed this problem to Authorized lenovo service center but the technician guy told me its a hardware issue & it'll take 8 days to repair it because they don't have necessary parts to repair it & he'll have to bring parts from other city. I went after 8 days but still the issue was not fixed technician told me he hasn't received all the necessary parts...During all this I called lenovo service more than 15 times & personally visited service center 2 times but nothing happened,even after 1 month my tab was not repaired..then finally after waiting for 35 days problem was fixed. This is the Worst service by lenovo..Never buy any Lenovo products.",
            "overall value for money",
            "Only 1.2 gb ram available",
            "Awesome tab",
            "excellent product, it's solved mobile and tab purpose display is awesome",
            "good",
            "Very nice tab. You can say that \"awesome\"",
            "nice product",
            "only cons no volte",
            "Best tablet for the price\nBlazingly smooth, hiccup free performance, stellar look, great display.\n10/10 would recommend.",
            "Better than Samsung Tab A",
            "fabulous",
            "Good",
            "Not bad",
            "Really nice tab... running smooth, voice is clear, display is good, ms office installed already.. so i got exactly wht i wanted...",
            "Perfect",
            "touch is not smooth and fast",
            "Decent tab. 16 Gb internal storage is less. U get around 7 gigs free. Screen and sound quality is good. UI is clean n simple but I've noticed lags while scrolling through web pages and apps. Battery life is decent not that good... Hopefully Lenovo shud send any update for the scroll lag fix",
            "so good",
            "One of the best tablet in this segment.",
            "Tablet is self working,there are some pressure points which make the tablet self working sometimes,don't know what to do, dissatisfied.",
            "Good tablet but lacks USB OTG support and hdmi connectivity. Rest is OK.",
            "Good product",
            "Good value for money.",
            "Nice product.... Sound quality best... Overall best tablet in this price range....",
            "Excellent tab. But the battery capacity is low for a tab",
            "The product is good, but there is no flip cover availability",
            "One of the best tablet .. Awesome display",
            "Good display to watch movie.",
            "Processing is fast, Screen resolution is good, Light weight and slim.",
            "value tablet.",
            "Profuct is awesome and meet my expectations under my budget.Flipkart delivery was slow.",
            "Excellent product, flawless,go for it...",
            "Pros: Display is fantastic. Full HD.\nTouch is smooth.\nGood speaker (Dolby)\nYou will be left with around 7.5 gb of internal storage for your use. Rest will be taken by system.\n\nCons:\nRear camera is okay (means not that good)\nNot good for video calling.\nLacks a front flash.\nNo otg support\nNo direct phone calls (possible via 3rd party apps)",
            "Nice product. Delivered within two days.",
            "Good",
            "Within one month it starts creating problems. Audio Jack not directed properly, can't make call, and slow speed.",
            "Very good product,nice performance, display clearly very very nice",
            "Good",
            "Good for everything, would say a bit expensive, but definitely happy",
            "Not a worthy tab",
            "Best tablet in the market at this price go for it",
            "Good",
            "The product was ok but i didnt get my cashback till now. They are just saying to talk to bank customer support and later are saying to contact flipkart support..\nWorst experienced.\nNever will buy from flipkart again..!!",
            "Excellent Product,",
            "good",
            "Great value For money!",
            "No voice calling",
            "Best tab to buy for 17000",
            "Excellent product go for it.",
            "Great one",
            "Best tab at this price",
            "A Pleasing performance Devices...",
            "Good",
            "good product...great sound...great mobility for the device...",
            "Amazing tablet.. Crisp display.. Great stereo speakers..Just go for it!!!",
            "After Oreo update no issue of headphone jack.",
            "Mast hai Bhai...\nI given 5tar extra one for Dolby Atmos in it too good.....system stability is good...camera quality is good but not compare with iPad air please....worth for 17000rs ..",
            "Hanging issue is there, display is great.",
            "Good tab , smart look .it's nice",
            "The need of minimum 32 gb rom is required",
            "this is very good Tab.but flipkart service is not good.i had to come out from in street to collect item.delivery boy not come to my room.",
            "Best value for money",
            "very good product with very affordable price.",
            "Great product by lenovo....you can see my detailed review on this tab here ------ youtube.com/TechyPranay",
            "I love this tab......this is very good tab with HD screen, light weight and look is awesome!",
            "Fast battery charging\nFast apps downloading\n3 GB RAM with 2 Ghz processor makes processing very fast\nGood screen quality",
            "Amazing product with great looks, although only available in 3gb model till date, but still performance is very gud. A little costly but gives u a premium feel with metal border and glass at the back, 8mp camera is very gud but a little noise in dark. But it's not having NFC so u need an NFC enabled phone also in ur pocket to use ur cards for contactless payments",
            "Awesome tab. Bought it two months earlier and have no problems till now. Go for it...",
            "Very Gd tab in this price segment... processor is also fast; no lagging.. camera be also a good not very Gd it is avrg. And decent battery backup. Dolby atoms is also nice; sound quality superb. Jio working nic, bt Volte not supported. Use jio voice app.",
            "Not supporting VOLTE... U can use Jio sim for net, but have to download hio4g calling app for voice calling.",
            "Very good",
            "Excellent tab... Breathtaking display... Superb quality sound thanks to Dolby atmos... Reach feel... Overall 5 star....",
            "I got my order within 2 days and tab is simply awesome.",
            "If you are getting this.. you better get a case along with it.. it's not very comfy in the hands",
            "Slim and light weight. Really loved it.",
            "Thanks Flipkart for early delivery. Tab is awesome.",
            "It's an amazing product. Value for money. Flipkart got it delivered before the expected day, as usual. Very good service. Thank you flipkart.",
            "Delivery time - Good. Representative - Good.",
            "Best budget tab",
            "display is gud",
            "Got it delivered on time. It's definitely value for the money. But I think the touch could have been better.overall it's a really good product",
            "Awesome tablet and worth the price. Only downside is 16GB of internal storage when older tablets come with 32GB as minimum.",
            "Cool TAB. So far so good. Battery backup is great. Getting updates for bug fixes. Finally worth every penny and Would be very nice to buy at 16k or less.",
            "No Volte support",
            "Awesome",
            "excellent product and safest and fastest delivery.",
            "No volte support... Battery backup good.... Good performance overall... Low internal memory.... Hybrid sim...",
            "Nice tab, good processor and very smooth body structure ....",
            "Good tab with sound, screen and memory",
            "Best tab in market",
            "Does not support volte .",
            "it's been 15months....still working good...best tab under 20k... don't prefer any other product if this is in stock.... trust worthy product and heartful review",
            "Nice tablet sound quality good",
            "Super...in all aspects it is good.",
            "perfect budget tab",
            "Brilliant Looking and Features",
            "It's really good.",
            "very good tablet but very low on storage",
            "Best one in that price band",
            "Awesome.......tablet\nLoved it........ superb",
            "Great product!! Stylish look and awesome display. You can definitely go for it👍",
            "Product is awesome.. Premium look.. Feel great",
            "Awesome tab",
            "Everything is working fine but there is a software issue in headphone jack port. I hope it will get fixed in a update",
            "Nice tab",
            "VFM ! Super Like",
            "Nice display. Premium built quality, good battery. You can go for this tab..",
            "Thanks",
            "Good product",
            "dc",
            "Very good service"
        ],
        "likes": [
            "285",
            "45",
            "43",
            "31",
            "9",
            "15",
            "10",
            "3",
            "3",
            "5",
            "285",
            "45",
            "43",
            "31",
            "9",
            "15",
            "10",
            "3",
            "3",
            "5",
            "8",
            "8",
            "2",
            "2",
            "5",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "4",
            "4",
            "3",
            "1",
            "1",
            "1",
            "1",
            "2",
            "5",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "81",
            "23",
            "20",
            "8",
            "11",
            "7",
            "7",
            "56",
            "83",
            "32",
            "19",
            "11",
            "4",
            "2",
            "4",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "3",
            "3",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1"
        ],
        "dislikes": [
            "117",
            "11",
            "47",
            "31",
            "1",
            "5",
            "3",
            "0",
            "0",
            "1",
            "117",
            "11",
            "47",
            "31",
            "1",
            "5",
            "3",
            "0",
            "0",
            "1",
            "3",
            "4",
            "0",
            "0",
            "3",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "5",
            "5",
            "3",
            "1",
            "1",
            "1",
            "1",
            "2",
            "32",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "6",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "2",
            "23",
            "4",
            "5",
            "1",
            "3",
            "1",
            "1",
            "34",
            "54",
            "17",
            "11",
            "6",
            "1",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "5",
            "8",
            "1",
            "1",
            "1",
            "1",
            "3",
            "13",
            "35",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "2",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "4",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    },
    "qna": {
        "questions": [
            "Q:it is support 4g sim",
            "Q:Is lenovo tab 4 8 plus is upgradable to andoid oreo ?",
            "Q:is it supports voice calling? description says no.im confused",
            "Q:does it support watsapp??",
            "Q:Is it good for reading ebooks and pdfs and ppts for long hours? I am planing mainly for reading and study purpose only , should I buy?",
            "Q:what is the remaining RAM and internal storage after buying this tab??",
            "Q:does it has fingerprint sensor?",
            "Q:does it have glass body at the back",
            "Q:Is this having anypen technology?",
            "Q:can i play pubg game on these device??",
            "Q:it has quad core or octa core? bcoz the description says quad core but the specifications say octa core. So pls tell",
            "Q:Does it has fast charging??",
            "Q:it has inbuilt calling function",
            "Q:use keypad or not",
            "Q:Can I install apps in external memory rather than the finite 16gb rom.",
            "Q:Is it good for playing pubg without any lag As I saw it has only 1.5gb ram left after buying",
            "Q:Dose it suppot otg?",
            "Q:does this tab have dedicated micro sb slot?",
            "Q:What is the internal storage size? In the official Lenovo website it says 4GB/64GB?",
            "Q:I am a student, is it good for me",
            "Q:What it's support voice call by any Sim cards ?",
            "Q:doees it have full hd display ??",
            "Q:can it read external hard disk?",
            "Q:Peoples in Lenova site forum are saying about Micro sd card problem, Is there any..??",
            "Q:Is it support ms excel",
            "Q:how much storage is occupied by system and OS in 16 GB variant? How much left for user?",
            "Q:does this tab support voice calling",
            "Q:is it a voice calling",
            "Q:Is it a calling tab??",
            "Q:Does the 8 plus have a notification led? And is it glass back?",
            "Q:does this tab support 1 TB hard drive.",
            "Q:Which type of android it have -Stock android or Normal android?Is this upgradable to Android 8.0(OREO)?",
            "Q:how its camera quality",
            "Q:We can do screen cast with lenovo 4 8 plus to Sony bravia ????",
            "Q:is it slim",
            "Q:How much ROM memory available for user to Install apps",
            "Q:is it 4g speed tab",
            "Q:we can use zoom app",
            "Q:What is the expendable memory of 64 gb verient?",
            "Q:does it have dolby atmos sound system built in?",
            "Q:can i play pubg in it with no lags...",
            "Q:can i use stylus pen to write on screen(own purchase) does it support stylus pen",
            "Q:i think iam confused it consists video call or not",
            "Q:it lags or not lags",
            "Q:what is the breadth of the tab?",
            "Q:can we use sd card as internal storage",
            "Q:After updaing to oreo is it stop calling from jio simEnhanced LTE or VOLTE provisioned feature disabled. , how to roll back nougat again?",
            "Q:is it have quad core or octa core processor description says quad core and specifications says octa core kindly clear",
            "Q:is it support keyboard",
            "Q:Is 128 GB micro sdxc card compatible with Lenovo Tab 4 8 Plus?",
            "Q:Has any user installed a memory card in Tab 4 8 Plus? Were any issues with using a memory card?",
            "Q:does it support voice calling for airtel 4 g sim?",
            "Q:does it support go fpv app???",
            "Q:what's the size of its ram??",
            "Q:sdoes it support split screen?",
            "Q:how much ram in this ?",
            "Q:Can I use it as a phone like calling and sms and whats app like a normal Android phone..??",
            "Q:is it cricket game support?",
            "Q:Can we connect with HDMI adapter port presentation big screen presentation",
            "Q:does it have amr based processor?",
            "Q:What is the RAM size?",
            "Q:in specfication it show (voice call= no ) and iN qustion it say yes it support calling is it suporrt or not ....?",
            "Q:Does it have a finger print censor because I can't see it in the pictures available above",
            "Q:does it support stylus pen?",
            "Q:is same prosser lenovo tab4 8 vs tab4 8plus",
            "Q:the tab supports sd card and single sim slot at the same time",
            "Q:Does this tab good for reading elderly people?",
            "Q:can i use WhatsApp from play store? (not WhatsApp Web)",
            "Q:does this tab support voice calling?? i'm very confused about that ..please help me",
            "Q:It supports voice call. Please suggest me I want to buy this product.",
            "Q:Who much use business tablet",
            "Q:Q: Dose it support otg?",
            "Q:It have 4g volte support",
            "Q:how many hours need to full charge it.?",
            "Q:Dear Friends,i want to buy this tab,is there any technical issues like memory card corruption...pls let me know?",
            "Q:does it support whatsapp and otg connectivity?",
            "Q:can use jio sim",
            "Q:does it support jio 4g sim",
            "Q:WHETHER THIS LENOVO TAB 4 8 PLUS IS VOLTE & OTG SUPORTED ? PLEASE REPLY EARLY.",
            "Q:Is Ms office preinstalled with this tab",
            "Q:Does this tablet support OTG??",
            "Q:does it have a fingerprint sensor.?",
            "Q:Is it otg supported?",
            "Q:Can i call through 2g or 3g sim card?",
            "Q:when it is going to launch ?",
            "Q:is it support voice calling..??? without third party app like jiovoice. but lenovo tab customer care informed me there is no voice calling..Please clear this..",
            "Q:does it support jio video calling?",
            "Q:Has it a selfie camera?",
            "Q:Is it supports jio sim",
            "Q:Witch One Is Good Choice Mi Max 2 Or Tab 4 8 Plus ?",
            "Q:this tab support the quick charging or not",
            "Q:is back cover included with it?",
            "Q:Does it comes with kids package? I mean the bumper case and screen guard?",
            "Q:do the tablet have a mirror-like look in its backside?????",
            "Q:Can we use sim slot for internet?",
            "Q:does it support for voice calling ,in specifications it tells it does not support",
            "Q:does it support jio VOLTE for voice calling with out using calling app?",
            "Q:is there any protection for the screen ?",
            "Q:can play pubg in them",
            "Q:is it support key board",
            "Q:Does it have \"\" type c\"\" charger.",
            "Q:Does it have OTP support?",
            "Q:is this tablet support 2 TB hard disc..? how i have to connect it..??",
            "Q:Does this Tab support external keyboard ?",
            "Q:Does the tab have heating issue?",
            "Q:Can we insert 2 sim and SD card Or We get hybrid sim slot ?",
            "Q:Can we mount EXTERNAL SD CARD as INTERNAL STORAGE as we can do in marshmallow and in higher Android versions (STOCK ANDROID), cause out of 16 GB only 10 GB will be left I guess??",
            "Q:can change it into windows os",
            "Q:Is it pocket compatible??",
            "Q:does it have head phone jack",
            "Q:Tab's screen length is 20cm approx. What is it's approximate width?",
            "Q:Does it support voice calling for jio sim without using jio voice app?",
            "Q:is it work without any calling app ... voice call can make and receive ?",
            "Q:can we play pubg without any leg? Can tgis tab give us seamless performance when playing pubg?",
            "Q:can i conect this tab with teamveiver.?",
            "Q:Does it support Quick charging 3.0 or 2.0 ? pls be specific on which charger",
            "Q:can I play pubg with high grafix",
            "Q:can we remove pre installed app?",
            "Q:Dose it support all mobile app",
            "Q:Is Jio Voice app required for both voice call & video cal for jio sim ? Also, can we use pendrive drive directly or use otg ??",
            "Q:IS IT 3GB RAM OR 4GB RAM",
            "Q:what accessories included with the tablet ?",
            "Q:does it support Google maps, camera?",
            "Q:is its rear camera auto focus or not ? plzz reply asap",
            "Q:just one question... will this tablet last for 3-4 years?",
            "Q:plastic body or metal body?",
            "Q:Where can I find the 4gb ram and 64gb storage variant? Can someone please send the link.",
            "Q:does it hais fingerprint",
            "Q:Serching for good tab",
            "Q:does jio tv run on it?",
            "Q:Does this device support Miracast?",
            "Q:this supports OTG but is there any storage limitations ?",
            "Q:does it has a sim slot or it only works with wi-fi dongle?",
            "Q:Does it support marrow n other medical apps",
            "Q:What is the standby time of this tablet on a full charge?",
            "Q:Does it has Wi-Fi hotspot feature?",
            "Q:Is it has glass back?",
            "Q:How much Screen on time are you getting?",
            "Q:Out of 3GB RAM, how much free RAM is available?",
            "Q:Out of 16 GB ROM, Whow much memory is free on first boot?",
            "Q:In this tab i can use pen for writing",
            "Q:This tablet comes with Google assistant or not.",
            "Q:what is the processor speed of this tab",
            "Q:I want to buy 64gb model. When can it be available?",
            "Q:can I use JIO sim for internet browsing with this? I dont need voice calling..",
            "Q:Does it support pandrive through otg?",
            "Q:Can I use pandrive by others?",
            "Q:is it HD capable",
            "Q:is it volti enable??",
            "Q:stylus can be used",
            "Q:will i be able to use with projector?",
            "Q:why this tab not recognised headphones even though headphones are plugged in? is this a technical issue?",
            "Q:Can anybody tell me from where i can purchase accessories like tempered glass and back cover for my Lenovo tab 4 8 plus??",
            "Q:it is support OTG???",
            "Q:is it support micro sd card ?",
            "Q:how much pixel front camera is???",
            "Q:Are its accesories available? Screen guard and covers?",
            "Q:Is it upgrade-able to Android version 8.0 Oreo?",
            "Q:does it have gorilla glass?",
            "Q:Is calling facility is available in this tab.??",
            "Q:Will Whatsapp run on this device?",
            "Q:Does it support 4G Volte?",
            "Q:will this support otg?",
            "Q:does it have voice calling..?",
            "Q:does this tablet have dual sim with 4G network capability ?",
            "Q:Does it contain hybrid sim slot ?",
            "Q:CAN I MAKE CALLS FROM LENOVO TAB 4 8 PLUS DOES IT SUPPORT JIO SIM",
            "Q:does it have gorilla glass protection?",
            "Q:does it has fingerprint sensor?",
            "Q:how many hours need to full charge it.?",
            "Q:Does it has fast charging??",
            "Q:does it support whatsapp and otg connectivity?",
            "Q:does it have gorilla glass?"
        ],
        "answers": [
            "A:Yes",
            "A:it's now updated to android oreo",
            "A:yes it supports. I'm using it.",
            "A:it supports whatsapp",
            "A:yes. very good for reading.",
            "A:normally 800-900 mb of RAM remains free and system occupies about 7 GB of internal storage.",
            "A:Yes. This tablet has a fingerprint sensor built in it's on-off switch. This tablet is quite fast.",
            "A:Yes it has glass back panel but it's not a drawback at all & it doesn't get any Fingerprint smudges as one would think. Grip is quite good if you don't have small hands.",
            "A:No it doesn't have anypen tech.",
            "A:whitout any lab bro.",
            "A:It has octa core processor....Qualcomm Snapdragon 625 2.02 GHz",
            "A:no normal charging",
            "A:Yes I use calling and receiving calls",
            "A:used and is ok",
            "A:Yeah you can. All you have to do is select the option Format as internal memory once you put the card in. It merges with what's left of the internal memory. I suggest you put 32 or 64 gigs.",
            "A:i hve played this game on this tab it was running smoothly.",
            "A:yes",
            "A:Yes this tab has 2 sim slot and separate micro sd slot..",
            "A:mine was 16 gb/2gb",
            "A:yes definitely.",
            "A:Yes but for Jio sim it required Jio voice",
            "A:yes it is 8\" full hd 1920x1200 IPS display",
            "A:yes bt u need an otg cable..",
            "A:no",
            "A:Yes",
            "A:Around 9 or 10 gigs is available for apps & stuff on board. What you can do is get a 32 or 64 gb micro SD card and then format it as internal memory to merge with inbuilt storage for more space.",
            "A:Yes it does.",
            "A:Yes",
            "A:Yes it is.",
            "A:Yes it has a glass back as well as a notification LED. The presence of an LED doesn't really make any significant difference on the battery life. This piece actually has an amazing battery. Best.",
            "A:Yes",
            "A:Its Stock Android mostly. Not much bloatware. It's compatible for Android update but there has not been any official announcement regarding update from Lenovo yet.",
            "A:tablets are not for photography so don't expect to much from this tablet also. it's 8mp camera is good enough for photos but not for best quality pictures. don't rely on its camera for high end stuff",
            "A:no",
            "A:Yes it is quite slim... But i would recommend buying a cover for it, as its back is of glass, it is fragile.",
            "A:abt 6.95GB is used by the tab.",
            "A:If you insert 4g sim card then you will get data connectivity. I am not sure about voice calling but as far aa I know there is no voice calling service.",
            "A:Yes you can.",
            "A:This is very useful product It's processing very fast Overall result very good.",
            "A:yes it has",
            "A:yes you can play pubg without any lags as it has a powerful snapdragon 625 in it",
            "A:yes, you can use",
            "A:Yes it has. I use Airtel 4G sim and I am able to make Video call using Google Duo and Whatsapp Video.",
            "A:yes it lags",
            "A:roughly 4.5 inches",
            "A:yes",
            "A:U need to factory reset the whole device and after that dont update it again",
            "A:Snapdragon 625 octa core",
            "A:Yes, through micro usb & via Bluetooth both way...",
            "A:Yess",
            "A:yes microSD card can use. there is no issue to using this.",
            "A:ya it's has only LTE no Volte, I use jio sim, so I have installed jiovoice to make calls....",
            "A:The installation can be possible. As I don't have any drones, I have not tested the usability of the same.",
            "A:3GB for 16GB ROM/INTERNAL STORAGE",
            "A:Yes",
            "A:3 GB",
            "A:definitely yes.",
            "A:yes",
            "A:No",
            "A:Yes, it has Qualcomm snapddragon 625 Soc",
            "A:4gb",
            "A:I used Jio sim, for internet, jio TV etc it is fine, as it has not Volte support you have to install Jio calling app for making calls. I have not used any other sim.",
            "A:Yes, it is in the right side, the power button is finger print capture.",
            "A:no",
            "A:This is product is not good for readers. Battery life to be improved.",
            "A:yes",
            "A:yes u can read on it .",
            "A:yes. you can install it",
            "A:I inserted Idea sim card, it does support voice calls",
            "A:Yes, it supports voice calls",
            "A:Very useful. It sports SD 625 + 3gb ram. Any business app can run smoothly on this device.",
            "A:yes",
            "A:yes. i also use jio sim.",
            "A:1 hour 30 minutes",
            "A:Nope. no such issues faced with daily use of surfing and app usage. recommendation is to have only requires apps",
            "A:YES",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:Yes",
            "A:yes",
            "A:no",
            "A:yes",
            "A:It's launched already and available",
            "A:Yes after 3rd update now it has volte feature.just go to settings and write 'enhanced' in search box.u will find volte feature there.",
            "A:via jio video call app only",
            "A:yes",
            "A:yes it support jio",
            "A:mi max 2 is not a tablet ,compare the things in compatible group",
            "A:Yes. It supports... But I suggest not to buy Lenovo product. Their technical team is very poor. Also, u will start facing problems within one month... Better to buy apple",
            "A:No. It doesn't comes with any back cover or Screen Guard. You need to purchase it separately.",
            "A:NO",
            "A:back has glossy finish.",
            "A:Yes it has SIM slot which supports 4G service from all Telecom Service provider of India (Airtel, Jio & Vodafone). Please note that this tab don't support VoLTE.",
            "A:Yes, it does support voice calling. I have used the tab for callin with Idea 4G & Vodafone 3G sims. However, I was not able to use the default app with Jio Sim. Had to use Jio 4G voice app for calls.",
            "A:yes support but change settings",
            "A:no",
            "A:yes",
            "A:yes",
            "A:yes ,type c charger it has",
            "A:OTG yes",
            "A:NO",
            "A:yes",
            "A:I've been using it for the past 1 month.A great device.NO ISSUES so far.",
            "A:Model TB-8704X has one tray with two slots. One for Nano SIM and one for Micro SD card. This is what the guide shows.I haven't used either. For more information visit Lenovo website.",
            "A:When external SD card inserted it formats as internal storage",
            "A:no",
            "A:no, it not pocket compatible",
            "A:yes but not a VOLTE phone",
            "A:20",
            "A:yes",
            "A:Yes.Earphone voice cooling and receiving",
            "A:yes you played but only one app in 16 gb but 32 gb variant is very good",
            "A:Its an android version 8 tab. so anything which would work with android would work with this too.",
            "A:3.0",
            "A:No. It supports low graphics by default. However U can apply the high graphics if connected with good internet speed",
            "A:yes but by booting but than ur warranty will be void",
            "A:yes , it is support computable Oreo 8 update. android app",
            "A:use c port otg adapter or pendrive",
            "A:4gb.",
            "A:tab, charger and c type cable.",
            "A:Yes",
            "A:It’s auto focus",
            "A:It depends upon your handling & usages. Generally it can last utpo 2-3 years hassle free.",
            "A:Plastic body",
            "A:it is available on Amazon at ₹22000",
            "A:Yes, on the side power button.",
            "A:it is good but WiFi connectivity is poor",
            "A:yes it run on it.",
            "A:yes,It supports Miracast.",
            "A:yes it supports otg.i connected 2tb drive there is no problem",
            "A:it has Sim slot also wifi",
            "A:Yes it does",
            "A:If working, then 8 hrs approx. Otherwise 2 days.",
            "A:Yes, every smartphn have wifi hotspot",
            "A:Yes the back is of glass, looks pretty premium",
            "A:it last all day. the battery lasts for 1-2 days with heavy use..",
            "A:While buying didn't thought of it bt android os with lenovo UI, at max 40% of ram should be occupied n rest 60 for users",
            "A:11 GB free on first boot",
            "A:no it is not compatible",
            "A:yes",
            "A:2GHz",
            "A:No",
            "A:yes it has lte support. But you cant make calls directly. you would need jiovoice app.",
            "A:yes",
            "A:Yes thru otg",
            "A:Yes",
            "A:yes it is 4g volte supported",
            "A:Stylus can be used. But it is not provided by Lenovo in the box.",
            "A:No... strongly suggest no go for this product",
            "A:It's working for me well without any disruption. Everyday I'm plugging headset for making video and audio calls.",
            "A:always better to use tempered glass and back cover/flip cover. back cover is required for grip.",
            "A:No connecting",
            "A:yes",
            "A:5 Megapixel",
            "A:No",
            "A:Yes",
            "A:Yes",
            "A:yes",
            "A:yes....obviously",
            "A:Yes but not calling",
            "A:yes, but type c otg",
            "A:No",
            "A:yes",
            "A:Yes...",
            "A:yes",
            "A:yes",
            "A:yes power butten.",
            "A:2:00",
            "A:yes",
            "A:yes",
            "A:yes"
        ],
        "likes": [
            "29",
            "1",
            "54",
            "12",
            "1",
            "0",
            "18",
            "21",
            "4",
            "10",
            "3",
            "8",
            "3",
            "2",
            "9",
            "4",
            "6",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "0",
            "1",
            "1",
            "2",
            "1",
            "1",
            "3",
            "0",
            "3",
            "1",
            "1",
            "2",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "8",
            "4",
            "11",
            "0",
            "6",
            "2",
            "4",
            "2",
            "3",
            "4",
            "1",
            "2",
            "0",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "7",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "4",
            "0",
            "21",
            "2",
            "0",
            "0",
            "6",
            "9",
            "0",
            "4",
            "0",
            "3",
            "0",
            "0",
            "8",
            "2",
            "5",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "6",
            "0",
            "8",
            "1",
            "1",
            "5",
            "5",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "6",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "7",
            "2",
            "3",
            "0",
            "2",
            "0",
            "2",
            "4",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "11",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "7",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0"
        ]
    }
}