{
    "title": "MICROSOFT Surface Go Pentium Gold - (4 GB/64 GB EMMC Storage/Windows 10 Home in S Mode) 1824 2 in 1 Laptop  (10 inch, Platinum, 0.522 kg)",
    "product_specification": {
        "Sales Package": "2 in 1 Laptop, Power Adaptor, User Guide, Warranty Documents",
        "Model Number": "1824",
        "Part Number": "MHN-00015",
        "Series": "Surface Go",
        "Color": "Platinum",
        "Type": "2 in 1 Laptop",
        "Suitable For": "Processing & Multitasking",
        "Battery Backup": "Upto 9 hours",
        "Power Supply": "65 W AC Adapter",
        "Battery Cell": "2 cell",
        "MS Office Provided": "No",
        "Processor Brand": "Intel",
        "Processor Name": "Pentium Gold",
        "SSD": "No",
        "RAM": "4 GB",
        "RAM Type": "DDR3",
        "EMMC Storage Capacity": "64 GB",
        "Processor Variant": "4415Y",
        "Clock Speed": "1.6 GHz",
        "Cache": "2 MB",
        "Graphic Processor": "Intel Integrated HD 615",
        "Number of Cores": "2",
        "OS Architecture": "64 bit",
        "Operating System": "Windows 10 Home in S Mode",
        "System Architecture": "64 bit",
        "Mic In": "Yes",
        "USB Port": "1 x USB Type C",
        "Multi Card Slot": "Micro SDXC Card Reader",
        "Touchscreen": "Yes",
        "Screen Size": "25.4 cm (10 inch)",
        "Screen Resolution": "1800 x 1200 Pixel",
        "Screen Type": "HD LED Backlit PixelSense Display with Corning Gorilla Glass 3",
        "Speakers": "Built-in Dual Speakers",
        "Internal Mic": "Built-in Digital Microphone",
        "Sound Properties": "2 x 2 W Stereo Speakers with Dolby Audio Premium",
        "Wireless LAN": "IEEE 802.11a/b/g/n/ac",
        "Bluetooth": "v4.1",
        "Dimensions": "245 x 175 x 8.3 mm",
        "Weight": "0.522 kg",
        "Disk Drive": "Not Available",
        "Web Camera": "5 Megapixel Front Camera, 8 Megapixel Autofocus Rear Camera",
        "Security Chip": "TPM 2.0",
        "Keyboard": "Surface Go Type Cover (To be Sold Separately)",
        "Additional Features": "Sensors: Ambient Light Sensor, Accelerometer, Gyroscope, Magnetometer, Enterprise-grade Protection with Windows Hello Face Sign-in",
        "Warranty Summary": "1 Year Limited Hardware Warranty",
        "Warranty Service Type": "Onsite",
        "Covered in Warranty": "Manufacturing Defects",
        "Not Covered in Warranty": "Physical Damage",
        "Domestic Warranty": "1 Year"
    },
    "product_description": {
        "Windows on the Go": "Working on a project, watching a movie, creating artwork, every experience is enhanced with the user-friendly Windows 10 Home in S Mode operating system.",
        "Easily Portable": "With a weight of 0.52 kg and a 25.4-cm PixelSense Display, this device fits easily in your bag, allowing you to enjoy the Surface Go Experience anytime and anywhere.",
        "Efficient in Every Way": "It comes with 64 GB of storage capacity which is expandable up to 128 GB, so you can store all your pictures, music, and other important documents without having to worry about freeing up space. It also provides you with up to nine hours of local video playback, so you can remain unshackled for a long duration.",
        "Your Versatile Partner": "Whether it's schoolwork and home projects, managing emails or watching a movie, the Surface Go makes it really to share. Its sharp, vibrant display makes it an ideal choice to read a book or a magazine. Also, it comes with an 8.0 MP rear HD camera and a 5.0 MP front-facing camera, so you can capture precious moments and video call your friends with ease.",
        "Your Information is Secure": "With built-in protection such as Microsoft-verified security, Windows Defender, parental controls, and world-class support, you can relax as your data is as secure as it can be.",
        "Laptop Mode": "By opening and adjusting the built-in Kickstand and adding the removable Surface Go Signature Type Cover, you can enjoy using the Surface Go in Laptop mode.",
        "Tablet Mode": "To use the Surface Go in Tablet Mode, just close the Kickstand, and detach or fold the back cover.",
        "Studio Mode": "Just lower the Kickstand all the way down to activate Studio Mode which when used with the Surface Pen provides a natural, tilted writing and drawing angle."
    },
    "reviews": {
        "ratings": [
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "2",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "2",
            "2",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "1",
            "2",
            "5",
            "3",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "2",
            "3",
            "5",
            "1",
            "5",
            "3",
            "4",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "3",
            "1",
            "3",
            "4",
            "1",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "1",
            "1",
            "5",
            "1",
            "5",
            "5",
            "5",
            "2",
            "4",
            "2",
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "2",
            "5",
            "1",
            "1",
            "2",
            "2",
            "5",
            "1",
            "4",
            "5",
            "2",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5"
        ],
        "review": [
            "Review after roughly 2 months of usage.\nAlso, I did buy the keyboard separately. Didn't buy the Pen.\n\nSo, I'll first address what my needs were and then tell you what Pros and Cons did this device had for me.\n\nThe kind of work I needed to do -\n- Run online IDEs(Integrated development Environment) for programming languages such as Java and Python.\n- Occasionally watch movies/shows etc.\n- I wanted more of a productivity device than an entertainment device.\n\nAnd that was it, I needed a device that could do this and be reliable. The problem with me was that I was on a very tight budget and just because I had to run online IDEs, I needed some more horsepower in a device, however, you can't get everything you want when you're on a tight budget and therefore I went on buying this product.\n\nPros -\n- Lightweight, you won't feel that this is in your backpack.\n- Beautiful display.\n- Best 2-in-1 device for Productivity.\n- You're gonna love the kickstand.\n- Premium design and materials used.\n\nCons -\n- Processing power is less.\n- Less RAM, should've atleast had 8GB of RAM. I would've paid extra if I could have gotten the exact same configuration with just 8GB RAM.\n- The device lags when I open more than 3 tabs on Google Chrome and because of the work I do, it always happen which can be sometimes frustrating but then you adjust with time.\n- Also, you can't add more RAM in this device.\n\n\nSo, if I could go back in time and buy the other costlier version of this device?\nThe answer is NO. The cost difference between this version and the other one is too much.\n\nIf there was a version which had the same configuration but more RAM and was maybe, at max, 4k costlier, then would I buy that?\nThe answer is YES. A big YES.\n\nWhy didn't I consider iPad?\nIt was \"cost vs needs\" for me. iPad is a premium product which I would've considered if I were buying this product for entertainment purposes but I needed more productivity and that's why this filled in my needs in a much better way. Think of this product as a laptop and not a tablet. iPad's are much better than the Surface Go if you're looking for a tablet. If you're looking for a miniature laptop then this is the one.\n\nPS - Frankly, I use OnePlus 7T Pro, which I think is definitely much more powerful and snappier than this but my phone still can't give me what this product is giving me for a much lesser price.\n\nPPS - Also, this is my first actual review, I wrote this so that people like me can make an educated guess because I never found someone like me who was in the market with the same needs.\n\nThank you for reading. Have a good day.\nCheers!",
            "Awesome windows based tablet.\nFirst of all its not fare to compare iPad and Surface. I have both.\nIpad is app based product with thousands of app available on apple store. But its restricted to apps only.\nSurface is full windows based tablet where we can install any software, games etc. Its compact, lightweight and premium feel. The kickstand is awesome concept.\nIf you travel a lot and looking for portable windows based tablet then its perfect choice for you.\nPair it with a keyboard if you ar...\nREAD MORE",
            "Before buying this product ( I bought 8 GB Ram and 128 GB SSD), I have seen many reviews and some were very good, good and some was not good. But after using this I must say this is awesome. This might not be treated as a primary laptop for you, but if you are looking for something on the go, which is not so heavy and can be carried anywhere - believe me, go for it without any 2nd thought. I have at home, Dell all in one desktop and I was always looking for something, where I can use effectively on the go and this is the Tablet/Laptop ( whatever you say) for me. I am very happy using it.\n\nSo, if anyone, looking for:\n\n1. A secondary laptop/tablet - which can be used as laptop or tablet as per the need.\n2. A device with premier look.\n\nThis is for you and go for it guys..",
            "I am happy to buy it. I have been working with it one month ago. And its working perfectly.. Microsoft product always awesome...There is no doubt about it. But I have little issue with it, that screen could be wider than 9inchs. Other wise this surface is awesome..whenever you work with it or just hold it, feel like something you have which you can't elaborate by words😊",
            "I travel a lot and I own a Surface book 2 15\". therefore I wanted a smaller cheaper and lighter device for my short travels. I tried an IPad which is a wonderful yet restrictive tablet. the Go was in my sights for a while. I was considering getting the 8gb ram and 128 GB SSD but then saw some reviews about the 4gb 64 emmc and thought that it will be a secondary device so no need for it to spend extra cash and I am glad that I bought it. So far it has exceeded my expectations. it's really zippy . the emmc storage, though slower at read speed than the ssd is faster than a traditional HDD and windows 10 is good at storage and memory management so no worries there. I popped in a micro sd card for additional storage and got a type c connector dock for my external pereferals. the build quality is fantastic and even the basic optional type keyboard is superb is a must to get the most out of it. I highly recommend this device to anyone looking for a quality portable computer . In case you want this as a primary device and want to install more traditional apps then I recommend upgrading to the 8gb ram 128 ssd as you will get more of everything in the long run but if this is a secondary device or you don't use much then like me save some money and get this without second thought.",
            "Perfect ipad killer.. perfect combo of tablet and pc. I have purchased the 4gb model. Decent performance and the hats off to microsoft for designing such a quality product. Battery life is good. Its super light , has just enough power to sail through basic tasks and the kick stand improves the flexibility.\nIts is slightly over priced because the type cover comes as an add on. Just wait a little more till the price of type cover comes down and you ll be fine.\nDo not forget that the windows 10 offers the users plenty of freedom if u compare it to the ipad.",
            "Loved the product Microsoft has nailed it , device is too good easy to carry , it is pro device for student developer yes I run visual studio , visual studio code with good performance, it can run entire windows smooth and heavy workload capable device",
            "it's been few days but it's working is good. As a student, it serves well to me as don't require heavy software. just browse net make my doc's on word, power, excel and one-note. so yes good for students. the keyboard specially is good so buy it, go ahead.",
            "The processor is not so fast. But it gets my work done. I use it for around 12 hours everyday. I mostly use it for typing and watching videos. I didn't find any lag or shutdowns. There is no perceivable heat buildup. After 2weeks.. I have no complaints. It is very much upto my mark. I haven't downloaded any games or used it for that purpose. Mostly Microsoft Office and stuff. The battery life though.. Is not as advertised. I get around 4 hours maximum. But the keyboard I got was very good deal. Quite fast and responsive",
            "Great product, I love this product\nIt's more useful for common people & students\nBetter than Android tablets because it's windows 10 flatform\nMulti tasking very well,\n\nMicrosoft makes good move.",
            "Review after roughly 2 months of usage.\nAlso, I did buy the keyboard separately. Didn't buy the Pen.\n\nSo, I'll first address what my needs were and then tell you what Pros and Cons did this device had for me.\n\nThe kind of work I needed to do -\n- Run online IDEs(Integrated development Environment) for programming languages such as Java and Python.\n- Occasionally watch movies/shows etc.\n- I wanted more of a productivity device than an entertainment device.\n\nAnd that was it, I needed a device that could do this and be reliable. The problem with me was that I was on a very tight budget and just because I had to run online IDEs, I needed some more horsepower in a device, however, you can't get everything you want when you're on a tight budget and therefore I went on buying this product.\n\nPros -\n- Lightweight, you won't feel that this is in your backpack.\n- Beautiful display.\n- Best 2-in-1 device for Productivity.\n- You're gonna love the kickstand.\n- Premium design and materials used.\n\nCons -\n- Processing power is less.\n- Less RAM, should've atleast had 8GB of RAM. I would've paid extra if I could have gotten the exact same configuration with just 8GB RAM.\n- The device lags when I open more than 3 tabs on Google Chrome and because of the work I do, it always happen which can be sometimes frustrating but then you adjust with time.\n- Also, you can't add more RAM in this device.\n\n\nSo, if I could go back in time and buy the other costlier version of this device?\nThe answer is NO. The cost difference between this version and the other one is too much.\n\nIf there was a version which had the same configuration but more RAM and was maybe, at max, 4k costlier, then would I buy that?\nThe answer is YES. A big YES.\n\nWhy didn't I consider iPad?\nIt was \"cost vs needs\" for me. iPad is a premium product which I would've considered if I were buying this product for entertainment purposes but I needed more productivity and that's why this filled in my needs in a much better way. Think of this product as a laptop and not a tablet. iPad's are much better than the Surface Go if you're looking for a tablet. If you're looking for a miniature laptop then this is the one.\n\nPS - Frankly, I use OnePlus 7T Pro, which I think is definitely much more powerful and snappier than this but my phone still can't give me what this product is giving me for a much lesser price.\n\nPPS - Also, this is my first actual review, I wrote this so that people like me can make an educated guess because I never found someone like me who was in the market with the same needs.\n\nThank you for reading. Have a good day.\nCheers!",
            "Awesome windows based tablet.\nFirst of all its not fare to compare iPad and Surface. I have both.\nIpad is app based product with thousands of app available on apple store. But its restricted to apps only.\nSurface is full windows based tablet where we can install any software, games etc. Its compact, lightweight and premium feel. The kickstand is awesome concept.\nIf you travel a lot and looking for portable windows based tablet then its perfect choice for you.\nPair it with a keyboard if you ar...\nREAD MORE",
            "Before buying this product ( I bought 8 GB Ram and 128 GB SSD), I have seen many reviews and some were very good, good and some was not good. But after using this I must say this is awesome. This might not be treated as a primary laptop for you, but if you are looking for something on the go, which is not so heavy and can be carried anywhere - believe me, go for it without any 2nd thought. I have at home, Dell all in one desktop and I was always looking for something, where I can use effectively on the go and this is the Tablet/Laptop ( whatever you say) for me. I am very happy using it.\n\nSo, if anyone, looking for:\n\n1. A secondary laptop/tablet - which can be used as laptop or tablet as per the need.\n2. A device with premier look.\n\nThis is for you and go for it guys..",
            "I am happy to buy it. I have been working with it one month ago. And its working perfectly.. Microsoft product always awesome...There is no doubt about it. But I have little issue with it, that screen could be wider than 9inchs. Other wise this surface is awesome..whenever you work with it or just hold it, feel like something you have which you can't elaborate by words😊",
            "I travel a lot and I own a Surface book 2 15\". therefore I wanted a smaller cheaper and lighter device for my short travels. I tried an IPad which is a wonderful yet restrictive tablet. the Go was in my sights for a while. I was considering getting the 8gb ram and 128 GB SSD but then saw some reviews about the 4gb 64 emmc and thought that it will be a secondary device so no need for it to spend extra cash and I am glad that I bought it. So far it has exceeded my expectations. it's really zippy . the emmc storage, though slower at read speed than the ssd is faster than a traditional HDD and windows 10 is good at storage and memory management so no worries there. I popped in a micro sd card for additional storage and got a type c connector dock for my external pereferals. the build quality is fantastic and even the basic optional type keyboard is superb is a must to get the most out of it. I highly recommend this device to anyone looking for a quality portable computer . In case you want this as a primary device and want to install more traditional apps then I recommend upgrading to the 8gb ram 128 ssd as you will get more of everything in the long run but if this is a secondary device or you don't use much then like me save some money and get this without second thought.",
            "Perfect ipad killer.. perfect combo of tablet and pc. I have purchased the 4gb model. Decent performance and the hats off to microsoft for designing such a quality product. Battery life is good. Its super light , has just enough power to sail through basic tasks and the kick stand improves the flexibility.\nIts is slightly over priced because the type cover comes as an add on. Just wait a little more till the price of type cover comes down and you ll be fine.\nDo not forget that the windows 10 offers the users plenty of freedom if u compare it to the ipad.",
            "Loved the product Microsoft has nailed it , device is too good easy to carry , it is pro device for student developer yes I run visual studio , visual studio code with good performance, it can run entire windows smooth and heavy workload capable device",
            "it's been few days but it's working is good. As a student, it serves well to me as don't require heavy software. just browse net make my doc's on word, power, excel and one-note. so yes good for students. the keyboard specially is good so buy it, go ahead.",
            "The processor is not so fast. But it gets my work done. I use it for around 12 hours everyday. I mostly use it for typing and watching videos. I didn't find any lag or shutdowns. There is no perceivable heat buildup. After 2weeks.. I have no complaints. It is very much upto my mark. I haven't downloaded any games or used it for that purpose. Mostly Microsoft Office and stuff. The battery life though.. Is not as advertised. I get around 4 hours maximum. But the keyboard I got was very good deal. Quite fast and responsive",
            "Great product, I love this product\nIt's more useful for common people & students\nBetter than Android tablets because it's windows 10 flatform\nMulti tasking very well,\n\nMicrosoft makes good move.",
            "Since its launch, I wait for a long to have it... From July'18 to Dec'18 I just went through lots of review video and article. I'm writing this review, after 2 weeks of usage:\n\nNice design: It is exactly handy. The body made from the same magnesium material of Pro series. Loved the kickstand design. It fits in small pouch in my backpack.\nDecent Hardware: Though it is no mammoth, it can do multiple tasking flawlessly.\nPentium gold 4415Y processor really provides the power to make your daily work easy.\nThe pixel sense display is awesome. 1800 x 1200 resolution can stunn you. One can say it has thick bazels, but believe me, it won't be a drawback and it matches with the display. You never feel the bazels. one can use 0.3mm tempered glass on it (as I used) to make the screen scatchless and it retains the same touch response. I used surface pen on it and it responded as well.\nCamera is good and windows hello is awesome, though you need to improve the sensitivity from settings.\nI bought 8gb/128gb variant. It logs in within 30 seconds, with hello.\nBattery is good. One can get 4-5hours of backup in full charge.\nMagnectic 3 sides. Left side for attaching Pen, right side for charger, surface connector and lower side for Keyboard.\nPower button and Volume rocker is on top side.\nSound is really clear and crisp. it has 2 front facing speakers, woolsfen sounding did its work.\n\nAn absolute OS: Surface go comes with original Windows 10 home in S mode. I don't know, why it is called S mode may be die to security. It is one type of locked version of home. In this mode you can not install any 3rd party app, you have to download apps only from Microsoft store. But don't worry one can switch out to full version of home edition. If you need Pro version you have to purchase it from store and this will cost you half the price of the actual. This upgradation is one time (free) and non reversable.\n\nNow pros and conns.\n\nPros:\n1. Design is very beautiful and it is absolutely handy (only 522 gram). Feels premium product.\n2. Decent hardwares provide you the power to perform daily work, office work or home entertainment flawlessly.\n3. One can boast of the real OS. Though Win 10 is not so good for tablets but it is really a good OS.\n4. Awesome display and sound.\n5. USB type C 3.1 connectivity.\n6. Fanless silent design\n\nConns:\n1. Processor is not a mammoth but not messy as Atom processor. You can not run large SWs.\n2. Pricing in India is a bit high. With all accessoires, it costs nearly 69K (tablet+Keyboard+mobile mouse+pen), Keyboard is signature type then it costs nearly 73K. One can get premium ultra thin portable laptops like Envy from HP or Dell or Macbook(2017 model).\n3. Though MS claims 9 hours of battery backup, you can get only 4-5 hours.\n4. May heat while running, it emits low heat.\n\nSummary:\nOne can purchase this product if it used as an alternative. This product is really nice in built quality, design and performance in its class. It replaced my ipad pro.\n\n** I cut a star for the delivery of flipkart. This time it showed its bad ways. After placement of order on 22nd December'18 it delivered on 5th Jan'19, nearly two weeks taken.",
            "i bought it after a lot of contemplating to replace my main laptop (i3, 4+500gb) which i used only for watching videos, editing documents and browsing web and i am super happy with the performance and most importantly the form factor the small light weight tablet form, and i got 4+64 variant and its just fine for light daily tasks so go for it, i did not get the keyboard cover but i m thinking to get it",
            "right, if you were waiting for the perfect low powered tablet alternative that was powerful enough to run windows. this would fit your bill if it only weren't for the Intel Pentium gold on this device.\nIf you've set reasonable expectations for a device of this form factor, only battery life will disappoint you. i'd recommend waiting for the arm based (snapdragon 855) models when they come out. other than that....\ntop notch screen.\nbrilliant audio.\nthe surface type cover is a must have.\nwindows hello? flawless.",
            "Device is excellent in performance n battery backup is around 5-6 hrs n the fast charge feature is soo good n speakers are just awesome the kick stand is very innovative n it's too useful\n\nIn terms of gaming it's also good not the best",
            "If u want a tablet around 40k u can simply buy this. But u want a laptop like performance still u can give it a try. If u want performance then I won't recommend this. But this the best 10inch machine I have ever used.",
            "Fantastic Device.\n\nUsing it for last 2 months and it has delivered fully on my requirements.\n\nI am using 4GB 64GD version.\n\nWhy I bought it?\n\nBecause I have Desktop and I needed a small device for traveling, capable of laptop level performance.\n\nI was using a corei3 4th generation 4GB laptop. Why I mentioned it as my Surface is nowhere less than this.\n\nWhat I do on it?\n\nMultiple PPT, Word, excel and browsing windows opened and working at same time. And it performed well.\n\nI used it as a primary device during my long travel and it never let me down.\n\nIssue... My Surface charging adapter stopped working, but Microsoft sent a new replacement within 4 days. Thumbs up on service.\n\nI am fully satisfied on the price, performance, design and brand...",
            "Absolutely brilliant. Using it for last 2 months, 4GB ram is good. Never experienced any lags, but my requirement is limited to Tally ERP, word, excel (Microsoft office), emails, browsing & pdf. Exporting huge data from tally is also not a problem. Booting speed is faster than my 8GB i3 laptop. Switched from S mode to full windows, also installed printer. Display is beautiful but screen reflection is there, enjoyed lot of Netflix and prime videos. If the accessories were provided by Microsoft in the same price (or on a very lower rate) then this surface go would have been a tremendous hit. Camera quality is not that good, but nobody buys this to take pictures, it’s sufficient for video calling. If your requirement is for a travelling or to complete quick work between things, you should definitely go for this. It also gives you two different charging options (using usb type C, min. 15 or 18 watts charger required). Don’t worry too much about keyboard as you also have a on screen keyboard and touchpad options in windows (but I did bought the type cover), you can also connect usb keyboard using type c otg cable or Bluetooth. Didn’t think I would write this much but, it’s worth the long review. If you buy it don’t forget to register it online for warranty (also provide them invoice to get full warranty)",
            "Excellent product. Perfect for my requirement. Super happy. Not using my regular laptop now. I have 4gb ram and it is adequate for daily use on the go",
            "Wanted to buy a new Surface device mostly for studying, watching videos, web browsing and note taking. Previously had a Surface RT. It died suddenly. Reviews of Surface Go, however, were mixed but mostly good. Decided to give it a shot. I have also added a 64GB microSD card for expansion. My key takeaways are listed below.\n\nPros:\n> Cheapest Windows tablet from a trustworthy brand which is available brand new.\n> Great form factor, easy to hold.\n> Light weight. Weighs around half a kg. More por...\nREAD MORE",
            "Very good product from Microsoft actually this is a computer on the go.You can do all functions of computer on this.Very portable and useful device.Quality of this product is high class.You can use this for productivity works.Very useful for office and educational purposes.I highly recommend this for productivity works.Microsoft great work.",
            "Just one day of use and am sharing my review. Surface Go gets decently charged in an hour. Good standby time. Shuts down like PC and quickly starts up like a mobile. One time Ms office for Students can be purchased for lifetime use. Touchpads are quick and responsive with 4Gb Ram like a mobile. I would have given a 5 🌟 if I could have connected my wireless keyboard and mouse to this device. There is no USB port where I could connect my USB device. I am still trying to figure out if I can connect my wireless keyboard and mouse. If anyone knows please guide.",
            "is fast and handles most software efficiently .i have stopped using my desktop after i got this.if you are looking for a small n portable device then u can consider this.limited apps on microsoft store this is good for word ,excell internet browsing and media consumption.RECCOMEND you buy the keyboard with it and if budget permits go for the 128gb ssd version.",
            "I have been using the 64 GB/4GB RAM version for about 2 weeks now. I bought it along with the regular black typing cover (sold separately). So far I have found it to be extremely effective at everything I have thrown at it. And by that I mean, all the basic apps and purposes. I use MS Office a lot, watch YouTube, Netflix, read a ton of news, browse websites (many with heavy media) and some light games. And Go excels in all these areas. I have not used graphics intensive games (PUBG or Need for Speed), haven't used AutoCad, or Photoshop or done video editing either. If you're planning to do all of these, then this machine might not be for you. Look elsewhere. Or go with Surface Pro.\n\nFor the money you pay, you get a good value. It's extremely portable and light. With the type cover it is barely over 700 grams. The screen is better than most of the iPads. Color accuracy is amazing. Color reproduction is better than any other screen I have used. At 217 ppi the screen resolution and pixel density is sufficiently nice. Type cover is a delight to type with. Dual speakers support stereo output and they are a pleasure to watch videos and listen to songs with. They're also sufficiently loud, so most of time you won't have to use bluetooth speakers.\n\nThe battery lasts more than 7 hours at 50% brightness and at better performance settings(as opposed to what MS claims, which is about 9 hours), but you can probably make it last longer if you use the battery saver mode. For any light activity, if you're using it on battery saver mode, it doesn't affect the performance. As for the memory, if you're not installing too many apps, 64 GB should be enough. However, you do have the option of using an SD card, so that takes care of the problem. You might as well save money and go with 64GB version rather than 128 GB. The 8GB of RAM won't matter a great deal. Trust me.\n\nI would highly recommend it over iPad pro! You'll be doing yourself a great favour if you got this over an Apple product. Unless you're an Apple fan to the core. Watch some YouTube reviews and decide for yourself.",
            "extremly fantastic i recommend it to every one who want to second laptop ya fhir bole to ek secondary just like a tablet i fully satisfied........good one but some little bit improve in battery life all is good ...",
            "Amazing product, most apt for Windows n Office lovers... You can do everything for daily office jobs. The look n feel is fantabulos. Amazing speed, screen resolution, very easy to use tab feature. I also have the keyboard(bought in combo deal) the combination is just Perfect!! Must Buy the Combo, worth every penny!!\nHave been using for over a week now, no heating, absolutely silent, great battery backup(this is my secondary device), but have been using it like a primary device.\nThanks to Flip...\nREAD MORE",
            "Yes, the surface go is expensive for what it offers but it just feels right to get your hands on one. You may find the screen to be small if you've been using traditional Windows laptops. Windows 10 isn't as optimised for touch usage as well. But it doesn't dissapoint. The pentium gold on Windows S mode gives you low level underclocked i3 level performance. So I would recommend you to buy the one with ssd storage as that helps to boot up the device and general usage much faster. Overall a great entry level product from Microsoft. Just wish they get rid of the huge bezels next time.",
            "I bought the 64GB/4GB version only for media consumption and it perfectly fits my needs. The display is very good (vibrant and has up to 400 nits of brightness). You have to disable adaptive contrast which is on by default (makes the screen look dull but to save the battery I suppose). This device is good enough for word processing, lightweight browsing, and media consumption. Windows Hello facial unlock works pretty well even in complete darkness. Speakers are really good, they are two 2watts speakers (Dolby available on OS). The only downside is the battery which lasts about 4 hours, but it charges pretty fast. Buy it on sale you might get it at a pretty good price.",
            "Quite satisfied with the product.\n\nThe magnesium design feels solid in the hand and the device looks awesome.\nIt's a small device with the functionality of a full on computer. The screen seems cramped initially but once you start using, it's pretty usable. The bazels aren't as thick as they appear on advertisement and reviews.\nIt's perfect for browsing and media consumption, thanks to the dedicated kickstand, the screen can be adjusted at various angles for better usability.\n\nThe battery lasts a day easily with normal usage which may include browsing, streaming, video playback and a little bit of work.",
            "A good product from Microsoft, using it from 5 months, battery lasts 6hrs using it only as a tablet with out type cover experience is smooth got for 30k witch is same as international price, very good for basic computing build quality is great , a full windows machine with sufficient power as a basic computer can't expect more from a fanless, compact , 10 inch , windows tablet 😁",
            "Was skeptical of buying because of 4gb ram and pentium gold processor. But it’s really good. Handles Visual studio code, blender2.8, main two heavy softwares that I use perfectly. Don’t expect to create 3d models with a lot of polygons and you will be fine. Perfect for web dev on the go. Day to day works are flawless.\n\nIf you need Adobe products, try looking for alternatives. There’s a AdobeXD alternative in windows store called Lunacy. It works flawlessly and is actually better than AdobeXD. For Photoshop, go for AffinityDesigner or something similar.\n\nMake sure to go out of S mode, and update the drivers.",
            "Surface Go 4GB has a reputation of being slow but we need to no compare this with an actual laptop. The performance is pretty adequate for a tablet and even as a laptop if you understand it limits. Within its performance limit it works very well and is very snappy. The display and touch are of very good quality and so is the build quality. It looks and feels very premium. Thee kickstand is very useful and type c port is also a good addition. The product is bery good but it has to be understood it is not capable of being a primary laptop. It works best as a primary tablet or a secondary laptop. If these are your use cases then the tabletworks very well. Getting Out of Windows 10 S brings lot of freedom but be cautious of installing software. Any bad software will impact the performance.",
            "Good portable 2 in 1 tablet and PC at the same time. Got windows 10 home, ideal for business purposes.",
            "Even though it wasn't flipkart assured, reached on time and packaging was good. It was as sealed and new as if buying from a store. Charges superfast and battery back up more than I expected. I like how it has a back stand, seems perfect to me as I can use it like a laptop on a table. I got it for a discounted price of 29,999 and now my brother wants to purchase it too. But the prices are again up to 37,999 .",
            "Tiny Machine to do your office work on the go !!! It is not powerful enough, but can be used to do office work and casual browsing. Although you can come out S-mode to install .exe applications, however, It is better to keep it as such for smooth functioning. It is not going to replace your laptop or main computer. Treat it as your secondary laptop, you are good to go.\n\nThe weakest link is the battery - hardly works for 3-4 hours, however, to compensate it, we can charge it with a USB-C charger. My Pixel-2 charges it in a decent quick time and I don\"t have to carry the supplied brick.",
            "The Surface Go is a good portable tablet plus PC. It can be used as a primary computer also if you use a lot of Microsoft word and checks e-mails etc. The storage provided at first seemed to be insufficient upon the first windows update but don't worry, removing the old windows file cleared maximum space in the disk. I have now 33.5 GB free space with latest windows 10 version. If you want to install apps from other sources than the Windows store, switch to Windows 10 home from S mode.\nOverall, i m highly satisfied with it's performance given my nature of work.",
            "Great product. Easy to use. The only downside is that if we want to keep the warranty we can only install apps which are available in Microsoft store. So no chrome and many other apps which we can download easily in other devices. If you don’t use lots of apps for daily work and are just satisfied with Microsoft apps and edge as a browser then you would love the product",
            "This surface go is powerful but not like other full fledged laptops, users need to understand this machine is designed for productivity purpose and the CPU does not throttle to boost performance. But over all this thing can run games like fortnite, rocket league, Pubg lite etc but in lower specifications.",
            "I am very much satisfied with my Surface Go. It suits my needs perfectly. I use it for official and light work and it is perfect for that.\n\nThe display is very good though not the best in market but then I wanted windows in my pad and that was my first priority.\n\nTouch input in screen is sensitive and well calibrated and it works as well with 3mm tempered glass which I applied for protection.\n\nBattery back up has been pleasant in my experience with almost 6 hrs of non stop video playback on Netflix app and around 9 to 10 hrs if I am using MS Office. Reading ebooks on it is also supercool, as it supports chm, pdf, pdb all sorts of format. I can also mount virtual drives of my surgical atlases and run my less performance intensive simulation apps easily.\n\nDo remember to upgrade Windows 10 S to Windows 10 Home, as it is one time option, and it is free. You can continue with Windows S but it has many restrictions due to security, or alternatively you can purchase Windows 10 Pro from same link and upgrade to that.\n\nOnscreen keyboard is very easy to use and keys are evenly placed, I also purchased keyboard for surface go, which has made typing much easier and turns it to mini laptop anywhere.\n\nI don't use it for gaming so I can't comment on its performance on that, otherwise it is a great product.",
            "Very well built tablet - computer hybrid device from Microsoft. Works well as a secondary device. Best part for me was the form factor. Simply loving it 🥰",
            "One of the best tab (windows) I have used. It is good for work on the go. (not for Autocad or heavy app). Lte could have been perfect combo.",
            "As per price a stylus would be very helpful or even a stylus with some offer would make the product more marketable. Rest is better than fine till now.",
            "Awesome product. Costly than Apple but also more productive as it can work as Tab and computer both. I wish office and keyboard were included but still it is good to go.",
            "Easy to handle and Excellent specifications. Good for office use. It's better to sell the accessories along with the product. Took lot of time on net for selecting suitable accessories.",
            "I bought the Surface Go for a laptop-on-the-go experience. This has allowed me to leave my work laptop in the office and use this conveniently sized product when I need to answer mails or work on any task when I'm on the move. My concern was the processor and comparatively low RAM, but haven't had any issued yet. Would definitely recommend this as an add-on for someone who already has a decent laptop.",
            "very good purchase. lightweight and good looking piece.got in 40k.if cover would have been provided, better because not good option available in market.",
            "I'm MS GO 8GB, 256GB SSD. 5 months old user, it pretty good for my tasks. Good performance 👌 even I run Adobe Illustrator, and Photoshop, also I run camtasia, Filmora with smooth performance. the main reason why I purchased the MS Go for writing blogs and DM activities.",
            "Brilliant piece of hardware. Everything works perfectly. It's a fantastic buy for anyone looking for an ultra portable sexy laptop.",
            "Outstanding product by Microsoft. After 11 days of usage I must say one should have this tab as a secondary device as you can easily carry anywhere. Sound quality is extraordinary. Need to purchase the keyboard separately hence it costs high totally. But it's worth for spending. Finally it's the best ever.",
            "very nice working.good product for price",
            "Excellent product.",
            "It is actually a mini PC. Unlike I-Pad, it gives liberty to do everything that can be done with Windows!!",
            "Giving review after 4 months.still now everything is fine working properly..",
            "awesome happy with the flipkart on time delivery.Also got Rs 8000 discount. Thankyou flipkart.",
            "Nice product",
            "Awesome design and super fast .",
            "Easily attracting and smooth",
            "Not working after Windows update! Warranty is also not showing 1 year from the date of purchase when I registered the product in Microsoft's site!",
            "Average",
            "after Macbook air, I liked the design and ease of use ...good one to have especially with outlook and MS office",
            "Excellent thank you Microsoft",
            "8 gb & 128 ssd.....it is very good if you think that this is your secondary option. battery back up is average depends upon your usage....and for those who are using AutoCAD, you can take this. I've installed it and it's running...",
            "If you want good compatible light weight....\nThen this is for you\nMust buy",
            "It is really nice device for everyday use.. I just love it..",
            "Product is very good but do not buy this from Flipkart as Flipkart has these from 2018 and as per Microsoft their warranty was of two years which is already ended in Feb 2020 which is displaying on my surface Go I contacted Flipkart they said to raise issue with Microsoft I have submitted my invoice to Microsoft after spending to much time to get to the processes to do that and still after 6 days they are not updating thing is it is a out of warranty product sold by Flipkart",
            "Must buy this product( Microsoft surface pro), never purchase hp 360 degree foldable laptop. As per my experience, I have purchased hp product, but I haven't received any response from hp service center/ they denied to solve my problem.",
            "I purchased the surface go last month. Needless to say, this product is only for business travellers due to its small size. But don't get fooled, this mini computer hangs a kot, at least the 4gb storage version.\nFor instance, you might have already typed a sentence and wait, what do you see? It's still stuck with the first word.\nApart from this, a poor battery life makes it an ever average package at such a price point.\nIf you want a powerful laptop which can handle your daily tasks easily, then this one is NOT for you.\nI regret my decision of buying the surface go 4 GB along with the keyboard.",
            "Although really good at design and display. My device really felt underpowered. The web browser is super clunky (even edge). It takes time to even do fullscreen of YouTube videos for god sake. Not an apple fan and hate there phone series but an iPad would be a much better investment than this.",
            "all are nice but no keyboard",
            "Performance- 3/5\nBattery- 3.5/5\nCamera- 4.5/5\nDesign- 5/5\nWorth- 3.5/5\nStorage- Very less(as it has only 64 gb of ssd )\nHeating issue while charging or multitasking\nLooks premium\n🙏🙏",
            "a good one in it's segment",
            "Perfect",
            "Superb product by microsoft finally. I needed a laptop and a tablet both. This serves the purpose for me. Battery backup is bit less but suggested brightness level it should be fine",
            "It is a giant killer.\nI've an iPad & a MacBook, but lately I prefer the Go to take on my journey.",
            "Its a very lightweight laptop alternative for basic tasks.i dont use it much as its incapable of doing most things.only use for watching videos smtimes now",
            "System consume high mobile data and always on update mode.\nSometimes system gets hanged and takes maximum time to come in normal mode.",
            "best product I have ever seen",
            "Extrodinary.. Awesome.. Very royal product.",
            "The product is very good. Got the Acttv offer what have been promised.",
            "worst product power issue since 2nd day",
            "one must opt for this laptop, elegant design, superb speed and easy to carry.\nwindows s mode quite good.",
            "Have been using this for almost three months now as my primary.\n\nAs a lawyer, I use it mostly for MS Office, surfing, and reading PDFs.\n\nWhile the display is lovely, the machine is definitely not as zippy as my old Retina 13 inch Macbook Pro. Gets the job done with minimal lag, however. Keyboard (bought separately) is brilliant, don't miss a larger one at all.\n\nRecommended for people needing a mobile device. However, the screen is a bit small, so not a very ideal primary device.",
            "Awesome product",
            "not satisfied with product.\ntoo expensive for these kind tabs..\nbetter buy iPad.",
            "Very bad battery and no service support after warranty period is over , No service centre available and their phone numbers not working , Product is superb until it is in warranty after that use very carefully because after that you can't repair it easily.",
            "Very good and versatile lap top/ tab. Blindly go for it.",
            "Very bad",
            "It's wonderful. No complaints whatsoever. Perfect for my use since I travel quite a bit.",
            "Only purchase it ,if your needs are casual browsing, skype calls,watching movies & doing some documents here & there.Speakers are awesome,have incredible stereo separation.",
            "Best products in small size",
            "its a very nice product and performance is better than other device .",
            "fabulous",
            "Nice product from Microsoft\nFlipkart giving me reasonable price for that\nHappy from product",
            "Product was delivered in good condition.The tabs performance is decent.You get stock Windows feel.Paying extra for the keyboard is a bit harsh from Microsoft.I have tp buy it yet.The bezels of the tab are a bit too more.The images here dont really show the bezel.May be next version would be better designed.I was waiting for a new Microsoft Go to be announced in the oct 2 event of microsoft but that dint happen so went ahead with this purchase.",
            "Feather light and Perfect for daily use.\nDon't expect performance like a regular full scale laptop.",
            "i have taken a good decession on purchase of the surface go.",
            "It is very nice one",
            "Product is good but the battery doesn't last long. it dries up in 4-5 hrs",
            "excellent",
            "Just we can buy with blind eye for sure. Worthable to buy. Especially 128gb version.",
            "well not as expected. it hangs a lot!",
            "Let me give u an honest review and you decide to buy or not\n1.Handy\n2.Good design\n3.Price higher than the product actual value\n4.Keyboard and pen too expensive =8000+8000=16000 without the tablet or pc\n5.A little slow.\n6.Good for those who sketch and use doc word, ppt,excel\n7. Worst i dont like about this product is it dint support OTG or pendrive to transfer data which is really a big problem",
            "Excellent product..useful for normal office works, travel",
            "Very Slow",
            "a bit overpriced but worth the money. works great. but my suggestion is to get the keyboard along with it as the windows 10 onscreen keyboard sucks.",
            "awesome product got it delivered within 2 days.only problem the windows interface is not very much good besides that the product is amazing.",
            "Good",
            "Product is nice but SIM card LTE slot is not provided also offers with product are not given inspite several times issue raised with Flipkart team",
            "1. this is not tab it is mini computer.2. no video calling except skype not able to use whatsapp.3 purchase key board which is min Rs 8000.4. pen also have to purchase seperately which is Rs 8000 min.5. Microsoft office also have to purchase sepearetly which is Rs 5000 to 7000. therefore over all it is very costly if you want to use in multipurpose. better go for Samsung tabs come with pen and economical key board or Apple Tab. please do not buy any thing get out of order it has to be replaced at cost of 20k minimum",
            "I don’t recommend anyone to use this\nYou can only install app from windows store\nIf you try to install chrome browser then forget about it\nYou can’t install any how in this system",
            "Within one month the display got blurred",
            "Waste of money better to buy apple i pad",
            "Good product. But accessories are costly. Their is no repair, replacement is extremely costly.\n\nWorst part is availability on Flipkart. Worst delivery and customer care experience. Microsoft should partner wit azon else flipkart will bring a bad name to a good product.",
            "Very very bad😭\nNo star❌",
            "5 stars",
            "Way to Awesome",
            "Very good",
            "Overall is the best",
            "I hv received this product on 12th june2020 and it's warranty was already over in 2018.... so I started facing this battery issue in September...and my returned date is already passed....so they had only given me no. Of customer support of Microsoft that's it....the problem with my device is dat battery completely drains in switch off mode...so whenever u hv to use next u have to plug in charger because there is not even 1% battery.",
            "Very good product. Good performance. Must buy.",
            "Product is good but price over flipkart is not competetive.",
            "Please don't buy Microsoft Hardware at all. Both product and their support are pathetic. East or west Dell is the Best.",
            "If you are looking for a tablet, just don't buy it. Just don't. For a mini laptop. It is just fine.",
            "Everything is good but I received a faulty unit .Type C port was not working .",
            "This is long term review after 8 months ...bad charger ... doesn't work properly....n new charger is 8k n new pen tips is 5k ....bad palm rejection. Will shift to mac eco system in a year fed up by Microsofts over priced peripherals.",
            "Beware if you want to add micro sd to surface products.. some times micro sd doesn't fit into its slot and will not appear on your computer..\n\nBit on the lower side in terms of performance..\n\nBut best in its class.. of tab cum laptop",
            "Quality is cheap and company does not refund my amount after product pickup",
            "EXCELLENT",
            "Good product but because it has 4 gb ram it tends get slow specially working on python",
            "I LOVE THIS LAPTOP , ITS HIGHLY RECOMMENDED FOR U GUYS ..... 64 GB SPACE IS GOOD",
            "Good product by MS but only for learning purpose, don't run too heavy softwares",
            "Osm product",
            "good",
            "Its OK OK",
            "Too much slow.",
            "The charger of the product sent is faulty. Need help to correct it.",
            "Wonderful responsive touchscreen.Good performance.Overall worth every penny of the cost for which it is available. Rating 4/5.However keyboard and touchscreen pen to be purchased seprarately.",
            "Worst product if u want speed. Hangs while doing every job",
            "Super quality very much satisfy. It was my good decision to buy Microsoft surface.",
            "Excellent product. A very practical device, great utility value.",
            "Easy and useful for home use. I like the product",
            "Battery is normal ok but the main think u cant install any importan apps our u can work on google as your home\nOnly u can work what microsoft store and microsoft have\nBut thing is that microsoft dont have multiple app and softwere surface go will not allow to install out side app our link to download to open i hope micro will change this feature\nMy mood is 55% to send it back to flipkart to purchase any other tab but because of it Carey's windows not 100% sure to send it bak\nIn one day its start to stop when want to open any app or meams stuck",
            "Very nice product, material isn't cheap and the speaker quality is 👌",
            "Its totally bakawas I suggest costumers not to buy any electronic products from flipkart we have perched this product which we got was not getting switch on first, the product got replaced that product battery is not even coming 2 hours ....it doesn't even deserve 1 star....we have lost 35000 rs as well our time",
            "Worthy product from Microsoft",
            "Screen is awesome, if HDR support would there then much better,but as a tablet it's perfect and I can use it as a computer also for some tasks. For reading, watching videos and web surfing it's perfect.",
            "Very good",
            "PRODUCT IS VERY GOOD",
            "Beauty at its best.... Very good product by Microsoft.\nClub it with a keyboard, then it's a perfect laptop.\nFantastic machine for travel.",
            "Don't use this product at anycost if u buy this product it is the biggest mistake in your life",
            "Heats up when charging..\nIt's awesome looking 😍\nWorks great too😊\nI m satisfied on this product...",
            "Portable, perfectly in sync with my needs.",
            "Good one",
            "Excellent product.",
            "Very handy , useful , portable and twin in one as laptop and tablet.",
            "The battery is not working, no response from Flipkart yet against multiple requests to change the product. Highly disappointed. I would suggest to directly buy from Microsoft.",
            "For note taking purpose i bought this surface it work well and used for online classes.",
            "Completely satisfiedatisfied",
            "Worst performance, Gets over heated quickly and super slow processing. Worst product ever from microsoft.\n\nI know the design is lucrative but don't expect any performance from it",
            "Superb product",
            "This is a total garbage for the price. Very slow device, almost none of the android apps work, even the videos don't run without flickering. Don't waste your money on this. Warrantee already lapsed for the new device. Utterly disappointed by Microsoft",
            "Don't busy this product , performance is very bad , and you do not have a exchange option also .",
            "Takes time to boot, very slow face recognition, hanging",
            "Very poor battery life. It's been a month and it has already started discharging every 2-3 hours.",
            "Good. Worth spending",
            "Looks good thats it...\nGood for nothing",
            "Good product, but when I tried to register it online it showed out of warranty.",
            "it is above ipad for usability but slightly lower on performance..overall very good for books reading, Microsoft office, portability and presentations.",
            "Processor is slow. It",
            "Nice and cute, happy to use",
            "nicely designed",
            "bast",
            "Display is not working",
            "Excellent and lowest price",
            "Solves purpose as a secondary option.",
            "OK with pen. without pen it is not that much usefull.",
            "Awesome Laptop",
            "I purchase this only for excel or mail purpose\nBut it’s not working properly it’s very slow\nNot even recommend to purchase",
            "Awesome delivery by Flipkart.\n\nGreat Windows tab or 2 in 1, call it what you want but its amazing for watching videos and even for working in microsoft office.",
            "This is good product. But Microsoft destroyed Windows after Windows 7. There should be at least full screen virtual touch pad. If i could install Windows 7 on this, This would have been good.",
            "very very good product for light weight and reliable and convenient usage.",
            "excellent product",
            "very handy for personal use but we have to buy office 365",
            "Good for people who have to work on-the-go like mailing , movies, small data transfers,etc",
            "Best quality product except of a bit heating issue has observed...it's super handy and useful alongwith your primary laptop with much higher specs!!",
            "not\nsatisfaction",
            "good product, very handy",
            "Handy for general use and reading stuffs online.\nHave face ID which is great.\nFront camera is nice, I have tried video call.\nLight weight coz build material is plastic.\nA bit thick compared to iPads 🤓\nVery slight lag is there between touch and response.\n\nAlternatively you can buy a iPad Air at same price with better performance and looks.",
            "good build quality and do its purpose very well.",
            "A perfect mix of portability and design.\nthings I like:\nPortability\ntype C charging\nkeyboard desgin\nunconventionally convincing 2 in 1 capabilities\na mini desktop experience on the move\n\nthings I hate:\nbattery drains super fast,3hrs is the max I could get\ntablet mode is pathetic due to windows OS experience",
            "product is good, but keyboard is missing and s pen too.\ndon't know if we have buy and if yes I am ready to get both.\nrequest you to please suggest on this",
            "Super perfomance",
            "Excellent item.",
            "goog product\nmicrosoft good work.",
            "awesome product.. win build 1903 updation makes much faster..",
            "The product is good, very slim and stylish but the display is already damaged. Cover should be provided with the package.",
            "so fast",
            "Good",
            "The product is excellent. Display and sound quality is fabulous. Some time the key pad doesn't comes up soon when you need. Some times some of the content hides behind the key pad. I suggest not to buy as it is not much useful because you can not download many apps and software except Microsoft products. It is Two years now, got a very thin vertical line across my surface go screen. I hardly used it.",
            "Good product",
            "All-over Great but, sometimes a little bit sluggish due to eMMc type internal memory...",
            "awesome",
            "Original product in well packed condition delivered on time",
            "Superb Product Must Buy",
            "Amazing performance. exactly does what I brought it for. People who are light users - just browsing & copying data from portable devices - This is it :)",
            "Excellent Product",
            "good and reliable product as described",
            "awsome product with awsome Performance Loved it !!!!!!",
            "Awesome mini laptop cum tablet for document editing and media consumption and super portable",
            "super tablet",
            "A very handy product but Microsoft must give full use of office",
            "good product by Microsoft with affordable price, but it let user to install apps only from stores while running in S mode, of course Microsoft let you to switched to other version of Windows",
            "Meets expectations. Bought with a key board. I am using this to connect remotely to office workstation. I don’t think it will handle performance intensive applications. But I dont see any issue with normal day to day coffee table browsing and media consumption. Cord connected to usb type c port gets in the way when you charge using the surface connector. Windows is just OK when compared to the Mac experience.",
            "decent tablet... much better to use with the surface go keyboard..."
        ],
        "likes": [
            "1965",
            "261",
            "389",
            "191",
            "507",
            "104",
            "67",
            "72",
            "30",
            "19",
            "1965",
            "261",
            "389",
            "191",
            "507",
            "104",
            "67",
            "72",
            "30",
            "19",
            "667",
            "6",
            "6",
            "14",
            "11",
            "4",
            "4",
            "4",
            "9",
            "12",
            "5",
            "9",
            "8",
            "3",
            "7",
            "5",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "2",
            "23",
            "6",
            "16",
            "14",
            "13",
            "17",
            "5",
            "10",
            "52",
            "13",
            "13",
            "4",
            "6",
            "51",
            "10",
            "20",
            "3",
            "3",
            "3",
            "6",
            "4",
            "8",
            "2",
            "3",
            "3",
            "17",
            "5",
            "3",
            "2",
            "1",
            "9",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "3",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "4",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "166",
            "86",
            "147",
            "87",
            "277",
            "68",
            "13",
            "37",
            "9",
            "7",
            "166",
            "86",
            "147",
            "87",
            "277",
            "68",
            "13",
            "37",
            "9",
            "7",
            "168",
            "0",
            "0",
            "3",
            "2",
            "0",
            "0",
            "0",
            "3",
            "6",
            "1",
            "6",
            "7",
            "1",
            "10",
            "7",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "1",
            "1",
            "0",
            "0",
            "2",
            "4",
            "0",
            "4",
            "3",
            "3",
            "5",
            "0",
            "2",
            "29",
            "4",
            "4",
            "0",
            "1",
            "39",
            "4",
            "12",
            "0",
            "0",
            "0",
            "2",
            "1",
            "4",
            "0",
            "1",
            "1",
            "27",
            "6",
            "1",
            "1",
            "1",
            "17",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "5",
            "3",
            "1",
            "1",
            "1",
            "1",
            "1",
            "13",
            "2",
            "26",
            "4",
            "4",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1"
        ]
    },
    "qna": {
        "questions": [
            "Q:M a med student and reads books with pdf size of upto 500 mb andrarely more.would there be fast rendering or it will take some time. I mean how well the processor handle huge pdf files?",
            "Q:Does it come with preloaded MS office package or we need to purchase separately?",
            "Q:can external hard disk can be connected in this device??",
            "Q:I Will Get Keyboard With in 37999 Or I Have To Buy Apart From It ?",
            "Q:can we expand its SSD storage????",
            "Q:software are same as laptop?",
            "Q:Can we do python programming on it?",
            "Q:along with this laptop keyboard will be provided or not",
            "Q:is any another keyboard add on it or not",
            "Q:how is it for ms office day to day regular work.",
            "Q:it is touch screen laptop",
            "Q:Is it possible to install \"Origin Pro\" software ?",
            "Q:in this laptop chrome works or not?",
            "Q:can I connect wacom drawing tablet to it and use?",
            "Q:how can it be used as android mobile or tablet",
            "Q:how is camera quality?",
            "Q:can we use idm(internet download manager) & torrent or any other softwares...like pc",
            "Q:we can play gta 5 in this laptop",
            "Q:1)Can we install Tally ERP on this device, 2)also we have multi user tally, Can i connect (With good internet both sides) and access server through VPN fluently,",
            "Q:can we install tally through pendrive?",
            "Q:does the sales pacakge include keyboard?",
            "Q:64 gb is sufficient storage?",
            "Q:max capicity of hard disk i can use in this device",
            "Q:Will it be Suitable for AutoCAD",
            "Q:Does it contain lan cable",
            "Q:Can I install Linux or Android based os like any other laptop ?",
            "Q:Can I use excel for free or will to buy subscription",
            "Q:Does it has bluetooth and wifi?",
            "Q:can I use SAP and also can i connect USB type printer",
            "Q:it supports type c otg?",
            "Q:can i install all 3rd party apps?",
            "Q:is key board free with it?",
            "Q:Hi, can I use this device for autocad and 3ds max. what abiut the graphics card.. pls confirm",
            "Q:Does it come with Microsoft office installed ?",
            "Q:keyboard and mouse is included with it?",
            "Q:What is Windown 10 Home S Mode?? What is S Mode?",
            "Q:can i connect printer by using usb wire",
            "Q:How does it perform for web development using VS Code and Chrome? Precisely, I need it for basic development in JavaScript and Python.",
            "Q:does ot support adobe page maker software?",
            "Q:Memory expandable upto 512 GB?",
            "Q:Is Microsoft surface go magnetic tablet keyboard compatible with the device?",
            "Q:can we any window application ms office 7 like we do in laptop ?? not in s mode..",
            "Q:Does it come with touch pen?",
            "Q:is this good for traders for trading views and candle bars and real tradings?",
            "Q:pubg works on this device?",
            "Q:Can anybody confirm actual battery performance on usage, like web browsing, video stuff?",
            "Q:can I connect 1 tb harddisk",
            "Q:We can use with hand or only in pen",
            "Q:Can I install team viewer on it ??",
            "Q:its touch screen responce is good or not do you get pencile and keyboard with it plz responce",
            "Q:is it support 3TB external Hard disk?",
            "Q:can i use this laptop for programming like python, java ,cpp?",
            "Q:I want to know that it is of which company ??",
            "Q:can we use it for online classes with apps like zoom ,google meet and classroom?",
            "Q:Is it support multi touch? how many finger does it support?",
            "Q:can we download instagram app in this?",
            "Q:Can i play games like fifa?",
            "Q:in box keyboard will be there ?",
            "Q:what about the pen is it attached to the surface go are we have to purchase it ????????",
            "Q:does it come with a webcam?",
            "Q:it laptop video editing facility yes or no",
            "Q:Is this tablet compayible with onenote app",
            "Q:can we play games like pubg and asphault 8 or 9 without any lag?",
            "Q:I already have Office 2016 in my Microsoft account. Can I install it on surface and use ?",
            "Q:does thekey board compulsory to operate thus device?",
            "Q:is 4gb version is good for trading",
            "Q:can we print on bluetooth thermal printer",
            "Q:can i use apps on this ... i need it to use marrow app , which is for medicos ....",
            "Q:is there pen with this package",
            "Q:do we have to buy the keyboard from apart this price???????",
            "Q:Is it possible to connect a deskjet printer with the usb cable and carry forward office printing jobs on ms word?",
            "Q:can it works as rewriting pad by using pencil",
            "Q:can we expand the storage by 512 gb",
            "Q:is surface compatible with cellular",
            "Q:what is emmc ?",
            "Q:can I connect keyboard to this ?",
            "Q:can we turn off s mode?",
            "Q:how can we expand memory",
            "Q:Can this (microsoft Go) be able to maintain or keep up website daily?",
            "Q:Please Answer ASAP, will it be billed as a Laptop or a Tablet ?",
            "Q:it is come with all things",
            "Q:ram can be expanded or not?",
            "Q:can it is useful for an app developer?",
            "Q:is this have play store app..can we have bujyu s app in this",
            "Q:can we make ppt on it",
            "Q:can i install general softwares like VLC media player, utorent, pdf reader, rar software etc??",
            "Q:can we connect pendrive",
            "Q:can i play games from steam? light games of course",
            "Q:how to connect external hardrive?",
            "Q:dose this product with keyboard r have to buy",
            "Q:i used to give presentation for office work..can i connect projector so that I can better give give presentation through ppt.",
            "Q:data SIM card does it support?",
            "Q:can i do c,c++,latex,matlab in this tab?",
            "Q:if we can make notes by this tab",
            "Q:Can I install Adobe Pagemaker software and Akruti multi language writing software ?",
            "Q:can we attach hard disk to it?",
            "Q:Does this tablet consist calling feature?",
            "Q:how to connect external hard drive to watch movies",
            "Q:CAN I use what's aap",
            "Q:does it supports power point , ms office and word",
            "Q:does it has face unlock",
            "Q:I wanted to know, from where can I buy the Surface Pen in India ? and how much does it cost ?",
            "Q:can we use ms office Mobile version downloaded from the Microsoft App Store in it for free ???",
            "Q:Can i connect it with smart tv wirelessly",
            "Q:How is it for web development using Chrome and visual studio code? I'm planning to take the 8gb variant for the same.",
            "Q:in this we can do autocade",
            "Q:does remote desktop work on this?",
            "Q:It is useful for animation students?",
            "Q:Does it have audio jack for connecting ear phone ?",
            "Q:What is the body built of ? Plastic or an alloy??",
            "Q:how much capacity of external hard drive i can use on this device",
            "Q:will stylus pen come with the tablet",
            "Q:can i use tally or busy accounting software in this or not?",
            "Q:is it i3 or i5 processor",
            "Q:can i install turbo C ?",
            "Q:How long battery remain",
            "Q:Can we use watsapp,insgagram. In thus tab??",
            "Q:Did this come with keyboard ,pen&mouse or we have to buy it",
            "Q:Can we work on java",
            "Q:Can I dual boot another software with it?",
            "Q:was the pen included with the same purchase?",
            "Q:Keyboard and mouse and pen free with it",
            "Q:Can count this device for video editing and Photoshop ?",
            "Q:Can i do RAW image editing using Capture NX D(Nikon RAW image editing software)?",
            "Q:can i use SAP programme and USB type printer",
            "Q:can i install coding software's like IDE S like java,php and net beens softwares",
            "Q:performance, display, hanging,?? which is better?",
            "Q:Can I install tally?",
            "Q:is this use full for Bsc computer science students",
            "Q:Hi! Till how much is the memory expandable? The product page mentions 128 GB but someone mentioned 512 GM in an answer. Wondering which one is correct! Help please :-)",
            "Q:Can we connect this with wireless keyboard & mouse.",
            "Q:max sdx card we can use?",
            "Q:does the pen come along with the tablet?",
            "Q:Is it come with pen or need to buy additional?",
            "Q:Can I install Ms Office Suite on this device? Can I install and use it for running IDEs? Can I use it for programming HTML, XML, etc? Are apps in Microsoft Store downloadable for free?",
            "Q:Does it come along with this product or I will hv to take it seperately ?",
            "Q:Does Laptop comes with Keyboard or we should buy separately",
            "Q:with keyboard?it support s 4k vd?",
            "Q:Does it include keyboard in the pack ?",
            "Q:Do android like apps run on it in tablet mode?",
            "Q:may we use pensive in this",
            "Q:whether the keyboard and pen also included in package. ? or else we need them to buy seperately ?",
            "Q:keyboard and mouse are included in box ?",
            "Q:Is It SIM Card Supports??",
            "Q:Is this Android compatible ?",
            "Q:is this tablet best to play games",
            "Q:External hard drive capacity",
            "Q:Can a normal bluetooth mouse be used with it or do we have to use only microsoft's mouse?",
            "Q:with keyboard ya without keyboard",
            "Q:can we play pubg mobile in it?",
            "Q:Should I buy the Keyboard separately ?",
            "Q:it can I use for designing ?",
            "Q:can we animate on it?",
            "Q:Can I use programming lang softwares like Python, Hadoop.? And can we attend live class sessions",
            "Q:Can v rest our hand on the screen while writing with the pencil.",
            "Q:can i extend the hard disk",
            "Q:can we type on it. like we do in phone. using touchscreen qwerty virtual keypad.",
            "Q:how to conenct printer",
            "Q:is surface Go ideal for heavy excel & other software usage ?",
            "Q:Auto cadd and other civil software's are working well?",
            "Q:which one will be good, those who are working on Internet (speed) \" Apple IPad pro 32 GB or Microsoft surface go Pentium gold 8GB Ram \"",
            "Q:Which generation is this laptop?",
            "Q:Can it be connected to a projector?",
            "Q:I can connect a key board for typing",
            "Q:can i download children education App. like cuemath, byjue",
            "Q:will it comes with pen and keyboard or we have to buy them separately",
            "Q:the keyboard is attached to it?",
            "Q:can i install auto cad like softwares??",
            "Q:Can usb type c port used for charging & what will be the wattage of charger required?",
            "Q:This tab use in sim or wifive ?",
            "Q:is it for vdo editing ?",
            "Q:pubg can run",
            "Q:can we download apps from Google playstore ?",
            "Q:can i use social media on this",
            "Q:can revit and autocad be used in it?",
            "Q:Can we connect a normal usb keyboard and mouse?",
            "Q:Can I charge it with Powerbank?",
            "Q:does it have thunderbolt port for graphics amplifier?",
            "Q:Does this product come with installed version of Windows 10? Ans does it auto upgrade like other pc's from S mode?",
            "Q:How long does the battery last?"
        ],
        "answers": [
            "A:it can flawlessly handle PDF, exel files, word files I opened a 100 pages PDF no issue found",
            "A:You can get 30days trial office package. After that you need to buy. After buying the product(incase of office 365) subscription you can also get 30days extra if payment set in auto renewal mode.",
            "A:Yes. You need to purchase a USB C to USB Cable or Adapter. Surface Go does not have a direct USB Port",
            "A:separately",
            "A:Yes add 512gb microsd card",
            "A:yes",
            "A:Yes, you can. Though it won't be sufficient for you to base all your work on it. You'll need a bigger, meaner machine for all the programming stuff.",
            "A:no, you will have to buy the keyboard and the surface pen separately",
            "A:you can use any wired keyboard or wireless or bluetooth keyboard and mouse with it.",
            "A:It's good enough. For day to day tasks like editing documents and even browsing a little bit. For checking mails, Microsoft edge works better than chrome on this.",
            "A:If it's a question, you must start with the verb to give it a proper structure. Also, you missed the article 'a'. The correct statement would be, \"Is it a touch screen laptop?\" To answer that, yes!",
            "A:Surface Pro comes with Windows in 'S' ,mode. In this mode, you can instal only those apps that are available in the MS App store. Disable 's' mode if you want to use other software.",
            "A:This is not a Chromebook. It is a fully-fledged Windows PC with Windows 10. You can install Chrome on it",
            "A:yes you can",
            "A:Tablet",
            "A:Similar to mid-range smart phone",
            "A:Yes. After switching out of S mode.",
            "A:no sir",
            "A:yes tally can be installed on this device without any issues. and yes you can use VPN to connect to internet and multiuser tally server from this system",
            "A:you can install after you take out the s mode. Instructions are already in surface go itself as to how to convert from s mode to win 10 home",
            "A:nope. we have to pay for it extra. not even surface pen. and worst part... not even microsoft office. we have to buy it separately",
            "A:Depends upon your usage. 64 gb is written but after windows and update of apps. we actually get around 56 gb",
            "A:If u saying about capty of storage - 64/128gb(u can exceed it, using by extranal memory card & USB 3.0). For read speed up to 430mbs/s capacity.",
            "A:it is not the most powerful device but it can run auto cad and photoshop. It is bit laggy at times when running such heavy software.",
            "A:nope",
            "A:yes, you can. but you will face problems regarding wifi /touch driver.",
            "A:Of course u can use it free... U need to log on with ur id. It is absolutely free:)",
            "A:Yes it has wifi and not tried bluetooth",
            "A:Oh! Yes u can connect these.",
            "A:yes it does",
            "A:U can. Surface go comes with windows 10s out of the box, u have to upgrade to windows 10 home (free of cost) to install 3rd party apps.",
            "A:No",
            "A:No Graphics Card. And I wouldn't recommend it for AutoCAD or 3DS Max. Think of this as a Microsoft based Media Consumption device or as a student/business friendly laptop.",
            "A:no",
            "A:No",
            "A:Windows 10 in S mode is a version of Windows 10 that allows only apps from the Microsoft Store. You can switch from S mode to the regular Windows 10 at any time for free.",
            "A:Yes, But You Need Dock (C- Type)",
            "A:Performance is very good. My suggestion is : Format and install fresh copy of win 10 professional. Then you can install any software easily. Performance will increase.",
            "A:It supports all apps compatible with windows 10. However device is not appropriate for heavy processing but light usage like browsing and multimedia consumption.",
            "A:it's got a micro SD slot, so the limit is whatever size micro SD card you buy (which goes upto 512), or you can buy multiple cards as well if you can keep track of them",
            "A:There are 2 keyboards, one for surface pro and another one for surface GO. make sure to get the Surface Go type cover",
            "A:Can we download or use it? I didnot get your question. We can download and use. The surface go comes equipped with trail version of office 365. You can either continue using that or buy other version",
            "A:No",
            "A:Absolutely. This is the best one out there for anyone looking for an outstanding laptop experience. Don't think, go buy it today!",
            "A:No., it's not available on it.",
            "A:Depends on usage. I watch offline videos and got around 6-7 hour usage without internet usage. If you mainly watch internet videos you might me getting 4+ hours at full brightness",
            "A:yes",
            "A:Hand too",
            "A:yes. why not",
            "A:Touch is very smooth and You don't get pencil and keyboard. with the tab you have to buy it separately .",
            "A:Yes, it does for data storage purposes",
            "A:No, it doesn't have that much fast processor!",
            "A:Microsoft.The real one.",
            "A:Yes",
            "A:10",
            "A:YES",
            "A:nope",
            "A:No. Has to be bought separately.",
            "A:You need to purchase it separatelty",
            "A:yes",
            "A:Video editing capabilities are limited with a device with onboard graphics card. You will need dedicated graphics card with better cooling facilities and RAM and a capable processor, like PRO models.",
            "A:Yes it is ... almost like a laptop however can not handle very heavy apps",
            "A:Racing games can be played in very low settings .games like mine craft can be playable.",
            "A:no need of installation.it is already there preibstalled.Just login with ur credentials.",
            "A:No not compulsory . without keyboard it's is perfectly use",
            "A:Nope",
            "A:yes",
            "A:As long as the app is available in windows store",
            "A:No,pen is a separate buy.",
            "A:Separately",
            "A:Get a type-c extender dock will work just fine.",
            "A:Yes it does",
            "A:Yes it has a memory card slot",
            "A:There is no slot to place SIM card. One can connect with WIFI.",
            "A:It is relatively old generation storage type.",
            "A:Yes you can connect any wireless keyboards just the same. It only has a type c port so for wired keyboard you will need some converting ports",
            "A:yes",
            "A:Memory card",
            "A:Casual websites are ok.Heavy websites will increase toll on battery & performance.",
            "A:It will be billed as a laptop.",
            "A:yes its comes with sealed box and with adaptor",
            "A:Yes it can be there is a memory card slot in a non LTE model",
            "A:No",
            "A:This is not an android Tab. Its a Windows Computer. Everything that you can do in your Windows PC or Laptop, same you can do. Nothing extra.",
            "A:yes",
            "A:Yes",
            "A:Yes but with Type-C otg connector.",
            "A:you can play even heavy games. this is a superb machine.",
            "A:you have to buy type c external HDD or you have to buy a external dcking station for connecting external USB products",
            "A:keyboard is availiable seprately",
            "A:you will need a usb c hub with hdmi.",
            "A:No, it does not support sim card.",
            "A:Yes you can do c, c++ or mat lab however for writing codes in comfortable manner you will need an keyboard, but i would recommend to buy i5 model of surface as it will be more smooth.",
            "A:This is mini laptop. you can do install any windows software or app and use. some time hanging due to 4gb ram. try 8gb version or brand hp mini laptop also available better.",
            "A:U can install Adobe Pagemaker in it...!! but I'm not sure about the software ur asking about...Mostly many apps doesn't work in secure mode so u have to exit from secure mode to use the apps....",
            "A:SSD is very good for it.",
            "A:No",
            "A:you can but a USB c to USB connector",
            "A:yes",
            "A:Yes it does, in fact it has trail version for one month, later either you can purchase office 365 or 2019 license.",
            "A:yes it has",
            "A:it is available on flipkart..",
            "A:No Microsoft 365 it is not free.",
            "A:no",
            "A:I'm tried Visual studio, but you can install on Windows 10 S mode. You need upgrade to Windows 10",
            "A:No, it has only 4gb ram and runs on S- mode. That means you aren't allowed to run third party software. Ofcourse you have an option to get out of S mode. But you can't reverse it back.",
            "A:Yes",
            "A:you can't do any heavy stuff on it. it can be used for basic office work and playing videos.",
            "A:Yes",
            "A:body is not plastic its Alloy..",
            "A:100gb, you can use microsd card for additional storage.",
            "A:Pen is available",
            "A:Yes you can use Tally on it like you are using it on a normal windows System.",
            "A:Neither, It's Pentium Gold..",
            "A:yes u can",
            "A:its remaining time is how much I watch Netflix on this tab .. its not disturbing me at all.. it give 6-7 hrs Max... & m satisfied wit it.",
            "A:yes we can install software from Store and can use. I am using WhatsApp.",
            "A:No, keyboard, surface pen and mouse has to be purchased separately.",
            "A:No",
            "A:No",
            "A:No..",
            "A:no",
            "A:I don’t think so. Surface pro would be a better option for video editing and photoshop",
            "A:yes it will run that, but if you push it to hard it will throttle a little",
            "A:No idea on SAP, there is no USB port. You have to buy c type converter",
            "A:You cannot do heavy stuff in this. It will be slow",
            "A:performance ,display",
            "A:No, APPS from Microsoft store can only be installed. If want to install tally than quit s mode & covert to Home or Pro version of windows10(Option to convert is available through setting)",
            "A:yes",
            "A:Microsoft recommended 1TB",
            "A:Yes",
            "A:512gb",
            "A:No.",
            "A:Buy additional",
            "A:No it is not free yearly subscription is necessary.",
            "A:separate keyboard and separate pen. separately we have to buy microsoft office",
            "A:separately",
            "A:it smoothly supports 4k",
            "A:nope",
            "A:No",
            "A:Ofcourse",
            "A:Buy separately",
            "A:No, u need to buy those separately.",
            "A:LTE model yes",
            "A:it's a Windows laptop if u want to use Android then u need to install application like BlueStacks to use Android",
            "A:No not for high end games with heavy graphics. I have installed some light ones gave decent prerformance and tried for fornite and pubg.. terrible fps on low graphics too. so No to gaming",
            "A:2tb",
            "A:yes u can use any Bluetooth mouse with it. just that Microsoft mouse will be a bit better with compatibility. but in real use any mouse is fine",
            "A:without",
            "A:Yes",
            "A:Yes, Need to buy separately",
            "A:yes definetly",
            "A:yes",
            "A:Hi, yes you can use programming language softwares quite well. I would suggest you to use external monitor as well as I am personally using 19.5 Inch monitor attached using a USB c dongal and HDMI.",
            "A:Yes we can. microsoft has done a great job in ignoring the touch of hand while using surface pen. but still machine is a machine.... once in a while it does sense hand as finger but that is ignorable",
            "A:There is no hard disk. Best to use cloud storage like Dropbox, Google Drive or One Drive which comes with Office 365.",
            "A:yes you can. but user experience is not like as phone. sometimes it is hiding half of the screen content.",
            "A:it is not connecting with any printer",
            "A:yes it is idle for heavy excel and other software uses but as screen is small you might not live working on excel. better use external monitor connected via USB c dongal.",
            "A:Didn't try. if your requirements include, AutoCad, photo/video editing and intense graphics oriented stuff, this device is not for you. It's meant for casual users, for browsing, YouTube, Netflix.",
            "A:surface go",
            "A:This is a new model that has been released only in August 2018. so with respect to this device the \"Surface Go\" we can say its a first generation device.",
            "A:Yes but you'll need a USB-C to HDMI adapter since it only has one USB-C port.",
            "A:You need to buy a USB dock as the Surface Go has a single Type C slot. Thereafter you can connect any keyboard and mouse via Bluetooth.",
            "A:appstore in microsoft is really very small compared to both apple and android,yet you can download the third party app. For this u 1st need to switch your tab out of s mode widout which isn't possible",
            "A:Need to buy them separately",
            "A:The keyboard can be attached with it's integrated magnetic points but the keyboard is sold separately.",
            "A:yes, if it's in Microsoft store then directly else get off Windows S mode to install",
            "A:Usb",
            "A:wifi,",
            "A:No, its slow compared to the processing power needed for video editing.",
            "A:no bro.",
            "A:Nope ... from windows store only",
            "A:Yes you can. This is good for light usage like browsing, watching movies, social media and working with docs and excel. It cant handle heavy stuff though.",
            "A:Yes. You need to instal minimum software. Add proper sd card",
            "A:yes",
            "A:Nope",
            "A:No, you cannot use the usb c for external gpu. It can only be used for data transfer and charging.",
            "A:Yes",
            "A:Hi This is my secondary device and I use occasionally, don’t vary the charger on a day trip. Serves my purpose. I think when continuously used, noticed lasting for 5+ hrs"
        ],
        "likes": [
            "167",
            "362",
            "3",
            "7",
            "20",
            "5",
            "15",
            "86",
            "4",
            "54",
            "43",
            "1",
            "13",
            "2",
            "1",
            "2",
            "2",
            "2",
            "19",
            "16",
            "30",
            "33",
            "9",
            "10",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "7",
            "4",
            "5",
            "2",
            "3",
            "0",
            "0",
            "0",
            "2",
            "3",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "360",
            "404",
            "24",
            "74",
            "14",
            "31",
            "10",
            "4",
            "22",
            "25",
            "55",
            "11",
            "10",
            "7",
            "15",
            "25",
            "4",
            "29",
            "7",
            "15",
            "7",
            "4",
            "5",
            "6",
            "0",
            "2",
            "2",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2"
        ],
        "dislikes": [
            "64",
            "160",
            "1",
            "0",
            "5",
            "0",
            "4",
            "58",
            "0",
            "39",
            "59",
            "0",
            "10",
            "0",
            "0",
            "0",
            "0",
            "0",
            "21",
            "18",
            "40",
            "48",
            "8",
            "11",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "9",
            "5",
            "10",
            "3",
            "1",
            "1",
            "0",
            "0",
            "5",
            "12",
            "2",
            "3",
            "4",
            "4",
            "4",
            "7",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "2",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "119",
            "158",
            "7",
            "35",
            "3",
            "14",
            "2",
            "0",
            "10",
            "16",
            "48",
            "6",
            "4",
            "6",
            "14",
            "33",
            "2",
            "43",
            "5",
            "23",
            "5",
            "3",
            "5",
            "5",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2"
        ]
    }
}