{
    "title": "Lenovo Tab 3 2 GB RAM 16 GB ROM 8 inch with Wi-Fi Only Tablet (Black)",
    "product_specification": {
        "Model Number": "ZA170189IN",
        "Model Name": "Tab 3",
        "Ideal Usage": "Business, Reading and Browsing",
        "Color": "Black",
        "Connectivity": "Wi-Fi Only",
        "OS": "Android",
        "Operating System Version": "6 (Marshmallow)",
        "RAM": "2 GB",
        "Voice Call": "No",
        "Display Resolution Type": "HD",
        "Processor Type": "MediaTek 64-bit Quad Core",
        "Additional Features": "Dual Front Facing Speakers With Dolby Atmos, Adaptive Display Technology (Media Mode, Standard Mode, Reading Mode, Child Mode), Kid's Mode and Multi-user, Gestures Mode, Face Unlock",
        "Display Size": "20.32 cm (8 inch)",
        "Sales Package": "Tablet, Adapter, USB Cable, Warranty Guide, Quick-start Guide",
        "Display Resolution": "1280 x 800 Pixels",
        "Primary Camera": "5 megapixels",
        "Internal Storage": "16 GB",
        "Processor Speed": "1 GHz",
        "USP": "Android v6 (Marshmallow) OS, 5 MP Primary Camera, 8 inch HD Display, Quad Core Processor",
        "Sim Type": "No Sim",
        "ROM": "16 GB",
        "Battery Capacity": "4290 mAh",
        "Battery Type": "Lithium - Ion",
        "E-mail": "Yes",
        "Secondary Camera": "2 megapixels",
        "Other Camera Features": "Primary Camera: Auto Focus; Secondary Camera: Fixed Focus",
        "2G": "No",
        "3G": "No",
        "USB": "Yes",
        "Browser": "Android",
        "Other Display Features": "IPS Display",
        "Video Playback": "Yes",
        "Audio Formats Supported": "MP3",
        "GPS Support": "Yes",
        "Map Support": "Google Maps",
        "Expandable Storage Capacity": "64 GB",
        "Memory Card Slot Type": "microSD",
        "Memory Card Support": "Yes",
        "Warranty Summary": "1 Year on Product & 6 Months on Accessories"
    },
    "product_description": {
        "Multi-user Sharing": "Now your entire family can get their dose of entertainment with this tablet. Create different profiles for each of your family members and configure apps accordingly for a more personalized user experience.",
        "Perfect For Kids": "Ensure that your kid is being influenced by all the right things. Thanks to the dedicated profiles feature, you can limit your child's access to websites and apps.",
        "Adaptive Display Technology": "Lenovo's unique adaptive display technology automatically adjusts the display and audio settings based on the app you're using. So, you'll experience your favourite audio-visual content in the best way possible.",
        "Dual Speakers With Dolby Atmos": "Dolby Atmos technology ensures that the tablet produces crystal-clear sounds, making makes music videos and movies much more immersive.",
        "Compact Design": "It's almost effortless to carry this tablet in your backpack or handbag as it sports a thin, compact design.",
        "New to Tab 3 Series": "You can launch apps with simple gestures, unlock the tablet with the face-recognition function or stay connected with your friends on FB with Wi-Fi. The Lenovo Tab 3 A8 comes with all these features and more.",
        "Long Battery Life": "Thanks to a powerful 4290-mAh battery, you can use this tablet for up to 9 hours with a single charge, giving you ample time to browse the Web, play games, watch movies and more.",
        "Dual Cameras": "Always be prepared to capture the interesting sights that pass you by every day with the 5-MP rear camera. Make clear videos calls to your loved ones with the 2-MP front camera.",
        "Performance": "1-GHz, 64-bit, MediaTek, quad-core processor and 2 GB of RAM, you can simultaneously run multiple apps - FB, WhatsApp and Candy Crush Saga, for example - without experiencing lag.",
        "Operating System": "The Android Marshmallow 6.0 OS makes browsing through the many apps of this tablet a smooth experience. The OS is highly efficient at managing power. To top it all off, you can use your expanded storage space as your primary storage space, thanks to OS. Now you'll have ample space to store a ton of apps.",
        "Display": "Watch popular YouTube videos at an enchanting resolution of 1280x800 on this tablet's large, 20.32-cm IPS display. IPS technology ensures that the colour and contrast of videos stay consistent even if you're viewing the screen at an extreme angle.",
        "Storage": "Thanks to an internal storage capacity of 16 GB, you can store many games, videos, songs, apps and other content on this tablet. If you want to store large-sized files, like full-length feature films, you can expand the memory by up to 64 GB with a micro SD card."
    },
    "reviews": {
        "ratings": [
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "3",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "4",
            "3",
            "5",
            "3",
            "2",
            "1",
            "1",
            "4",
            "5",
            "5",
            "5",
            "4",
            "3",
            "4",
            "4",
            "3",
            "4",
            "5",
            "1",
            "5",
            "5",
            "5",
            "1",
            "5",
            "4",
            "5",
            "5",
            "1",
            "2",
            "4",
            "1",
            "1",
            "2",
            "5",
            "1",
            "1",
            "5",
            "4",
            "5",
            "3",
            "5",
            "5",
            "4",
            "3",
            "4",
            "5",
            "1",
            "5",
            "3",
            "2",
            "5",
            "5",
            "5",
            "5",
            "1",
            "5",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "2",
            "1",
            "4",
            "3",
            "5",
            "1",
            "4",
            "4",
            "3",
            "1",
            "1",
            "5",
            "5",
            "5",
            "1",
            "5",
            "5",
            "1",
            "3",
            "5",
            "1",
            "3",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "1",
            "3",
            "2",
            "5",
            "4",
            "4",
            "4",
            "1",
            "1",
            "1",
            "5",
            "5",
            "1",
            "5",
            "4",
            "3",
            "3",
            "5",
            "4",
            "1",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "2",
            "3",
            "3",
            "5",
            "4",
            "4",
            "4",
            "3",
            "4",
            "5",
            "5",
            "3",
            "1",
            "3",
            "4",
            "5",
            "5",
            "4",
            "4",
            "4",
            "3",
            "4",
            "3",
            "5",
            "4",
            "5",
            "5",
            "4",
            "1",
            "1",
            "5",
            "3",
            "1",
            "5",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "1",
            "5",
            "4",
            "5",
            "5",
            "3",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "1",
            "5",
            "5",
            "1",
            "4",
            "4",
            "4",
            "4",
            "4",
            "2",
            "4",
            "4",
            "5",
            "5",
            "5",
            "4",
            "4",
            "3",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "5",
            "1",
            "4",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "3",
            "4",
            "4",
            "1",
            "5",
            "3",
            "4",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "5",
            "5",
            "5",
            "1",
            "4",
            "5",
            "4",
            "4",
            "4",
            "4",
            "4",
            "3",
            "5",
            "1",
            "4",
            "5",
            "4",
            "1",
            "4",
            "5",
            "4",
            "5",
            "4",
            "3",
            "5",
            "2",
            "4",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "4",
            "5",
            "5",
            "2",
            "5",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "4",
            "5",
            "4",
            "1",
            "4",
            "5",
            "5",
            "5",
            "5",
            "5",
            "3",
            "4",
            "5",
            "5",
            "4",
            "5",
            "5",
            "5",
            "5",
            "4",
            "3",
            "5",
            "5",
            "2",
            "4",
            "4",
            "3",
            "1",
            "4",
            "5",
            "5",
            "5",
            "3",
            "5",
            "4",
            "4",
            "4",
            "5",
            "4",
            "3",
            "5",
            "1",
            "5",
            "1",
            "1",
            "4",
            "5",
            "5",
            "5",
            "1",
            "2",
            "1",
            "1",
            "5",
            "5",
            "3",
            "5",
            "5",
            "1",
            "1",
            "1",
            "4",
            "1",
            "1",
            "1"
        ],
        "review": [
            "Has 2gb ram , marshmallow. Screen quality is nice . Great battery life and never got heated up all the time I have been using. Good product.",
            "Excellent product and very good experience with lenevo tab. Display is bright and color reproduction is very rich. Sound seems to be bit moderate in open speaker mode, but good when used with earphone. Android 6.0 is refreshing... overall satisfied with performance till date. Only could not locate flip cover for this tab..hope to find one soon.",
            "Good tablet. Writing review after a month usage. Good tablet for children. I got this for my daughter. I set up multiuser profile. In kids profile I can control what app , when and how long to use. Different screen setting for standard, movie and reading saves eye from irritation. Default warm screen for kids profile helps child to read without tiring eyes. Scheduled on off feature helps to save battery too. Charging takes quiet a while. But last long for a week end trip.",
            "I bought this 4 days before the big billion sale, got a sweet deal. Flipkart made super fast delivery in less than 20 hours.\nNow regarding the tablet, my main motive for purchasing this was for reading books, and little casual entertainment when travelling. I must say reading book is a delight on this tablet, it has an effective reading mode (An option in Adaptive Display, also Moon Reader + is a good app), full HD videos play without any lag.\nCharging is fast. The reason I selected this tablet over others is simply that it has 2GB RAM, with 8 inch screen which no one else provided in this price range.\nDisplay is vivid and clear. Regarding the build quality, nothing out of the world, it feels ok to hold, nothing premium nor cheap plastic feel, but no complains considering its price..\nIt doesn't have a Sim slot, this was not my concern as I have no intention of using an 8 inch phone, it looks weird to talk with such a huge screen.\nIt's a good entry level tablet I can say, and one can opt for this confidently.",
            "got it at 7199, 1k off + 799 axis bank offer. tab is fantastic.\n1. a bit heavy.\n2. feels sturdy n grips well while holding.\n3. battery performs well under moderate usage for 6-7 hrs.\nworth buying..",
            "Pretty decent for the price of 5.4k which I paid during the offer period. Battery is amazing. The rest of the specs are in line with its price. The software is close to stock Android and the Handy features like kid mode, various display modes and dolby sound are useful.\n\nThe only con is this slowly clocked 1Ghz processor. Hence it is not suitable for heavy work such as graphic intensive games. Ideal for reading, browsing, videos and as a study companion for students.",
            "Best Tab Under 10K\n\nDon't trust the negative reviews about this tab. It is a great tab in every respect :\n\nSuperb Build Quality\n\nFantastic Display. Absolutely perfect clear viewing from any angle, no contrast or colour shift. Very soothing to eye also.\n\nSpectacular 360degree surrounding Dolby sound effect from the two front facing speakers. You will not believe this until you hear the sound shifting from left speaker to right.\n\nMarshmallow without any bloatware.\n\nGreat Battery life.\n\nWell , seems like I am writing propaganda for lenovo. But these are facts. Trust my words. I am very happy with my purchase.",
            "First of all , the product was timely delivered. No surprise here. Thanks to flipkart delivery system.\nNow, considering the price this Lenovo tab 3 8 is a really satisfying product. Though it's 1GHz processor is a little underpowered but the 2gb of ram successfully covers the drawback. Very smooth multitasking performance. Touch is responsive enough. Display is sufficient. If you are a high resolution smartphone user then you may feel some disappointed but considering the price it's sufficient.\nBattery is a boon. Single charge lasts for a whole day of multitasking. Charging is also quite fast.\nAll apps are working. Kids mode is a new thing to discover and could give a benefit. Heavy games are working quite well. Night reading becomes comfortable with the adaptive display.\nOverall value for money and definitely wouldn't disappoint you at least it doesn't for me.",
            "Writng this review after 2 years if usage. Best for....literally everything. The system is very fast and have yet not recieved any complaints. Excelent storage capacity. Great live backgrounds, lighting, security system and fits in smallest to smallest of places. Loking for a TAB, go for this because it is an efficient and a totally worth it product.",
            "If you are looking for a basic tab and if you will use it for browsing and reading pdf documents on the go then this is the right tab for you. Sound quality is quite good with duel speakers. Screen quality is acceptable for indoor use. Screen brightness is not adequate for outdoor use. You can't expect anyting from a tablet camera. I don't use it for gaming. You can use it for watching youtube videos in 720p. Using it for several months without any proboem.\nRegards\nAnkur",
            "Has 2gb ram , marshmallow. Screen quality is nice . Great battery life and never got heated up all the time I have been using. Good product.",
            "Excellent product and very good experience with lenevo tab. Display is bright and color reproduction is very rich. Sound seems to be bit moderate in open speaker mode, but good when used with earphone. Android 6.0 is refreshing... overall satisfied with performance till date. Only could not locate flip cover for this tab..hope to find one soon.",
            "Good tablet. Writing review after a month usage. Good tablet for children. I got this for my daughter. I set up multiuser profile. In kids profile I can control what app , when and how long to use. Different screen setting for standard, movie and reading saves eye from irritation. Default warm screen for kids profile helps child to read without tiring eyes. Scheduled on off feature helps to save battery too. Charging takes quiet a while. But last long for a week end trip.",
            "I bought this 4 days before the big billion sale, got a sweet deal. Flipkart made super fast delivery in less than 20 hours.\nNow regarding the tablet, my main motive for purchasing this was for reading books, and little casual entertainment when travelling. I must say reading book is a delight on this tablet, it has an effective reading mode (An option in Adaptive Display, also Moon Reader + is a good app), full HD videos play without any lag.\nCharging is fast. The reason I selected this tablet over others is simply that it has 2GB RAM, with 8 inch screen which no one else provided in this price range.\nDisplay is vivid and clear. Regarding the build quality, nothing out of the world, it feels ok to hold, nothing premium nor cheap plastic feel, but no complains considering its price..\nIt doesn't have a Sim slot, this was not my concern as I have no intention of using an 8 inch phone, it looks weird to talk with such a huge screen.\nIt's a good entry level tablet I can say, and one can opt for this confidently.",
            "got it at 7199, 1k off + 799 axis bank offer. tab is fantastic.\n1. a bit heavy.\n2. feels sturdy n grips well while holding.\n3. battery performs well under moderate usage for 6-7 hrs.\nworth buying..",
            "Pretty decent for the price of 5.4k which I paid during the offer period. Battery is amazing. The rest of the specs are in line with its price. The software is close to stock Android and the Handy features like kid mode, various display modes and dolby sound are useful.\n\nThe only con is this slowly clocked 1Ghz processor. Hence it is not suitable for heavy work such as graphic intensive games. Ideal for reading, browsing, videos and as a study companion for students.",
            "Best Tab Under 10K\n\nDon't trust the negative reviews about this tab. It is a great tab in every respect :\n\nSuperb Build Quality\n\nFantastic Display. Absolutely perfect clear viewing from any angle, no contrast or colour shift. Very soothing to eye also.\n\nSpectacular 360degree surrounding Dolby sound effect from the two front facing speakers. You will not believe this until you hear the sound shifting from left speaker to right.\n\nMarshmallow without any bloatware.\n\nGreat Battery life.\n\nWell , seems like I am writing propaganda for lenovo. But these are facts. Trust my words. I am very happy with my purchase.",
            "First of all , the product was timely delivered. No surprise here. Thanks to flipkart delivery system.\nNow, considering the price this Lenovo tab 3 8 is a really satisfying product. Though it's 1GHz processor is a little underpowered but the 2gb of ram successfully covers the drawback. Very smooth multitasking performance. Touch is responsive enough. Display is sufficient. If you are a high resolution smartphone user then you may feel some disappointed but considering the price it's sufficient.\nBattery is a boon. Single charge lasts for a whole day of multitasking. Charging is also quite fast.\nAll apps are working. Kids mode is a new thing to discover and could give a benefit. Heavy games are working quite well. Night reading becomes comfortable with the adaptive display.\nOverall value for money and definitely wouldn't disappoint you at least it doesn't for me.",
            "Writng this review after 2 years if usage. Best for....literally everything. The system is very fast and have yet not recieved any complaints. Excelent storage capacity. Great live backgrounds, lighting, security system and fits in smallest to smallest of places. Loking for a TAB, go for this because it is an efficient and a totally worth it product.",
            "If you are looking for a basic tab and if you will use it for browsing and reading pdf documents on the go then this is the right tab for you. Sound quality is quite good with duel speakers. Screen quality is acceptable for indoor use. Screen brightness is not adequate for outdoor use. You can't expect anyting from a tablet camera. I don't use it for gaming. You can use it for watching youtube videos in 720p. Using it for several months without any proboem.\nRegards\nAnkur",
            "Got this tablet after two days of placing an order. Faster delivery from Ekart. I had ordered Wi-Fi only version for 6k. I am writing this review after two weeks of usage.\nPros:\n- Nice Screen and nice colour reproduction.\n- Good sound quality as it having dolby atmos feature.\n- 2 GB RAM.\n- Back side texture is very nice. It cannot slip from hands easily.\n- Short Edges at both side left and right. Built quality is ok as at the edges it shaped like “J” i. e. screen is bit small on top and not equal to back cover. So, there is some pain on fingers.\n- Front camera is good for video calling on Skype, etc. but have some problem in low light.\n- Tablet charges fast takes about two and half hours for full charge.\n- Good battery backup. I have activated battery optimiser tablet runs two days of moderate usage.\n- Good for reading books and watching movies in bigger screen.\nCons:\n- Does not support USB OTG that is very essential for tablets as per my opinion.\n- 3.5mm audio jack is not universal, I cannot use all headphones only nokia and Philips is supporting as I have checked.\n- 1 GHz mediatek processor.\n- Can’t play high end games. I can’t play GTA vice city.\n- Touch not much responsive at the corners.\n- No screen protection. Even tablet does not come with factory screen guard and not tempered glass or screen guard available in market.\n- No flash at back camera.",
            "It is an amazing product. The price is just too good for the whole package. I purchased it for reading ebooks and magazines and it serves the purpose like a charm. The only downside - Accessories not available. I would so much love to have a flip book cover but sadly there is nothing available. Even the screen guard has to be modified of other brand and fitted in.\n\nOther and a very weird downside. It does not accept any other memory card than Transcend. Transcend is expensive and that is there you take a hit of about 1k. But still overall it remains an impressive package. Go for it.",
            "I find product searching easy in flipcart compared to any other shopping sites or tools. The tablet quality is good. Flipcart delivery is excellent. Overall good performance.",
            "I'm writing a review after using this product for 1 week. Got this for 5999rs on 12 Dec 2016 and got delivered in 2 days. The packing was very good and the product was a brand new sealed one.\nIn the box- 1 tablet piece,a charger,a USB cable, user manual and 1year warranty card\nWhat all I expected but didn't have- an otg cable(I still haven't checked if it supports otg) , screen guard\n\nSince there is no available of screen guard and flip cover for this model u can purchase any 8 inch screen guard and an 8 inch universal flip cover as I have done and it fits perfectly!!\n\nSpecs- all the things given in the product description is true. Please note that this model is wi-fi only tablet.\n\n∆The tablet actually looks very good than from the picture. The tablet back is black and has a grainy texture which feels very good in hand and gives nice grip for this big tablet.\n\n∆The back cover is not removable as well as the battery.\n\n∆The back and front cameras are above average. But that's just enough for a tab!\n\n∆the best thing are the dual front speakers. They have a decent loudness and actually provides a good surround effect while watching movie or playing games. This uses a dolby system for sound equilizer and effects. The dolby provides a professional inbuilt equilizer.\n\n∆ another cool feature is the adaptive display with 4 modes! It changes the display settings and sound output according to the app opened. If you open a ebook for reading it automatically changes to reading more and when you open a movie or a game it switches to media mode .\n\n∆another feature is the child mode where you can control the app used by the child and also the time.\n\n∆ I used a 8gb SD card and it's working fine. U can make it as internal memory or just a removable memory! Cool feature from android marshmallow.\n\n∆ the 2 GB ram management is very good. It always provide 1.2gb free ram good for multitasking.\n\n∆ the battery backup is exceptionally excellent!! I used it like 3 days without charging which included gaming , reading etc. Very cool!!\n\n∆the internal memory is 16. Only 12.5gb is available for user. Also u can increase internal memory using an external SD card.which is a very good feature .\n\n∆ I'm a hardcore gamer. And have played graphics intensive games like asphalt 8 , gangstar, modern combat, clash of clans etc. All the games run very smooth without anl6 lags or freezing. Thanks to 2 GB ram and 1ghz clock is just enough!\n\nOverall I'm very much satisfied with this lenovo tab! The main point is that lenovo is a well reputed brand and the build quality of the product is very good . Feel free to buy the decent priced tab with these much good specs. You won't regret buying it. ;)",
            "Ordered on 5th June and got on 7th June so very fast delivery by ekart. Full marks on that\n\nPros\nGood display\nRead Mode is good for reading as it automatically turns on the yellow tint which is good for eyes\nMedia mode make media experience awesome\nThere's also a kid Mode which I don't use\nBattery life is good. Saw movie whole night and still 40% battery was still left\nCame with a screen guard already on tab\nDolby sound is powerful but not very great\nAlmost stock Android experience which is good than having other softwares\nGot many frills in low budget\nIt's a WiFi only tab, not calling, so good for me\nWiFi is fast\n\nCons\nScreen size looks smaller than 8 inch due to edges\nTouch gets irresponsive many times\nNo Android updates available\nNo otg cable with tab. Have to buy separately\nApps don't get installed on SD card nor you can transfer them to SD card. You can transfer files from your PC or laptop to SD card.\nOtg support not very smooth. Tab didn't recognize my otg device.\n\nMy verdict\nI wanted tab for watching pre downloaded movies or online videos and reading stuff, which the tab does perfectly well.\nI didn't want a calling tab but tab with good display and WiFi, which is satisfied.\nI will say it's value for money in this price range as it offers smooth Android experience, very good battery life and display. But not good for heavy gaming purpose or heavy networking purposes. I am satisfied with both flipkart and lenovo",
            "The product is good compared to other available options at the price point. I got it for 5500 and it worth more than that. 2gb ram, atmos sound ideal size. This is WiFi only model",
            "A steal for 5999\nIt a decent tab for the discounted price of 5999 but certainly not for the original price of 10k.\n\nThe cons\n- slightly on the slower side but responsive none the less.\n- screen saturation and color reproduction aren't accurate.\n- screen isn't very crisp either\n- the camera is quite bad indoors and outdoors(but who cares about a tablet camera). Front is just good enough for video calls.\n- no blue light filter mode - forgodsake it's a tab, why isn't there a reading mode, installed a different app for it.\n\nThe pros\n- the UI is quite smooth being almost close to stock android provided you turn off the animations and stuff.\n- pretty decent multi tasking with decent ram management.\n- easy to hold and type.\n- easy to carry around.\n- decent build quality.\n- looks like a quality product.\n- stereo speakers are decent. Not loud but decent. I would've loved better audio quality though through the headphones..",
            "Good tablet with good moderate speed. sound is good but volume is low. Memory card 32GB samsung gets supported. wifi reception is excellent. High internal memory and ram for apps. Fast charging less than 2.5 hours for full charge and good battery backup. Overall value for money",
            "The display ain't razor share but its the best in the class the contrast ratio the saturation the viewing angles everythings perfect!\nThe battery life is Super awesome the best i've had on any tablet i've ever used only con i could say is the processor.\n1ghz processor is not powerful enough to play heavy games.",
            "My son who is in class seventh is using this product for last two months.\n\nProduct quality is really good looking at price point. Objective was only to provide a device to be used for study and purpose is getting solved in low cost.\n\nScreen, though is 8inch, but is really big enough, it look like three times bigger than my 6inch mobile. My mobile screen look child in front of this tab.\n\nWhatsApp installation was not working, but worked after OS update (default update, nothing new was required). .\n\nI like the multi profile option. I have created separate profile for my child and blocked application installation, you tube etc in child profile. My son can only use whatever app I have allowed in child profile. He doesn't know parent (admin) profile password, so safety thing is taken care.\n\nAlso, I like the feature where we can set the uverall usage allowed. So, if you set the allowed duration of only 2 hours from within window of 9am to 7pm, then system doesn't allow login if any of this criteria is fulfilled for the day for that profile.\n\nBattery backup looks good enough for study.\n\nOverall, happy with the device and it meets my requirements.",
            "its a nice tab incredible battery life super clarity display and sound",
            "Okay so this is everything for an avid reader. It supports everything and also has a high battery back up. Secondly, the screen is of 8 inches and so you can also enjoy films.",
            "Amazing product using for my office work and it work fantastic. Camera is good but not as much as i expected. But overall performance of this tablet is great.",
            "As far as design ...its eye catching ,looks up market .......performance is good for multitasking and low end games ........display is amazing for the price .......the sound is crisp and clear thanx to Dolby atmos.........go for it....you'll not regret it",
            "As usual flipkart delivered before time and the tab is very good value for money. Very good wifi reception and kids are enjoying kind of games on the tab. Hassle free usage and customer friendly. Would highly recommend it.",
            "This tab in comparison with other currently available tabs is good. It has 2 gb ram though you get a WiFi only version. The operation is smooth. Ideal for kids, students and travellers. Has a good battery backup as well. And the sound is good.",
            "The best one can get at the given price. Battery backup is good enough. Screen resolution n Dolby Atmos is really good experience. Screen touch sensitivity is also good Enough..howevr its been jst a week since the tab is delivered..hope all ths experiences remains the same on the long run. Budget tab!!!",
            "RAM could have been improved to at least 3GB\nROM also should have been 32 GB\nScreen resolution also could have been better\nOtherwise a decent tab for the price, and the best in this range as of now",
            "A good device for normal usr. Running smooth. Good battery, awesome build quality and responsiveness. Not blazingly fast! Screen resolution is avg. I got it for 7k and now it's available for 6k. I love the device.",
            "I bought this on 5th December and was delivered on 6th december. Totally value for money tab as I got it for Rs.5399. Good buying experience from Flipkart and a good seller. I have used it for couple of days and found this tab totally worth the money spent. Backside of the tab has rubberised plastic, a good touch from Lenevo. Only negative is that touch is little unresponsive on soft touches i.e. you need to touch it little hard. May be I am not use to it as I use iPhone & Nexus but it will be unfair to compare this tab with those phones.You will not get such good specifications for this price so just go for it.",
            "Amazing product and super value for money. Flipkart's delivery was super fast and product came with proper bubble packing to avoid any damage to it. I would rate the lenovo's tab as the best in that price range and flipkart to be the first choice to buy anything online.",
            "Nice tab gaming speed awesome,browsing is fast nice tab recommend to buy!",
            "it have multiple mode light faster and i got it for only rs .6999,u dont get this type of tab at this affordable price and of a well established brand of lenovo",
            "VALUE FOR MONEY TAB\nA very good tablet at this price with a better brand name.\npros.:\n1.2gb Ram(you can install many apps)\n2.camera quality is ok but no led flash.\n3.multiuser and very good Wi-Fi connectivity.\n4.battery life is good (Can last long 2 to 3 days for mild use)\n5. Charging time is less (get 80% from 20% in one hour).\n6. A light weight tablet.\n7. Android Marshmallows 6.0.\ncons.:\n1. no led flash.\n2. Processor is only 1GHz(sometimes may appears lag while using multiple applications).\n3. Screen resolution is not upto mark if you are playing high graphics game.(but its ok for reading books and low graphics game.)\n4. Speaker quality is not up to mark.",
            "Excellent delivery by Flipkart\nPerfect budget tab under 9k, please don't expect it to work like iPad. Perfect tab for reading ebooks and watching videos.\nTo ensure smooth running avoid installing unnecessary apps",
            "This Tab has only Wi-fi mode no Sim Slot available. display is good. cam is average just manageable no more expectation.\nsmooth to work. good looks. Processing is fine for moderate users. though i haven't played games i used only for work it never hanged or delayed.",
            "Good if u r a heavy youtube and internet user, though the touch is a bit unresponsive.. the device lags if you try to run games. Overall its a good device if u r a mild user....if u r a heavy user do not go for this device.\nThe battery is very good, the sound quality is not so good, the display is nice.\nU will feel a bit of unresponsiveness while using it. And sometimes a bit of lag.\nThose trying to buy a tab to play clash of clans, do not go for this device, it lags.",
            "Great tablet.. one of the few tablets having 2gb ram. Got it for 5999 only. Performance, display are good. Battery back up is awesome.\nOnly drawback is that Lenovo does not give any software update.",
            "Light weight with sand stone back finish really makes good in hand feel. Battery is ok, display is a bit of a disappointment, main high point goes for its audio, really its great both through loudspeakers and headphone, overall quite mediocre.",
            "Volume is lower, and not with HD quality.",
            "There is problems with Android OS not compatible with hardware, the display color changes frequently. Also cpu is 1ghz which is very less",
            "Cool but hangs a lot",
            "Nothing can be best at this price. FLIPKART is always at top.",
            "Good looking tab.",
            "The product is excellent, display and sound is good . Nice product",
            "Quick charging. Played for 4.5 hours without break. Better sound from atmos. Gave 5 star. Thanks to Lenovo.",
            "works smoothly, no complaints & must buy",
            "Got this for 7700 & can't complain. Thr 4-Star rating & the following points are strictly keeping the price tag in mind.\nPros:\nGood build quality\nGood speakers\nGood battery life\nAndroid Marshmallow (although, it's 6.0, NOT 6.0.1 or later)\nCons:\nLOW Screen Resolution\n1 GHz Quad Core Mediatek is just ISN'T enough horsepower\nMy two cents - For its regular price of around 9,000 INR, it's better to go for the Mi Pad instead.\nHope this makes you make an informed decision.\nRegards,\nOmkar",
            "Pros:\n2 GB RAM\nMarshmallow (OS)\nBattery(4250 mah)\nPrice : Got it at 5399/- its the best Tablet for This Price\nCons:\nProcessor\nThe Display Sucks ,The Max Brightness Level is Not enough for Outdoor Lightenings and this bothers me a lot while i am in out door",
            "Good tablet for media consumption and web browsing... Don't buy this expecting a high end performance...",
            "Very good tab. Bought it for my daughter and serves the purpose. Basic tab for your daily basic stuff.",
            "Used Lenovo Tab 3 for almost 2 weeks and Mi pad for more than a Year.\nThe touch and camera of Mi Pad is much better than Lenovo tab. The feel of Mi pad is better though holding Lenovo Tab is more convenient than Mi Pad. If Mi Pad is avalaible I will do for Mi Pad.",
            "i ordered this tablet on 17th aug and received it on 19th morning....so far the tablet is running good...\n\nfirst of all the tablet's name is Tab 3 8 not A8....if u look into lenovo website then u will find only 1 GB RAM version however this one is 2 GB model. To make it clear, this tab is wifi only model....no sim slot option available....using a tab for calling is wierd anyways so its not a problem for me.\n\nAt this price, its the only tab u will get in the market with better brand name and with 2GB ram inside it....\n\nIf u need voice calling then there is Phab from lenovo for that.\n\nNote for Flipkart website maintainers :- please put correct details regarding the devices as these are not cheap items which can be ignored. Also, the product name is wrong. You people corrected the voice calling specs fiasco however the most important thing is the name of tab which creates confusion is still wrong...",
            "U will regret if you buy this tab as 1ghz will always let u down.... Rest is ur choice.. moreover there is also problem in the memory card slot as sometimes failed to identify memory card of 64gb or even 32 GB but 16 GB works very well....",
            "Very nice tab at 7200/- after discount and cash back. Good performance for my use case. My kid is living it. Build quality is good.",
            "Totally Awesome. Good specs and Screen design. Performance lag is just due to over running of apps in the background. A nice piece. Awesome for watching movies.\nOnly 1 Con - Supplied AC Charger has a very small chord.",
            "The tab is really awesome I'm using it since couple of years\nIt's battery and over all performance are very good",
            "3rd Class Return Policy",
            "Fully satisfied",
            "Decent price for this product\nSuitable for reading\nEspecially those who need tab for meeting and field service go for this\nOne only con for this tab is doest have SIM slot\n\nCheck this regularly price will fall down to 5999",
            "Good Battery. Good Display. Voice is also good. Value for money.\nI will suggest buy. No sim card slot.",
            "very nice product",
            "Tap ok price good 5999 but touch slow camera quality poor",
            "nice tab..easy and smooth..but doesn't support few apps.. battery drains too fast.. could be way better.touch sensitivity is bad, getting worse with time",
            "The product is ideally suited for reading , watching media content , surfing internet etc. Battery life is good. Sometimes if too many apps are open , the OS stutters. On closing the older apps, the device becomes responsive again. Would have definitely given five stars if it had android 7!!!",
            "Bad performence",
            "poor quality.",
            "Not worth the price, even at flip-kart this product is available with 40% discount, feel like cheated.",
            "People want it's touch to be like their iPhones.Guys you don't need to sell your kidney to buy this product.i think you're getting much more than you have paid for. Display looks amazing. I played many movies its great.even played 1080p pretty well without any lag. Battery life is also good.touch responce is cool.Just buy it if you don't wanna waste money on some expensive crap.",
            "Touch is very bad...",
            "During the product search as per flipkart websites lenovo A8 tab having calling facility but when actual product received not having calling facility. Seems to be issue in product features display on website",
            "awesome tab but it doesn't have a file manager and needs to be accesed to settings every time. camera quality of the rear camera is poor . it doesn't seems like it is 5 megapixel. note : sim cards can't be inserted . it has very good pair of dolby speakers",
            "very good product.....No problem arises till using one and half years",
            "Got this for 7700 & can't complain.\n\nGood build quality\nGood speakers\nGood battery life\nAndroid Marshmallow\nModes modes like child mode , reading mode is really good.\n\n* PLZ DONT PASTE ANY TEMPERED GLASS ON THE SCREEN IT REALLY REDUCES THE TOUCH SENSITIVITY",
            "Quality and touch sensitivity is not good. Better to buy Lenovo Phab 2",
            "Good Tab",
            "Excellent tab !!! Get it in Sale",
            "Good tablet for study and reading purpose .. Good battery backup.. no heat issues till now (3 weeks).....\n\nGood buy for those who seek where study, read pdf material and listen music\n\nGood for exam aspirants who need test series app and study material app ..",
            "Worth for money but not like MI Pad...",
            "Its OK, but quite sluggish and heavy. I went looking at specs which is better than Yoga. But not a great tablet",
            "Great deal. Good product, recommended",
            "Sd card issue , shown for few minutes then stop detecting try 2 sd card but same issue",
            "Good tablet at this price range..\nFor unboxing & gaming review..\nVisit my channel on YouTube\n#RAR TECH\n\nCHANNEL NAME : RAR TECH\n\nAnd do SUBSCRIBE !!!\n\nTHANK YOU..",
            "It is average product that all",
            "Average tab neither good nor bad",
            "Good one in ₹6800, I purchased from flipkart in sale.\nWorks quite well.",
            "Very impressive... I bought it a week ago in flipkart and it works great. As per specification it's much better. Don't go for its negetive side because in this budget any brand can't give everything u want.",
            "Superb product... 2 gb ram and marshmallow...have been using it for 2 weeks now...no lag...good battery backup...display quality is good. Sufficient internal storage.",
            "I got this for ₹5999. Few updates were given. For that price,I can't complain much. Performance is average for daily use. I use it for reading and watching movies. Good battery life. Can't play heavy games due to the limitation of the processor. It's light, got good speakers, and display is not bad. Good first time tablet purchase on a budget.",
            "This tablet I have used more that 5yrs it was very nice,\nBut the display is not that much strong",
            "Good tab still performs bettwr",
            "Touch is not good.",
            "not as expected but average",
            "Not bad",
            "superb genuine product",
            "good battery backup",
            "Good",
            "Writing exactly after two year of purchase. Very good battery backup. Never faced any issue . Still working as new one . I used extensively for reading. 8 inch screen is very good for reading compare to 7 inch. Looking forward similar tablet only with WiFi connectivity. Because while reading distraction is very less . If we have 4g easily we will lost in social networks\nThanks Lenovo and flipkart festival sale",
            "ram is very low if you are using this as a half day work than don't buy",
            "very bad experience with this set.getting problem to insert memory card.....doesn't support..",
            "Built quality is good but sometimes it work's slowly",
            "So, after using it for more than year, i have had following observations: Processor is sl",
            "this is always the speakers very good but the file manager support is not available and installed to got that the only thing missing on the tablet",
            "The worst thing to happen is the Tab is not detecting external SD card, which I came to know after exchange duration of 10 days is over.",
            "very hantic product but battery backup will down after 6 month\nAnd it,s was very hanging after 8 months\nSo it made only for entertainment not for bussiness work",
            "Good",
            "Sound quality not so good, camera is okay, storage space is less. Not so heavy.",
            "Lenovo India does not have customer support for this model. Service centre in Mumbai can quote any price for spares.",
            "Worst technician and horrible call centre people",
            "All good.....!! No cons were found..",
            "worth buying",
            "nice product",
            "not good",
            "This is a good tab but the resolution is to low 188dpi, and u will realize it each time you look at it.\nColors are washed its contrast is low. Strictly dont buy if u want to watch movies. Acts like a mirror outdoors.\n\nBuilt quality is great.\n\nCover is must..! Its been only 7 days and theres a scratch on screen, and im using just indoors.\n\nSpeakers loud but tear at full volume.\n\nI got it around 6000 rupees which is same as Fire HD8 and that only reason im rating it 5 stars. .",
            "Good n nice product",
            "Jio 4G voice not supported this device",
            "It is useful only to view photos and other media files, ebooks etc.Speaker sound is ok.\nseveral apps including whatsapp are not supported as there is no sim card. These apps are sent to this tab via Shere it and installed them. we can use them But can't be updated since they are not downloaded from Google play.\nBetter to go for any 5.5\" or 6\" android mobile.",
            "it was a good deal at 7000",
            "It has just been a month and the lcd screen has suddenly gone faulty. It looks alright when switched off but when turned on, the screen starts flickering with no or negligible touch sensitivity. This is my second such experience with Lenovo products in last three months. Please stay away!",
            "Ok not reached high quality",
            "Superb, like the kids longin",
            "superb clarity..worth of money",
            "Good Quality in best price!",
            "I have been using it for somedays.. Very good battery life. Dispaly is awesome (except outdoor)\nSound quality is exceptionally good with dolby dual speakers. Best for binging tv series",
            "Touching sensitivity is too bad",
            "awesome tab in this price only 8 inch resolution are not sufficient",
            "perfect android tab for this rate",
            "This product is not good where is shame for Flipkart I did not like do not buy this product this is very bad shame for Flipkart",
            "tab is good but not built in a good quality",
            "Delivered quick\nNice specification happy with it\nWhen I tried to put sim I can't find the sim tray but in the catalogue it tells me to pull the sim tray and insert the sim in it\nGot disappointed very worst",
            "Package was neatly packed..the tab was sound inside..no prob till now",
            "nice budget tablet",
            "Touch is poor",
            "Nice tablet under 10K",
            "Worst tab",
            "waste of money it works only on Wi-Fi. Tab works very slow",
            "There is no slot for sim in the product although it is written on the manual nd also on google that there has to be a sim slot nd slot for sd card. So now flipkart is delivering products different from the original products' qualities. This is very much unexpected from FLIPKART.",
            "Good",
            "Good product",
            "Don't but leveno. In stable and unreliable",
            "Good",
            "Good product",
            "Normal use",
            "Bought at 9k and received in 2 days.Screen resolution is not good.Sound is also not much despite Dolby Atmos.Battery will discharge in 8-10 hours.",
            "Worth Tab",
            "Comparitively great tab when it comes to price and performance.Though it is not as good for gaming and rough users",
            "Poor quality\nNot happy with touch......",
            "Fast delivery by Flipkart...",
            "lenovotab ok",
            "Good product",
            "Its a good product,\nScreen looks good and performance is decent.\nBit heavy",
            "Nice one but no sim....",
            "Good quality, User friendly, Thanks Lenovo",
            "Not good waste",
            "Delivery as per schedule.\nCondition of pack and inside tab condition good.",
            "It is a good Product if Price is considered.\n\nThanks\nSiddharth",
            "Very good",
            "touch is not good , but ok . for the price . again thanks flipcart.",
            "Good",
            "It's a gud tab for the price range, build quality is gud but performance is lacking a bit. Overall is a worthy tab for the money",
            "Baby can use good but not any other users cannot use",
            "I have purchased the same for my kids and they are using the same for last 5 months.\nThe expectation is as per the tech specification, so it fits the requirement.\nIts sturdy and has no issues though mostly handled by kids. so is a good purchase over all as per me.",
            "it works very well. display is good. battery is good. functions smoothly without hanging. i would suggest to buy this one.",
            "Nice product. Worth the money!",
            "Perfect tab but a bit slow",
            "Nice",
            "Worth for money,but looks like bit small in screen",
            "Good one",
            "Lenovo brand name is enough",
            "Value for money",
            "Balanced product",
            "Product is really good!!!",
            "Value for price",
            "Avg",
            "Good value",
            "Touchscreen not get, otherwise good product in its price range",
            "Tab has good features and look suitable to advice",
            "Nice product with exciting battery back up and camera",
            "Nice tab",
            "Excellent",
            "Namaste, nice product at reasonable rate, thanks",
            "Don't buy this product\nafter 7 days i purchased a sandisk 32gb sd card and after 1 hour the card shows automatically ejected...this is very disappointing\nbad experience",
            "Not satisfied ,money waste",
            "excellent",
            "Good memory...battery backup is very very good but camera quality is not so.. good",
            "I am not fully satisfied with lenovo tab",
            "Probably, the only sub-10K option among name brand tablets, happy with the product so far (2 weeks now)",
            "Good for students",
            "Thanks for Flipkart for delivering in time. Nice product sound quality is good. Value for money.",
            "Just ok at this price",
            "The dimensions of the tempered glass is accurate. Go for it.",
            "Xclnt tab ... You could stop searching in this product",
            "A very good one",
            "Best in terms of all",
            "Good product .Could have a better display",
            "Very good purchase...",
            "Awesome. This tablet is very light weight. My husband is very happy with this tablet",
            "Nice cost effective tablet for Wifi usage ONLY .Excellent delivery by Flipkart in one day .",
            "Have been using this tab for the past 6 months. Excellent value for money. Handles the internet browsing, video and music streaming apps with ease. All in all a great tab for the price.",
            "When you are looking for tab with marshmallow and all new features. Just go for lenovo tab 3",
            "terrible experience with the tab",
            "Not an impressive but not ok tablet for this price.",
            "Hi...I'm using it for last two weeks.. It's performance and battery backup is up to the mark..\nUser friendly...!!! It is worth for the price..But the price fluctuates all the time.. better have a frequent look to catch it inlow price...",
            "Buy electronic goods on flipkart they are of nice quality",
            "No Sim slot",
            "Too good...",
            "1280*800 is not enough to 8 inch screen\nAccessories are not available\nBuild Quality is good\nSound system is good\nPerfect for multimedia and reading",
            "Very good in quality and use.",
            "1 touch very smooth 2 battery backup good 3 frienshing good",
            "Very nice n slim its very good...also I need to purchase Samsung tablets but its very highly price its 11999 if flipkart give the best deal then I will buy for me because I want to gifts some one",
            "A great tab got it for 5400. And the tab seems to have the worth of Rs. 7000",
            "This product is excellent",
            "Its good. No problem faced till now",
            "I was skeptical about buying this Tablet after reading the negative review. I used a Lenovo Tablet for 3 years, that erased my doubts.\n\nI receiveced the Tab in an excellent condition. My expectation was met. The issue about using this Tab is that app takes enough time to install.",
            "Good one to buy. Bit light in weight, slim & impressive one. But front & rear cameras are of poor quality .",
            "Good",
            "Awesome tab ...best in class.",
            "No slot for sim",
            "Got it for rs.5500 and let me tell u that this tablet is just a beast , with 2gb RAM and other configurations this is very good for day to day use and no lag whatsoever, only con I noticed is that it doesn't support WhatsApp and other calling apps",
            "nice tab.good.",
            "Don't take this model, touch is very bad. My mobile touch much better than this, hanging and waste of money. at least before buying read returns policy.",
            "Gud product at this price",
            "Nice",
            "Worth to have good product for Rs.8999.",
            "Very good display and responsive to commends",
            "Worth for the price",
            "Never purchases this product. Very bad product from lenovo house",
            "Good product. Battery stands well",
            "Build quality good .. display nd touch response good.. camera poor. Battery backup good.. sound quality is low..",
            "Long back I have taken, working good",
            "Nice tab",
            "Got this tab for ₹6000 :B\n\nWith its performance...I can say it is the deal of millennium.. :D",
            "Overall a great tablet,i ended up getting it for 5.5K,\nThat said if you load a lot of applications the tablet starts lagging.\n\nUsing greenify to kill apps loading in the background smoothens the tablet response.\nGreat battery backup, you can play basic games.\n\nAsphalt type games might lag/stutter a little.",
            "Good tab. Purchased for my niece",
            "can be used for youtube and casual browsing not made for gaming",
            "Tab was good but started having problem in few days have to take it Lenovo service center and see what is the problem.will update detail review later",
            "Superb tab got this in discounted sale for 5999 few months back. Now that the display got broken due to my fault went to service center they are asking a 4500 to put a new display !!!!\nHence bought a new one instead ..\nThis is good tab by the way but yes one thing is bad that they need to ensure OS update what Lenovo never bothers.",
            "Best budget tablet using this for 6 months no complaints",
            "good sound with dolby atmos and two front firing speakers",
            "Good Product with average looks...",
            "Excellent product from Lenovo. Have been using it for 3 months. No problem till now. Battery backup is excellent.",
            "Lenovo advanced brand...nice features....smart delivery on Flipkart...worth price",
            "I bought the tab for father who off late became tech savvy. He loved it as it replaced the laptop and convenience of carrying every where. Performance, quality and build are excellent.",
            "Nice tab with good specs",
            "We have been using this tab since almost a week now and w are highly satisfied. My boy is using of his games, mostly racing games and he is very happy with the tab. Overall a value for money item.",
            "Nice product",
            "Hopeless quality . Not recommend",
            "Nice tab..... Gud battery life..... Very average camera..... Great value for money.......",
            "Very nice product",
            "V.good",
            "This product is very good.\nDelivery is very fast and secure.\nGood tablet in this range.",
            "Nice tab. I purchased mainly for reading. Good display. Adapter cable is very short than average mobile charger cable size. So oly 4 star. Also no scratch card and headphones.",
            "It is awesome.... But I still find out back cover",
            "speed is too good I didn't expect this much speed with this processor. worth product.",
            "A very good buy. Its got a good matte finish on the back panel and the touch is good. I m happy with this product",
            "Good product and price",
            "Superb performance",
            "2GB RAM is awesome......",
            "Nice tab...",
            "Smart.",
            "Good product. It suits best for the purpose I bought it.",
            "Excellent buy",
            "Super product with lest price.",
            "Good.",
            "Audio is been delayed. I don't know how to resolve it pls help me.....",
            "Very nice tab under 10k, thubs up, superb",
            "Off sim problem's",
            "It is good tablet but only thing missing that there is no sim card link. By mistek I ordered it. It should be there.it's OK. Thanks.",
            "I was actually surprised to see performance .... Regarding the brand and price .",
            "Good",
            "Dolby Atmos Sound Is Very Awsome..Very Good Except Camera Quality",
            "Nice product.",
            "Great value for money! Decent performance, fantastic pricing",
            "In WiFi only sector very good, supports whats app on single platform",
            "good product ;wood be happy if provided suitable back cover and screen guard",
            "Vry nice product n fkipkart is best",
            "Nice specifications with decent Price",
            "It was good as expected.",
            "High Price, low quality camera and display",
            "The best tab for multimedia",
            "Good product .........",
            "Good",
            "Awesome product thanks to lenovo",
            "This is an awesome tab folks!!!\nBuy it if you want a good tablet under 10,000 rs\nThis is the best amongst all tabs under 10,000",
            "Ok",
            "Batery is good, display is ok, runing smoth processor is avg.",
            "At 5400, it's a great deal, I use it mostly for net surfing & games, and found very handy, very very happy with this product",
            "Really good product considering the price range",
            "Nice tab from Lenovo battery backup is good ...",
            "Excellent product under 6k.But processor is only 1Ghz",
            "Good features but touch screen sensitivity and interface is hard/poor",
            "best",
            "good",
            "It is a nice tablet ,",
            "screen resolution worst\neverything avg",
            "good sound,super disply..",
            "Worth for money..",
            "Good",
            "Product work initially fine, but after 12 days touch stop responding properly...\nVery bad experience...",
            "Good tablet with affordable price,,",
            "Really good product\nworth for the price\nthanks flipkart",
            "Ok..but not up to mark.\nCamera not good\nProcessor not bad.\nTouch response average.\nBattery ok.\nDisplay not bad.\nSound quality loud and good.\nUser interface ok.",
            "Nice tab",
            "Nice tab. Camera quality poor but worth the price",
            "Good one .",
            "Excellent product,value for money",
            "Seemed fine for the first month but problems started creeping in later on with respect to booting and reset.",
            "Except touch everything is fine for 6k it's worth and better than otber tablets in this range",
            "Problem with Screen brightness",
            "Good",
            "The best 8 inch tablet available at this price. Got it for a steal at 40% off. Performance is good. Sound quality with Dolby atmos is good. Kids mode is built in and is very useful. Overall, really satisfied.",
            "Battery back up good and android 6.1",
            "Excellent product! Great for reading!!!",
            "Very good looking and excellent performance",
            "Nice product. 8 inch display is very good to use. battery also good.\nGot this @ Rs.5999. Don't know why the price fluctuating Rs 8999 to 5999 (without any card discount).",
            "Really a good product at that price",
            "An awsome product of Lenovo... Specially child mode is very useful!!",
            "Awesome purchase during billion shopping days. Best tab for movie watching gaming and surfing.",
            "Very Good product. Sound quality is extra ordinary.",
            "Excellent...",
            "The Product is Good.. But Anyone Answer Me This Tablet Has a sim slot or Not",
            "POSITIVE PRODUCTS OF FLIPKART GOOD OFFER TO GET IT",
            "Screen resolution is good. Touch sensitivity is very average",
            "Fantastic",
            "Good product but after starting it first time , uninstall unwanted apps.",
            "Tab responsiveness is good. Good screen resolution at this price. But the concern is about camera, both front and back cams are worst I ever seen such bad photos even in Nokia basic models. Front cam I don't need to talk, if you are looking for video calls better not to choose this tab.",
            "Awesome product,,, got on December 8th, worthy... It's Flipkart re, believe me, the tab is just superb... Don't look back buy it. Thank you Flipkart for your service",
            "Nice product.\nvalue for money.",
            "Thanks lenovo as well as flipkart for providing me such a wonderful experience with this Tab 3.",
            "Good",
            "I bought it for 6K in offer. Tab is too good. Only issue is touch quality very poor.",
            "GREAT",
            "Good",
            "Just for 6000/- this tablet is awesome",
            "Value for money... Lenovo best in class specifications... On a tech person knows the real value of the product...200% recommend this",
            "Good Tab Look wise",
            "Very Nice Product",
            "Have been using it for the past two days, its performance has been exceptional. Display is very good so is the sound. I would recommend this to anyone who believe in 'value for money'. Didn't experience any lag, device is working smoothly.",
            "Good one.nice experience.but In 16 GB, 5.5 GB system space.",
            "Within one month turned out of order. Neither got repaired nor provided any support from the authorised dealers. Total loss.",
            "I feel that touch sensitive is not good",
            "value for\nmoney",
            "Superb",
            "Good product,features correct,nice looking,perfect touch and camera",
            "Awesome performance",
            "Its such a good offer",
            "Gud",
            "Quality is good. At cost of Rs. 6000, 2 GB ram and 16 GB internal space is very good. Display is good (HD). Touch is OK, not very good.\nThe issue with any without sim slot tablet is that sim based applications like \"Whats App\" can not be installed from Google play store. I installed \"Whats App\" by a setup got from whats app Web site.",
            "Great for the price .",
            "Nice tab",
            "Bang for the buck. Bit of lag for a 2GB RAM and lack of covers/scratch guards is the cons.",
            "Affordable and good tablet for kids.",
            "Awesome product. Excellent value for money.",
            "Very nice product..\nAtmos dolby sound is too good.",
            "The product good and my kid love it great",
            "Good Product ......?",
            "Camera disappointing... However rest all is good for that price",
            "Good one as per expectation",
            "Nice deal",
            "I can't get delivery of product to my home town (Sagar). Many products are not available to sagar- 577401 please arrange as soon as possible",
            "Excellent tab for readding, browsing., multimedia, very good battery life., google play 3d games running smoothly, overall a good product for its asking price.",
            "Good tab.&very fast Flipkart Dilivery. I like it .",
            "Camera quality is not good.\nBattery backup is also not good.",
            "Okk",
            "Good tab",
            "Nice product",
            "Very Nice Product",
            "Excellent buy for the price",
            "I have being using this tablet for accessing social sites, reading and video purpose, over all the product is good expect the touch which is bit non responsive, we have to be more harsh with respect to touch response. little bit slow with touch response and many times back button does nothing and need to use the home button to come out of the applications.",
            "Its exectly same product as explained",
            "Good budget tablet.",
            "Good for reading and enjoying movies.\nA bit lagging while running games.\nNot good for multitasking.",
            "Everything is good in this tab. It just 1 GHz speed is not enough for gaming.\nAnd as I do not needed the cellular feature so its not a problem for me.\nTab is working good as it should be, no lag no problem . But if you need cellular\nfeature there is another model of this tab with that feature. Bottom line tab is very good\nat this price.",
            "Awesome tab by Lenovo with great voice quality and a crisp display!!!",
            "Product is very good. It was delivered promptly. It would have been nice if headphones were supplied with the tab",
            "I need another one but price high. At 1st I buy it rs 5999.why high today.",
            "Good tab for this price. After 6 months using nice",
            "lenovo tab is the worst tab.my first product was faulty then i asked for return and flipkart made it.but after some days i found again fault in that product.i suggest buy from flipkart but not this particular product(lenovo tab)",
            "Good service",
            "After sales service is pathetic. I bought this for my daughter's birthday and the same evening when it was delivered my daughter's by mistake sat on it and the screen hot damaged. Went to nearby service centre in Parel where manager was Girlish Gangar and they now want to charge 340 one for emailing company to raise invoice. First time I learnt about that they charge money to raise invoice. Made me with for hours and God knows what will happen now. Still sitting there. I am repenting buying this.",
            "I purchased the device on seeing the specification 3G. But when I got the device it was wifi only. I have been purchasing from flipcart for a couple of years and this is my first experience.",
            "Good deal",
            "Compatible with price but don't use any tempered glass along with its very annoying",
            "Picture quality good but touch not v good n get heated v fast",
            "Good product",
            "Worst product. Displaying multiple black strips on the screen from day 11. We had faith that we will get the best quality product if we buy from Flipkart Assured but unfortunately both this tablet & mobile was worst. We must stay away from Flipkart.",
            "touch response is worst..do not buy this tab",
            "This Tab is not having sim card option, hence please replace the same with new product with sim card option on replacement.",
            "I received a liquid damage tablet but noticed it after 12 days since I could not use it after receiving. And, after 12 days, Flipkart simply asked me to contact Lenovo. I think the sellers take a chance by sending these defective products and if the return date is gone they are successful. Lenovo customer care is even worse. This is my second device to have liquid damage.\n\nIGNORE THIS MESSAGE at your own risk!",
            "In time delivery",
            "Excellent product .. Thanks to flipkart for timely delivery.",
            "tablet is good,but two major concerns- 3.5 mm jack not supporting all earphones,tried nokia,samsung,philiphs,sound is coming only in one side,\nresponse is not great,sometime has to touch multiple times ,rest is ok\ncan anyone name compatible earphones for this tablet pls?",
            "Fully satisfied fastest and confident services from Flipkart.",
            "Delivered I'm happy",
            "There is a serious sd card slot issue with this product. They say it supports 64gb sd card, but even 16gb sd card it is unable to detect sometimes. Only works for sd cards till 8gb.\n\nI have returned and got a replacement,but still the same.",
            "super bad service from seller and flipkart.. even though the product is hanging they refused to do refund..",
            "Friends please don't buy this its very bad tablet i buy it twice its waste",
            "Thankyou flipkart",
            "I have ordered this product by seeing the Specs with SIM Slot. But the Delivered Product doesn't have sim slot. I had multiple inquiry to customer care before ordering this product about SIM slot. Executives are unaware they also see their Flip kart web and reply back!!\n\nso Ideally website Designing team should be more cautious about specification before rolling out to customer!!!\n\nUltimately !! Flipkart is losing the trust what it has gained so far !!!",
            "Conned by flipkart. Dont buy this cheap product from a cheap site flipkart, They firstly clearly written in the product description that this tablet supported Dual sim, but this tablet does not supported even a single sim. There is no sim slot. When people tell this to flipkart they have corrected his mistake from product description and now they are delaying the refund. They keep asking more and more time from past 2 weeks to return the amount but they are not returning the money. BEWARE AND DONT BUY FROM FLIPKART. BIG OOOOOOOOO RATING TO FLIPKART.",
            "Flipkart disappointed me this time , the specification & customer executive of flipkart states that it's a voice Calling tab but it doesn't have Sim card option ,\nThier service quality is now deteriorating, flipkart think they are big online gaint , but they will be big sick unit if they will do such kind of acts."
        ],
        "likes": [
            "131",
            "22",
            "13",
            "16",
            "6",
            "4",
            "4",
            "6",
            "1",
            "1",
            "131",
            "22",
            "13",
            "16",
            "6",
            "4",
            "4",
            "6",
            "1",
            "1",
            "3",
            "2",
            "2",
            "8",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "7",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "0",
            "0",
            "212",
            "92",
            "7",
            "12",
            "1",
            "105",
            "3",
            "7",
            "5",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "5",
            "3",
            "3",
            "3",
            "3",
            "6",
            "5",
            "4",
            "2",
            "1",
            "1",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "1",
            "1",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "7",
            "2",
            "3"
        ],
        "dislikes": [
            "38",
            "14",
            "5",
            "17",
            "6",
            "3",
            "3",
            "7",
            "0",
            "0",
            "38",
            "14",
            "5",
            "17",
            "6",
            "3",
            "3",
            "7",
            "0",
            "0",
            "3",
            "3",
            "0",
            "16",
            "1",
            "1",
            "2",
            "2",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "4",
            "2",
            "0",
            "1",
            "1",
            "0",
            "0",
            "0",
            "1",
            "1",
            "9",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "46",
            "23",
            "0",
            "2",
            "1",
            "78",
            "0",
            "3",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "1",
            "1",
            "1",
            "1",
            "5",
            "4",
            "3",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "1",
            "2",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "3",
            "1",
            "0",
            "0",
            "0",
            "2",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "0",
            "3",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "2",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "0",
            "1",
            "5",
            "3"
        ]
    },
    "qna": {
        "questions": [
            "Q:I have inserted my memory card in the wrong slot and it not comming out will it create any problem to the tab ?",
            "Q:use jio 4g?",
            "Q:Is this tab have facility for earplug jack?",
            "Q:DOES IT HAVE FLASHLIGHT?",
            "Q:is the tablet laggy as it has only 2gb ram and a quad core processor.",
            "Q:what are the accessories contained in the box",
            "Q:does it have two front facing speakers? how is the speaker quality ?",
            "Q:is the diaplay good enough for reading purpose ??",
            "Q:is it 2GB RAM or 1GB",
            "Q:does it support mp4",
            "Q:IndiFlashMart reliable Seller or not?",
            "Q:I want connect it to Sony TV through HDMI cable to view Youtube or any other content of TAB..Is it possible?",
            "Q:Does it have Google play store",
            "Q:Has a split screen",
            "Q:is we can do phone to others",
            "Q:its use for whatsaoo",
            "Q:is this support modem",
            "Q:the tablet is 3gb or 4gb",
            "Q:Does it have headset pin?",
            "Q:is it support to hotspot???",
            "Q:Is the battery removeable?",
            "Q:Does it support USB OTG?",
            "Q:Can i use Microsoft office, Msn all app, some light game(hill climb racing, ludo, coc) & also use heavy working purpose?",
            "Q:Where do I find Lenovo service centres, if I bump into some issue with the product?",
            "Q:How many cameras are present within the device? Does it come with an LED flash?",
            "Q:Which OS does the device come with?",
            "Q:IS THIS 4G ENABLED",
            "Q:dose it have Bluetooth?",
            "Q:can i connect to projector",
            "Q:does it support Dolby Atmos?",
            "Q:can we use calling app in this. does it has microphone.",
            "Q:IS IT CONNECTED TO A PRINTER ?",
            "Q:Is whatsapp supported?",
            "Q:does it have gorilla glass?",
            "Q:Lenovo or Swipe slate 8, Which one is better?",
            "Q:does it have hotspot?",
            "Q:Can i attach a pendrive/keyboard using otg with this tablet ?",
            "Q:can u please tell us about aspect ratio is it 4:3 or 16:10",
            "Q:external HDD supported yas ya no",
            "Q:is this q voice calling tablet",
            "Q:have it two speaker?",
            "Q:what about external memory?"
        ],
        "answers": [
            "A:yes, there will be a possibility of track damage if more attempts made remove it. S",
            "A:This is a Wi-Fi only device. No SIM card slot available",
            "A:yes.",
            "A:No..",
            "A:the tab is not laggy, as far as my basic usage is concerned",
            "A:Charging adapter & data cable only.",
            "A:no only one speaker and one microphone",
            "A:If you are willing to read novels then it is perfect, but if you want to use it to read textbooks then it is slightly small.",
            "A:2gb",
            "A:yes",
            "A:certainly reliable. flipkart is behind them, so no worry at all",
            "A:Their is no hdmi port available. you can use casting.",
            "A:Yes",
            "A:Its android M ..no split screen",
            "A:No.",
            "A:yes",
            "A:yes",
            "A:2 GB",
            "A:Yup",
            "A:yes",
            "A:It is not possible...as all devices now a days comes with integrated batteries.",
            "A:Yes",
            "A:no, this is Android tab",
            "A:You can find all the service centre details here: https://support.lenovo.com/in/en/solutions/ht118678",
            "A:The device comes with two cameras: 5MP primary camera and 2MP front camera. LED flash is not present.",
            "A:The device comes with the latest Android OS",
            "A:I think this doesnt come with Sim slots. It have only Wifi and no sim cards can be used with it",
            "A:Yes",
            "A:This device only has 3.5mm jack and USB input. If your projector can be connected using USB cable then yes you can connect it to projector, otherwise not.",
            "A:yes but sound quality is not good as compared to other dolby atmos on other lenovo phone ..",
            "A:You can use a microphone. This Tab has two variants. Wi-Fi only model does not allow you to put a SIM card. So can not call another phone. So use Skype to make calls. Models with 3G/4G can make calls.",
            "A:Yes",
            "A:YES",
            "A:NO gorilla glass on this one",
            "A:Lenovo",
            "A:yes",
            "A:yes",
            "A:4.3",
            "A:no",
            "A:No",
            "A:yes... speakers are good but lesser volume",
            "A:I'm using 32gb SD card in it. but as per the specification it can be extended still 64 gb."
        ],
        "likes": [
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "4",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "56",
            "0",
            "35",
            "44",
            "7",
            "4",
            "1",
            "3",
            "2",
            "2",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        "dislikes": [
            "0",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "5",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "10",
            "3",
            "19",
            "37",
            "9",
            "4",
            "0",
            "4",
            "2",
            "4",
            "1",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "1",
            "0",
            "0",
            "2"
        ]
    }
}